{
    "text": "The great thing about using a system like MySQL (or any SQL for that matter) is that it's been around for so long that if you can think of something that would be nice to have, you can be sure it's there somewhere. They've had enough time not only to hit all the walls, but to try out different approaches and settle on one. Maybe at times there were competing ways to do things, like the way Bluesky and ActivityPub, and probably Threads, and certainly Facebook and Twitter insist on reinventing \"RSS\". But when I ask ChatGPT \"can you do this in MySQL\" it gives me one or two ways to do it, but usually just one. These are things I never would have found in the old Google-search way of finding answers. An example, I wanted to find out if there was a MySQL way to query a value inside a JSON object, and the answer is (of course) yes. And you can create an index on such a value. I didn't even ask for it, ChatGPT volunteered, guessing it would be my next question (it was). Whatever happened in the evolution of SQL it was a lot healthier than what's going on now in the social web, where the creators completely ignored what came before, and each other, and as a result there's a proliferation of different ways to do things we've known how to do for <a href=\"http://scripting.com/2022/09/18.html\">over 20 years</a>. SQL has been around for <a href=\"https://en.wikipedia.org/wiki/SQL#History\">50</a>, so maybe they went through this stage and emerged from it with a better answer. This feels a bit like the <a href=\"https://chatgpt.com/share/677bf6d0-b868-8012-af56-7e4449e9182f\">Fermi paradox</a> and I'm a time traveler who has managed to witness 50 years of evolution long after the fact, any day of any week I want to thanks to ChatGPT. Also this is why it is so important to keep the archives of the 1990's web preserved. We may need to loop back to this when the people responsible for the social web decide that interop is important as opposed to each of them going it alone. ",
    "created": "Mon, 06 Jan 2025 15:17:59 GMT",
    "type": "outline",
    "image": "https://imgs.scripting.com/2020/11/27/duck.png",
    "flInCalendar": true
}