{
    "text": "An open tweet to Keith Olbermann",
    "created": "Sat, 13 Jul 2024 19:19:53 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "<i>Adapted from a <a href=\"https://x.com/davewiner/status/1812139277418971640\">tweet</a>.</i>",
            "created": "Sat, 13 Jul 2024 19:20:03 GMT",
            "flInCalendar": true
        },
        {
            "text": "Still thinking about your last episode and how you don't know what to tell anyone to do. i think that's great. because no one knows -- in the meantime here are a couple of ideas.",
            "created": "Sat, 13 Jul 2024 19:21:06 GMT",
            "flNumberedSubs": "true",
            "subs": [
                {
                    "text": "let's organize democratic voters. the better organized we are, the better we can get through the attacks from the nyt, cnn, msnbc, et al that are coming until the election. a web site for circles of friends, a buddy system that gets the word out. can use all social networks, email etc. ",
                    "created": "Sat, 13 Jul 2024 19:21:07 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "encourage biden to take off the gloves, even more than he is. he should say the biggest problem is the supreme court. we have to fix it. make this a referendum on roe v wade and all the other stuff that's harder to explain.",
                    "created": "Sat, 13 Jul 2024 19:21:26 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "ask joe to have fun. he's good when he's saying god love you and shit like that. hand out ice cream when it's hot. ",
                    "created": "Sat, 13 Jul 2024 19:21:27 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "level with people. biden isn't the best speech-maker and 81-year-olds can't run around like they're 50 (he's still figuring that out),  but he's a really good president. think about how it was when trump turned things over. the country was in really bad shape. he totally blew covid. that mattered. ",
                    "created": "Sat, 13 Jul 2024 19:21:29 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "one more thing -- trump attacked the freaking capitol on his way out. that man has a temper and is a loser. a sore loser ",
                    "created": "Sat, 13 Jul 2024 19:29:23 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "biden has friends who help him. make the theme song for the election <a href=\"https://www.youtube.com/watch?v=0C58ttB2-Qg\">help from my friends</a> by the beatles. put the young stars of the democrats out on the road and sell them as the future that we are working on. ",
                    "created": "Sat, 13 Jul 2024 19:21:31 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "the product isn’t just Biden, it’s a freaking goverment and social security, and owning your own body, freedom of religion, all that good american stuff. It’s the governors of pennsylvania, michigan, arizona, the senators from georgia, it’s the whole freaking thing!",
                    "created": "Sat, 13 Jul 2024 19:21:49 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "like it or not the debate <i>did</i> start the campaign. Everyone is listening to Joe Jobs now, so say things! Dont waste the attention. Never waste a good crisis someone said.",
                    "created": "Sat, 13 Jul 2024 19:22:16 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "have you ever seen a campaign speech with <a href=\"https://this.how/whyVoteForBiden/\">slides</a> like a Steve Jobs keynote. Some good ideas there. \"One more thing.\"",
                    "created": "Sat, 13 Jul 2024 19:22:49 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "KO -- keep up the good work. and ad lib more. some of your writers are pretty lame. i can tell when you wrote the episode, but i like the ones where you ad lib even more.",
                    "created": "Sat, 13 Jul 2024 19:21:08 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}