{
    "text": "Advice to would-be platform vendors",
    "created": "Fri, 31 Jan 2025 15:26:41 GMT",
    "type": "outline",
    "description": "The key to success is convincing developers to ignore the fact that you will eventually kill them.",
    "subs": [
        {
            "text": "TL;DR: The key to success is convincing developers to ignore the fact that you will eventually kill them.",
            "created": "Fri, 31 Jan 2025 15:31:23 GMT",
            "flInCalendar": true
        },
        {
            "text": "Would-be platform vendors, open or not, in order to entice a developer to learn how it works:",
            "created": "Fri, 31 Jan 2025 15:26:57 GMT",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "Quick success. Hello World works in less than 30 minutes. Hopefully much less.",
                    "created": "Fri, 31 Jan 2025 15:27:23 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Easy to believe that the platform vendor won't want to kill me. This is a trick, because based on my experience, they always try to kill you, eventually. ",
                    "created": "Fri, 31 Jan 2025 15:27:24 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Fun. If I can fill a need that I think users will want, without being resented too much by the platform vendor then I might take a jump knowing full well that the better the idea the quicker the vendor will kill me. For that reason it's better to do something they don't understand, or will see as irrelevant, ie a \"third party opportunity.\" As soon as it appears to be \"system software,\" that's when they started the project to eat your lunch. ;-)",
                    "created": "Fri, 31 Jan 2025 15:27:33 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The API works the way you think. This has been the highest hurdle for me to get over in most platforms I think about working with. I can't tell you how many times I've stared at the docs for a platform and have no idea how it relates to the product, which I know how to use. The concepts should mirror the functionality of the system it's the API for. Too much theory and I have to be very very motivated for other reasons to get through the fog. ",
                    "created": "Fri, 31 Jan 2025 15:27:46 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It must be relatively easy for you to hang out in a corner where it's too hard for them to be worth the trouble.",
                    "created": "Fri, 31 Jan 2025 22:56:47 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Thing is if there is a platform vendor, they <i>can</i> kill you, no matter what they say. I once had a big platform vendor say they weren't trying to crush me. I could see on his face he realized he had just given up their plan, or how else would that term be in his head as applied to me. Never mind, I was already commited so what difference did it make. ",
            "created": "Fri, 31 Jan 2025 22:55:28 GMT",
            "flInCalendar": true
        },
        {
            "text": "The reason for all this is that as they grow, platform vendors hire employees to work on this stuff, and they resent independent developers. This surprised me when I first encountered it. I thought we were siblings, brothers and sisters. But they idealize our situation and only see the pain in theirs. So they will enjoy killing you. It will eventually happen. That's why it's generally much better if there is <a href=\"https://www.google.com/search?q=%22platform+without+a+platform+vendor%22+site%3Ascripting.com\">no platform vendor</a>. ",
            "created": "Fri, 31 Jan 2025 22:57:12 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}