{
    "text": "I wrote this in 2014",
    "created": "Wed, 23 Sep 2020 13:15:19 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "<i>Posted on Facebook on this day in 2014.</i>",
            "created": "Wed, 23 Sep 2020 13:15:23 GMT"
        },
        {
            "text": "From the last episode of <a href=\"https://www.pbs.org/show/roosevelts/\">The Roosevelts</a>, a friend explains that when Eleanor Roosevelt was touring, when she'd meet someone who wanted to tell her how she had helped them, she didn't show interest, she just rushed on to the next thing. Why? She didn't have time for that. She's busy doing stuff. ",
            "created": "Wed, 23 Sep 2020 13:15:32 GMT"
        },
        {
            "text": "I feel the same way when people say they respect me for work I did ten or twenty years ago. I only care about that to the extent that it means it might be a little easier for me to do the next thing I want to do. Ironically, it works exactly the opposite way. The more people feel your accomplishments are in the past, the <i>less</i> they let you do now. (My philosophy is to do it anyway.)",
            "created": "Wed, 23 Sep 2020 13:16:37 GMT"
        },
        {
            "text": "The same thing happened to her uncle, President Theodore Roosevelt. He left office at 50, desperately wanted to stay involved, but couldn't find a way to do it. This is the guy who built the Panama Canal. When the US finally got into WWI, he tried to enlist, but President Wilson wouldn't let him. Instead he sent his four sons off to fight in the war, while he stayed home. To him this must have been torture. He died at 60, I assume because there was nothing for him to do. "
        },
        {
            "text": "ER said the same thing, as long as there were still things to do, as long as her life had a purpose, she wanted to keep living. As soon as their stopped being a purpose, she wanted to die, and she did."
        },
        {
            "text": "My stuff is coming together in ways I only dreamed about in the past. I have no time to think about what happened in the past, except in ways it makes me wiser about things I do now and in the future, and if it makes people more open to the idea that I might be doing something of significance."
        }
    ]
}