{
    "text": "Que sera sera",
    "created": "Mon, 26 Dec 2022 13:58:23 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I wrote <a href=\"http://scripting.com/davenet/1996/10/24/QueSeraSera.html#6\">this</a> in 1996, and we're there again, 26 years later. ",
            "created": "Mon, 26 Dec 2022 13:58:31 GMT",
            "subs": [
                {
                    "text": "To anyone who wants to lead -- show us software that's fun and empowering, get us interested and excited. Gates, McNealy, Ellison et al never do that. We've tried it their way before, look at the stagnation that resulted. We're at a crossroads now, do we go back to the mess of the past or do we learn to enjoy the que sera of it all, and stop seeing threats everywhere we look?",
                    "created": "Mon, 26 Dec 2022 13:59:04 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "So much of the energy is about defeating and destroying, so little is about creating. People believe in others, not themselves, and are disappointed when they are left out of the big plans. They forget that no matter how rich and intimidating each leader of our industry is, or would-be leader, none of them predicted the world we live in now, and by extrapolation they are powerless to control the world we will live in in 1997 and beyond.",
                    "flInCalendar": true
                },
                {
                    "text": "I'll do my part: here's an invitation to truly embrace the creativity of others. Instead of beating your breast about how great you are, try saying how great someone else is. Look for win-wins, make that your new religion. Establish a policy that nothing will be announced unless it can be shown that someone else will win because of what you're doing. How much happier we would be if instead of crippling each other with fear, we competed to empower each others' creativity.",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}