{
    "text": "Sinema for president?",
    "created": "Fri, 14 Jan 2022 15:00:10 GMT",
    "type": "outline",
    "metaImage": "http://scripting.com/images/2022/01/14/sinema.png",
    "description": "It might work.",
    "subs": [
        {
            "text": "tl;dr -- it might work. ",
            "created": "Fri, 14 Jan 2022 15:00:17 GMT",
            "flInCalendar": true
        },
        {
            "text": "Yesterday I ran a <a href=\"https://twitter.com/davewiner/status/1481836126495256576\">poll</a> asking people to identify Sinema as:",
            "created": "Fri, 14 Jan 2022 15:00:24 GMT",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "bribed",
                    "created": "Fri, 14 Jan 2022 15:00:44 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "blackmailed",
                    "created": "Fri, 14 Jan 2022 15:01:20 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "held hostage",
                    "created": "Fri, 14 Jan 2022 15:01:23 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "insane",
                    "created": "Fri, 14 Jan 2022 15:01:26 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "I had not considered another possibility -- she wants to be president! This came up in a tweet <a href=\"https://twitter.com/JoeTrippi/status/1481997298078990336\">forwarded</a> by  the innovative Democratic campaigner <a href=\"https://twitter.com/JoeTrippi\">Joe Trippi</a>. ",
            "created": "Fri, 14 Jan 2022 15:01:27 GMT",
            "flInCalendar": true
        },
        {
            "text": "My first thought: no way, maybe option #4 is correct after all, but then on reflection, it would increase interest in the primary and that's a good thing. Nothing is worse than a primary with candidates who all appear to be losers or bore you to death in their speeches, or worse make you feel uncomfortable (Biden, Hillary Clinton). And I don't want another Obama, I feel wounded by his presidency. Left us in a bad place. ",
            "created": "Fri, 14 Jan 2022 15:03:04 GMT",
            "flInCalendar": true
        },
        {
            "text": "And then I realize, <a href=\"https://www.youtube.com/watch?v=jI5Z7Zg64YM\">Sinema</a> is a good speaker, based on video of her back when she gave speeches. This crazy personal insurrection of hers has done one thing, it has made her much more famous. ",
            "created": "Fri, 14 Jan 2022 15:04:40 GMT",
            "flInCalendar": true
        },
        {
            "text": "People vote for candidates who are confident and make them feel good about themselves, like they matter. That's pretty much it. I wish it were otherwise, but there's a lot to be said requiring a leader to be able to lead. Yes it matters where they lead us, but to a lot of voters, their thoughts don't go that far. ",
            "created": "Fri, 14 Jan 2022 15:24:05 GMT",
            "flInCalendar": true
        },
        {
            "text": "PS: I've beem thinking about who I want to run in 2024. My two main interests are Jay Inslee and Gavin Newsom. Both are confident, good speakers, and their politics are  straight Democrat. I think they are our best shot at winning, and yes that's the primary concern. We simply can't have another Republican president and not go completely to hell. Please don't ever overlook that. ",
            "created": "Fri, 14 Jan 2022 15:08:57 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}