{
    "text": "Should you care about GitHub?",
    "created": "Sat, 02 Jun 2018 13:58:39 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "If you're a user, should you care about GitHub possibly being <a href=\"https://www.techmeme.com/180601/p20#a180601p20\">acquired</a> by Microsoft? I imagine most non-developers have no idea such a thing as GitHub exists. ",
            "created": "Sat, 02 Jun 2018 14:01:31 GMT",
            "image": "http://scripting.com/images/2018/04/08/stalin.png"
        },
        {
            "text": "It's a fairly remarkable thing, kind of invisible, not much talked-about, but vital and appreciated. And well-done. It's what I call a <i>consensus platform.</i> It means that if you're starting an open source project, GitHub is the default place to do it. Most projects are hosted there. All of mine are. And I've been deploying new ones on a regular basis, and updating existing ones. It's important to me that they be preserved. For some reason it feels to me it's more likely they will persist because GitHub is such a consensus. ",
            "created": "Sat, 02 Jun 2018 14:01:49 GMT"
        },
        {
            "text": "In other words, no one gets fired for using GitHub (to paraphrase an ancient slogan about IBM).",
            "created": "Sat, 02 Jun 2018 14:09:12 GMT"
        },
        {
            "text": "It woke me up a bit to consider the possibility that it might be acquired. And then the ramifications of it, and the potential. It <i>could</i> be a good thing. But in tech, even a good thing somehow gets perverted by big companies, has atrocious business models attached to it, ends up being managed by someone more qualified to sell cars than manage a highly technical <a href=\"http://www.dictionary.com/browse/nuanced\">nuanced</a> development platform. ",
            "created": "Sat, 02 Jun 2018 14:02:17 GMT"
        },
        {
            "text": "What you want is steadiness. Gradual improvements. <i>No breakage. </i>",
            "created": "Sat, 02 Jun 2018 14:03:42 GMT"
        },
        {
            "text": "It could be that Microsoft would run GitHub better somehow than the current management, who I don't now, have never met, etc etc. But it's hard to see how it could be better. GitHub is what we want it to be, quiet, out of the way, taken for granted, there when we need it, a constant and dependable option. ",
            "created": "Sat, 02 Jun 2018 14:04:00 GMT"
        }
    ]
}