{
    "text": "I discovered yesterday that the <a href=\"https://www.hbomax.com/hub/classics-curated-by-tcm\">TCM library</a> is available on HBO Max. Well I think that did it. I'm going to be spending a lot of time with that. The first movie I watched was <a href=\"https://en.wikipedia.org/wiki/Victor/Victoria\">Victor/Victoria</a>. I love everything about that movie, even the cornball stuff. But the best part is <a href=\"https://en.wikipedia.org/wiki/Julie_Andrews\">Julie Andrews</a> playing a woman playing a man playing a woman, and it's so entertaining. I first discovered TCM when I was recuperating from surgery in 2002. They gave me an unlimited supply of <a href=\"https://en.wikipedia.org/wiki/Oxycodone\">Oxycontin</a>. So I was weak and completely stoned for a full month watching TCM movies basically non-stop. Without commercials. For such a serious life moment, I was actually enjoying it pretty well, I have to say. One of the movies was <a href=\"http://scripting.com/2002/09.html#victorvictoria\">Victor/Victoria</a>. I probably watched it all the way through 20 times in 2002 (I had a <a href=\"http://scripting.com/2001/09/27.html#l478d29742a10d66001e366393966eb78\">TiVO</a>). It was also <a href=\"https://web.archive.org/web/20140102022028/http://www.tcm.com/this-month/article/940179%7C0/Robert-Osborne-on-Joan-Crawford.html\">Joan Crawford Month</a>, so I watched every JC movie they had, going back to silent movies. She was a super cutie, whatever you think of her <a href=\"http://scripting.com/2014/02/06/publicShamingIsWorthALook.html\">as a mother</a>, I could watch her all day, esp with the Oxy. Then they did the <a href=\"https://en.wikipedia.org/wiki/1939_in_film\">movies of 1939</a>, which was probably the best year ever for Hollywood. The way the early web may have been the best time for tech. <a href=\"http://scripting.com/2002/08/14.html#When:1:03:47PM\">The Women</a> was an unusual movie from 1939. You don't realize this right away but there are no men in the movie, not even an extra. And a <a href=\"https://en.wikipedia.org/wiki/The_Women_(1939_film)#Cast\">cast</a> of superstar women actors of the day. There was also The Wizard of Oz and Gone With the Wind. Anyway, after all this time, I can't get Oxy anymore (glad for that, I liked it too much) but I can get as much TCM as I want, and I get to do the programming. Geez. All I need is a bungalow in the Florida Keys or a hacienda in Taos, and nice way to watch TCM, and I could just disconnect. :boom:",
    "created": "Sat, 14 Aug 2021 20:58:58 GMT",
    "type": "outline",
    "image": "http://scripting.com/images/2021/08/14/joanCrawford.png",
    "flInCalendar": true
}