{
    "text": "Melo to the Thunder!",
    "created": "Sat, 23 Sep 2017 19:58:27 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I got back from a long bike ride around Manhattan to the news that <a href=\"http://nypost.com/2017/09/23/the-knicks-have-finally-traded-carmelo-anthony/\">Melo has been traded</a> from the Knicks to the Thunder. ",
            "created": "Sat, 23 Sep 2017 19:58:34 GMT",
            "image": "http:///scripting.com/images/2017/09/23/melo.png"
        },
        {
            "text": "I like the deal.",
            "created": "Sat, 23 Sep 2017 20:09:51 GMT"
        },
        {
            "text": "Melo gets a fresh start, and has two all-star team-mates, Paul George and Russell Westbrook, who also happens to be last year's MVP. ",
            "created": "Sat, 23 Sep 2017 19:59:04 GMT"
        },
        {
            "text": "Westbrook gets an outside shooter in Melo. ",
            "created": "Sat, 23 Sep 2017 19:59:36 GMT"
        },
        {
            "text": "Melo will not be the alpha guy on this team. It's Westbrook's team. It'll be interesting to watch him make the adjustment. ",
            "created": "Sat, 23 Sep 2017 20:01:51 GMT"
        },
        {
            "text": "The Knicks like it because they get to start over and they didn't have to give up a first round draft pick (rebuilding teams have valuable draft picks) and they got the Thunder to take the remaining two years on Melo's contract, and free up a huge amount of cap space for the Knicks, who can now invest it in younger players more suited for their young team. (They should also get some veterans to school them.)",
            "created": "Sat, 23 Sep 2017 19:59:53 GMT"
        },
        {
            "text": "Melo leaves with the affection of the fans. He will be cheered when he returns in his OKC uniform. It wasn't what we all hoped it would be with Melo, but he stayed cool at times when he didn't really have to, and in NY sports that's always appreciated. ",
            "created": "Sat, 23 Sep 2017 20:06:06 GMT"
        },
        {
            "text": "It's a fair, competent deal, and makes sense for both teams.",
            "created": "Sat, 23 Sep 2017 20:01:05 GMT"
        },
        {
            "text": "And as a Melo fan I'm glad to see he'll get a shot at the post-season. I don't think the Thunder are championship contenders, not enough depth in the lineup, but it should be some good basketball. ",
            "created": "Sat, 23 Sep 2017 20:01:15 GMT"
        }
    ]
}