{
    "text": "I fear for Ukraine...",
    "created": "Sun, 08 May 2022 15:15:01 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I fear for Ukraine. What happens when we decide it's over even when the war is still raging, as we have done with Covid, not caring how many people's lives will be ruined, or ended.",
            "created": "Sun, 08 May 2022 15:15:06 GMT",
            "flInCalendar": true
        },
        {
            "text": "I expect it'll be the same with Roe v Wade, until we really get woke and see the big picture. We need societal mechanisms to stay focused on what matters, and not lose focus in meaningful ways, until the problem is solved or the threat is over. ",
            "created": "Sun, 08 May 2022 15:15:32 GMT",
            "flInCalendar": true
        },
        {
            "text": "Lots of other things fall into that bucket btw: climate change, regulating guns in the US, black lives matter, LGBTQ rights. We only focus briefly, leaving us vulnerable to dishonest power-hungry people who are more patient.",
            "flInCalendar": true
        },
        {
            "text": "Social networks can help, but only ones that are carefully crafted to stay focused on the goal they are assigned to. Twitter and Facebook et al were invented and bootstrapped in chaos. I understand this process as well as anyone. There are other ways to do it. ",
            "created": "Sun, 08 May 2022 15:55:44 GMT",
            "flInCalendar": true
        },
        {
            "text": "PS: I posted this as a <a href=\"https://twitter.com/davewiner/status/1523320792536449024\">thread</a> on Twitter. I know no one there will latch onto it, because it's not the kind of thing Twitter-the-network pays any attention to. Which is the point. The only way to get something like that going is to go first, the same way podcasting and RSS and blogging before it got started. Do it until it seems obvious, and then there's a FOMO, and let the people with the loudest voices pretend they were there at the beginning. All those things have to happen. So we're a long way from being able to work together, but until we start, we'll still be mired, and the people who think and act long-term will keep running everything.  ",
            "created": "Sun, 08 May 2022 15:55:46 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}