{
    "text": "Let's bust some new norms",
    "created": "Fri, 25 Oct 2024 14:21:59 GMT",
    "type": "outline",
    "description": "We've relied too much on the Democrats to stick their necks out, when in fact all our necks are on the line here.",
    "metaImage": "http://scripting.com/images/2024/10/25/supremeCourt.png",
    "subs": [
        {
            "text": "Why hasn’t the NY Times run a story that takes Trump at face value and explains to voters what it would be like to live in that United States? It should have been updated and run every time Trump ups the ante.  ",
            "created": "Fri, 25 Oct 2024 13:53:35 GMT",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://www.threads.net/@kamalahq/post/DBjMQCDsZdy\">An example</a>. Trump says Americans who criticize the Supreme Court for overturning Roe v. Wade should be imprisoned:  “These people should be put in jail for the way they talk about our judges and justices.” ",
            "created": "Fri, 25 Oct 2024 14:15:15 GMT",
            "flInCalendar": true
        },
        {
            "text": "A news story on this subject should include calls to all the <a href=\"https://www.supremecourt.gov/about/justices.aspx\">justices</a> on the Supreme Court to ask if they agree or disagree. It's time to bust some new norms. They are above reproach, traditionally, but they decided that the president can do whatever he wants, break any law without penalty. Are they concerned that perhaps they might be imprisoned if they make a decision that Trump doesn't like? Let's learn from them, how they think American citizens should feel about this. After all they are American citizens too, aren't they? If we can be jailed, or worse, for our speech, why not them? :smile:",
            "created": "Fri, 25 Oct 2024 14:28:56 GMT",
            "flInCalendar": true
        },
        {
            "text": "Of course if they refuse to answer, which they probably will, that should be part of the story. No deference allowed, by the journalists. Simple factual statements. ",
            "created": "Fri, 25 Oct 2024 14:34:31 GMT",
            "flInCalendar": true
        },
        {
            "text": "We've relied too much on the Democrats to stick their necks out, when in fact all our necks are on the line here. So if you have something to say about this, now is the time to do it. In a couple of weeks it might be too late. ",
            "created": "Fri, 25 Oct 2024 14:18:00 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}