{
    "text": "Trump was a free man...",
    "created": "Sun, 22 Jan 2023 14:21:31 GMT",
    "type": "outline",
    "metaImage": "http://scripting.com/2017/01/22/trumanWhiteHouse.png",
    "subs": [
        {
            "text": "<i>I wrote this on <a href=\"http://scripting.com/2017/01/22/trumpWasAFreeMan.html\">Jan 22, 2017</a>, two days after Trump was inaugurated.</i>",
            "created": "Sun, 22 Jan 2023 14:21:37 GMT",
            "flInCalendar": true
        },
        {
            "text": "Trump was a free man until he took the oath. ",
            "created": "Sun, 22 Jan 2023 14:21:51 GMT",
            "flInCalendar": true
        },
        {
            "text": "But once he assumed the office, and until he leaves, he belongs to us, the American people. I'm sure this is a new feeling for him. But we all must submit to something. The president submits to the people. ",
            "flInCalendar": true
        },
        {
            "text": "I can't imagine what hell it must be behind the closed door that leads to the press room. The ranting and screaming, the tears and the \"there there's\" from his staff, the promises to get even. ",
            "flInCalendar": true
        },
        {
            "text": "But he will keep bumping up against the reality that now, we own his ass, even the ones who thought his campaign was crazy and dangerous. The people who voted for him thinking it left the rest of us powerless are in for a surprise too. The other politicians you elected care about what we think, because they need us to keep their jobs. The election is over, now they're worried about the next election. And like it or not, they need us. ",
            "flInCalendar": true
        },
        {
            "text": "Harry Truman famously called the White House the \"crown-jewel of the federal penal system.\" ",
            "flInCalendar": true
        },
        {
            "text": "I don't know how Trump will come to terms with this. We have an idea of what a president does, says, how he or she reacts to events. We just had eight years with a guy who never lost his cool over anything. The new president sees a report on TV saying he lost the MLK bust in the Oval Office and he loses it? He has a long way to go before he is our president. He may hold the office but he hasn't embraced it yet.",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}