{
    "text": "America as a platform",
    "created": "Sat, 10 May 2025 12:53:22 GMT",
    "type": "outline",
    "metaImage": "http://scripting.com/images/2019/03/26/eveAndPeterWalkingToSchoolIn1964.png",
    "description": "We have a system in this country, it takes people from everywhere and gives them a platform to create whatever they want. ",
    "subs": [
        {
            "text": "We lived for the first years of my life in <a href=\"https://en.wikipedia.org/wiki/Jackson_Heights\">Jackson Heights</a>, which is probably, today, the most culturally diverse place in the world. In the 1960s it was a white neighborhood that was adjacent to a black neighborhood, <a href=\"https://en.wikipedia.org/wiki/Corona,_Queens\">Corona</a>. They paired our elementary schools when I was in third or fourth grade. My little brother went to the school in Corona, and I stayed in the school in Jackson Heights. ",
            "created": "Sat, 10 May 2025 12:49:43 GMT",
            "flInCalendar": true
        },
        {
            "text": "There's a <a href=\"http://scripting.com/images/2025/05/10/eveWinerPeterWinerWalkToSchool.png\">famous picture</a>, in our family at least, of my mother walking my brother to school. It was on the front page of the NYT one day. That was a big deal then.  ",
            "created": "Sat, 10 May 2025 12:54:24 GMT",
            "flInCalendar": true
        },
        {
            "text": "When I was in fifth grade we moved to Flushing. It was a sleepy little place (for NYC), nice houses, mostly Irish and Italian families with a few Jews. Now it's a Far East culture, from China and Korea, and still just as nice as it ever was. ",
            "created": "Sat, 10 May 2025 12:50:03 GMT",
            "flInCalendar": true
        },
        {
            "text": "We have a system in this country, it takes people from everywhere and gives them a platform to create whatever they want. In Flushing it's the best Chinese food in the city, which is saying a lot.",
            "created": "Sat, 10 May 2025 12:53:18 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}