{
    "text": "Software isn't a thing",
    "created": "Sat, 10 May 2025 14:19:52 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "When a friend discovers a new product of mine and says the world owes Dave for being such a great guy, I wish they'd skip that part, and follow what we're doing. Get in the loop. ",
            "created": "Sat, 10 May 2025 13:38:34 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Software isn't a thing, it isn't finished, it's a process as it gets invented by the users. It's a performing art. WordLand today is like a musician performing in a small club, working out the playlist, and hoping to be playing at theaters then arenas, and finally someday, if we're very good, stadiums. But we need help. ",
            "created": "Sat, 10 May 2025 14:20:16 GMT",
            "flInCalendar": true
        },
        {
            "text": "If you love WordLand, subscribe. Use the software. Learn what it can do, hit its limits, make requests. ",
            "created": "Sat, 10 May 2025 14:20:31 GMT",
            "flInCalendar": true
        },
        {
            "text": "I remember very well being handed a list of feature requests by Apple's lead evangelist from a new exec they just hired at Apple. I looked at the list, and handed it back and said I'd like to meet him. On the paper was the top ten list of <i>every</i> MORE user at the time. We knew what they wanted because we listened, studied, and learned. I knew his new boss was a real user, and thus I knew we could do stuff together. It worked out exactly that way. ",
            "created": "Sat, 10 May 2025 14:20:40 GMT",
            "flInCalendar": true
        },
        {
            "text": "So if you love it, use it, <i>become part of it. </i>",
            "created": "Sat, 10 May 2025 14:21:00 GMT",
            "flInCalendar": true
        },
        {
            "text": "PS: I've written about this over the years with the motto <a href=\"https://www.google.com/search?q=site%3Ascripting.com+shitty+software\">we make shitty software</a>. If you use it and share what you learn, it will get better. ",
            "created": "Sat, 10 May 2025 14:22:07 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}