{
    "text": "A fictionalized account of a true story",
    "created": "Thu, 30 Nov 2017 14:09:48 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I try to begin each email with one of two sentiments: Thanks or sorry. Or find a way to praise the person I'm writing to. Start with something positive or show empathy. I've found, over years of experience, that people will likely stop reading after the first sentence, even if you are being nice. If you show appreciation or sincere regret up front, the chances that they'll read beyond the beginning seem to go up significantly. ",
            "created": "Thu, 30 Nov 2017 14:10:12 GMT"
        },
        {
            "text": "A book author begins with a question, have you had a chance to read my book and write about it on your blog? Another rule kicks in here. No bad news. I could tell the truth, that I find it difficult to read printed books, esp ones with small type, because I have a disability. Not something that limits much of what I can do, but it does affect my reading ability. I had eye surgery a number of years ago and it left me with bad vision in one eye, and made it impossible for me to wear glasses, yadda yadda yadda. No one is interested in this other than me (very!) and my eye doctor (not much she can do unfortunately, other than surgery on the other eye, something I'm not willing to risk). ",
            "created": "Thu, 30 Nov 2017 14:11:10 GMT"
        },
        {
            "text": "If I told the author all this, he would probably react negatively. Tell people I was difficult (this has actually happened) or otherwise defame me. But if I simply don't respond there are no negative consequences. So that's what I do. I don't like it. It isn't in my nature to leave people hanging. I want to give them a chance to fix the bug. An electronic copy can help. But honestly I didn't find the subject of the book so compelling, so I don't want to create the expectation that if he jumps through this hoop I will read the book. I probably won't. ",
            "created": "Thu, 30 Nov 2017 14:11:53 GMT"
        },
        {
            "text": "And the idea that I owe anyone space on my blog is a <i>huge</i> turnoff for me. That isn't how it works. Once someone gets territorial about my space, that's usually the end of that. Which is why this is a blog post instead of an email. A rather long one, I might add. :rocket: :boom:",
            "created": "Thu, 30 Nov 2017 14:00:53 GMT",
            "type": "outline"
        }
    ]
}