{
    "text": "December 3",
    "created": "Sun, 03 Dec 2017 15:52:57 GMT",
    "name": "03",
    "subs": [
        {
            "text": "The Mueller investigation, esp when it's working, works in Trump's favor, in a perverse way. It lulls us into believing it's all going to be over maybe soon -- but we don't know what happens if Mueller presents an airtight case. It could be nothing happens.",
            "created": "Mon, 04 Dec 2017 01:24:59 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/dompates/status/937492803625668609",
            "image": "http://scripting.com/images/2017/12/03/bigMac.png"
        },
        {
            "text": "I keep saying <a href=\"https://twitter.com/MMFlint/status/937468504441311232\">this</a> too: \"It is utter denial is to keep repeating that Trump has been able to get little or nothing done. His Fed agencies have decimated this country.\"",
            "created": "Mon, 04 Dec 2017 01:00:28 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/MMFlint/status/937468504441311232"
        },
        {
            "text": "I'm tired of my AppleTV. What to get in its place? Amazon, Google, Roku, or a new AppleTV? The one I have is over five years old. And it's pretty sucky. What do you like?",
            "created": "Sun, 03 Dec 2017 19:32:55 GMT",
            "type": "tweet",
            "tweetId": "937404532656615424",
            "tweetUserName": "davewiner"
        },
        {
            "text": "Based on ratings on \"BingeWorthy\" I started watching <a href=\"http://bingeworthy.io/?id=00233\">Rectify</a>. It's the story of a man who is released from death row into a small Georgia town, and all the shit that happens. I liked the first season, but now I'm getting into the middle of the second, and it's more <i>cringe </i>worthy than binge worthy. What gives? Does it get better?? Also it's got one of the worst names ever. I figured by now I might know what it means, but noooo.",
            "created": "Sun, 03 Dec 2017 16:10:09 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/12/03/filetOfFish.png"
        },
        {
            "text": "Update: I've now finished season 2. It gets better. It's still fairly cringe worthy. But it's also a little thought provoking, pitiful and a teeny bit sexy. I'm going to start season 3. ",
            "created": "Mon, 04 Dec 2017 01:25:41 GMT",
            "type": "outline"
        },
        {
            "text": "Like a lot of subscribers to the NY Times I got <a href=\"http://scripting.com/images/2017/12/03/kristofEmail.png\">an</a> <a href=\"http://x.e.newyorktimesinfo.com/ats/msg.aspx?sg1=5c84bf10cddbe6f611dec47f84f3aa94\">email</a> from Nicholas Kristof thanking me for giving them money. Just like the politicians. Someday they'll figure out that we have much <a href=\"https://duckduckgo.com/?q=define+expertise&t=hg&ia=definition\">more</a> to contribute than money, but not yet.",
            "created": "Sun, 03 Dec 2017 15:52:58 GMT",
            "type": "outline"
        }
    ]
}