{
    "text": "December 4",
    "created": "Mon, 04 Dec 2017 14:43:06 GMT",
    "name": "04",
    "subs": [
        {
            "text": "If the world is going to end I might as well have some <a href=\"https://www.amazon.com/Bowers-Wilkins-Cancelling-Headphones-Performance/dp/B07574TYWW/ref=sr_ph_1?ie=UTF8&qid=1512423107&sr=sr-1&keywords=bowers+wilkins+px\">nice headphones</a>.  Bowers & Wilkins PX. They sound pretty good. But I haven't found music (yet) that sounds that much better than the much <a href=\"https://www.amazon.com/gp/product/B00MR8Z28S/ref=oh_aui_search_detailpage?ie=UTF8&psc=1\">cheaper</a> and lighter and less confining wireless headphones I was using previously. I may still return the new ones. ",
            "created": "Mon, 04 Dec 2017 21:32:02 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/12/04/bowersWilkinsPx.png"
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/937325726629588992\">My poll</a> about 280 character tweets got exactly 280 votes. 33 percent said it was bad, the rest said good, some good some bad, or not sure.",
            "created": "Mon, 04 Dec 2017 15:01:09 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/937325726629588992"
        },
        {
            "text": "I stopped going to tech conferences when I realized there was no way to win as a voice in the \"audience.\" Then I started a <a href=\"http://bloggercon.scripting.com/iv/format.html\">conference</a> that didn't have the concept of an audience. Our goal was to draw the crowd in the hallway back into the conference room. It worked. People loved BloggerCon. I saw some of this at Newsgeist in November. The quality of the session depends on how committed the discussion leader is to hearing from everyone, and following through on interesting and different ideas. I found that teachers and reporters often made excellent discussion leaders. A conference about news <i>should</i> be great. If the reporters are committed to getting the story. But reporters sometimes have a narrow field of vision. And teachers sometimes aren't interested in dialog with students.",
            "created": "Mon, 04 Dec 2017 15:02:13 GMT",
            "type": "outline"
        },
        {
            "text": "Oddly, I found I could be more influential at conferences, if I wasn't there, and just blogged on the topic of the conference from home. So many people in tech read my blog that this turned out to be effective. The only problem was I didn't get the benefit of their thinking. The best balance is to give everyone an equal voice, to the extent that's possible. To really be fierce about not allowing some people to be <a href=\"http://scripting.com/2017/12/02.html#a030533\">better</a> than others. ",
            "created": "Mon, 04 Dec 2017 15:10:11 GMT",
            "type": "outline"
        },
        {
            "text": "At the second BloggerCon I was invited to an elite dinner the night before. Just the good people. I smashed it. Threatened to out them. I said you guys don't understand this conference. You are not better than anyone else. We had a great inclusive dinner that night at the <a href=\"https://en.wikipedia.org/wiki/Durgin-Park\">Durgin Park</a> restaurant in Faneuil Hall in Boston. Open to everyone. Lots of food and drink and lack of civility. ",
            "created": "Mon, 04 Dec 2017 15:11:39 GMT",
            "type": "outline"
        },
        {
            "text": "I wrote this <a href=\"http://scripting.com/davenet/1996/10/24/QueSeraSera.html\">piece</a> in 1996 after going to Stewart Alsop's conference in Phoenix. So much fear from the podium. Larry Ellison and Scott McNeally said they will crush us, in different ways. Ellison more honestly. McNealy with cute metaphors. They were both full of shit. But people in the room might not have realized that. \"The future's not ours to see,\" one might have said to Larry and Scott. Even if you're worth a hundred million billion. ",
            "created": "Mon, 04 Dec 2017 15:17:05 GMT",
            "type": "outline"
        },
        {
            "text": "White hat journalism, superfeeds and courage to change",
            "created": "Mon, 04 Dec 2017 14:49:48 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I got an invite this morning to attend a panel discussion in NYC about how to combat fake news with technology. The panelists all have excellent job titles. No one could be fired for choosing them. The solution is obvious, imho, but it requires them to change. First you have to commit to competing with Facebook and Twitter in news distribution. Which means joining feeds into one superfeed (a term I just coined for what FB/TW do), and only including news orgs that try to write accurately and informatively and respond to feedback that they got it wrong. ",
                    "created": "Mon, 04 Dec 2017 14:50:16 GMT",
                    "image": "http://scripting.com/images/2017/12/04/whiteHat.png"
                },
                {
                    "text": "Think of that as white hat journalism, a <a href=\"https://en.wikipedia.org/wiki/White_hat_(computer_security)\">term</a> borrowed from tech. I proposed this at one of the first sessions at <a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+newsgeist&t=hf&ia=web\">Newsgeist</a> in November. All kinds of well-titled people there. I was asked if Breitbart would be included the superfeed. No, of course not, I said. But, there would be no single superfeed. There would be competiton, so no one has the power to exclude. <i>There was no discussion. </i>I brought it up a couple more times at this future-of-news conference and no one was willing to discuss. ",
                    "created": "Mon, 04 Dec 2017 14:56:43 GMT"
                },
                {
                    "text": "The news industry solution is for Facebook to give them money. I see these two approaches as diametrically opposed. Either compete, or be subservient. ",
                    "created": "Mon, 04 Dec 2017 14:51:41 GMT"
                },
                {
                    "text": "Anyway, that's why I'm pretty sure there will be no attempt to solve the problem at this panel. How could I go and support this, when they don't have the courage to change? ",
                    "created": "Mon, 04 Dec 2017 14:52:19 GMT"
                }
            ]
        }
    ]
}