{
    "text": "December 6",
    "created": "Wed, 06 Dec 2017 16:49:32 GMT",
    "name": "06",
    "subs": [
        {
            "text": "I have a new <a href=\"http://scripting.com/english/\">app</a> for you to try out. It's called <a href=\"http://this.how/english/\">English</a>. It's an editor that runs in the browser that can create and edit a Markdown document in a GitHub repository. It's designed for editing docs and readmes, and to make it possible for less-technical writers to participate in GitHub-hosted open source projects. ",
            "created": "Wed, 06 Dec 2017 16:49:38 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/12/06/bizarroSuperman.png"
        },
        {
            "text": "Update: I am now using <a href=\"http://scripting.com/english/\">English</a> to edit the <a href=\"https://github.com/scripting/Scripting-News/blob/master/README.md\">Readme</a> file of the Scripting-News repo.",
            "created": "Wed, 06 Dec 2017 16:59:42 GMT",
            "type": "outline"
        },
        {
            "text": "Disclaimer: I know it is missing most of the features you'd want in an editor. I explained that in <a href=\"http://this.how/english/#1512575572000\">the readme</a>. ",
            "created": "Wed, 06 Dec 2017 17:00:10 GMT",
            "type": "outline"
        },
        {
            "text": "The point of <a href=\"https://www.zillow.com/homedetails/142-Hopewell-Rd-Alton-NH-03809/86705433_zpid/?utm_content=tid-14d909b7-e1a7-4d7a-b824-47a3e87e7a5d&utm_campaign=zpd_fb_rtg_shdw_NH_14D&utm_source=facebook&utm_medium=social-paid\">real estate porn</a>, if there is one, is to get all the enjoyment there is to be got from fantastic homes without having to pay for them, or live in them. ",
            "created": "Wed, 06 Dec 2017 20:49:08 GMT",
            "type": "outline"
        },
        {
            "text": "A jaw-dropping <a href=\"https://twitter.com/WLV_investor/status/938410022538682368\">tweet</a> unlike any other I've ever seen.",
            "created": "Wed, 06 Dec 2017 17:52:29 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/WLV_investor/status/938410022538682368"
        },
        {
            "text": "New technology is adopted bottom-up, never top-down. And of course the big mucky-mucks can't admit that. Which creates problems.",
            "created": "Wed, 06 Dec 2017 18:17:04 GMT",
            "type": "tweet",
            "tweetId": "938472486093680640",
            "tweetUserName": "davewiner"
        },
        {
            "text": "This kind of <a href=\"https://medium.com/oversightdems/flynn-text-to-business-colleague-during-trump-inauguration-adc558e7291\">document</a> should be on a publicly-owned server.",
            "created": "Wed, 06 Dec 2017 18:27:12 GMT",
            "type": "tweet",
            "tweetId": "938475072246906880",
            "tweetUserName": "davewiner"
        },
        {
            "text": "Try to pull people off Facebook? Wrong idea",
            "created": "Wed, 06 Dec 2017 17:01:09 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "The other day, I got an email from a friend suggesting that we try to get people to stop using Facebook. This idea comes up a lot. I don't support the idea, for a variety of reasons.",
                    "created": "Wed, 06 Dec 2017 17:01:22 GMT",
                    "flNumberedSubs": "true",
                    "subs": [
                        {
                            "text": "I like Facebook. I use it to keep in touch with friends. I have made new friends there. I would miss it. I don't want to quit. ",
                            "created": "Wed, 06 Dec 2017 17:02:06 GMT"
                        },
                        {
                            "text": "It's hopeless. Facebook is an addiction. Try telling a smoker to stop smoking. It's bad for you! Yes yes I know. But people have to want to quit, a lot, to overcome the addiction. A well-intentioned friend is not helping by insisting they stop. (An aside, much better, when they decide it's time to quit, tell them it makes you happy. Offer to help, to go for a walk with them when the urge is overwhelming.)",
                            "created": "Wed, 06 Dec 2017 17:02:25 GMT"
                        },
                        {
                            "text": "And there's something more direct that will do much more good. See the next section.",
                            "created": "Wed, 06 Dec 2017 17:03:59 GMT"
                        }
                    ]
                },
                {
                    "text": "Here's the better idea..",
                    "created": "Wed, 06 Dec 2017 17:08:22 GMT"
                },
                {
                    "text": "Instead of getting people to quit Facebook, let's get proactive in rescuing great writing from Facebook. There should be a process. I see something great on Facebook. I then open a page on some alt-Facebook, or bizarro-Facebook, or whatever you want to call it, and create a copy outside the silo. A place where search engines will find it. Where it can have a life on the open web.",
                    "created": "Wed, 06 Dec 2017 17:04:19 GMT"
                },
                {
                    "text": "Yes yes I know people might not like it. You can ask first if you want, but until the rescue site gets famous people won't know wtf you're talking about. Better to make it a guerilla thing at first. Ask for forgiveness instead of permission. ;-)",
                    "created": "Wed, 06 Dec 2017 17:05:45 GMT"
                },
                {
                    "text": "That's what I think. You could even write a bookmarklet to automate much of it. ",
                    "created": "Wed, 06 Dec 2017 17:06:30 GMT"
                }
            ]
        }
    ]
}