{
    "text": "December 8",
    "created": "Fri, 08 Dec 2017 16:53:57 GMT",
    "name": "08",
    "subs": [
        {
            "text": "For the movie version of BingeWorthy, <i>coming soon,</i> I want to start with movies that are in theaters now, and add new movies as they come out. I want to know about shows you've already seen or want to see. Also interested in movies as they show up in rentals and on DVD (or Apple TV or Netflix, etc).  Post a note <a href=\"https://github.com/scripting/Scripting-News/issues/51\">here</a>, or on <a href=\"https://www.facebook.com/dave.winer.12/posts/657744381099637\">Facebook</a>, or in response to <a href=\"https://twitter.com/davewiner/status/939180433329344513\">this post</a> on Twitter. Let's have fun! :rocket: ",
            "created": "Fri, 08 Dec 2017 16:53:58 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/12/08/popcorn.png"
        },
        {
            "text": "Follow-up to Franken resignation",
            "created": "Fri, 08 Dec 2017 17:45:23 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "This is a very lightly edited version of a <a href=\"https://twitter.com/davewiner/status/938858303282728960\">series of tweets</a> I posted yesterday after the Franken resignation, and after there had been some time to absorb its implications.",
                    "created": "Fri, 08 Dec 2017 17:45:30 GMT",
                    "subs": [
                        {
                            "text": "Earlier today I <a href=\"http://scripting.com/2017/12/07.html#a135018\">wrote</a> that Al Franken should not resign. My concern is we'd be without a process should any other senators be accused of abuse. It should have taken time to decide Franken's fate. Now we have a very flawed process. Not a good place to be.",
                            "created": "Fri, 08 Dec 2017 17:46:16 GMT"
                        },
                        {
                            "text": "People who say the Dems took the high ground are wrong. The high ground would have been to resist the impulse to act quickly, and let the ethics probe proceed. Franken promised to cooperate. This would have been the constructive example for the country, imho the high ground.",
                            "created": "Fri, 08 Dec 2017 17:46:31 GMT"
                        },
                        {
                            "text": "The Sam Seder <a href=\"https://theintercept.com/2017/12/07/sam-seder-msnbc-reverses-decision-to-fire-contributor-sam-seder/\">situation</a> was a warning. <i>There are trolls at work here. </i>Have we already forgotten the debacle of the 2016 election? How easily we can be manipulated. This truth goes along with all the other truths being exposed now.",
                            "created": "Fri, 08 Dec 2017 17:46:44 GMT"
                        },
                        {
                            "text": "His judges, his Democratic colleagues in the Senate, were angry, involved, not dispassionate. Franken maintains that the stories don't add up to what the senators implied (but didn't say). When they write the history, all anyone will be able to say was that Franken was accused.",
                            "created": "Fri, 08 Dec 2017 17:49:40 GMT"
                        },
                        {
                            "text": "It wasn't deliberative. It didn't reach a conclusion. His speech was defiant. Maybe there's truth there. This isn't the way it should be in the United States.",
                            "created": "Fri, 08 Dec 2017 17:51:05 GMT"
                        },
                        {
                            "text": "My main point is there are trolls among us. I'm not just thinking about Franken, but where we go from here. How easily lives will be destroyed (have been destroyed). We are too vulnerable, and the senate could have taken that into account too.",
                            "created": "Fri, 08 Dec 2017 17:51:19 GMT"
                        },
                        {
                            "text": "The key word is deliberate. Which means slow and careful. The way Mueller is pursuing the president. Why were we in such a rush to get rid of Franken and Conyers. We should have been careful. That's the mistake.",
                            "created": "Fri, 08 Dec 2017 17:51:49 GMT"
                        },
                        {
                            "text": "So if you go back to the beginning of the thread. All I claimed was the Dems did not take the high ground. I think they should have.",
                            "created": "Fri, 08 Dec 2017 17:52:02 GMT"
                        }
                    ]
                }
            ]
        }
    ]
}