{
    "text": "December 9",
    "created": "Sat, 09 Dec 2017 13:18:42 GMT",
    "name": "09",
    "subs": [
        {
            "text": "It's ridiculous we don't have <a href=\"https://twitter.com/attn/status/939514740161703938\">parking lots</a> for bikes in NYC.",
            "created": "Sat, 09 Dec 2017 15:20:35 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/attn/status/939514740161703938"
        },
        {
            "text": "Rectify is a <a href=\"http://bingeworthy.io/?id=00233\">favorite</a> of the BingeWorthy crowd, although with not a lot of votes, so I gave it a try. I watched two seasons. It had some good moments. And the premise is fascinating. A man on death row is given a reprieve and sent back to the town where he supposedly committed his crime. But the show drags on and on. It's a soap opera. Lots of meetings between characters where they sigh and struggle, in soap operaish ways. I guess most shows are just that, even The Wire or The Sopranos. But they have variety and surprises and humor. I'm not sure what makes a great binge, but for me, Rectify is not it. ",
            "created": "Sat, 09 Dec 2017 13:37:15 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/12/09/rectify.png"
        },
        {
            "text": "After getting lots of advice from the <a href=\"http://scripting.com/2017/12/03.html#a193255\">braintrust</a>, the consensus was get a Roku. So I did. It hasn't arrived yet. It was supposed to be here yesterday, ordered from Amazon, but it's late. Can't wait to try it. I was going to use it to watch season 2 of <a href=\"http://bingeworthy.io/?id=00352\">The Crown</a>, but I'm going to go ahead with my ancient Apple TV. ",
            "created": "Sat, 09 Dec 2017 13:28:23 GMT",
            "type": "outline"
        },
        {
            "text": "Have you seen the Netflix show \"Godless\"?",
            "created": "Sat, 09 Dec 2017 13:18:43 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "If so, please rate it at <a href=\"http://bingeworthy.io/?id=00353\">BingeWorthy</a>.",
                    "created": "Sat, 09 Dec 2017 13:19:10 GMT"
                },
                {
                    "text": "It should probably be in the top 10, but hasn't received enough ratings yet to qualify."
                },
                {
                    "text": "Thanks! :rocket:",
                    "created": "Sat, 09 Dec 2017 13:18:56 GMT"
                }
            ]
        },
        {
            "text": "I'm tired of all the bashing",
            "created": "Sat, 09 Dec 2017 13:48:43 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Last year's election was a real drain. I remember as we were coming up to Election Day thinking maybe this will all be over soon. In my heart I kind of knew that it wouldn't. Though I wished it would. I'm a programmer, so I'm pretty fatalistic about <a href=\"http://scripting.com/2016/07/28/dontFeedDjTrump.html\">bugs</a> like Trump. You can't wish them away. You have to roll up your sleeves, address the problem, fix it. That's the school of <a href=\"http://scripting.com/davenet/1997/05/07/Programmers.html#5\">programming</a> I belong to. There is no moving forward until you fully understand the problem. ",
                    "created": "Sat, 09 Dec 2017 13:49:47 GMT",
                    "image": "http://scripting.com/images/2017/12/09/mlk.png"
                },
                {
                    "text": "The biggest drain was the utter stupidity of all the anger on the social nets, when people should have been pulling together, to avoid the catastrophe that is Trump. People bashing Hillary or Bernie, or each other. So much hate. Even bashing Trump is pointless. We need to see each other as real people just like ourselves. The media was pushing us apart, not bringing us together.",
                    "created": "Sat, 09 Dec 2017 13:50:43 GMT"
                },
                {
                    "text": "Well it didn't get better. My Facebook world gets smaller and smaller because I have a rule to not engage with people practicing hate. I don't try to talk them out of it. I have a simple gentle way of dealing with it. Instead of objecting I silently unfriend and unfollow the person. It keeps conflict to a minimum, and I get to preserve my self-respect. Watching friends rant about how this group or that group is responsible, often a group I belong to, takes its toll. People I couldn't stand to say goodbye to got second and third chances. But ultimately once we lost them to hate they really are gone. They don't seem to come back.",
                    "created": "Sat, 09 Dec 2017 13:51:36 GMT"
                },
                {
                    "text": "So rather than fight I withdraw. The circle gets smaller. Eventually Facebook might just disappear, at least my version of it. I think about where I can move to withdraw from all of it. I dream of somewhere in the Rockies. Where the mornings are cold and the air is clear. Maybe start skiing again. But then I realize there really is no escape. That's America too. The hate follows you everywhere.",
                    "created": "Sat, 09 Dec 2017 13:53:51 GMT"
                },
                {
                    "text": "Last year when the music stars were dying, Prince and Bowie, and this year -- Tom Petty and Walter Becker, I would joke, well at least they don't have to live through Trump. Like all jokes it was funny because it was true. I keep wondering when the suicides will start, as people give up hope. I think that is the logical conclusion of my thought process. The way to make the world disappear is to make <i>yourself</i> disappear.",
                    "created": "Sat, 09 Dec 2017 13:54:52 GMT"
                },
                {
                    "text": "Don't worry dear reader, I have no intention of doing away with myself. That'll happen soon enough through the natural progression of things. But if I were a young person today I'd be angry and in the streets, shaking every person saying what the fuck are you doing to put a stop to this lunacy?",
                    "created": "Sat, 09 Dec 2017 13:56:26 GMT"
                }
            ]
        },
        {
            "text": "People who show up",
            "created": "Sat, 09 Dec 2017 14:47:22 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "There's a nice <a href=\"https://twitter.com/anildash/status/939137973240696832\">thread</a> on Twitter, started by @anildash. He asks you to name people who opened doors for you and made new things possible. I got a few very sweet testimonials from old <a href=\"https://twitter.com/om/status/939204436961792001\">friends</a>. It's nice to have your good work appreciated. Opening doors for other people is a big deal for me. ",
                    "created": "Sat, 09 Dec 2017 14:47:26 GMT"
                },
                {
                    "text": "Brent Simmons <a href=\"https://twitter.com/brentsimmons/status/939215623023759360\">said</a> it was simple. I gave him a chance as a programmer working with me, on projects in the 90s that had pretty great results. So obviously I made the right call. I want to say why I chose Brent over more experienced educated people. It's simple. He showed up. ",
                    "created": "Sat, 09 Dec 2017 14:48:31 GMT"
                },
                {
                    "text": "You can learn how to program, and your help might be very helpful, but if you aren't there, you aren't willing to take a chance, don't have the innate skills, the foundation, the whatever-it-is that made you show up, if you aren't all those things which amount to showing up, then well I'm going to go with the person who showed up. It's a decent algorithm. Empirically, it works. (Not a joke, though it might sound like it is.)",
                    "created": "Sat, 09 Dec 2017 14:49:34 GMT"
                },
                {
                    "text": "Same with Chris Lydon. Many if not most things about Chris infuriate me. I have to get that out of the way. I love him, but most of the time, in the ways I care about, he does not show up. But I worked with him, and the work, like the projects I did with Brent, proved to be significant. It produced results that could be built on. I know this because things <i>were</i> built on it. Because in the end, for whatever reason, he showed up.",
                    "created": "Sat, 09 Dec 2017 14:51:31 GMT"
                },
                {
                    "text": "When I made my <a href=\"https://twitter.com/davewiner/status/939236760055410690\">list</a> of people who opened doors for me, that's the criteria I used. People who worked with me, trusted me, took a chance on me, because flipped around that's exactly what Brent and Chris did. There are <s>probably</s> certainly things about me that infuriate them. But I showed up, they showed up, and something happened.",
                    "created": "Sat, 09 Dec 2017 14:55:35 GMT"
                }
            ]
        },
        {
            "text": "Give her a show! ;-)",
            "created": "Sat, 09 Dec 2017 20:42:16 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Yesterday I <a href=\"https://twitter.com/davewiner/status/939261439105224706\">tweeted</a> that Yamiche Alcindor, a reporter at the NY Times, should get her own show. Here's why I said that. ",
                    "created": "Sat, 09 Dec 2017 20:42:37 GMT",
                    "flNumberedSubs": "true",
                    "subs": [
                        {
                            "text": "At the moment I wrote that tweet she was a guest on MTP Daily on MSNBC. They were talking about Al Franken. There were three reporters on a panel moderated by Chuck Todd, the host. ",
                            "created": "Sat, 09 Dec 2017 20:42:45 GMT"
                        },
                        {
                            "text": "She was the only one who said what actually happened. Franken did not admit guilt, did not apologize, and there was a rush to get him out of the Senate, no process was used. So we don't know anything more than Franken was accused of something that he denies. ",
                            "created": "Sat, 09 Dec 2017 20:53:54 GMT"
                        },
                        {
                            "text": "I had heard her earlier on Friday as a guest on the <a href=\"http://podcatch.com/archive/2017/12/08/628337.html\">Daily podcast</a>, where she said the same thing, in more detail without interruption, so I knew what she was trying to say on MTP.",
                            "created": "Sat, 09 Dec 2017 20:44:25 GMT"
                        },
                        {
                            "text": "With one exception, Masha Gessen <a href=\"https://www.newyorker.com/news/our-columnists/al-franken-resignation-and-the-selective-force-of-metoo\">writing</a> in the New Yorker, every other report seems to have missed this very basic point. Franken could have, guilty or innocent, helped establish a process for a #metoo case, at least for politicians. The process is going to be different in private corporations. But the senators that forced Franken out had no authority to do so. He isn't anyone's employee. He represents the people of Minnesota, and as was pointed out in the New Yorker piece, they were not consulted. ",
                            "created": "Sat, 09 Dec 2017 20:44:59 GMT"
                        },
                        {
                            "text": "I have <a href=\"http://scripting.com/2017/12/08.html#a174523\">written</a> about this twice. I expressed the same ideas Alcindor was expressing. I added that I didn't see what the rush was. A thorough and deliberative process would say that we're trying to be fair. A rush to judgment is exactly the kind of thing the Democratic Party was against, as far as I know. It's against the basic values of our country. If we want to maintain the rule of law (we do!) how does it help to circumvent it? I think it's great that a reporter thinks the facts are more important than an insider's view of optics, which is what the other panelists focused on. ",
                            "created": "Sat, 09 Dec 2017 20:46:53 GMT"
                        }
                    ]
                }
            ]
        }
    ]
}