{
    "text": "December 10",
    "created": "Sun, 10 Dec 2017 14:28:10 GMT",
    "name": "10",
    "subs": [
        {
            "text": "New <a href=\"http://scripting.com/2017/12/10.html\">header graphic</a> for the change in season.",
            "created": "Mon, 11 Dec 2017 02:59:36 GMT",
            "type": "outline"
        },
        {
            "text": "Hillary's mistake was thinking all she had to do is remind voters how awful Trump is. I saw the ads as evidence she had nothing to offer, no passion. Over and over. I wouldn't bother pointing this out now if the Dems weren't repeating this approach. ",
            "created": "Sun, 10 Dec 2017 22:47:05 GMT",
            "type": "outline"
        },
        {
            "text": "Reporters and pundits seem to think we're reliving Watergate. I don't think so. In Watergate you didn't have ex-presidents warning that if we don't do something, we're going to wind up in Nazi Germany. I wonder how many times we'll hear that warning, or if you only get it once, and if the next thing is that the ex-president goes into hiding. How much are the Repubs in Congress backing Trump because they like the politics or they fear for their lives? There probably won't be a point where you get a choice, go this way for salvation and the other way for hell. It may be that by the time you realize there was a choice, there no longer is a choice. A year ago we were trying to convince electors to do the sane thing and not vote for Trump. Now look where we are. If Roy Moore makes it into Congress, how many Roy Moores will follow? ",
            "created": "Sun, 10 Dec 2017 18:05:41 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/12/10/thisIsNextYear.png"
        },
        {
            "text": "I'm working my way through <a href=\"https://en.wikipedia.org/wiki/The_Crown_(TV_series)\">The Crown</a>, season 2. It's every bit as good as the first season. No <a href=\"https://en.wikipedia.org/wiki/John_Lithgow\">John Lithgow</a>, unfortunately. But still plenty of politics and intrigue and British mannerisms to keep you entertained. Stiff upper lip. Cheerio. Quite right.",
            "created": "Sun, 10 Dec 2017 14:28:11 GMT",
            "type": "tweet",
            "tweetId": "939864492065902600",
            "tweetUserName": "davewiner"
        }
    ]
}