{
    "text": "December 13",
    "created": "Wed, 13 Dec 2017 14:40:02 GMT",
    "name": "13",
    "subs": [
        {
            "text": "Welcome to <a href=\"http://bingeworthy.io/movies/\">BingeWorthy for Movies</a>! :rocket:",
            "created": "Wed, 13 Dec 2017 14:40:03 GMT",
            "type": "outline"
        },
        {
            "text": "There's a <a href=\"http://this.how/bingeworthy/#1513006310000\">section</a> in the BingeWorthy howto for the movies. ",
            "created": "Wed, 13 Dec 2017 14:43:42 GMT",
            "type": "outline"
        },
        {
            "text": "Overview: the movies in BingeWorthy are the ones currently in theaters. New movies will be added over the coming weeks. The big day of release of course is Christmas Day. Not sure how it will evolve after that. The immediate goal is to find out what people think of movies in almost realtime, as they roll out through the theaters. Also included are new releases on Netflix and other streaming services as well as featured releases from previous years. I wanted to be sure people had something to rate on their first visit. ",
            "created": "Wed, 13 Dec 2017 14:44:44 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/12/08/popcorn.png"
        },
        {
            "text": "With this release, the first site is now repositioned as <a href=\"http://bingeworthy.io/tv/\">BingeWorthy for TV</a>. It has been moved to a sub-folder. The home page still is the TV version, but I plan to redirect from there to one of the sub-sites. Not doing that immediately. ",
            "created": "Wed, 13 Dec 2017 14:46:47 GMT",
            "type": "outline"
        },
        {
            "text": "There are a bunch of changes and new features. There's a <a href=\"http://scripting.com/images/2017/12/13/permaLinkIcon.png\">link icon</a> in the upper left corner of the program box. This is the permalink to the page for that program. Previously there was no easy way to get a permalink. Also there's a menu bar at the top of the screen. The links below the program box have been moved there. I expect there will be more things to link to over time, and we needed an approach that would have some ability to extend. ",
            "created": "Wed, 13 Dec 2017 14:48:54 GMT",
            "type": "outline"
        },
        {
            "text": "If you have questions or problems to report, please post a <a href=\"http://this.how/bingeworthy/#1510670870000\">comment</a> on the howto page.",
            "created": "Wed, 13 Dec 2017 14:53:20 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=sRd17GEt7b8&feature=youtu.be\">Demo</a> of new thread-writing feature in Twitter.",
            "created": "Wed, 13 Dec 2017 17:33:27 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/embed/sRd17GEt7b8"
        },
        {
            "text": "I have these <a href=\"https://www.amazon.com/Bowers-Wilkins-Cancelling-Headphones-Performance/dp/B07574TYWW/ref=sr_ph_1?ie=UTF8&qid=1513177553&sr=sr-1&keywords=bowers+%26+wilkins+px\">sexy new headphones</a>. Great sound. But I keep accidentally hitting the controls, which are not labeled. I have no idea what they do, other than they turn the music off, and I can't figure out how to turn it back on. This gets inconvenient when I'm out and about and it's <i>fucking cold</i> outside. They should user-test these things in the conditions people really use them in. ",
            "created": "Wed, 13 Dec 2017 15:04:34 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/12/04/bowersWilkinsPx.png"
        },
        {
            "text": "Another thing. The Music app on the iPhone doesn't let you search your own library. You can only search <i>their</i> library, the one that costs money or shares all your prefs who god-knows-who. ",
            "created": "Wed, 13 Dec 2017 15:06:40 GMT",
            "type": "outline"
        },
        {
            "text": "Fact: Donald Trump, president of the United States has a weird as yet undetermined relationship with Russia. He probably owes them a lot of money. We need to know about this. Since the president hasn't been forthcoming, we're using the FBI.",
            "created": "Wed, 13 Dec 2017 15:22:47 GMT",
            "type": "outline"
        },
        {
            "text": "BuzzFeed imho should have become a <a href=\"http://scripting.com/stories/2010/02/07/hypercampRevisited.html\">venue</a> for news the way the cable channels are. But with lots of studios distributed around the world. That would have guaranteed them a seat at the table going forward. ",
            "created": "Wed, 13 Dec 2017 16:16:17 GMT",
            "type": "outline"
        }
    ]
}