{
    "text": "December 21",
    "created": "Thu, 21 Dec 2017 14:04:29 GMT",
    "name": "21",
    "subs": [
        {
            "text": "If you have a comment about something I've written on <a href=\"http://scripting.com/\">this blog</a>, you can use the <a href=\"http://scripting.com/?tab=discuss\">Discuss tab</a> to add a note. I'm using Disqus, because it's so easy, but am considering other approaches, even replacing it with a simple chat app. The comment <a href=\"http://guidelines.scripting.com/\">guidelines</a> still apply. ",
            "created": "Thu, 21 Dec 2017 14:47:55 GMT",
            "type": "outline"
        },
        {
            "text": "Apparently there's a march to impeach Trump in Washington on January 20 and elsewhere. Looking for a simple fast website to point to for this event. Not on Facebook. Any pointers?",
            "created": "Fri, 22 Dec 2017 00:46:37 GMT",
            "type": "outline"
        },
        {
            "text": "Nieman Lab runs a <a href=\"http://www.niemanlab.org/collection/predictions-2018/\">year-end series</a> of essays by experts on the future of news. If I had a say --> In the future news will include perspectives from voters and taxpayers, people who are governed, the ideas and questions they have, without experts getting in the middle. Also \"public editors\" will be members of the public, not professional journalists. ",
            "created": "Thu, 21 Dec 2017 14:52:25 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/12/21/kraftParmesanCheese.png"
        },
        {
            "text": "Really the greatest disease of journalism is its closed <a href=\"https://en.wikipedia.org/wiki/Topology\">topology</a>. No ideas can enter. It runs off its own fumes, only. Nothing can take it off course. Same assumptions apply, always, even when discredited. Allowing non-journalists access to the flow would change that in an instant. Which is why journalists are so totally opposed to it. They do not want change. ",
            "created": "Thu, 21 Dec 2017 14:59:08 GMT",
            "type": "outline"
        },
        {
            "text": "I've found that when someone asks your opinion what they usually mean is they want you to agree with them.",
            "created": "Thu, 21 Dec 2017 14:04:30 GMT",
            "type": "outline"
        }
    ]
}