{
    "text": "December 22",
    "created": "Fri, 22 Dec 2017 14:01:24 GMT",
    "name": "22",
    "subs": [
        {
            "text": "I've <a href=\"http://scripting.com/2017/04/09/fiveDaysInPerugia.html\">been</a> to a <a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+newsgeist&t=hg&ia=web\">couple</a> of future-of-news conferences this year, first in a long time. In both cases I stayed from beginning to end, went to lots of sessions, talked with lots of people, was treated well. My takeaway: they need their own independent developer community that shares their interests, which are in conflict with the big tech companies, Amazon, Google, Facebook et al, who are the sponsors of these conferences. That's how they pay for them. So I guess it would be impolite to try to build a developer community through these conferences? Or impossible.",
            "created": "Fri, 22 Dec 2017 14:01:25 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/12/10/thisIsNextYear.png"
        },
        {
            "text": "When Apple bought NeXT in 1997, few people realized that it was really NeXT buying Apple. And when we won the war in Iraq, perhaps it was the other way around too. ",
            "created": "Fri, 22 Dec 2017 16:57:35 GMT",
            "type": "tweet",
            "tweetId": "944250642956275719",
            "tweetUserName": "davewiner"
        },
        {
            "text": "Twitter <a href=\"https://twitter.com/mrdonut/status/943965304257880064\">asks</a> what is the most important thing you want to see improved in 2018. My <a href=\"https://twitter.com/davewiner/status/943968987599261699\">suggestion</a>:  In addition to images and movies, add a text type with simple styles and links, possibly using <a href=\"https://github.com/adam-p/markdown-here/wiki/Markdown-Cheatsheet\">markdown</a> syntax.",
            "created": "Fri, 22 Dec 2017 14:53:11 GMT",
            "type": "outline"
        },
        {
            "text": "End of year blogging",
            "created": "Fri, 22 Dec 2017 15:06:15 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Re <a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+blogger+of+the+year&t=hg&ia=web\">Blogger of the Year</a>. I have of course been thinking about my annual <a href=\"http://thesaurus.land/?word=rite\">rite</a>, choosing a person to honor as the standout BOTY. I do this almost every year, and there's still a couple of weeks left in 2017, so I might still do it this year, if inspiration hits me. But this has not, for me, been an inspiring year for blogging of others. So for now at least this will be a BOTY-less year. ",
                    "created": "Fri, 22 Dec 2017 15:09:05 GMT",
                    "image": "http://scripting.com/images/2017/12/22/santa.png"
                },
                {
                    "text": "My own blogging? Yes, I'm happy with the way that's going. I stood my ground this year, and dug in against the deluge of silos. No more trying to accomodate the limitations of Facebook, Google Reader (astonishing even though it's 5-years defunct it's still having a negative effect on blogging), and Medium. I went <a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+%22old+school%22&t=hg&ia=web\">old school</a>, and am happy with this way of doing things. ",
                    "created": "Fri, 22 Dec 2017 15:06:41 GMT"
                },
                {
                    "text": "And I'm happy to say that Twitter became much less of a problem this year, just by going to 280 chars, more of my blog posts fit in tweets. Which means there's more fidelity between my platform and theirs. I hope they go all the way, and let posts like this be readable in Twitter, without threads, and without a link-click.",
                    "created": "Fri, 22 Dec 2017 15:07:13 GMT"
                },
                {
                    "text": "Right now, if I were <i>forced</i> to choose a BOTY, it would be <a href=\"https://om.co/\">Om Malik</a>. One of the very early bloggers, and close to my heart because he started on my platform way back then, and close to my heart just because he's so open with his thoughts and strong in his beliefs. But his blogging rebirth is still a new thing. Let's check back in 2018 and see how it's going.  ",
                    "created": "Fri, 22 Dec 2017 15:07:14 GMT"
                }
            ]
        }
    ]
}