{
    "text": "December 23",
    "created": "Sat, 23 Dec 2017 16:50:07 GMT",
    "name": "23",
    "subs": [
        {
            "text": "Two levels of obstruction",
            "created": "Sat, 23 Dec 2017 16:50:08 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "It's sad to watch the Republican leaders of Congress obstructing justice to cover up the president's crimes. This was the lesson of Watergate, repeating now at two levels. ",
                    "created": "Sat, 23 Dec 2017 16:50:14 GMT",
                    "flNumberedSubs": "true",
                    "image": "http://scripting.com/images/2017/12/23/sarahLynn.png",
                    "subs": [
                        {
                            "text": "First, we don't know what the president is covering up, but we have a pretty good idea. In his case it might make sense to try to obstruct, because the crimes were so incredibly damaging to the country. ",
                            "created": "Sat, 23 Dec 2017 16:56:27 GMT"
                        },
                        {
                            "text": "But why would the Republican congresspeople risk going to jail, unless they were also implicated? It's hard to imagine. They are members of a co-equal branch of government. They are supposed to watch the executive, be ready to impeach if the Mueller investigation shows the president committed a crime. They know this, very well, but chose to go the other way, to abandon their country. Why? Why would they do this?",
                            "created": "Sat, 23 Dec 2017 16:56:35 GMT"
                        }
                    ]
                },
                {
                    "text": "The lesson of Watergate was this. The crime of obstruction was greater than the crime they were covering up. Nixon and his aides would have been better off to come clean as soon as the burglars were caught. As I said that may not be the case for Trump, but it almost certainly is true for the Senators and congresspeople. ",
                    "created": "Sat, 23 Dec 2017 16:53:37 GMT"
                }
            ]
        }
    ]
}