{
    "text": "December 26",
    "created": "Tue, 26 Dec 2017 15:36:45 GMT",
    "name": "26",
    "subs": [
        {
            "text": "Saying \"we both know\" is the kind of thing the bully used to say when we were kids. Don't say it. It's super disrespectful. Let everyone speak for themselves.",
            "created": "Wed, 27 Dec 2017 00:24:40 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/12/26/bojack.png"
        },
        {
            "text": "You know that story where <a href=\"https://en.wikipedia.org/wiki/First_they_came_...\">the guy said</a> first they came for the socialists, and I did not speak out because I was not a socialist, etc. Well we're living in that world now. And the chances to speak out are passing us by. ",
            "created": "Wed, 27 Dec 2017 00:42:23 GMT",
            "type": "tweet",
            "tweetId": "945817131907764224",
            "tweetUserName": "davewiner"
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/945693468378181633\">Who's in the White House?</a> Tony Soprano, Mr Burns, King Joffrey or Boris & Natasha.",
            "created": "Wed, 27 Dec 2017 00:50:43 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/945693468378181633"
        },
        {
            "text": "Holding the line with the FBI is a better situation than last year with the  Electoral College. Then we were pushing for a function of government to assume more than the normal power. With the FBI, we're demanding they be allowed to do what they always do, investigate and indict. ",
            "created": "Tue, 26 Dec 2017 18:04:08 GMT",
            "type": "outline"
        },
        {
            "text": "Some people, esp in tech and journalism, think if you're nice to them, or help them, that you must want something from them. I have to admit that <i>sometimes</i> I do want something, but I try to keep that decoupled from what I'm doing at the moment. No need for a quid pro quo. But I don't mind reciprocation. It's a subtle distinction. Anyway, I don't think I've ever posted this. I really actually like helping people. It makes me feel good. Esp when they do something powerful with the help. :boom:",
            "created": "Tue, 26 Dec 2017 15:36:46 GMT",
            "type": "outline"
        },
        {
            "text": "I feel this very strongly",
            "created": "Tue, 26 Dec 2017 16:05:02 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "We have to find ways to tell the FBI that the majority of the American people want the Mueller investigation to go to completion, regardless of what the Republicans do to interfere."
                },
                {
                    "text": "If the FBI should fall, we'll be in a terrible position. The president and his cronies will feel there is no reason at all to obey the law. They are concerned now, after defeating the FBI, there will be no reason to be concerned."
                },
                {
                    "text": "I can imagine a set of steps, but the first step is to decide, now, to make your opinion heard."
                }
            ]
        }
    ]
}