{
    "text": "December 27",
    "created": "Wed, 27 Dec 2017 16:37:08 GMT",
    "name": "27",
    "subs": [
        {
            "text": "This is a <a href=\"https://github.com/scripting/open-source-writing/blob/master/2017/12/petition.md\">draft</a> of a petition I want to run on change.org. Comments and suggestions are welcome.",
            "created": "Wed, 27 Dec 2017 18:12:09 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/09/26/colin.png"
        },
        {
            "text": "Announce: <a href=\"https://github.com/scripting/electricPork\">Electric Pork as open source</a>. I like to start developer projects at this time of year, when people have time to poke around and think and try ideas out. This year, I'd like to <a href=\"https://github.com/scripting/Scripting-News/issues/55\">introduce a shell</a> that I've created for Electron apps called electronLand. It hooks into \"nodeStorage\" and Twitter for identity and storage. I use this framework in \"Public Folder\", \"Instant Dave\" and \"Electric Pork\". I also have some unreleased projects that use electronLand. When it's ported all the projects should port as well. And the framework could prove useful to others, I hope. :boom:",
            "created": "Wed, 27 Dec 2017 17:04:54 GMT",
            "type": "outline"
        },
        {
            "text": "If you have questions or comments about the open source release of Electric Pork, please post a note <a href=\"https://github.com/scripting/Scripting-News/issues/55\">here</a>. ",
            "created": "Wed, 27 Dec 2017 17:11:09 GMT",
            "type": "outline"
        },
        {
            "text": "My dear departed uncle started a mythical union called The Amalgamated Bums and Drifters of America. I realize now that I qualify for a union card. ;-)",
            "created": "Wed, 27 Dec 2017 22:48:31 GMT",
            "type": "tweet",
            "tweetId": "946150909070979073",
            "tweetUserName": "davewiner"
        },
        {
            "text": "<a href=\"http://scripting.com/stories/2012/07/20/moreOnLocAndTwitter.html\">In 2012</a>, I argued that libraries should first support the open web before partnering with private companies. The moment was defined by the Library of Congress hooking up with Twitter. Blogs desperately needed preservation at the time.",
            "created": "Wed, 27 Dec 2017 16:37:09 GMT",
            "type": "outline"
        },
        {
            "text": "You know how NRA supporters say \"it's too soon\" to politicize gun violence. In the same way, even more so, it's too soon to politicize the Mueller investigation. Wait until there's an outcome, then if you object let your concerns be known. In the meantime be quiet. ",
            "created": "Wed, 27 Dec 2017 18:00:01 GMT",
            "type": "outline"
        },
        {
            "text": "Ask yourself, seriously, what are the chances that one of the superstars of TrumpLand has tried on a Nazi uniform, just to see how it looks.",
            "created": "Wed, 27 Dec 2017 18:10:05 GMT",
            "type": "outline"
        },
        {
            "text": "Hint to political parties and news orgs. Come up with ways for citizens to help, to belong, to participate. I take pride in <a href=\"https://bikeangels.citibikenyc.com/\">helping Citi Bike</a> in NYC, even though it's a private corp. People <i>want</i> to help good causes.  ",
            "created": "Wed, 27 Dec 2017 18:33:11 GMT",
            "type": "outline"
        }
    ]
}