{
    "text": "December 28",
    "created": "Thu, 28 Dec 2017 15:24:07 GMT",
    "name": "28",
    "subs": [
        {
            "text": "<a href=\"https://www.change.org/p/americans-support-the-fbi?recruiter=33525126&utm_source=share_petition&utm_medium=twitter&utm_campaign=share_twitter_responsive\">Petition</a> to demand that the president stop interfering in the Mueller investigation. Please sign and RT and pass it along.",
            "created": "Thu, 28 Dec 2017 18:50:59 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://twitter.com/JorgenVeisdal/status/946397006083313665\">Jørgen Veisdal</a>: \"How are science and news different in terms of their overarching goals? Why is one publicly funded and the other not (in the US)?\" My <a href=\"https://twitter.com/davewiner/status/946422125841342465\">response</a>. ",
            "created": "Thu, 28 Dec 2017 20:20:44 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/946422125841342465"
        },
        {
            "text": "<a href=\"http://www.nakedjen.com/nakedjen/2017/06/noisy.html\">NakedJen in NYC</a> with a little philosophy about noisy people. ",
            "created": "Thu, 28 Dec 2017 18:23:24 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://github.com/scripting/open-source-writing/issues/1\">Comments</a> on change.org  petition. There have been some good comments, resulting in an improved <a href=\"https://github.com/scripting/open-source-writing/blob/master/2017/12/petition.md\">statement</a>. Feedback is welcome, until the petition is public, then it can't be changed.",
            "created": "Thu, 28 Dec 2017 15:55:01 GMT",
            "type": "outline"
        },
        {
            "text": "Pay for your sins, <i>before</i> the users figure it out",
            "created": "Thu, 28 Dec 2017 22:17:48 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "<a href=\"https://www.apple.com/iphone-battery-and-performance/\">Apple</a> <a href=\"https://www.techmeme.com/171228/p11#a171228p11\">was</a> in a tight spot, probably. Had they explained what they were doing, proactively, people probably wouldn't have understood. It seems likely they were driven by engineering, not greed. But what if they had been caught doing evil? There would have been hell to pay. ",
                    "created": "Thu, 28 Dec 2017 22:17:57 GMT",
                    "image": "http://scripting.com/images/2017/11/15/kristaps.png"
                },
                {
                    "text": "But other tech companies <i>are</i> doing evil stuff and getting away with it because users are confused or their attention is focused elsewhere or they naïvely trust them. For now. But at some point that might not be true. ",
                    "created": "Thu, 28 Dec 2017 22:18:02 GMT"
                },
                {
                    "text": "Google is a prime example, spoiling the environment, and temporarily getting away with it. Unlike Apple with the battery software, there won't be a good engineering reason for what they're doing. Strictly greed. "
                },
                {
                    "text": "Good advice: clean up your <a href=\"http://scripting.com/2013/07/23/whyGoogleReaderDied\">oil</a> <a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+google+https&t=hf&ia=web\">spills</a> before people figure out what you've been doing. ",
                    "created": "Thu, 28 Dec 2017 22:23:22 GMT"
                }
            ]
        },
        {
            "text": "About patriarchy and gender",
            "created": "Thu, 28 Dec 2017 15:31:10 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "If there is a patriarchy, no one gave me the password (or the URL for that matter). In my experience, men are pretty shitty to other men. On the other hand, women are pretty shitty to men too. I suppose it's simply that people are shitty to other people, and (possibly) gender matters only in how they express their shit? I don't think people have studied this objectively, so I think my own opinion is as good as anyone's.  ",
                    "created": "Thu, 28 Dec 2017 15:31:22 GMT",
                    "image": "http://scripting.com/images/2017/12/28/cylon.png"
                },
                {
                    "text": "That said, unequivocally, my best friends are women. They listen better, care more, share more of who they are, are less guarded than my men friends. The exceptions among men are people who have had their armor removed by life. Having a serious illness or divorce, some kind of crisis that woke them up. And this may be true of women as well. If you haven't had to deal with a personal existential crisis, at some level you feel like life is infinite. People who have evaded death, for the moment, tend to be better friends. ",
                    "created": "Thu, 28 Dec 2017 15:32:04 GMT"
                },
                {
                    "text": "And before you blame men for having the armor in the first place, it was our families and society that forced us to have it. <a href=\"https://www.youtube.com/watch?v=hc45-ptHMxo\">Be a man</a>, man up, etc. In my experience that was a response to growing into a man's body when I was still a kid and had no idea why people were now scared of me. I was still a boy. I'm sure girls go through something similar (though opposite perhaps) when their bodies mature when they are still children. ",
                    "created": "Thu, 28 Dec 2017 15:32:52 GMT"
                },
                {
                    "text": "I think our gender problems trace to the dissolution of the extended family. We are a social species, but many of us are told we have to be self-sufficient. This is impossible. But we cope with it somehow. If we could find ways to have more lifelong friendships, we'd probably be better to each other. ",
                    "created": "Thu, 28 Dec 2017 15:33:20 GMT"
                }
            ]
        }
    ]
}