{
    "text": "December 29",
    "created": "Fri, 29 Dec 2017 15:37:35 GMT",
    "name": "29",
    "subs": [
        {
            "text": "A small technical change in the way \"Scripting News\" is generated. There are two kinds of posts, singular items, and titled items. This post is a singular item. Both kinds appear on the home page and on the archive pages. But now titled items also appear on their own pages. For example, here's a <a href=\"http://scripting.com/2017/12/29/160005.html\">titled item</a> from earlier today on its own page. And here's the <a href=\"http://scripting.com/2017/12/29.html\">archive page</a> for today. You may, in some RSS readers, see all the titled items from the month of December repeated, because their permalinks have changed. ",
            "created": "Fri, 29 Dec 2017 23:27:30 GMT",
            "type": "outline",
            "image": "http://static.scripting.com/larryKing/images/2012/11/10/horse.gif"
        },
        {
            "text": "I started watching the Netflix series <a href=\"https://en.wikipedia.org/wiki/Travelers_(TV_series)\">Travelers</a> and I liked the first couple of episodes, but now four episodes into season 1 they seem to have run out of ideas. I'm looking for bingeable entertainment. I think I've watched all the good stuff.",
            "created": "Fri, 29 Dec 2017 15:37:36 GMT",
            "type": "outline"
        },
        {
            "text": "It's disgusting the way Repubs attacked NY and Calif with their tax plan. An idea for a counter-attack: tax all income over $1 million at 100 percent, and accompany it with a statement. We will restore the tax to what it was when the Repubs undo their attack. That would get a conversation going between the rich folk who own the rest of us. What would NY/Calif do with the money? Pay its citizens to move to Wyoming, Montana, Alaska, etc. And vote. It wouldn't take many expat NYers to turn those states blue. I know it's a hardship, that's why they have to be paid, well, for their sacrifice. Like the bonus people get for giving up their seats on overbooked flights.",
            "created": "Fri, 29 Dec 2017 16:52:31 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+napster&t=hf&ia=web\">Napster</a>, one of the most culturally significant inventions, doesn't get enough credit imho. It's when the <a href=\"http://scripting.com/2014/12/17/whatIfTheRiaaHadEmbracedNapster.html\">dam</a> broke, when music programming became something we can do for ourselves. It's hard to remember how it used to work, we were so controlled by the scarcity of music. After Napster, we assume we can listen to anything we want.",
            "created": "Fri, 29 Dec 2017 16:21:10 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/12/29/napster.png"
        },
        {
            "text": "Horse race politics",
            "created": "Fri, 29 Dec 2017 16:00:05 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I'm not big on horse races, but I just realized that Trump forces the Repubs to be less radical, less insane, esp after the Roy Moore experience in Alabama. Let me explain.",
                    "created": "Fri, 29 Dec 2017 16:00:54 GMT",
                    "flNumberedSubs": "true",
                    "subs": [
                        {
                            "text": "First, Roy Moore is a crazy candidate. A total looney bird. Would only be worse if he wore a Gestapo outfit while he rode his horse to the polls. His insanity would appeal to a very small group of people, normally, but Alabama is not normal. You could nominate <a href=\"https://en.wikipedia.org/wiki/Jeffrey_Dahmer\">Jeffrey Dahmer</a> or <a href=\"https://en.wikipedia.org/wiki/Charles_Manson\">Charles Manson</a> and they'd probably get elected as a Repub in Alabama, any time except now. ",
                            "created": "Fri, 29 Dec 2017 16:01:16 GMT"
                        },
                        {
                            "text": "Trump has shown us where crazy gets us. People are tired of it. Even solid Republican voters. Exhausted, and it's only getting worse. Enough that <i>Roy Moore lost to a Democrat. </i>Mitch McConnell <a href=\"https://www.apnews.com/cfe1852e997043e3b4d41c08e296e1ea\">noted</a> that this was in the reddest of red states. That's a signal to every other state. Nominate a lunatic and no matter if you're Mississippi or Texas or Wyoming or Alaska, the Democrat is going to win. ",
                            "created": "Fri, 29 Dec 2017 16:02:05 GMT"
                        },
                        {
                            "text": "So... some red states will nominate moderate Repubs instead of the normal Tea Party asshole. And others will go ahead and nominate someone who's as crazy as Trump or Moore. Either way, politics won't scare us as much in the next cycle. ",
                            "created": "Fri, 29 Dec 2017 16:03:37 GMT"
                        },
                        {
                            "text": "However, that's not to say that the Repubs who are nominated, crazy or moderate, won't take their orders from the same billionaire assholes, the Kochs, Adelsons, Mercers, etc. Their form of lunacy won't go away any time soon.",
                            "created": "Fri, 29 Dec 2017 16:04:41 GMT"
                        }
                    ]
                }
            ]
        }
    ]
}