{
    "text": "Skiing is falling",
    "created": "Thu, 15 Feb 2024 19:40:50 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I went skiing again today, second time in two weeks. Feeling pretty good. And I learned something I'd like to share. A different way of looking at skiing. Here's the story...",
            "created": "Thu, 15 Feb 2024 19:31:32 GMT",
            "flInCalendar": true
        },
        {
            "text": "First thing in the morning the snow was hard and while they had done a good job of grooming, you do a lot of sliding when you edge when the snow is so hard. Much more than in the powder you get in the Rockies. So I'm always totally thinking about staying in control and it's stressful. In this mode I ask myself why I'm doing this if it's so unpleasant. ",
            "created": "Thu, 15 Feb 2024 19:44:01 GMT",
            "flInCalendar": true
        },
        {
            "text": "But as the snow softened during the day, and my body warmed up, and my brain remembered more about this strange thing that I used to do so well, I started going faster, not worrying as much, and then started going faster, and I started feeling like wow I'm doing this well, and then boom, for an instant I completely lost control and was tilted one way, but had to land the other way, and without any conscious thought and absolutely no time to worry, my brain and body did exactly what you have to do to make this look and feel super elegant, almost as if I must have planned it this way. ",
            "created": "Thu, 15 Feb 2024 19:44:26 GMT",
            "flInCalendar": true
        },
        {
            "text": "I kept skiing a bit after that and then stopped and breathed the cold air, and looked at another ski area far in the distance (Hunter?) and realized something -- skiing is falling. You go to a mountain top, pull down your goggles, get to the top of some steepness, and you jump. The question is -- do you look and feel beautiful while doing it, or are you scared and trying to stay in control. But that's the thing, falling is all about letting it go and trusting your mind and body will know what to do when you fall one way, and also when you fall another. ",
            "created": "Thu, 15 Feb 2024 19:44:51 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}