{
    "text": "If Twitter is imploding...?",
    "created": "Sat, 05 Nov 2022 17:29:00 GMT",
    "type": "outline",
    "description": "I’ve been asked by a number of people what to do, based on the assumption Twitter is imploding.",
    "subs": [
        {
            "text": "I’ve been asked by a number of people what to do, based on the assumption Twitter is imploding.",
            "created": "Sat, 05 Nov 2022 17:29:06 GMT",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "It’s not yet imploding. Everything seems to work, as before. ",
                    "flInCalendar": true
                },
                {
                    "text": "I’d back up the list of people you follow, and people who follow you. How to do this? Someone should figure it out and write a simple howto.",
                    "flInCalendar": true
                },
                {
                    "text": "I wouldn’t expect mastodon to be able to handle anything remotely like the load Twitter is handling for years. In the meantime, someone should write a Busy Developers Guide to peering with Mastodon, so we can get started on making the vision really work at scale.",
                    "flInCalendar": true
                },
                {
                    "text": "If we wanted a smooth transition we should have planned for a great diaspora. Years ago. But nothing like that happened.",
                    "flInCalendar": true
                },
                {
                    "text": "I wouldn’t hold my breath waiting for Blue Sky.",
                    "created": "Sat, 05 Nov 2022 17:29:09 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "What is possible, in a few months, if we start working on it now, are mini-twitters, like lifeboats, where a small circle of friends gets together to share stuff within the group. But this won’t be free. But it won’t be that expensive either. Far less than say $8 per month. ",
                    "flInCalendar": true
                },
                {
                    "text": "Another thing that’s possible is using RSS and writing blogs. A “back to the land” movement, perhaps. It’s much less expensive resource-wise, and really works. Lots of pre-existing options.",
                    "flInCalendar": true
                },
                {
                    "text": "Realistically those are the choices, imho — with the caveat that I’ve been wrong before and all other disclaimers. ",
                    "created": "Sat, 05 Nov 2022 17:29:13 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}