{
    "text": "On this <a href=\"http://scripting.com/misc/howlongfortrump/\">last full day</a> of Trump's presidency, I am grappling with an inconsequential decision. <a href=\"https://twitter.com/davewiner/status/1351299875791634486\">CNN vs the Knicks</a>. I can have one of them, but if I want both it'll cost me an extra $65 per month. If I felt strongly about either, or both, the decision would be easy. It's difficult only because I'm somewhat ambivalent about each. CNN is for mindless relaxation. I like watching Wolf Blitzer because he's so pompous. \"This <i>just in</i> to the Situation Room,\" he likes to say, but of course it's a studio not a room, and nothing is \"in\" there. It's the most old and stuffy place. It's totally out. I find it relaxing the same way I used to find it relaxing to watch my grandmother knit, or my cat lick herself. I like watching Erin Burnett because (I know this is weird) I think she's hot. Esp when she's angry, and these days, she is very angry, a lot (at the same things we all are angry about btw). I also like CNN because they have better guests. But I could live without them. For 20+ years I never watched CNN. Then there are the Knicks. I've been a Knicks fan, on and off, for most of my life. I came back strong for Linsanity, and hated them for screwing that up, and then they fired Melo and Porzingas, well I kind of gave up for a while. The pandemic and the bubble made it seem illegit. But with a new coach this year, they're looking interestings, and they're competitive, and sometimes they win! I'd like a chance to watch, not sure I would actually watch. The sports news service Fubo doesn't have CNN, and YouTube TV has CNN but no Knicks. So I did a <a href=\"https://twitter.com/davewiner/status/1351299875791634486\">poll</a> to find out what people thought. As I write this the consensus is to leave CNN and go with the Knicks. I think it's time for a more <a href=\"https://en.wikipedia.org/wiki/%C3%80_la_carte\">à la carte</a> menu. Most of what's on either Fubo or YouTube TV doesn't interest me. Too many good choices on Netflix, Hulu and Amazon, and podcasts are great these days too. ",
    "created": "Tue, 19 Jan 2021 12:50:40 GMT",
    "type": "outline",
    "image": "http://scripting.com/images/2017/12/17/melo.png",
    "flInCalendar": true
}