{
    "text": "Louis CK and the Daily",
    "created": "Thu, 18 Oct 2018 21:05:23 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "The question of what to do with Louis CK was featured <a href=\"https://www.nytimes.com/2018/10/18/podcasts/the-daily/louis-ck-comedy-cellar-metoo.html?action=click&module=audio-series-bar&region=header&pgtype=Article\">today</a> on the Daily podcast. It's a good thing to talk about, and it should be looked at from all sides, esp ones that haven't been challenged yet. It's especially important to challenge people who say LCK should never work again. ",
            "created": "Thu, 18 Oct 2018 21:05:34 GMT"
        },
        {
            "text": "They mention the example of Mel Gibson's anti-semitism. I was a fan, but I couldn't understand how Hollywood could ever let him work again after what he did. So I've had the same \"nuke him\" impulse around another issue. Mel Gibson is making movies. I don't think people are more or less expressive of their anti-semitism because he is. I've gotten over it, I won't go to see his movies. I still object to him as a celebrity, I can never think of him without thinking how he feels about Jews. I don't want to laugh at his jokes. But that's me. He gets to exist, and practice his art. ",
            "created": "Thu, 18 Oct 2018 21:08:42 GMT"
        },
        {
            "text": "Noam Dworman, the owner of the Comedy Cellar club in NY made the only important point in all of this. He doesn't object to other owners refusing to let LCK perform on their stages, as long as no one tries to force him to ban him as well. I'm pretty sure this is one of those moral questions that doesn't actually have an answer. Maybe all artists that are great must also be flawed human beings. Maybe the reason why Louis CK is so good is that he is so bad? Maybe he can keep it under control as long as exposure is the penalty although in his case I could see where he might like being exposed. ",
            "created": "Thu, 18 Oct 2018 21:11:14 GMT"
        },
        {
            "text": "I don't have the answer, but on the other hand I don't think anyone else does either. I think that's what the owner of the club was trying to say.",
            "created": "Thu, 18 Oct 2018 21:15:02 GMT"
        }
    ]
}