{
    "text": "The future is ours",
    "created": "Fri, 05 Jul 2019 16:03:04 GMT",
    "type": "outline",
    "description": "My generation gave you an open networking system of immense power. The millennial generation took that wonder of human ingenuity, discipline, cooperation and idealism and turned it into Facebook. ",
    "subs": [
        {
            "text": "I was born in 1955. I am 64 years old. When I go to the doctor now I ask about Medicare. Things change when you pass 60, really mind-bending things. For example, I'm legally unemployable starting next year. Most companies and governments require their employees to retire at 65. At a practical level I am already unemployable. They certainly aren't hiring many people at 64.  ",
            "created": "Fri, 05 Jul 2019 16:03:08 GMT"
        },
        {
            "text": "Except here's the thing young folk can't understand until they actually live this. There's this bewildering feeling of When The Fuck Did This Happen and Why? I know you intellectualize it, I did. You realize \"Life is short\" but really believe me, you have no idea until you look back on all those years and think -- really? That's it? It's a cliche, but it's deep. And if you think about these things, as I do, always have, you realize the incredible wisdom of the phrase <i>Live In The Moment. </i>You can hear the words, but until you get there on your own path, they really are just words.",
            "created": "Fri, 05 Jul 2019 16:04:22 GMT"
        },
        {
            "text": "Live In The Moment is true like Breathe the Air or Drink the Water. Living only happens in the moment. There is no life in the past or future, only the now. You can get lessons from the past, and lessons are important, for sure -- but no actual living happens there. ",
            "created": "Fri, 05 Jul 2019 16:06:39 GMT"
        },
        {
            "text": "Okay so why is this important. ",
            "created": "Fri, 05 Jul 2019 16:07:42 GMT"
        },
        {
            "text": "When we talk about the important stuff, the stuff of the future, the stuff we are sure is coming -- the Climate Crisis as the prime example, our discussion wanders into the past or future too quickly. As an old person, one who isn't actually ready for that, I think about the future, a lot. Yet at some level, the thought does occur to me that it is not my future. But that mainly comes up when I am silenced or put down because of age. In my heart the future is as much mine as it is some arrogant naive and clueless 30-something person. Yes I'm angry at being ignored or swept aside. ",
            "created": "Fri, 05 Jul 2019 16:07:52 GMT"
        },
        {
            "text": "They are also wrong when they make sweeping statements about the bad stuff my generation did. It goes the other way too. My generation gave you an open networking system of immense power. The millennial generation took that wonder of human ingenuity, discipline, cooperation and idealism and turned it into Facebook. Zuck was born in 1984. Your generation owns him, not mine. As a hippie boomer I am proud of what we've done. ",
            "created": "Fri, 05 Jul 2019 16:10:11 GMT"
        },
        {
            "text": "One more thing, there were all kinds of boomers. People who lived in the deep south dreamed of proms and went to frat parties (btw I went to college with them) and wanted comfortable suburban lives, very much <a href=\"https://en.wikipedia.org/wiki/Summer_of_Love\">unlike</a> <a href=\"https://en.wikipedia.org/wiki/History_of_the_hippie_movement\">hippies</a>. There were working class Republicans, part of Nixon's <a href=\"https://en.wikipedia.org/wiki/Silent_majority\">Silent Majority</a>. People who voted for Nixon, were of course not hippies. There were the <a href=\"https://en.wikipedia.org/wiki/Hard_Hat_Riot\">hard hats</a> and the National Guards who killed the students at <a href=\"https://en.wikipedia.org/wiki/Kent_State_shootings\">Kent State</a>. There was an antiwar movment but there was also a Love It Or Leave It movement. There was a draft too. Sure there were a million people at Woodstock. But this is a big country. Hippies were then, as they are now, a small minority, they were certainly not a whole generation. ",
            "created": "Fri, 05 Jul 2019 16:14:01 GMT"
        },
        {
            "text": "Anyway, here's a response to young people of 2019. Your life is finite and very short. In a few moments you'll be old. Imho the future isn't yours any more than it's mine, not at a species or evolution level. You are just a <i>representative</i> of the future, you are not an embodiment of it. We are contemporaries. You are, in this moment, no more a representative of the future than I am. ",
            "created": "Fri, 05 Jul 2019 16:11:47 GMT"
        }
    ]
}