{
    "text": "Notes on Covid-19",
    "created": "Sat, 07 Mar 2020 17:51:27 GMT",
    "type": "outline",
    "description": "These ideas are going to seem horribly naive in a few days probably, but based on lots of reading and listening this is what I think.",
    "subs": [
        {
            "text": "These ideas are going to seem horribly naive in a few days probably, but based on lots of reading and listening this is what I think. ",
            "created": "Sat, 07 Mar 2020 17:51:35 GMT",
            "isComment": "false",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "Until there is massive testing we can't know where the virus is. Assuming it's everywhere is better than assuming it's nowhere.",
                    "created": "Sat, 07 Mar 2020 17:52:49 GMT"
                },
                {
                    "text": "<a href=\"https://emergency.yale.edu/be-prepared/shelter-place\">Shelter in place</a>. <a href=\"https://www.nytimes.com/2020/03/06/health/self-quarantine-coronavirus.html\">Self-quarantine</a>. ",
                    "created": "Sat, 07 Mar 2020 17:52:08 GMT"
                },
                {
                    "text": "The reason to self-quarantine is two-fold. 1. To minimize the chance that you get the virus and 2. to slow its transmission. It uses our bodies to get to other bodies. If we don't have it, we can't transmit it. If we do, if we don't move around we can't transmit it. ",
                    "created": "Sat, 07 Mar 2020 17:53:00 GMT"
                },
                {
                    "text": "Only go out to get food and other supplies, and to work if you can. That's an ideal of course, not achievable in most countries, esp not the US, which doesn't have health care for all, or paid sick leave, or for that matter a functioning government.  ",
                    "created": "Sat, 07 Mar 2020 17:52:31 GMT"
                },
                {
                    "text": "Hope that essential services can be maintained, electric, water, the supply chain for food, health care. Expect lots of outages. Hope is really all we have at this point when it comes to maintaining our way of life. ",
                    "created": "Sat, 07 Mar 2020 17:56:57 GMT"
                },
                {
                    "text": "If the government can't implement massive testing, we have to do it. We'll need excellent data management functions so we can do all kinds of queries on the data, to determine what comes next. ",
                    "created": "Sat, 07 Mar 2020 17:53:24 GMT"
                },
                {
                    "text": "I have to say this, we should get Trump out of the loop of this, he's much more lethal than the virus. The government that comes after Trump, hopefully very soon, must implement a TARP-like program to vastly expand health care funding and funneling money to people who can't go to work because they have the virus, to help slow transmission. Also to parents who have to stay home to take care of kids who aren't going to school. ",
                    "created": "Sat, 07 Mar 2020 17:53:33 GMT"
                },
                {
                    "text": "The rate cut by the Fed was insane btw, if we get out of this, we're going to need the ability to drop interest rates to stimulate the economy (experience from Katrina, a stopped economy is slow to restart). The rate cut can't do anything to stimulate an economy that is coming to a halt for non-market reasons. If people have more money in their pocket (they won't but if they did) they aren't going to go to Walmart to buy a new fridge and risk getting a virus that might kill them. ",
                    "created": "Sat, 07 Mar 2020 17:54:07 GMT"
                }
            ]
        }
    ]
}