{
    "text": "June 7",
    "created": "Thu, 07 Jun 2018 14:03:36 GMT",
    "name": "07",
    "subs": [
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=XgdOIAlY0bQ&feature=youtu.be\">Quick demo</a> of the difference <a href=\"http://scripting.com/misc/xmlrpc-in-json.html\">between</a> JSON and XML-RPC.",
            "created": "Thu, 07 Jun 2018 16:45:47 GMT",
            "type": "outline"
        },
        {
            "text": "I'm surprised there aren't Twitter-based <a href=\"https://en.wikipedia.org/wiki/Pyramid_scheme\">pyramid schemes</a>. <a href=\"https://en.wikipedia.org/wiki/Multi-level_marketing\">Multi-level</a> tweets. You get $1 for RTing, and 5 cents for every follower who RTs, a cent for the next level, and so on. And just about now someone is thinking -- <i>Blockchain! </i>💡",
            "created": "Thu, 07 Jun 2018 19:06:38 GMT",
            "type": "tweet",
            "tweetId": "1004802970343673856",
            "tweetUserName": "davewiner"
        },
        {
            "text": "There ought to be a class in <i>Advanced Computer Literacy</i> for comp sci majors. In this class, you'd download malware, document and debug it, and make mods, use it to attack a real server (one operated by the TA, of course). You will also do tech support. This may sound counter-intuitive, you've just completed eight semesters in OS and compiler design. You've mastered the internals of databases and studied the mathematics of algorithms. What could you possibly learn from tech support and studying malware? Exactly. You have no idea. It's amazing what doors open when you understand what you do from the perspectives that make or break you as a software developer and designer. ",
            "created": "Thu, 07 Jun 2018 14:25:21 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/06/07/pierce.png"
        },
        {
            "text": "Advice for The Recently Acquired",
            "created": "Thu, 07 Jun 2018 14:03:37 GMT",
            "type": "outline",
            "description": "Getting acquired is part of the Silicon Valley experience. It's neither good nor bad, it just is.",
            "subs": [
                {
                    "text": "Getting acquired is part of the Silicon Valley experience. It's neither good nor bad, it just is.",
                    "created": "Thu, 07 Jun 2018 14:03:46 GMT",
                    "image": "http://scripting.com/images/2018/06/07/handbookForTheRecentlyDeceased.png"
                },
                {
                    "text": "If you're a founder, the silver lining is that you got rich. But there's a shock that comes when you realize that there are not two definitions for the term \"sell out.\" When you sell out someone else owns it. No matter how much they say they understand your values, they don't."
                },
                {
                    "text": "The only advice I have to offer is this -- pick your battles. I've seen people make a stand for the values of the acquired company, both in the company I sold and in other companies that were acquired. It never works. If you have a good stock program, keep your head down, let the stock vest, and then move on. Assume they are going to screw up your company. And if they don't you can be happy! :boom:",
                    "created": "Thu, 07 Jun 2018 14:04:16 GMT"
                }
            ]
        }
    ]
}