{
    "text": "June 13",
    "created": "Wed, 13 Jun 2018 13:17:57 GMT",
    "name": "13",
    "subs": [
        {
            "text": "Google should get used to people writing about what's obvious as opposed to what they admit to. They do it too. In the fight for net neutrality, I doubt if the ISPs admitted to adding tariffs for YouTube and Netflix. But Google acted as if it were inevitable. Same thing <a href=\"http://this.how/googleAndHttp/\">here</a>.",
            "created": "Wed, 13 Jun 2018 15:07:47 GMT",
            "type": "outline"
        },
        {
            "text": "Point of view is everything",
            "created": "Wed, 13 Jun 2018 14:23:26 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Companies create their own gravity, even small ones.",
                    "created": "Wed, 13 Jun 2018 14:29:20 GMT"
                },
                {
                    "text": "Google is huge. Their gravity is analogous to that of a star. But it diminishes rapidly as you move away from it. Other perspectives take hold. That's something very few people inside or outside appreciate. How different things look to each of us. Point of view is everything.",
                    "created": "Wed, 13 Jun 2018 14:33:55 GMT"
                },
                {
                    "text": "My point of view -- I never signed up to be a Google developer. I wouldn't have if they asked. So I  resent having to <a href=\"http://this.how/googleAndHttp/\">beg them</a> to keep their hands off the open web. And if they slander my work, or cut off access to it, I will not conform to their demands. I will not be a Google developer, ever.",
                    "created": "Wed, 13 Jun 2018 14:30:51 GMT"
                },
                {
                    "text": "If you're listening to me, and them, all I ask is that you think for yourself. Be true to your own point of view. And try as hard as you can to understand that other people's points of view are valid and try to understand what they're saying and doing. ",
                    "created": "Wed, 13 Jun 2018 14:27:49 GMT"
                }
            ]
        },
        {
            "text": "Technical problem at Facebook",
            "created": "Wed, 13 Jun 2018 13:58:29 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I've noticed that I'm seeing the same stories in my Facebook feed, repeatedly. My friend Amy Bonetti Price wrote, in a <a href=\"https://www.facebook.com/AmyBonetti/posts/10103944898448683?comment_id=10103944908448643&reply_comment_id=10103945000913343&comment_tracking=%7B%22tn%22%3A%22R%22%7D\">comment</a>, that she's seeing it too. ",
                    "created": "Wed, 13 Jun 2018 14:00:36 GMT",
                    "subs": [
                        {
                            "text": "Feeds are so messed up. You don’t see your friend’s posts, and the posts you see are people way down on the totem pole. Cheap ads. Stories posted and reposted from your ‘friends’ that are old posts from 4 days prior. You didn’t like it then, why would you like like it every day for 4 days. Cheap news stories and not from top tier news outlets - even though I constantly unlike and say that i don’t want to see these types of stories. All in all my feed has gotten littered and uninteresting and I have to purposely go to friends timelines to see what they’re doing. I’m really upset about it, as are so many people I know.",
                            "created": "Wed, 13 Jun 2018 14:01:34 GMT"
                        }
                    ]
                },
                {
                    "text": "My experience is more or less as she describes. I <a href=\"https://www.facebook.com/dave.winer.12/posts/734139966793411\">asked</a> my friends and they report the same.",
                    "created": "Wed, 13 Jun 2018 14:02:13 GMT"
                },
                {
                    "text": "BTW, I normally do not point to Facebook, as I explained previously. But since this post is about Facebook, I thought it made sense to point in. No guarantee of course that you'll see anything when you click the links.",
                    "created": "Wed, 13 Jun 2018 14:05:13 GMT"
                }
            ]
        },
        {
            "text": "Our big loop",
            "created": "Wed, 13 Jun 2018 13:17:58 GMT",
            "type": "outline",
            "description": "All of this has happened before, and it will all happen again.",
            "subs": [
                {
                    "text": "I want people to be able to put up their own web servers. Not companies. Not people with Computer Science degrees. People. Anyone. Everyone.  ",
                    "created": "Wed, 13 Jun 2018 13:23:47 GMT",
                    "image": "http://scripting.com/images/2018/06/13/cylon.png"
                },
                {
                    "text": "I think every journalist should learn how to set up and run a web server. I think any student, no matter how young, should learn, if they want to. The doors to publishing should be open to everyone. It's never been easier, and it could be getting easier all the time. That should be one of the <a href=\"https://dictionary.cambridge.org/us/dictionary/english/overarching\">overarching</a> goals of our profession, to make what we do easier and easier, all the time. To make what we did ten years ago something anyone can do. It's the nature of software, that once we know what we can do that we make it easy for everyone to do it.",
                    "created": "Wed, 13 Jun 2018 13:24:17 GMT"
                },
                {
                    "text": "<i>But</i> there's no doubt that the browser vendors want to go the other way, to raise the barriers, to make it harder for newcomers, young or old, to launch their own boats into the mighty ocean of the web. They may be righteous or <a href=\"https://www.merriam-webster.com/dictionary/treacherous\">treacherous</a>, or some of both, but their motives don't matter, what matters is the net-effect, and that is to restrict publishing to the initiated, the priesthood. To keep the <a href=\"http://www.dictionary.com/browse/rabble\">rabble</a> from interfering. ",
                    "created": "Wed, 13 Jun 2018 13:23:40 GMT"
                },
                {
                    "text": "If they succeed, and at this point I think they will, I have no doubt what will happen next. We'll just invent the web all over again. With a new Mosaic, a new Marc Andreessen, a new Google, etc. It's how tech works. Just when Bill Gates thought he had it all wrapped up, in 1994, that his software was at the base of every stack, <a href=\"http://scripting.com/davenet/1994/10/18/billgatesvstheinternet.html\">along comes the web</a> to knock him off his perch. Google is ripe for this disruption. They don't see it coming, but it's coming all the same. ",
                    "created": "Wed, 13 Jun 2018 13:26:31 GMT"
                },
                {
                    "text": "This phenomenon is why I'm seriously thinking of changing the <a href=\"http://scripting.com/images/2018/06/13/slogan.png\">slogan</a> at the top of my blog from ",
                    "created": "Wed, 13 Jun 2018 13:34:23 GMT",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "<i>It's even worse than it appears</i> to  ",
                            "created": "Wed, 13 Jun 2018 13:34:38 GMT"
                        },
                        {
                            "text": "<i>All of this has happened before, and it will all happen again.</i>",
                            "created": "Wed, 13 Jun 2018 13:34:43 GMT"
                        }
                    ]
                },
                {
                    "text": "I will try to have a good backup of my websites, so if we need to transition it will be possible to do so.",
                    "created": "Wed, 13 Jun 2018 13:27:22 GMT"
                }
            ]
        }
    ]
}