{
    "text": "June 20",
    "created": "Wed, 20 Jun 2018 12:03:50 GMT",
    "name": "20",
    "subs": [
        {
            "text": "I'm on my way home, waiting for my flight at Milan's airport. I've been through security and passport control, stood in a bunch of lines, and got a good look at the people in line with me, who come from places you don't often see in lines at American airports. Lots of babies, toddlers and children, along with their parents, all with brown skin. I wondered how they would be treated in my country. Not as well as I would like. ",
            "created": "Wed, 20 Jun 2018 12:03:51 GMT",
            "type": "outline"
        },
        {
            "text": "People flying to two countries need to go through special security -- Israel and the US. I don't remember this from the last time I was in this airport a few years ago. ",
            "created": "Wed, 20 Jun 2018 12:11:10 GMT",
            "type": "outline"
        },
        {
            "text": "It's going to be a while before I get home, to midtown Manhattan, a very different place from where I'm at now. ",
            "created": "Wed, 20 Jun 2018 12:11:31 GMT",
            "type": "outline"
        },
        {
            "text": "One thing an American traveling in Europe notices is how everything here is first class compared to how it is at home. The subways are clean. People dress well, and are generally polite. There are exceptions, the man standing behind me in line yelling into my ear and his phone at the same time, I finally let him pass me so I could enjoy my own thoughts. There's a little justice in this because I offended a British gentleman at breakfast this morning by speaking loudly while we were eating breakfast. I wish he had told me in a more considerate way, he left me muttering <i>asshole</i> under my breath. I am an American, and I guess no matter where we go, we speak loudly. ",
            "created": "Wed, 20 Jun 2018 12:07:15 GMT",
            "type": "outline"
        },
        {
            "text": "There <i>is</i> small justification for what the US is doing now with the children",
            "created": "Wed, 20 Jun 2018 12:15:50 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I listened to the Dailly podcast <a href=\"https://www.nytimes.com/2018/06/19/podcasts/the-daily/trump-immigration-children-border.html?rref=collection%2Fcolumn%2Fthe-daily&action=click&contentCollection=podcasts&region=stream&module=stream_unit&version=latest&contentPlacement=2&pgtype=collection\">yesterday</a> and learned that there is actuallly justification for what the US is doing with the children at the southern border.",
                    "created": "Wed, 20 Jun 2018 12:16:05 GMT"
                },
                {
                    "text": "Previously, an immigrant would cross the border and if caught would declare they're seeking asylum. They would be taken into custody, with any accompanying children, appear before a judge, and would be given a date for a trial to determine if their request is justified. Then they would be released, in the United States. At that time they would be free to get a job, take up residence, and often they would not show up for the trial. So through this large loophole they would effectively become residents of the United States.",
                    "created": "Wed, 20 Jun 2018 12:16:39 GMT"
                },
                {
                    "text": "That's one approach, and it has an obvious problem. As Trump says, it makes our border open to all, as long as they can say they're seeking asylum.",
                    "created": "Wed, 20 Jun 2018 12:18:55 GMT"
                },
                {
                    "text": "The method Trump is using isn't any more of a solutionand it's inhumane, creates damaged children and adults, and for people with legitimate claimes for asylum,  gives thm an impossible choice. It's also part of our law that <i>we welcome immigrants seeking relief from oppression. </i>It's the philosophy of the country, which is a country of immigrants. Every one of us who is not a native American came here from somewhere else, including everyone in the government.",
                    "created": "Wed, 20 Jun 2018 12:20:04 GMT"
                },
                {
                    "text": "It's not a simple problem. There doesn't seem to be a good solution. I can't say lesser of two evils, because letting undeserving immigrants into the country is far from evil, it's pragmatic. We do have jobs for them. They have a place in our society. But many of them are breaking the law by coming in seeking asylum without a valid claim, and no rule-of-law respecting person can say that is totally okay. ",
                    "created": "Wed, 20 Jun 2018 12:22:22 GMT"
                }
            ]
        }
    ]
}