{
    "text": "June 21",
    "created": "Thu, 21 Jun 2018 15:52:37 GMT",
    "name": "21",
    "subs": [
        {
            "text": "Shortly after getting home last night I got this <a href=\"http://scripting.com/images/2018/06/21/googleEmail.png\">disgusting email</a> from Google. Most of this email is threatening, blackmail. Very little about any benefit. Also <a href=\"http://scripting.com/\">scripting.com</a> is my oldest site. The blog that started blogging. Older than Google itself. I am livid mad with this company that we used to love, that was born of the web. If you're not up on what they're doing, I wrote a <a href=\"http://this.how/googleAndHttp/\">FAQ</a> for you. Please read and pass it along. The press isn't covering this for some reason. ",
            "created": "Thu, 21 Jun 2018 16:29:00 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/06/21/googleWarningEmailSmall.png"
        },
        {
            "text": "I like to throw ideas around without concern for how practical they are to implement. When I was running my company, this was one of the most difficult concepts to teach my people. Don’t worry about time when your mind comes up with an idea. Ideas lead to other ideas, and the next one might not take much time.  ",
            "created": "Thu, 21 Jun 2018 21:15:32 GMT",
            "type": "outline"
        },
        {
            "text": "I posted <a href=\"https://twitter.com/davewiner/status/1009365047989166080\">updates</a> on my trip yesterday on Twitter. ",
            "created": "Thu, 21 Jun 2018 16:31:17 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1009365047989166080"
        },
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=vuO878gwWyw\">Gee</a> but it's great to be back home. <a href=\"https://www.youtube.com/watch?v=EUrUfJW1JGk\">Home</a> is where I want to be. ",
            "created": "Thu, 21 Jun 2018 15:52:38 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=EUrUfJW1JGk"
        },
        {
            "text": "Most of the reviews you read for bingeable TV shows are of the first few episodes because that's all the networks provide reviewers at the beginning of a season. The exceptions of course are Netflix and Amazon. I just finished Season 3 of <a href=\"https://en.wikipedia.org/wiki/Mr._Robot\">Mr Robot</a>, and having seen all ten episodes I have to say you would have had no idea what was coming and how good it would get based on the first few episodes. This was the season when Elliot and his sister Darlene become human. Find love. Accept their own flaws and their father's, the titular character. There's one scene in episode 6 when father and son are fighting in a totally <a href=\"http://scripting.com/images/2018/06/21/mrRobotFightingWIthElliot.png\">Mr Robot way</a>, and I laughed so hard, it was <i>so</i> well done. \"I guess he didn't like my note,\" says Elliot. Episode 8 with the young Iranian kid was so sweet, and it's when we learn Elliot cares about people and loves himself. This is new. Anyway, Season 2 was a disappointment, but Season 3 makes up for it. I may have to watch it again. ",
            "created": "Thu, 21 Jun 2018 15:55:03 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/06/21/ourDemocracyHasBeenHacked.png"
        },
        {
            "text": "BTW, a great thing about Mr Robot is that it's about what I do. I type at a command line as Elliot does. I use the tools he uses. Of course I'm trying to topple the system not by hacking but by publishing. But the ideas are similar. And the next binge, Silicon Valley, is about what I used to do, before I hated that place. :boom:",
            "created": "Thu, 21 Jun 2018 16:11:02 GMT",
            "type": "outline"
        },
        {
            "text": "And I will never not be able to think of <a href=\"https://www.youtube.com/watch?v=aAj__InxjhI\">Rami Malek's acceptance speech</a> at the Emmies. It's funnier when the theme of Mr Robot is fresh in your mind. ",
            "created": "Thu, 21 Jun 2018 16:12:48 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=aAj__InxjhI"
        }
    ]
}