{
    "text": "June 25",
    "created": "Mon, 25 Jun 2018 12:01:59 GMT",
    "name": "25",
    "subs": [
        {
            "text": "New feature. When you click on a <a href=\"http://scripting.com/images/2018/01/29/hedyLamarr.png\">link to an image</a> from Scripting News it opens in a <a href=\"http://scripting.com/images/2018/06/25/hedyInDialog.png\">dialog</a>. It works on an <a href=\"http://scripting.com/2018/06/25.html\">archive page</a> and on the <a href=\"http://scripting.com/\">home page</a>.  It only works on pages posted today or in the future. <i>Still diggin! </i>:boom:",
            "created": "Mon, 25 Jun 2018 15:25:32 GMT",
            "type": "outline"
        },
        {
            "text": "I now have \"Happy Friends\" running with the new Twitter callback constraints. You may have to log off and log back on to get it to save your changes.",
            "created": "Mon, 25 Jun 2018 20:15:33 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://twitter.com/BlkAndPr0ud/status/1011325555462037504\">This</a> should be aTV show. Believe it or not it would do a lot of good. Not by shaming people, but by showing them in real terms why the ideas they're hearing are wrong.",
            "created": "Mon, 25 Jun 2018 20:18:38 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/BlkAndPr0ud/status/1011325555462037504"
        },
        {
            "text": "At a campaign event, <a href=\"https://twitter.com/jmannies/status/1010693719178338304\">Claire McCaskill asks</a> everyone who has a pre-existing condition to stand. Almost everyone does. This should be done at every Democratic rally, dinner or meetup so it's understood how important coverage of P-E-Ds is.",
            "created": "Mon, 25 Jun 2018 14:40:39 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/jmannies/status/1010693719178338304"
        },
        {
            "text": "In Italy I saw everyone wearing nice sunglasses. My problem is that when I buy nice ones I lose them. So I buy shitty sunglasses, in bulk, and let them get lost. But in Italy I couldn't even stand to take them out because everyone had such nice sunglasses. When I got home, I splurged, and bought a new pair of <a href=\"https://www.amazon.com/gp/product/B015EJWFZE/ref=oh_aui_detailpage_o02_s00?ie=UTF8&psc=1\">Raybans</a>. They are <a href=\"http://scripting.com/images/2018/06/25/bigSunglasses.png\">beautiful</a>. And they make what I see beautiful too. I will probably lose these too, though I may be developing a system for not losing them. We'll see. In the meantime I am enjoying them. ",
            "created": "Mon, 25 Jun 2018 12:39:36 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/06/25/myNewRaybans.png"
        },
        {
            "text": "Inside the government I bet they're thinking the mistake they made with the zero tolerance border policy is letting the story leak out. This was the conclusion of the Bush II administration re Vietnam, that the mistake was letting pictures of flag-draped coffins get out. So they prevented that in the Iraq War. Also a big tax cut and no draft. That bought peace at home for a war that was just as wrong as Vietnam. ",
            "created": "Mon, 25 Jun 2018 12:08:41 GMT",
            "type": "outline"
        },
        {
            "text": "I updated the <a href=\"http://this.how/googleAndHttp/\">Google and HTTP</a> faq to include a <a href=\"http://this.how/googleAndHttp/#1529927677000\">section</a> about the email I received from them on June 20.",
            "created": "Mon, 25 Jun 2018 12:02:00 GMT",
            "type": "outline"
        },
        {
            "text": "What Google’s “not secure” means: “Google tried to take control of the open web and this site said no.”",
            "created": "Mon, 25 Jun 2018 12:13:06 GMT",
            "type": "outline"
        },
        {
            "text": "Trump is not only a Nazi, he's in way over his head, and panicking",
            "created": "Mon, 25 Jun 2018 19:00:52 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Everyone is focused on the optics of what's happening in the immigration system, but underneath the awful images there's a real problem with no easy answers. The problem he's dealing with is far from new, and is horrible, and has been mishandled by every president since Clinton, leading to an escalating problem, and because he is so inept at communicating, Trump has turned into a huge crisis.",
                    "created": "Mon, 25 Jun 2018 19:00:58 GMT"
                },
                {
                    "text": "Looked at another way, remember how everyone has been positing what would happen when Trump had to deal with a crisis not of his own making? This is it. But he can't seem to get our sympathy and support, when any other president would have been able to do so easily.",
                    "created": "Mon, 25 Jun 2018 19:02:29 GMT"
                },
                {
                    "text": "Just listen to <a href=\"https://www.nytimes.com/2018/06/25/podcasts/the-daily/migrants-central-america-violence-gangs.html?rref=collection%2Fcolumn%2Fthe-daily&action=click&contentCollection=podcasts&region=stream&module=stream_unit&version=latest&contentPlacement=1&pgtype=collection\">today's Daily podcast</a>, and find out how when we had to deal with the El Salvadoran gangs in LA in the 90s, we exported them back to El Salvador where they <a href=\"https://www.npr.org/sections/goatsandsoda/2015/10/05/445382231/how-el-salvador-fell-into-a-web-of-gang-violence\">grew</a>, and now the next generation is coming of age, and the country is unlivable so they're coming north, and in fact <i>Trump has a good point</i> (if he could only communicate it) that we're going to deal with an even bigger problem next time around, as it echoes in a decades-long feedback loop.",
                    "created": "Mon, 25 Jun 2018 19:03:28 GMT"
                },
                {
                    "text": "Part of what we're seeing here is not only Adolf Hitler 2.0, but also a man who is in totally over his head, unable to understand how the US government functions. He's panicking. And folks, this is only one of a dozen major ongoing crises a president has to deal with. ",
                    "created": "Mon, 25 Jun 2018 19:09:05 GMT"
                },
                {
                    "text": "It's a real problem. If only our president had the means to communicate it in a rational, non-hysterical way. This one only knows one way of communicating -- he attacks. And that puts him at odds with how our form of government works.",
                    "created": "Mon, 25 Jun 2018 19:05:11 GMT"
                }
            ]
        },
        {
            "text": "Travel begets ideas",
            "created": "Mon, 25 Jun 2018 12:31:54 GMT",
            "type": "outline",
            "description": "When I travel I come back with ideas.",
            "subs": [
                {
                    "text": "When I travel I come back with ideas.",
                    "created": "Mon, 25 Jun 2018 12:32:07 GMT"
                },
                {
                    "text": "I should do it more often. ",
                    "created": "Mon, 25 Jun 2018 12:32:12 GMT"
                },
                {
                    "text": "On the last <a href=\"http://scripting.com/2018/06/20.html\">trip</a>, the question was, as it often is, what should we do for a bright future with publishing technology. I think that's been topic number one for me for at least 30 years, maybe my entire life, going back to the womb.",
                    "created": "Mon, 25 Jun 2018 12:32:16 GMT"
                },
                {
                    "text": "So here's what I came back with.",
                    "created": "Mon, 25 Jun 2018 12:32:55 GMT"
                },
                {
                    "text": "If I had my <a href=\"https://en.wiktionary.org/wiki/druthers\">druthers</a>, I'd have a team of writers, bloggers, journalists to work with, and I'd do a lot of experimenting with news creation and reading ideas. Rapidly try new approaches until we hit on one(s) they all loved. Then we'd know where to go from there.",
                    "created": "Mon, 25 Jun 2018 12:33:03 GMT"
                },
                {
                    "text": "That's it.",
                    "created": "Mon, 25 Jun 2018 12:33:47 GMT"
                }
            ]
        }
    ]
}