{
    "created": "2022-06-09T04:00:00.000Z",
    "flInCalendar": true,
    "name": "09",
    "path": "2022/06/09",
    "text": "June 09",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I'm happy to report that finally there's a reasonable app running at <a href=\"http://xmlviewer.scripting.com/?url=http://scripting.com/rss.xml\">xmlviewer.scripting.com</a>. I used the <a href=\"https://ace.c9.io/\">Ace Editor</a> in read-only mode to view the contents of the XML file provided as the <i>url</i> parameter. If no URL is provided I show the <a href=\"http://scripting.com/rss.xml\">RSS feed</a> for Scripting News (my blog). There are still a couple of problems, at least, with the vertical and horizontal scrollbars. Ace has a great community and everything in the software is configurable, but I've had trouble at times putting it all together. I'll swing back to this at some point, but in the meantime what's <a href=\"http://scripting.com/images/2022/06/09/xmlViewerToday.png\">there now</a> is far more useful that what's been there <a href=\"http://scripting.com/stories/2011/02/25/viewingRssInABrowser.html\">since 2011</a>. ",
            "created": "Thu, 09 Jun 2022 17:07:27 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2022/06/09/sanders.png",
            "flInCalendar": true
        },
        {
            "text": "BTW, for comparison, this is <a href=\"http://scripting.com/images/2022/06/09/chromeManglesMyBeautifulRssFeed.png\">how Chrome mangles</a> my beautiful RSS feed. Remember this next time you get excited when a big tech company decides to love something you built. Not only do they chop off the last 23 posts, and complain how there are no titles on the items, but they also suggest I subscribe to this feed in <a href=\"https://en.wikipedia.org/wiki/Bloglines\">Bloglines</a>, which has been defunct for (according to Wikipedia) <i>eight years.</i> There are some things big companies do well, caring for things like RSS is not one of them. ",
            "created": "Thu, 09 Jun 2022 17:20:56 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "BTW, none of this would've been necessary if the browser devs had been willing to work with me, but that's been the story of \"RSS\" -- people blazing their own trails for no good reason or possible gain instead of cooperating. What I'm doing now in 2022, <a href=\"http://scripting.com/2002/09.html#When:10:25:22AM\">almost twenty years</a> after RSS 2.0, is cleaning up the messes, the best I can. I figure after 20 years no one can complain that they were going to do it if I had just waited. :smile:",
            "created": "Thu, 09 Jun 2022 17:15:54 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://sports.yahoo.com/nba-finals-injured-steph-curry-and-ineffective-draymond-green-key-to-warriors-title-hopes-071015373.html\">Draymond Green’s</a> <a href=\"https://www.boston.com/sports/boston-celtics/2022/06/06/jaylen-brown-draymond-green-foul-celtics-warriors-game-2-nba-finals/\">nasty</a> behavior is cover for the fact that he’s all his team has for defense, and he’s basically a grouchy asshole with a big mouth.",
            "created": "Thu, 09 Jun 2022 15:44:33 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I like Amazon Music. I tried Spotify, but I don't like how they're taking the word <i>podcast</i> and trying to turn it into nothing, the usual thing about big shitty tech companies, they consume good things and leave a wreck behind like Google did to \"RSS\" and is trying to do to the web), so I'm sticking with Amazon (they're doing it too, but for some reason it doesn't bother me as much, I know it makes no sense). It just struck me that these music services are <i>better</i> than <a href=\"http://daytona.scripting.com/?q=napster&collection=scriptingnews\">Napster</a>, a lot better, and I found Napster to be one of the most empowering software products ever. In 2000, I was 45 years old, and had spent my life up to then unable to program music for myself. I couldn't afford to buy all the music I wanted, there was no software I could command to get me the song I wanted to listen to now. I knew I was cheating with Napster, but the music industry wasn't selling this product, and the music meant so much to me, I had to find out what that was. Now, 22 years later, they have managed to give me <i>more</i> than what I wanted in 2000, at a reasonable price. Just wanted to say that I'm glad this loop is closed. I feel sad for people who never got to experience programming their own music. But I'm glad that I did. :boom:",
            "created": "Thu, 09 Jun 2022 21:21:28 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/09/01/pumpItUp.png",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://en.wikipedia.org/wiki/George_Martin\">George Martin</a> was a Beatle and should be credited as such. Ever since <a href=\"https://en.wikipedia.org/wiki/The_Beatles:_Get_Back\">Get Back</a> came out, I've been seeking out Beatles experiences, and there's a huge difference between the music of John, Paul, George and Ringo before and after the breakup, and the biggest difference imho is what Martin added. There's a depth and beauty to Beatles music that none of the Fab Four had after the break. Listen to a Lennon song on Abbey Road, <a href=\"https://www.youtube.com/watch?v=45cYwDMibGo\">Come Together</a>, and compare it to <a href=\"https://www.youtube.com/watch?v=YkgkThdzX-8\">Imagine</a>. Both are great songs, some of the best music ever created. But there's a depth to <a href=\"https://en.wikipedia.org/wiki/Come_Together\">Come Together</a> that just isn't there in <a href=\"https://en.wikipedia.org/wiki/Imagine_(John_Lennon_song)\">Imagine</a>. That's Martin.",
            "created": "Thu, 09 Jun 2022 21:30:36 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "If we can’t deal with $10 a gallon gas, how are we ever going to get out of the urgent climate hole we’re in.",
            "created": "Thu, 09 Jun 2022 14:50:58 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Trump has as much grace as the <a href=\"https://www.youtube.com/watch?v=MbMFLDb3CbI\">boy king</a> in Game of Thrones. ",
            "created": "Fri, 10 Jun 2022 02:04:17 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://www.salon.com/2022/06/08/mitch-mcconnell-demands-democrats-rush-to-pass-security-bill-to-protect-brett-kavanaugh/\">Send Kavanaugh</a> an AR-15, let him shoot it out with his would-be assassin. I thought that was the Republican Way.",
            "created": "Thu, 09 Jun 2022 14:24:42 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I've <a href=\"https://github.com/scripting/Scripting-News/issues/234\">asked</a> about getting something like the code-displayer on GitHub to use in a package. I think I found one today, <a href=\"https://highlightjs.org/static/demo/\">highlight.js</a>. It's not exactly the style of the display on GitHub (<a href=\"https://github.com/scripting/tweets.opml.org/blob/main/users/davewiner/2022/06.json\">example</a>), but it does provide syntax coloring which is one of the basic features. I want it for an app I'm doing to display the result of converting an RSS feed to JSON. I want it to look good, for devs to immediately understand what they're looking at. ",
            "created": "Thu, 09 Jun 2022 14:10:39 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}