{
    "created": "2022-06-11T04:00:00.000Z",
    "flInCalendar": true,
    "name": "11",
    "path": "2022/06/11",
    "text": "June 11",
    "type": "calendarDay",
    "subs": [
        {
            "text": "A new Node package called <a href=\"https://github.com/scripting/reallysimple\">reallysimple</a> that reads feeds and calls back with a simple, consistent JavaScript object. Works with RSS, Atom and RDF feeds. Part of the RSS 2.0 twenty-year review.",
            "created": "Sat, 11 Jun 2022 19:33:56 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "A <a href=\"http://scripting.com/2022/06/11/aboutTheReallySimplePackage.m4a\">podcast story</a> of how \"reallysimple\" came to be released today. ",
            "created": "Sat, 11 Jun 2022 22:35:58 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2022/06/11/aboutTheReallySimplePackage.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "8468216",
            "flInCalendar": true
        },
        {
            "text": "I totally agree with this <a href=\"https://nypost.com/2022/06/10/corporate-media-may-at-last-be-waking-up-to-reality/\">editorial</a> in the NY Post. News orgs have lost touch with what their jobs are. This of course is advice the NY Post should take to heart. Disappointed but not surprised to see other news people dismissing it.",
            "created": "Sat, 11 Jun 2022 14:23:47 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I uploaded two more of the early Lydon podcast interviews to YouTube this morning: <a href=\"https://www.youtube.com/watch?v=ITwEMOGdPsg\">Jim Behrle</a> and <a href=\"https://www.youtube.com/watch?v=DDVdiEz0WE0\">Eugene Volokh</a>. It's a bit of a slog. The next podcast has three parts, which means I guess that they have to be merged somehow into a single video. ",
            "created": "Sat, 11 Jun 2022 14:08:13 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "No one trusts \"open\" formats and protocols from big tech companies. For good reason. 😀",
            "created": "Sat, 11 Jun 2022 21:38:16 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Jack, let the hostage go",
            "created": "Sat, 11 Jun 2022 14:42:29 GMT",
            "type": "outline",
            "description": "Jack Dorsey, you haven't invented the next web.",
            "metaImage": "http://scripting.com/images/2022/06/11/mountOlympus.png",
            "subs": [
                {
                    "text": "I think capitalism, practiced honorably, is great. You make a product, convince people to buy it, make a profit, attain financial security, live well from a material standpoint. Good for you. But some of the most successful people in business don't stop there, they seem to get a thrill from destroying things for profit, especially it seems, things that don't belong to them. ",
                    "created": "Sat, 11 Jun 2022 14:33:48 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "A great example, the oil companies. They sell a product they know makes our planet uninhabitable. Eventually it will fall to all of us to clean up after them, but also thanks to them, not before lots of people die and our quality of life is dramatically downgraded. That's just one example. ",
                    "created": "Sat, 11 Jun 2022 14:43:31 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "And now a very successful tech entrepreneur, Jack Dorsey, a man who has made billions, and until now has had a reputation for caring about the impact of his creations on the rest of the world, has taken something that is not his, the idea of an open web that belongs to everyone, that is the actual technology that made it possible for him to be so successful. Instead of giving back, he proposes to dismember it, deposit what's left in his bank account, and build something in its place that of course is designed to make him even richer, and have more control, while saying it will do the opposite. ",
                    "created": "Sat, 11 Jun 2022 14:44:12 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I never have understood why people who have made billions want more. It can't possibly do anything for them. They aren't smart enough to run the world, no one is -- I don't care how lucky you got, or how competitive, hard-working, even brilliant. No one is so smart that they can plan on a world scale how technology will work in the future. We can all put our ideas out there and let them mix with other people's and hope there are enough people who want to work with others (as opposed to destroying them) to actually do something good at a large scale. That's as good as it gets. There is no example in our past, when tech was much simpler, of a human who did anything more than add an idea or two to the mix. ",
                    "created": "Sat, 11 Jun 2022 14:45:16 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "So please Jack Dorsey, stop pretending you have invented the next web. No one knows if what you have invented, if you actually have invented anything, will be any good. It certainly doesn't deserve the name of the one technology that got us past all the greed and arrogance of previous generations of tech gods. Back off. I'll help you find a great name for what you're doing, and maybe we can even help each other create more useful tech. Maybe you can start listening more and stop looking inside yourself for all the answers. ",
                    "created": "Sat, 11 Jun 2022 14:46:23 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}