{
    "created": "2022-06-30T04:00:00.000Z",
    "flInCalendar": true,
    "name": "30",
    "path": "2022/06/30",
    "text": "June 30",
    "type": "calendarDay",
    "subs": [
        {
            "text": "So why is the court rushing to do it all this crazy stuff at once? They think there's a chance we might wake up and do the easy thing to neutralize them, by adding more members to the court. So they have to get it all in on the off-chance we might get smart. What's next is probably going after the presidential election, to give states the right to override their voters' choices.",
            "created": "Thu, 30 Jun 2022 19:09:16 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1542534669706694658",
            "image": "http://scripting.com/images/2022/06/27/sarahSquirm.png",
            "flInCalendar": true
        },
        {
            "text": "I know 89 percent of you don't care about the NBA, but please don't even think of moving <a href=\"https://twitter.com/wojespn/status/1542581090812149767\">Kevin Durant</a> to the Knicks. I can't imagine where he could possibly go. Maybe somewhere in the midwest like Denver or Dallas. Maybe <a href=\"https://sports.yahoo.com/sources-kevin-durant-requests-trade-from-nets-185500155.html\">Phoenix</a> to try to fill the shoes of the great Chris Paul. Maybe he and Russell Westbrook and James Harden could get back together somewhere to finish up their careers. Or maybe the Clippers. I'd like the Knicks to please turn the other way. No he's not welcome in NY. Thank you. I bet he thinks he's going to Boston. That would be a huge mistake imho. Maybe he can play in Europe or China. <a href=\"http://daytona.scripting.com/?q=durant&collection=scriptingnews\">Durant</a>, no matter how good he is choked twice. He didn't fit in Golden State, and what a fiasco in Brooklyn which anyone could see coming. Maybe he could take a sabbatical or a gap year to see the world. I think he'll be boo'd in every NBA city. I guess I could be wrong about that. Cleveland or Miami might want him.",
            "created": "Thu, 30 Jun 2022 18:51:38 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/wojespn/status/1542581090812149767",
            "flInCalendar": true
        },
        {
            "text": "New version of <a href=\"https://github.com/scripting/twitter\">davetwitter</a>, an Node package for simplified server-side access to Twitter API. They <a href=\"https://twittercommunity.com/t/retiring-the-1-1-configuration-endpoint/153319\">retired</a> an API a while back, we didn't need it, so I took out the call. ",
            "created": "Thu, 30 Jun 2022 18:13:40 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "We've been at war for all these years, without being very conscious of it, and the enemy just took over. We're only beginning to realize we have to fight back now with everything we have. We didn't defend the victories. New generations came along and took for granted that we couldn't go backwards. In fact I'm pretty sure it hasn't sunk in yet for most.",
            "created": "Thu, 30 Jun 2022 16:12:51 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I bought a relatively cheap office chair that I really liked. Fit me really well, and elevated me high off the floor which is comfortable for me. But yesterday one of the arms on the chair broke off. Just like that. I thought no big deal, I'll get used to it. No. It doesn't work that way. I spend so many hours each day in this chair, the missing arm throws me off balance, sometimes literally. Almost fell off the damn thing a couple of times. I have another much more expensive chair (older) that I hate. I tried using it. No not going to do that. So I ordered a new cheap replacement. Even the littlest things matter it seems. Of course I have to assemble these things and I hate that part. So many opportunities to screw it up (I think that's the problem with the older chair btw).",
            "created": "Thu, 30 Jun 2022 13:55:27 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}