{
    "text": "They can't see what they can't see",
    "created": "Wed, 23 Jun 2021 16:23:12 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Journalism, academia, government and the corporate world all hire from the same talent pool.",
            "created": "Wed, 23 Jun 2021 21:41:19 GMT",
            "flInCalendar": true
        },
        {
            "text": "They go to the same universities, get their news from the same sources. Corporate people take government jobs, then go back to the corporations. The people move fluidly in and out of each bucket. ",
            "created": "Wed, 23 Jun 2021 16:23:33 GMT",
            "flInCalendar": true
        },
        {
            "text": "So you get the same story, the reality they believe in, developed over centuries, that is radically different from the reality most other people experience. The story recited daily at CNN, MSNBC, The New Yorker, NYT. The world changes, again and again, and the story they tell is how angry this makes them, and how everyone must snap back.",
            "created": "Wed, 23 Jun 2021 16:23:53 GMT",
            "flInCalendar": true
        },
        {
            "text": "New technologies can make change possible, like the one we're using now. ",
            "created": "Wed, 23 Jun 2021 16:32:39 GMT",
            "flInCalendar": true
        },
        {
            "text": "We would never have Trump if it weren't for Twitter. Imagine someone saying that sentence 20 years ago. It would pay to have that kind of imagination built into journalism, and it is available. The incumbents, like the Democratic incumbents, will have to be left behind. ",
            "created": "Wed, 23 Jun 2021 16:32:52 GMT",
            "flInCalendar": true
        },
        {
            "text": "Today we can't rely on journalism, not because of a campaign run by Russians or Republicans or billionaires. ",
            "created": "Wed, 23 Jun 2021 16:24:27 GMT",
            "flInCalendar": true
        },
        {
            "text": "They think the problem is that we don't see what they see, but I think it's the other way. They hold on to a normalcy that is gone. ",
            "created": "Wed, 23 Jun 2021 16:26:08 GMT",
            "flInCalendar": true
        },
        {
            "text": "They can't see what they can't see.",
            "created": "Wed, 23 Jun 2021 16:23:16 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}