{
    "text": "Idea: Open source patents",
    "created": "Sat, 04 Dec 2021 15:39:23 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I had a radical idea about patents many years ago, when they were starting to spoil the software world.",
            "created": "Sat, 04 Dec 2021 15:39:31 GMT",
            "flInCalendar": true
        },
        {
            "text": "The idea -- open source patents.",
            "created": "Sat, 04 Dec 2021 15:39:40 GMT",
            "flInCalendar": true
        },
        {
            "text": "Develop something new. Document it, have it evaluated by a panel of experts. If it's new you get a \"patent\". ",
            "created": "Sat, 04 Dec 2021 15:42:59 GMT",
            "flInCalendar": true
        },
        {
            "text": "The <a href=\"https://en.wikipedia.org/wiki/Ersatz_good\">ersatz</a> patent does a few things.",
            "created": "Sat, 04 Dec 2021 15:40:03 GMT",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "It prevents Google or Apple from patenting it. ",
                    "created": "Sat, 04 Dec 2021 15:40:04 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It gives the inventor proper credit for their work.",
                    "created": "Sat, 04 Dec 2021 15:40:24 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It makes the idea useful to other software devs because it isn't just some random feature ready to be patented by Microsoft or Amazon.",
                    "created": "Sat, 04 Dec 2021 15:40:27 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "You can find out if something you did really is unique or if someone did it 25 years earlier (this has happened to me, I thought I had invented outlining until I read Ted Nelson's book and leared about Doug Engelbart).",
                    "created": "Sat, 04 Dec 2021 15:40:32 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It's good publicity, giving people an incentive to participate. ",
                    "created": "Sat, 04 Dec 2021 15:40:06 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Unlike non-open patents, everyone is free to use the idea for free. However they can't claim that they invented it. It's like <a href=\"https://creativecommons.org/\">Creative Commons</a> for patents. ",
            "created": "Sat, 04 Dec 2021 15:43:04 GMT",
            "flInCalendar": true
        },
        {
            "text": "I must not have been very good at explaining it, I thought it was something my friends at Harvard Law School would help with, but we're still stuck in this horrible situation where inventors of new ideas are forced to put up gates to simply get credit for their work. I'm never willing to do this myself, so I've seen many of my works being ignored or even undermined (notably podcasting by the f'ing EFF) or patented by IBM or Salesforce.",
            "created": "Sat, 04 Dec 2021 15:44:11 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}