{
    "text": "Programming is like skiing",
    "created": "Wed, 09 Aug 2017 23:59:18 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "<img src=\"http:///scripting.com/images/2017/08/09/skier.png\" width=\"125\" height=\"183\" style=\"float: right; border: 1px solid silver; margin-left: 25px; margin-bottom: 25px; margin-top: 15px;\" alt=\"A picture named skier.png\">Well, not really, but in a way.",
            "created": "Wed, 09 Aug 2017 23:59:28 GMT"
        },
        {
            "text": "I remember having a conversation with a business associate who wasn't a skier, who said he liked sports where he got a good workout and that skiing was for lazy people who don't like to work.",
            "created": "Wed, 09 Aug 2017 23:59:36 GMT"
        },
        {
            "text": "I told him he's got it all wrong. Skiing is a very taxing sport, hard on all parts of the body. When I'm done with a day of skiing there isn't much more I can do other than take a bath and eat dinner. ",
            "created": "Thu, 10 Aug 2017 00:00:07 GMT"
        },
        {
            "text": "He thought skiing was easy because sheez you just go to the top of the hill and gravity does all the work. I guess he thought it was like sledding. ",
            "created": "Thu, 10 Aug 2017 00:00:44 GMT"
        },
        {
            "text": "Programming still kicks my ass after doing it for over 40 years. I still learn new stuff, reach new heights, and know much less than I thought I did, all the time. It requires incredible concentration and memory and creativity to think of ways to do things that you can kind of describe in words but have no experience making work with ones and zeros. ",
            "created": "Thu, 10 Aug 2017 00:01:12 GMT"
        },
        {
            "text": "People who haven't programmed think it's like coding. You just code it up like a Morse Code message. Other people think up the ideas, coders do the coding. ",
            "created": "Thu, 10 Aug 2017 00:02:21 GMT"
        },
        {
            "text": "Well it doesn't work that way. Not even slightly in the ballpark of that way. ",
            "created": "Thu, 10 Aug 2017 00:02:58 GMT"
        }
    ]
}