{
    "text": "At the end of the runway",
    "created": "Sat, 03 Mar 2018 13:52:46 GMT",
    "type": "outline",
    "description": "In life as we try to achieve perfection, what we're really doing (maybe) is planning for a fantastic afterlife. ",
    "subs": [
        {
            "text": "I've been sharing a story offline with <a href=\"https://twitter.com/nakedjen\">NakedJen</a> about loved ones who pass and what they're doing while waiting for us to join them in the afterlife. ",
            "created": "Sat, 03 Mar 2018 13:53:09 GMT",
            "image": "http://scripting.com/images/2018/03/03/nakedjen.png"
        },
        {
            "text": "The story began a few years ago with each of us as an airplane on a runway, and life is us taking off and flying. As time goes by there's less runway in front of us (the future) and more behind (experience).",
            "created": "Sat, 03 Mar 2018 13:54:04 GMT"
        },
        {
            "text": "Lately there's a new twist to the story. Her dogs, led by Clyde (the only one whose name I know) are busily preparing a <i>perfect</i> dog park for Jen to live in. There will be many things to throw and catch. And things to smell and roll around in. A tree with shade to rest under. A bowl of fresh water. Treats. Jen will have a Mac, an iPad, an iPhone and a place to get <a href=\"https://en.wikipedia.org/wiki/Kombucha\">Kombucha</a>. There's a <a href=\"https://www.yelp.com/biz/the-coffee-garden-salt-lake-city\">Coffee Garden</a> up there too. And don't forget Sundance and the annual <a href=\"http://scripting.com/2017/12/24/191147.html\">NJFF</a>. I have that pencilled in on my afterlife agenda as well. :-)",
            "created": "Sat, 03 Mar 2018 13:53:46 GMT"
        },
        {
            "text": "I think of that as NakedJen's dog park at the end of the runway."
        },
        {
            "text": "I realize that my collection of Zillow searches are part of <i>my</i> planning for the afterlife. Lately I haven't been paying that much attention, but this <a href=\"https://www.zillow.com/homes/for_sale/Taos-NM/0_fr/1_fs/house,mobile,land_type/54659_rid/200000-900000_price/742-3338_mp/36.658504,-105.209542,36.061866,-105.768471_rect/X1-SS-8vk9hw4jzfg5_7aoby_sse/102053972_zpid/?utm_source=email&utm_medium=email&utm_campaign=emo-savedsearchdailyemail-forsaleimage&rtoken=d321f5b6-86bb-4001-88f3-bdc180dad72c~X1-ZUy9o59j6zxbt5_1wtuu&3col=true\">house</a> in <a href=\"https://www.google.com/maps/place/61+Blueberry+Hill+Rd,+El+Prado,+NM+87529/@36.3966079,-105.9079645,10z/data=!4m5!3m4!1s0x87177ae57a811af5:0xf02e0af490bc31f2!8m2!3d36.3966079!4d-105.6278131\">Taos</a> came along today and it immediately made sense. My Zillow queries are me shopping for where I want to live, for eternity. That house is pretty close what I want to build at the end of my runway.",
            "created": "Sat, 03 Mar 2018 13:55:10 GMT"
        },
        {
            "text": "PS: A plot for a science fiction movie. You know how Silicon Valley moguls are trying to find the cure for death so they can <a href=\"https://www.newyorker.com/magazine/2017/04/03/silicon-valleys-quest-to-live-forever\">live forever</a>. Well, in this story, they succeed, and they do live forever. Their friends and loved ones die as people normally do. And they're watching, in a dimension only the dead occupy, as their silly friends struggle to live forever while they're enjoying the many benefits of the afterlife (see above). ",
            "created": "Sat, 03 Mar 2018 14:10:51 GMT"
        }
    ]
}