{
    "text": "Mr Mercedes is very good",
    "created": "Fri, 20 Oct 2017 17:03:21 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I finished binge-watching the <a href=\"https://en.wikipedia.org/wiki/Mr._Mercedes_(TV_series)\">Mr Mercedes</a> TV series on the flight back from Denver yesterday, and man it was good. At the same level as Breaking Bad, only more bizarre. The acting was great. I thought the story from Stephen King they had to work with was so-so, that's why I expected the TV series to drift and get sappy, because that's what happened (imho) in the novel. But it didn't happen and I think I know why. The writer of the teleplay was <a href=\"https://en.wikipedia.org/wiki/Dennis_Lehane\">Dennis Lehane</a> who himself is a fine novelist, author of <a href=\"https://en.wikipedia.org/wiki/Mystic_River_(novel)\">Mystic River</a> and <a href=\"https://en.wikipedia.org/wiki/Shutter_Island\">Shutter Island</a>, two great movies. He also wrote for <a href=\"https://en.wikipedia.org/wiki/Dennis_Lehane#Film_career\">The Wire</a>. ",
            "created": "Fri, 20 Oct 2017 17:03:26 GMT",
            "image": "http:///scripting.com/images/2017/10/20/itchyscratchy2.png"
        },
        {
            "text": "In Mr Mercedes Lehane developed King's story into a 10-hour movie that would have been fine without the gore and violence, but it made it better, because it was delivered with humor and was outrageous and thrilling, on the same level as <a href=\"https://en.wikipedia.org/wiki/The_Shining_(film)\">The Shining</a> or <a href=\"https://en.wikipedia.org/wiki/Carrie_(1976_film)\">Carrie</a>. ",
            "created": "Fri, 20 Oct 2017 17:11:56 GMT"
        },
        {
            "text": "Even the computer stuff mostly made sense (in the novel it didn't, King doesn't really understand computers imho). There was even some good Mac humor in the story! How about that. ",
            "created": "Fri, 20 Oct 2017 17:16:21 GMT"
        },
        {
            "text": "Lehane found the thread in the King novel that worked, he changed a couple of things, and let the plot develop at a good pace, and the characters were fun, entertaining, cute, motivated, lovely and brave, and most important, believable. I loved it. Highly recommended if you like this <a href=\"https://en.wikipedia.org/wiki/The_Itchy_%26_Scratchy_Show\">kind of thing</a>. ",
            "created": "Fri, 20 Oct 2017 17:12:47 GMT"
        },
        {
            "text": "Update: The <a href=\"https://www.nytimes.com/2017/08/08/arts/television/mr-mercedes-tv-review.html\">NYT review</a> says there were three great writers working on the <a href=\"http://www.imdb.com/title/tt4354880/fullcredits?ref_=tt_ql_1\">show</a>. ",
            "created": "Fri, 20 Oct 2017 20:13:48 GMT"
        }
    ]
}