{
    "text": "Imagine RSS as a cover story",
    "created": "Sun, 16 Jun 2024 11:27:55 GMT",
    "type": "outline",
    "metaImage": "https://imgs.scripting.com/2024/06/16/imagineTheyPutRSSOnACover.png",
    "description": "I don't owe a news org anything because I read the news on their site. The news doesn't belong to them.",
    "subs": [
        {
            "text": "\"RSS\" has never been on the cover of a magazine, so you can't say ChatGPT is stealing this from anyone. In fact I'm offended on behalf of ChatGPT that the press has chosen to focus on the idea that it's plagiarizing journalists. The ideas journalists write about do not belong to them. If they're doing their jobs, they're reporting facts that exist whether or not they wrote a story about it. A simple example. I may have read in a local paper that the Mets swept the Dodgers in the <a href=\"https://en.wikipedia.org/wiki/National_League_Championship_Series\">NLCS</a>. I don't owe a news org anything if I wrote that the Mets won, because I read the news on their site. The news doesn't belong to them. ",
            "created": "Sun, 16 Jun 2024 11:28:02 GMT",
            "flInCalendar": true
        },
        {
            "text": "The idea that RSS could be on the cover of a magazine isn't so far-fetched, but no one ran a press release and there were no billionaires involved, so they didn't consider it newsworthy I guess. Some day we're going to have to accept that we have to make our own news, in the sense of Scoop Nisker's famous line -- \"If you don't like the news go out and make some of your own.\" So here we go. I asked ChatGPT to imagine a magazine with RSS as the cover story. ",
            "created": "Sun, 16 Jun 2024 11:31:07 GMT",
            "flInCalendar": true
        },
        {
            "text": "Imagine RSS as the cover story.",
            "created": "Sun, 16 Jun 2024 11:33:11 GMT",
            "inlineImage": "https://imgs.scripting.com/2024/06/16/imagineTheyPutRSSOnACover.png",
            "flInCalendar": true
        },
        {
            "text": "PS: Does the concept of a cover story even exist now that we rarely read printed magazines?",
            "created": "Sun, 16 Jun 2024 12:02:57 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}