{
    "created": "2025-04-03T04:00:00.000Z",
    "flInCalendar": true,
    "name": "03",
    "path": "2025/04/03",
    "text": "April 03",
    "type": "calendarDay",
    "subs": [
        {
            "text": "We're doing some research into the origins of my family in Germany, learning a lot. ",
            "created": "Thu, 03 Apr 2025 21:30:53 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Journalists still sanewashing",
            "created": "Thu, 03 Apr 2025 21:52:40 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "They're still <a href=\"https://en.wikipedia.org/wiki/Sanewashing\">sanewashing</a> Trump.",
                    "created": "Thu, 03 Apr 2025 21:52:50 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Example. Just listened to Brian Lehrer, a news interview and call-in show on WNYC, which I revere, for many reasons. Lehrer is smart, and doesn't dumb things down for his audience. He usually asks the question I'm dying to hear the answer to, which most reporters don't think of or won't ask.",
                    "flInCalendar": true
                },
                {
                    "text": "On the March 27 they had a <a href=\"https://www.wnycstudios.org/podcasts/bl-daily-politics-podcast/articles/columbia-university-faces-the-prisoners-dilemma\">discussion</a> about Trump's assault on Columbia University, which has now been extended to Harvard and Princeton. In all of them, the main issue is antisemitism at these universities.",
                    "created": "Thu, 03 Apr 2025 21:53:07 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Never in the discussion did they raise this question --",
                    "flInCalendar": true
                },
                {
                    "text": "Do we believe that Trump cares about antisemitism?",
                    "flInCalendar": true
                },
                {
                    "text": "And if he did, there are much bigger antisemites who are much more powerful and much closer to Trump (who is an obvious antisemite himself).",
                    "flInCalendar": true
                },
                {
                    "text": "I'll mention just one -- Elon Musk, who actually did the Nazi salute, twice, from the podium with the Presidential Seal on it, at the freaking inauguration.",
                    "flInCalendar": true
                },
                {
                    "text": "Musk has also backed the German Nazi party (they have a different name but to use that name would be NaziWashing, which I won't do).",
                    "flInCalendar": true
                },
                {
                    "text": "The Occam's truth is that he's tying antisemitism to things because it's fun for him, and because later -- they will blame Jews for everything that's wrong in the US, as they always do.",
                    "flInCalendar": true
                },
                {
                    "text": "The whole thing of Trump being a champion for Jewish people made me really uneasy, until I read a <a href=\"https://snyder.substack.com/p/antisemitism-and-antisemitism\">piece</a> in Timothy Snyder's newsletter, which I recommend to everyone. ",
                    "created": "Thu, 03 Apr 2025 21:53:41 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Anyway, I trust Brian Lehrer, I don't think he'd shirk a tough question, I just think as a journalist he still isn't thinking realistically about the world as it is now, instead behaving as he did before it got so rotten.",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}