{
    "created": "2025-04-11T04:00:00.000Z",
    "flInCalendar": true,
    "name": "11",
    "path": "2025/04/11",
    "text": "April 11",
    "type": "calendarDay",
    "subs": [
        {
            "text": "The difference between the 2008 crash and now is that we had a functioning government in 2008.",
            "created": "Fri, 11 Apr 2025 21:49:02 GMT",
            "type": "outline",
            "image": "https://s3.amazonaws.com/scripting.com/images/2020/05/02/lbj.png",
            "flInCalendar": true
        },
        {
            "text": "When young people come out of university in a technical subject, they think they know more than people already doing the jobs. They quickly learn that in school they were doing \"student projects\" which are not the real thing. <a href=\"https://bsky.app/profile/radiofreeameri.ca/post/3lmjtnotspv2z\">Ooops</a>, maybe we didn't know as much as we thought.",
            "created": "Fri, 11 Apr 2025 12:45:34 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Why we all have to be working <i>together</i> on creating a modern easily distributed communication system that's truly decentralized. The key is to only implement features that have super-simple implementations, so it will be easy to product new versions quickly in all environments. Which means starting with formats and protocols that are already widely supported. ",
            "created": "Fri, 11 Apr 2025 13:43:00 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "This morning ChatGPT told me it knows more about me, and will learn better. Promises promises. I would like to begin with teaching it my coding conventions. Will make it <i>much</i> easier for me to work with it. Their idea of how JavaScript works is disorganized bordering on chaos. I find that human developers always find a reason not to listen to other people, and that has huge problems (like no interop), but machines should do better. It seems to have infinite patience. What I need is to share a bit of space with the bot, so I can keep it up to date on my worknotes. I'm pretty good at it these days. Why not let that be input into the system so I can say -- give me all the notes I have on my Bingeworthy project. Why should I have to copy/paste. This is a big problem in the web, products that pretend to be islands, when they're really all floating on the same sea, the internet. We were supposed to be able to network not only our attention, but also our work.",
            "created": "Fri, 11 Apr 2025 13:16:21 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Did you know there's a chain of beating hearts going from your heart all the way back to the first animal on earth with a heart.",
            "created": "Fri, 11 Apr 2025 21:47:35 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}