{
    "created": "2025-04-18T04:00:00.000Z",
    "flInCalendar": true,
    "name": "18",
    "path": "2025/04/18",
    "text": "April 18",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Today's song: <a href=\"https://www.youtube.com/watch?v=3Y71iDvCYXA\">Pump It Up</a>.",
            "created": "Fri, 18 Apr 2025 16:05:27 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I'm working on a <a href=\"https://github.com/scripting/wordlandSupport/issues/71\">baseline theme</a> for WordLand-authored sites. I want to show people how to get a good result with WordLand, even if they have plenty of experience with WordPress, but especially if they don't. I want people to look at a user's site and think \"Hey I want one of those!\" Not too fancy, just get out of the way and let the writer's writing stand out and look great. This is a replay of the work we did on \"Manila\" and then <a href=\"https://www.google.com/search?q=site%3Ascripting.com+%22radio+userland%22\">Radio</a>. I hope we're able to start a designer community as vibrant and productive as the one we had a few years ago. ",
            "created": "Fri, 18 Apr 2025 15:57:59 GMT",
            "type": "outline",
            "image": "https://s3.amazonaws.com/scripting.com/images/2019/05/16/weTryHarder.png",
            "flInCalendar": true
        },
        {
            "text": "Everyone has to communicate in plain language, directly to the people. The courts, universities, every institution that the president is defaming. Go direct, go around the media. Start communicating in the language we communicate in these days. Use the tools. The campaign never stops. Then we'll know what we have to do to protect the rule of law. And the Dems are starting to do that, some of them, thankfully. Best example so far -- AOC and Bernie. Elizabeth Warren. Chris Murphy, Cory Booker, Chris Van Hollen. And lately some Repubs too. It's the same old thing the web does -- <a href=\"http://scripting.com/2022/04/13/165056.html\">Sources Go Direct</a>. ",
            "created": "Fri, 18 Apr 2025 14:55:37 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}