{
    "created": "2025-04-19T04:00:00.000Z",
    "flInCalendar": true,
    "name": "19",
    "path": "2025/04/19",
    "text": "April 19",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I got a US Mail notice to answer a Census form, so being a good American I did. It was a <a href=\"https://respond.census.gov/acs\">.gov address</a>, and looked like a government form. The initial questions were standard census questions, then they started getting into personal things that I didn't like answering. Then they <a href=\"https://imgs.scripting.com/2025/04/19/censusFormPage.png\">asked</a> if I was born in the US. That's a really shitty question <a href=\"https://apnews.com/article/supreme-court-birthright-citizenship-trump-6f0cb929c4604ec1d9bf9fea99765b61\"> to ask now</a>. I was glad to see that I could just click Next without answering any question, and they got worse, more invasive, esp considering who the president is, and who he brought with him, so I just closed the page and wrote this post. I would, if I had it to do over again, not answered any of their questions, or maybe stopped at the standard Census questions from years past. ",
            "created": "Sat, 19 Apr 2025 13:36:49 GMT",
            "type": "outline",
            "image": "https://s3.amazonaws.com/scripting.com/images/2020/08/19/mailman.png",
            "flInCalendar": true
        },
        {
            "text": "One reason I want to bring blogging and social media together is so I don't have to think about where I will post stuff. This is really important. I want my blog to be a complete record of everything I write publicly. The way our online writing world has been siloized, basically no one has that. We're going to try to fix that, and not with just my software, but by setting some new standards for interop, extensions to RSS, so that there's no exclusivity to making software for writers or publishers. That's what I mean when I say something is \"on the web.\" If your system is not 100% replaceable, today, they you are not on the web and should not claim it. If you're thinking about freedom, btw -- this should be part of your big picture. So many smart people don't want to know how our networks work, and that makes you a victim. And it's not that hard to understand, no matter what people have led you to believe. ",
            "created": "Sat, 19 Apr 2025 13:28:28 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I keep coming back to this -- ChatGPT is a vast library that comes with its own librarian. And the librarian has read and digested all of it, and can give you useful and usually exactly right summaries (despite what the critics say) in an instant. I've been using libraries my whole life, going back to when I was a child. I worked with card catalogs and non-virtual book collections. Archives of news on film. View ChatGPT on that timeline and you'll see its significance. You didn't write it, I didn't. Each of us may have contributed a little, and isn't that what we want? To help build the base of human knowledge? It gives our lives meaning. Sometimes I wonder how much value people place on themselves and so little on progress. I think we all want our lives to have meaning. Well here you go, it doesn't get more meaningful than this.",
            "created": "Sat, 19 Apr 2025 15:48:48 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}