{
    "created": "2025-04-22T04:00:00.000Z",
    "flInCalendar": true,
    "name": "22",
    "path": "2025/04/22",
    "text": "April 22",
    "type": "calendarDay",
    "subs": [
        {
            "text": "It's crazy to even think of moving Chrome from Google <a href=\"https://techcrunch.com/2025/04/22/openai-exec-says-the-company-would-buy-googles-chrome-browser-if-offered-the-chance/?guccounter=1&guce_referrer=aHR0cDovL3NjcmlwdGluZy5jb20v&guce_referrer_sig=AQAAALnjUkq94tpAXWEMr56Y1XtRJG6hrCFHhLQc0kOdOGX9lwkrh2G9cxd1P5OT3HH7-uCaybLWdPHi3J-VkpdtBV16Lnb8xCbvEIsQgOME7IXZgson6x4kIgRZgxaHkn8aH76hT-4BjuIa-Xbn30WQDKJ1N-mHp3PfPONGELKM0nVn\">to OpenAI</a>. The web needs to not be owned by anyone, esp not owned by the tech industry. What Google tried to do to the web is obscene. I love ChatGPT, but let's keep Chrome out of their owner's greedy little hands. Set it up so it stands alone.",
            "created": "Wed, 23 Apr 2025 00:43:59 GMT",
            "type": "outline",
            "image": "https://s3.amazonaws.com/scripting.com/images/2020/03/12/usAttacked.png",
            "flInCalendar": true
        },
        {
            "text": "If you're a young person contemplating a career in tech, great! It's fun, and you can help people doing this. But please don't listen to the VCs and entrepreneurs who say it's all about changing the world. Instead think of it this way -- you're going to create tools for people who may change the world, in collaboration with lots of other people. No one person is that smart and experienced that they know what's best for the world. The stories you heard about great inventors probably aren't true. And the ones who actually changed the world, may not have changed it for the better. Look at what happened with Twitter as a cautionary tale. Imho it would have been better if the founders had made less money, and opened the door for lots of competition right from the start. That's the philosophy of the web. Instead they captured the web, amputated all its good features, and locked it in the trunk and then cut off its air supply. That was inevitable given the path they went down. Yes they changed the world, and in turn are creating a lot of misery. You don't want to do that, brilliant young tech person, right? Let's make the world better, one little evolutionary step at a time. More about this in <a href=\"http://scripting.com/2025/04/21/141055.html\">yesterday's post</a>. ",
            "created": "Tue, 22 Apr 2025 12:13:17 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=Ozo97TTyg38\">A video demo</a> that shows how to set categories in \"WordLand\", and I ramble through lots of philosophy and trivia. But the answer is right up front so you can skip all that michegas. ;-) ",
            "created": "Tue, 22 Apr 2025 12:00:31 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=Ozo97TTyg38",
            "flInCalendar": true
        },
        {
            "text": "Many good points in yesterday’s unusual <a href=\"https://podcasts.apple.com/us/podcast/murkowski-could-lead-gop-revolt-against-trump-4-21-25/id1633301179?i=1000704258553\">Olbermann podcast</a>, but the one that stuck with me is that at some point Republican incumbents will figure they don’t have a future in what Trump is trying to create and thus have everything to lose if he prevails. He thinks senator <a href=\"https://en.wikipedia.org/wiki/Lisa_Murkowski\">Lisa Murkowski</a> (R-Alaska) may already be there.",
            "created": "Tue, 22 Apr 2025 12:10:27 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}