{
    "created": "2025-04-28T04:00:00.000Z",
    "flInCalendar": true,
    "name": "28",
    "path": "2025/04/28",
    "text": "April 28",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I mentioned this in <a href=\"https://shownotes.scripting.com/scripting/2025/04/27/chatgptDeservesOurRespectAtLeast.html\">yesterday's podcast</a> -- new problems popped up with websockets in WordLand. I worked through the whole tree of possibilities with ChatGPT and it came to the conclusion that the source was an out of date package, and it was confident if I replaced it with the one \"everyone else\" is using, the problems will go away. Now this is the moment when human judgement prevails. I'm going to experiment in a very small app first, to make sure I have the approach right, then I will cautiously make the change on my test WordLand server, and if it works there, then I will figure out how to install it on the main site. It couldn't break all that much because for some reason the WS code stopped working, completely, with no code changes anywhere. ",
            "created": "Mon, 28 Apr 2025 12:26:29 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Well it looks like the <a href=\"http://scripting.com/2025/04/27/130611.html\">new email app</a> is working. I got some really nice lookin emails last night, hope you did too. Subscribe <a href=\"https://subscribe.scripting.com/\">here</a>. And there's a basis on which to build. I will now proceed to turn off the old email app that has been serving us so well since 2017 or thereabouts. Goodbye old friend. Hello new world! ",
            "created": "Mon, 28 Apr 2025 11:56:25 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Cory Doctorow coined a lovely word -- <a href=\"https://en.wikipedia.org/wiki/Enshittification\">enshitified</a>. In that spirit, I'd love to see some elites <a href=\"https://www.google.com/search?q=explain+stodgy\">destodgified</a>.",
            "created": "Mon, 28 Apr 2025 17:01:35 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "If Harvard could become more American and less elite, that could change things. Make a simple direct unmistakable contribution directly to the well-being of Americans. Be the source of reliable information to the people that's missing because the major corporations who own the media are playing it safe. Harvard is no longer in a position where playing it safe is an option. The Trumps will continue to cast doubt on the truth, but in a contest between Trump and Harvard, I bet a lot of people, even most, would trust Harvard first. \n",
            "created": "Mon, 28 Apr 2025 16:21:43 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2019/05/29/truthAdjustment.png",
            "flInCalendar": true
        },
        {
            "text": "Dems get on the air!",
            "created": "Mon, 28 Apr 2025 13:50:55 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I’m sick of saying this <a href=\"https://bsky.app/profile/scripting.com/post/3lnunfkdru22h\">over and over</a>, the Dems need a regular snark-filled irreverent presence on social media to condemn every freaking fascist thing the Trumps do. They had it with the Kamala accounts, but they shut them down on Election Day. ",
                    "created": "Mon, 28 Apr 2025 13:50:23 GMT",
                    "type": "outline",
                    "flInCalendar": true
                },
                {
                    "text": "It’s so freaking simple. Not having a raging presence on social media in the future will be seen as like a successful company not being listed on the NYSE, or a country not having a rep at the United Nations. Aside from the cost of keeping a staff online 24x7, it's free, and serves as its own money-raising channel.",
                    "created": "Mon, 28 Apr 2025 13:51:19 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The Repubs figured this out in 2016. ",
                    "created": "Mon, 28 Apr 2025 13:51:42 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Maybe what the Dems need is some entrepreneurs and comedians at the top to actually get through to voters that say \"Hey we're the Dems, we're here and we love America and we love you, Americans!\" And actually make a stink when they try to kill Social Security.",
                    "created": "Mon, 28 Apr 2025 13:51:48 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Another purpose -- tell people when the next pandemic is here. You know the Trumps aren't going to do that.",
                    "created": "Mon, 28 Apr 2025 13:52:00 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}