{
    "text": "Payback time for the Dodgers",
    "created": "Sat, 12 Oct 2024 15:09:33 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Well we know who the Mets are facing, starting tomorrow, in the National League championship series. ",
            "created": "Sat, 12 Oct 2024 15:09:46 GMT",
            "flInCalendar": true
        },
        {
            "text": "Last time we played the Dodgers in the postseason we <a href=\"https://www.baseball-reference.com/postseason/2015_NLDS2.shtml\">kicked their ass</a>. And now they have the nerve to show up again. Geez some people never learn. ",
            "created": "Sat, 12 Oct 2024 15:10:18 GMT",
            "flInCalendar": true
        },
        {
            "text": "And we haven't forgotten how <a href=\"https://www.youtube.com/watch?v=BRbFJo83mlg\">Chase Utley</a> broke <a href=\"https://en.wikipedia.org/wiki/Rub%C3%A9n_Tejada\">Rubin Tejada's</a> leg, <a href=\"http://scripting.com/2015/10/11/baseballGotUglyLastNight.html\">deliberately</a>, basically ending his major league career. We thought he should have been arrested for that, no kidding -- it was a vicious un-baseball assault. He and the Dodgers showed <a href=\"https://dodgers.mlblogs.com/off-day-report-mattingly-addresses-utley-tejada-a2ba255e751f\">no remorse</a>. ",
            "created": "Sat, 12 Oct 2024 15:12:23 GMT",
            "flInCalendar": true
        },
        {
            "text": "The only payback that matters is victory.",
            "created": "Sat, 12 Oct 2024 15:20:02 GMT",
            "inlineImage": "https://imgs.scripting.com/2024/10/12/payback.png",
            "flInCalendar": true
        },
        {
            "text": "Update: The Jankees are playing Cleveland in the ALCS, and while some people with limited imaginations wish for a <a href=\"https://en.wikipedia.org/wiki/Subway_Series\">Subway Series</a> betw the the two NY teams, I do not. I have a rule, I always root for the team the Jankees are playing. Thus I hope to see a World Series between the Mets and so-called \"Guardians.\" And of course the Mets would be heavily favored in that contest because the Cleveland team has changed their name to something impossible to pronounce, ethically. When you change your name, like <a href=\"http://scripting.com/2015/09/21/silverLiningMetsBook.html#aIWPAT\">tearing down your stadium</a> (something that took the Mets a long time to recover from) you basically put a hex on your team making it virtually impossible for your philosophy to prevail. So Mets v Guardians, while not necessarily what I predict, rather is something I <i>hope</i> <i>for</i>, and as long as the game is played with philosophy, that's the real victory! So get em METS and never forget there's always next year. :heart:",
            "created": "Sun, 13 Oct 2024 00:52:47 GMT",
            "image": "https://imgs.scripting.com/2024/10/12/mrMetAtBat.png",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}