{
    "created": "2024-05-10T04:00:00.000Z",
    "flInCalendar": true,
    "name": "10",
    "path": "2024/05/10",
    "text": "May 10",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Pretty sure I understand why Jack Dorsey is <a href=\"https://www.piratewires.com/p/interview-with-jack-dorsey-mike-solana?data-crypto-dot-news\">disappointed</a> with Bluesky. The mistake they made at Twitter was taking responsibility for enforcing decorum, which is completely diseconomic. A fully decentralized system is very different. That was why he funded Bluesky, to make a social web that wouldn't have at its center a company responsible for content.",
            "created": "Sat, 11 May 2024 01:57:54 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "This year's <a href=\"https://en.wikipedia.org/wiki/Template:New_York_Knicks_roster\">Knicks</a> are as memorable as the 1970 <a href=\"https://www.basketball-reference.com/teams/NYK/1970.html#all_roster\">team</a>. Brunson, DiVincenzo, Hart, Anunoby and Hartenstein. They have totally distinct superpowers. Tonight's game will be played without Brunson and Anunoby, both injured. That means McBride and Atchiuwa start, probably. I kept wanting to tell friends about these guys, they're just as exciting as the starters. And don't forget there's another <a href=\"https://en.wikipedia.org/wiki/Jericho_Sims\">center</a> and <a href=\"https://en.wikipedia.org/wiki/Alec_Burks\">forward</a> still on the bench who have done real starting minutes this year and two years ago. They are Knicks too.",
            "created": "Fri, 10 May 2024 15:30:45 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2019/07/02/knicks.png",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://www.threads.net/@futurefasterplz/post/C6uPZpjSMQp\">A useful thread</a>, where people share answers to a request for \"an extremely minimal, clean blogging site with practically no bells or whistles where I can just share things on my mind.\" ",
            "created": "Fri, 10 May 2024 12:27:41 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The NYT runs on freedom and apparently they don't know that",
            "created": "Fri, 10 May 2024 15:24:11 GMT",
            "type": "outline",
            "description": "Sometimes it's hard to see what's totally obvious.",
            "subs": [
                {
                    "text": "This is a hard idea to get across, but there's nothing wrong with a news organization favoring things they depend on to exist.",
                    "created": "Fri, 10 May 2024 15:24:14 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "For example, a news org that covers San Jose, CA is entitled to favor San Jose. It's okay for them to do things that help San Jose in competition with other cities. They could sponsor a food drive for the neediest in their community. It wouldn't be a conflict of interest, because it's understood that they have an interest in the success of San Jose. ",
                    "flInCalendar": true
                },
                {
                    "text": "A columnist that covers the NY Mets can be happy when the Mets win the World Series, and sad when they don't. This is not an integrity issue, or something they need to disclose, unless it's not obvious that they cover the Mets.",
                    "flInCalendar": true
                },
                {
                    "text": "In that sense, every news org in the United States depends on the First Amendment, so it can be assumed they're in favor of democracy, because without it they couldn't exist. ",
                    "flInCalendar": true
                },
                {
                    "text": "This is why the editor of the NYT's statement about not favoring democracy is so ridiculous. He can't be objective about that, because the existence of his organization depends on the continuation of democracy in the US.",
                    "flInCalendar": true
                },
                {
                    "text": "Whether he knows it or not, he's against Trump and in favor of the Democrats in the upcoming election.",
                    "created": "Fri, 10 May 2024 15:25:02 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Sometimes it's hard to see what's totally obvious. Ask a fish about water and they'll say there is no such thing. Same with free speech and the NYT. They are a product of free speech, without it, it makes no sense, doesn't work. But that's been true forever, so it feels like a given, but it isn't.",
                    "created": "Fri, 10 May 2024 15:25:03 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}