{
    "created": "2024-05-13T04:00:00.000Z",
    "flInCalendar": true,
    "name": "13",
    "path": "2024/05/13",
    "text": "May 13",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I've been trying the new 4o version of ChatGPT. It's much faster. It certainly is a search engine. And it covers news. I asked it about Michael Cohen's testimony today in the Trump trial, and it gave me a summary. I asked for the weather forecast in Kingston NY. It wouldn't give me the lyrics to Martha My Dear by the Beatles. I asked it to draw a weather map of the mid-Atlantic states, but it drew the <a href=\"http://scripting.com/2024/05/13/205122.html\">usual garbage</a> for technical images. ",
            "created": "Mon, 13 May 2024 20:41:38 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I can’t wait for the UIs of settings on systems like Mac or Android to go through the AIs. No more hunting through menus to not find the setting where you’re sure it should be.\n",
            "created": "Mon, 13 May 2024 19:15:44 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2024/02/13/commanderDataStarTrek.png",
            "flInCalendar": true
        },
        {
            "text": "Here's where we're headed now that we have AI programming partners. Creating software will be possible the way popular music is created. Watch <a href=\"https://en.wikipedia.org/wiki/The_Beatles:_Get_Back\">Get Back</a> to get an idea. <a href=\"https://en.wikipedia.org/wiki/George_Martin\">George Martin</a> was the Beatles sherpa, the same way my AI partner is my guide through unknown programming lands. It now doesn't matter if I have less experience building MySQL apps than others. I have the collective experience of <i>all of them</i> here to help. My George Martin. What got me thinking about this is John Naughton's <a href=\"https://www.theguardian.com/commentisfree/article/2024/may/11/chatgpt-ai-will-co-pilot-coders-to-new-heights-of-creativity?CMP=Share_iOSApp_Other\">piece</a> about AI and programming. ",
            "created": "Mon, 13 May 2024 13:04:09 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The way MSNBC has contributors, I want contributors for my blog. One of the first people I'd invite is John Naughton. See next item.",
            "created": "Mon, 13 May 2024 13:06:51 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "BTW, that's what <a href=\"https://imgs.scripting.com/2024/05/13/myBlogroll.png?nodialog\">my blogroll</a> is turning into. My contributors. The people I keep an eye on through my work day. Where I get new ways of looking at the same world we're all looking at. We used to call this \"watching them watch us watch them watching us etc.\"",
            "created": "Mon, 13 May 2024 13:11:45 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"http://scripting.com/2014/03/03/theCanonicalKnicksFan.html\">The canonical Knicks fan</a>, a video.",
            "created": "Mon, 13 May 2024 12:13:16 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I feel like crap today, the Knicks were blown out by the Indiana team, the series is tied 2-2 but it feels much worse. The headline in the <a href=\"https://www.nydailynews.com/2024/05/12/pacers-blow-out-knicks-tie-series/\">Daily News</a> reads \"Pacers blow depleted, dead-legged Knicks out of the water in Game 4, tie series 2-2.\" Yeah. I don't know how we recover from this loss. In a way I imagine the Knicks issuing a resignation. \"It's been a great season, but we're tired. We're headed to the beach, we'll see you in October Knicks fans. Thanks for your support.\" I would nod my head and say \"Yeah that makes sense.\" Whatever. I may spend today sleeping it off. Next game is tomorrow night. Yes, they will play, for sure, and yes, I will watch.",
            "created": "Mon, 13 May 2024 12:03:59 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2019/07/02/knicks.png",
            "flInCalendar": true
        },
        {
            "text": "I absolutely abhor news sites that make you turn off your ad blocker only to reveal their paywall. ",
            "created": "Mon, 13 May 2024 12:09:49 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Imagine a social web without, by default, the right to drop turds where ever you like.",
            "created": "Tue, 14 May 2024 01:53:49 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://en.wikipedia.org/wiki/Tesla_Autopilot#Full_Self-Driving\">FSD</a> gets confused and does some incredibly stupid things. With ChatGPT it's amusing but with FSD it's your ass on the line. ",
            "created": "Tue, 14 May 2024 01:57:47 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Weather map",
            "created": "Mon, 13 May 2024 20:51:22 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I asked ChatGPT to draw a weather map of the mid-Atlantic states, but it drew the usual garbage for technical images. ",
                    "created": "Mon, 13 May 2024 20:51:42 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Weather map.",
                    "created": "Mon, 13 May 2024 20:51:54 GMT",
                    "inlineImage": "https://imgs.scripting.com/2024/05/13/weatherMap.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}