{
    "created": "2024-05-15T04:00:00.000Z",
    "flInCalendar": true,
    "name": "15",
    "path": "2024/05/15",
    "text": "May 15",
    "type": "calendarDay",
    "subs": [
        {
            "text": "My AI bot is a library, a librarian, a programming partner, tutor and executive assistant. And we're just getting started working together.",
            "created": "Wed, 15 May 2024 20:43:59 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://www.nytimes.com/2024/05/15/opinion/artificial-intelligence-ai-openai-chatgpt-overrated-hype.html\">AI is not over-hyped</a>, imho. I'm discovering new significance for it every day. An example. I had to go back to some very complex code I wrote a week ago. I wanted to give it new flexibility, that would be simple from the user's point of view, and in order for it to work technically it has to maintain that simplicity internally. It's a tall order to go back to something complex a week after writing it, and rip it apart and put it back together and have it retain the simplicity it had before. But I had an advantage this time that I had never had before, a programming partner with a perfect memory. I had written the original code with ChatGPT. So I went back and asked it to review my plan, and then worked with it step by step as I had before. It had perfect recall, right, of course where my recall is pretty sketchy. It took two sessions to get it done, but it works now, and I'm confident I've covered all the bases. How do you put that story in a press release? If you want to understand a new technology, don't talk to the CEO of the tech company that made the product, their lives are whirlwinds, they don't have time or the capacity to understand how big the idea is, they just know that it is big. If you want to understand you have to use it and you have to talk with other users. ",
            "created": "Wed, 15 May 2024 15:57:30 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2023/04/29/raisins.png",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=RXawa90YU2s\">Martha My Dear</a> is the <a href=\"https://chat.openai.com/share/4ea60bab-a1ab-42fd-b928-e93b38b566d6\">essential</a> Paul McCartney <a href=\"https://en.wikipedia.org/wiki/Martha_My_Dear\">love</a> song. ",
            "created": "Wed, 15 May 2024 13:26:30 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "This is a <a href=\"https://imgs.scripting.com/2024/05/15/typicalPaywallDialog.png\">typical dialog</a> you see when you <a href=\"https://www.usatoday.com/story/news/politics/elections/2024/04/11/donald-trump-new-york-hush-money-trial/72943245007/\">visit a site</a> with an ad blocker installed. They say that turning off the ad blocker will \"support\" them. No, I don't think it actually will do anything for them. It might expose me to malware or having my interests shared with businesses who will use that info for who-knows-what. Much better would be to let me click a button to give them $0.50 to read the freaking article that's behind that idiotic dialog, and btw, the payment would have to be anonymous or I'm clicking the Back button. I really did want to know what happens if Trump is found guilty and sentenced to prison. I still do. But I don't think I'm going to turn off my ad blocker. I'll think about it. In the meantime if they had let me pay them $0.50 to read the freaking article, I might have linkblogged it to people who follow me via RSS or email, or on Bluesky or Mastodon, thus giving them a chance to sell others on paying $0.50 to read the freaking article. Not promising I'd do that, but if they really answer the question, if I really learn something I certainly would pass it along. Come on USA Today, get conscious. We'll happily support you for giving us info we wanted, just let us actually help you in a meaningful way, not by penalizing us for having the audacity to use an ad blocker. ",
            "created": "Wed, 15 May 2024 13:18:28 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2024/05/15/paulAndMartha.png",
            "flInCalendar": true
        },
        {
            "text": "I wonder if anyone named their dog Alexa, and if any hilarity ensued.",
            "created": "Thu, 16 May 2024 00:45:48 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The Knicks won last night ",
            "created": "Wed, 15 May 2024 16:06:38 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Knicks at the Garden via ChatGPT 4o.",
                    "created": "Wed, 15 May 2024 16:50:15 GMT",
                    "inlineImage": "https://imgs.scripting.com/2024/05/15/knicksAtTheGarden.png",
                    "flInCalendar": true
                },
                {
                    "text": "They <a href=\"http://scripting.com/2024/05/14/125908.html\">needed</a> fresh blood, and they got it. ",
                    "created": "Wed, 15 May 2024 16:12:04 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Knicks <a href=\"https://sports.yahoo.com/jalen-brunson-erupts-44-points-025800375.html\">won</a> in a blowout. ",
                    "created": "Wed, 15 May 2024 16:52:15 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I had no idea that was coming. ",
                    "created": "Wed, 15 May 2024 16:52:32 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Next game on Friday.",
                    "created": "Wed, 15 May 2024 16:52:41 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}