{
    "created": "2024-05-19T04:00:00.000Z",
    "flInCalendar": true,
    "name": "19",
    "path": "2024/05/19",
    "text": "May 19",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Today's song: <a href=\"https://www.youtube.com/watch?v=UToUzWgHGyQ\">Blue Sky</a>. \"Good old Sunday morning..\"",
            "created": "Sun, 19 May 2024 12:56:09 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=UToUzWgHGyQ",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://x.com/davewiner/status/1792132956384809371\">Poll</a>: \"If you’re not using Twitter these days where can we find you?\"",
            "created": "Sun, 19 May 2024 13:03:47 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "If I were desiging a system to compete with Twitter, I'd implement a one-click Block button. It should be as easy to block someone as it is to follow them. It would make a statement to trolls and users alike. To users it would say that blocking is a common thing, don't think about it too much, and certainly don't be intimidated into not doing it. It must be almost as easy to undo. A command to review the list of recent blocks. Facebook comes closest to this. It is very easy to block an account but not quite this easy. I think they're probably heading there. ",
            "created": "Sun, 19 May 2024 13:25:31 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2021/01/21/theKnick.png",
            "flInCalendar": true
        },
        {
            "text": "I'm seriously going to try <i>not</i> writing about ChatGPT today. :smile: ",
            "created": "Sun, 19 May 2024 12:55:47 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Today the Knicks play a game 7 vs the Indiana team at the Garden. If the Knicks win, they go on to the next round vs the Celtics, starting on Tuesday. If they lose, we relax for four months or so, when it <a href=\"https://en.wikipedia.org/wiki/2024%E2%80%9325_NBA_season\">starts all over again</a>. With love for the <a href=\"https://www.youtube.com/watch?v=Kj_kK1j3CV0&t=315s\">heart of gold</a> team. Either way we win, imho. I know you're not supposed to feel that way, but that's how I feel right now. During the game, if we're losing, based on recent experience I won't like that so much. :smile: ",
            "created": "Sun, 19 May 2024 13:06:18 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "BTW, this blog will have been running for 30 years on Oct 10.",
            "created": "Sun, 19 May 2024 13:52:38 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}