{
    "text": "Enoch on the Stanford project",
    "created": "Sun, 05 Apr 2020 16:25:04 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Here's what <a href=\"http://scripting.com/2020/03/24.html#a165220\">Enoch Choi</a> said about the <a href=\"https://med.stanford.edu/covid19/covid-counter.html\">Stanford project</a>.",
            "created": "Sun, 05 Apr 2020 16:25:22 GMT",
            "subs": [
                {
                    "text": "How would you like to help to predict where the next hotspots are for the Coronavirus?",
                    "created": "Sun, 05 Apr 2020 16:25:34 GMT"
                },
                {
                    "text": "Stanford Medicine would like people to take a national survey. It is anonymous in aggregate so they can predict areas that will be most impacted based on how you are feeling. This data can help redirect medical resources and give public guidance.",
                    "created": "Sun, 05 Apr 2020 16:25:40 GMT"
                },
                {
                    "text": "Think about it. Most of us, if exposed, may develop a mild case and stay home to recover. We may not be able to be tested because we are not sick enough. There aren't enough tests available either. That data point is considered \"under the radar\" and is not reported in the daily numbers we hear on the news.",
                    "created": "Sun, 05 Apr 2020 16:26:00 GMT"
                },
                {
                    "text": "But if we knew how people felt, self-reporting symptoms, we could get a jump on it.",
                    "created": "Sun, 05 Apr 2020 16:26:21 GMT"
                },
                {
                    "text": "Given the 9-10 day delay between onset of symptoms and hospitalization, and the 20% hospitalization rate of patients, this type of survey tool can help fight the Coronavirus."
                },
                {
                    "text": "Please consider taking this survey to help end this pandemic quickly. You can opt out at any time."
                }
            ]
        }
    ]
}