{
    "text": "October 5",
    "created": "Thu, 05 Oct 2017 14:13:50 GMT",
    "name": "05",
    "subs": [
        {
            "text": "Follow-up on yesterday's <a href=\"https://github.com/scripting/Scripting-News/issues/34\">braintrust query</a>. Per Scott Hanson's recommendation, I installed MAMP. It's running and I've got a <a href=\"https://github.com/scripting/Scripting-News/issues/34#issuecomment-334476526\">Hello World</a> app working. Also looking for a REPL, some way to issue SQL commands in the Terminal app. That must be possible, right??",
            "created": "Thu, 05 Oct 2017 15:01:21 GMT",
            "type": "outline"
        },
        {
            "text": "Facebook has my number. They show me ads for real estate in gorgeous places. Some of it way <a href=\"http:///scripting.com/images/2017/10/05/expensiveHome.png\">too much</a> house (I try to signal to them to stop showing me that stuff). My sweet spot is betw $400K and $600K, in the Berkshires or Santa Fe, NM. I'm scared if they had a one-cick-to-buy button on some of the places I might actually click! The Berkshires esp must be a depressed real estate market, because the houses are amazing, and the pricing history indicates lots of markdowns in the last year.",
            "created": "Thu, 05 Oct 2017 14:13:51 GMT",
            "type": "outline",
            "image": "http:///scripting.com/images/2017/10/05/goldenGirlActionFigure.png"
        },
        {
            "text": "My friend Cat Mikkelsen recently moved to Hawaii with her high-school-age son. I know her through her husband, a famous Mac developer from the 80s. She posts pics as she explores their new lifestyle in paradise. Yesterday she went kayaking on the ocean. That's a very effective way to sell real estate, indirectly, because seeing where she's going and what she's doing makes me want to buy something and live that lifestyle myself. ",
            "created": "Thu, 05 Oct 2017 14:16:16 GMT",
            "type": "outline"
        }
    ]
}