{
    "text": "October 8",
    "created": "Sun, 08 Oct 2017 15:33:30 GMT",
    "name": "08",
    "subs": [
        {
            "text": "The <a href=\"https://en.wikipedia.org/wiki/Second_Amendment_to_the_United_States_Constitution\">Second Amendment</a> doesn't say anything about using a gun to protect your family from burglars and home invaders.  :point_left: ",
            "created": "Sun, 08 Oct 2017 16:07:00 GMT",
            "type": "outline"
        },
        {
            "text": "Another <a href=\"https://www.zillow.com/homedetails/215-Devon-Rd-Lee-MA-01238/56804871_zpid/?utm_source=email&utm_medium=email&utm_campaign=emo-instant-homerecs-3recsloop&utm_content=20171007-forsaleimage-CollaborativeRecModel&rtoken=d991648a-23b6-4061-85db-29561483920b~X1-ZUy9o59j6zxbt5_1wtuu&sse=X1-SS-1wdjom2hgitx1_1ekgn\">fantasy house</a>. Imagine how much :moneybag: in the Bay Area. ",
            "created": "Sun, 08 Oct 2017 19:36:30 GMT",
            "type": "outline"
        },
        {
            "text": "I watched the gun \"debate\" on CNN this morning and had to turn it off. So much shouting and interrupting, slogans and distractions. The gun advocates have it down, they can stop anything from being seriously discussed. On CBS they did a better job, with two advocates, Diane Feinstein and Wayne LaPierre, who were not on a panel and thus no one could interrupt. A much more useful format. On an issue like this, where many of us feel the wounds (I walk on streets with lots of windows every day), it hurt me physically to hear people treat the subject so casually. ",
            "created": "Sun, 08 Oct 2017 15:35:54 GMT",
            "type": "outline",
            "image": "http://static.scripting.com/larryKing/images/2012/11/22/oldFord.gif"
        },
        {
            "text": "Still no one has an answer why it should be possible for one person to shoot 600 people before being stopped. It's as if we made it legal for people to drive tanks on city streets. ",
            "created": "Sun, 08 Oct 2017 15:40:29 GMT",
            "type": "outline"
        },
        {
            "text": "In the aftermath of the <a href=\"https://www.nytimes.com/2017/10/05/us/harvey-weinstein-harassment-allegations.html?_r=0\">NYT story</a> about Harvey Weinstein, and the fact that it was common knowledge in the movie industry that he was an abuser, suppose you were one of the people with that knowledge. What were you supposed to do with that? ",
            "created": "Sun, 08 Oct 2017 15:33:31 GMT",
            "type": "outline"
        },
        {
            "text": "How Facebook controls speech",
            "created": "Sun, 08 Oct 2017 17:16:16 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I have a rule that I don't point to Facebook posts. Rules were meant to be <a href=\"https://www.facebook.com/dave.winer.12/posts/635426309998111?notif_id=1507478092757946&notif_t=feedback_reaction_generic\">broken</a>. It's a story I posted three years ago, about the time I pointed to a <a href=\"http://nakedjen.smallpict.com/2014/10/07/itsAWayToTellYourStoryToShareWhatYouSeeToProcessItDrawConclusionsAndMoveOn.html\">story</a> written by NakedJen. Read all the way to the end, please. ",
                    "created": "Sun, 08 Oct 2017 17:16:52 GMT",
                    "subs": [
                        {
                            "text": "I just got a lecture from Facebook on their community standards.",
                            "created": "Sun, 08 Oct 2017 17:17:28 GMT",
                            "flNumberedSubs": "true",
                            "subs": [
                                {
                                    "text": "First they logged me off everywhere, requiring me to re-enter my password on every system I use Facebook on.",
                                    "created": "Sun, 08 Oct 2017 17:22:32 GMT"
                                },
                                {
                                    "text": "Then a <a href=\"http://static.scripting.com/larryKing/images/2014/10/08/weRemovedSomething.gif\">dialog</a> saying they removed something I posted. (Okay fine, I'll click the button.)",
                                    "created": "Sun, 08 Oct 2017 17:18:07 GMT"
                                },
                                {
                                    "text": "That's not enough. We want you to <a href=\"http://static.scripting.com/larryKing/images/2014/10/08/review.gif\">review</a> the community standards. And then click another button to indicate that you heard us.",
                                    "created": "Sun, 08 Oct 2017 17:18:35 GMT"
                                },
                                {
                                    "text": "What was the offense? It's so silly. A couple of nipples attached to a simple and lovely very Facebookish <a href=\"http://nakedjen.smallpict.com/2014/10/07/itsAWayToTellYourStoryToShareWhatYouSeeToProcessItDrawConclusionsAndMoveOn.html\">post</a> by NakedJen.",
                                    "created": "Sun, 08 Oct 2017 17:19:03 GMT"
                                }
                            ]
                        },
                        {
                            "text": "BTW, it looks like she removed the picture. It was a picture of NJ on the stairway at my old house in Berkeley, naked of course, but with her legs crossed, and arms spread out in the usual NJ way. They have to have their standards, I understand, and nipples are a no-no, this picture crossed the line, but.."
                        },
                        {
                            "text": "Get this:"
                        },
                        {
                            "text": "It was THEIR choice to grab the picture. Not mine. I just linked to her post. Maybe they should lecture their bot, not me."
                        }
                    ]
                },
                {
                    "text": "Postscript, in 2017",
                    "created": "Sun, 08 Oct 2017 17:20:49 GMT",
                    "subs": [
                        {
                            "text": "I don't blame Facebook for this. They tried best they could to keep porn off their site. In my country nipples are considered pornographic. Their software hadn't learned yet to distinguish between photos scraped by their bot, vs photos posted by users. ",
                            "created": "Sun, 08 Oct 2017 17:23:40 GMT"
                        },
                        {
                            "text": "The moral of the story. When you want Facebook to stop political ads aimed at Americans from Russia, that means we're all going to be subjected to this kind of interrogation, not just about nipples, but also about our political values. People who believe you can cut out Russians without interfering with normal speech are naive about how the technology works. ",
                            "created": "Sun, 08 Oct 2017 17:19:25 GMT"
                        }
                    ]
                }
            ]
        }
    ]
}