{
    "text": "October 9",
    "created": "Mon, 09 Oct 2017 13:35:25 GMT",
    "name": "09",
    "subs": [
        {
            "text": "Idea: One team in each league doesn't play the anthem or honor the military, they play the sport and everyone has their own opinions.",
            "created": "Mon, 09 Oct 2017 18:10:11 GMT",
            "type": "outline"
        },
        {
            "text": "Another <a href=\"https://www.zillow.com/homes/for_sale/Taos-NM/house,mobile,land_type/2097659499_zpid/54659_rid/200000-900000_price/742-3338_mp/36.658504,-105.209542,36.061866,-105.768471_rect/10_zm/\">incredible house</a>, an off-the-grid \"earthship\" in <a href=\"https://www.google.com/maps/@36.511086,-105.7499428,10z\">Taos, NM</a>. ",
            "created": "Mon, 09 Oct 2017 13:35:26 GMT",
            "type": "outline"
        },
        {
            "text": "It's not wrong to think beyond Trump. Indulge yourself. You might get some ideas. ;-)",
            "created": "Mon, 09 Oct 2017 15:57:46 GMT",
            "type": "outline"
        },
        {
            "text": "Does anyone take <a href=\"http://www.memeorandum.com/171009/p2#a171009p2\">Pence</a> seriously? A thin veneer of <a href=\"https://en.wiktionary.org/wiki/ersatz\">ersatz</a> Reagan, under which is the soul of <a href=\"https://www.youtube.com/watch?v=fsWJ6JnwuAw\">Rush Limbaugh</a>. ",
            "created": "Mon, 09 Oct 2017 13:52:31 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/embed/fsWJ6JnwuAw"
        },
        {
            "text": "I now have the ability to attach a video to a node, as illustrated in the post above. I just set the <i>urlvideo</i> attribute on the node. It assumes the same HTML embed code works as would work for YouTube, so theoretically it can be used to embed videos not hosted on YouTube. Now here's the Grateful Dead performing Uncle John's Band to wash away the taste of Rush Limbaugh. ",
            "created": "Mon, 09 Oct 2017 14:19:17 GMT",
            "type": "outline"
        },
        {
            "text": "When life looks like easy street, there is danger at your door.",
            "created": "Mon, 09 Oct 2017 14:24:53 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/embed/n4-_V__GUro"
        },
        {
            "text": "Programming won't really take off as an art until we accept a certain basic set of tools that more or less remain constant. As long as the debate is at such a fundamental level as synchronous or asynchronous, and we keep flip-flopping back and forth, we'll never get to the next level of refinement. It's as if great cooks couldn't agree on knives, forks, spatulas, frying pans, collanders, etc. These tools have been around for centuries. Not that they haven't been evolving, but they do it slowly. We really do know at this point the basic tools of programming. There haven't been many new ideas in the time I've been active, and that's about as long as anyone.  ",
            "created": "Mon, 09 Oct 2017 14:34:13 GMT",
            "type": "outline"
        },
        {
            "text": "A <a href=\"https://twitter.com/JRart/status/917152293111435265\">picnic</a> meant to be seen from a drone. ",
            "created": "Mon, 09 Oct 2017 15:12:55 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/JRart/status/917152293111435265"
        }
    ]
}