{
    "text": "October 10",
    "created": "Tue, 10 Oct 2017 14:18:13 GMT",
    "name": "10",
    "subs": [
        {
            "text": "10-minute <a href=\"http://scripting.com/2017/10/10/aboutHarveyWeinstein.m4a\">podcast</a> on Harvey Weinstein, in two parts, two stories. Please listen generously and be kind in your criticism. ",
            "created": "Tue, 10 Oct 2017 20:14:26 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2017/10/10/aboutHarveyWeinstein.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "5286818"
        },
        {
            "text": "<a href=\"https://twitter.com/lizziejohnsonnn/status/917533047917916160\">Video</a> of the destruction in the California fires. ",
            "created": "Tue, 10 Oct 2017 23:08:30 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/lizziejohnsonnn/status/917533047917916160"
        },
        {
            "text": "It's a good time for one of the universities to have a one-day training for reporters on how Facebook ads work. How to use the software. Let's get in front of the problem before news makes another mess like the one with Hillary's email. ",
            "created": "Tue, 10 Oct 2017 23:03:19 GMT",
            "type": "outline"
        },
        {
            "text": "If you find yourself saying someone else must shut up, you're very likely wrong.",
            "created": "Tue, 10 Oct 2017 19:49:26 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/10/03/girlWithBalloon.png"
        },
        {
            "text": "Carl Sagan used to <a href=\"https://www.youtube.com/watch?v=wLigBYhdUDs\">say</a> that humanity is the cosmos becoming self-aware, coming to \"know itself.\" I always thought that was a super elegant idea. Well, Bob Corker saying the White House is adult day care is, in a similar way, the United States deciding to know itself, to tell itself the truth. Now reporters can quote him, saying what they could easily have said before, and imho should have. News has become news for lawyers. They're all trying to prove what's obvious, that we're reeling and teetering and sputtering on the edge of a cliff, with a guy juggling nukes in both hands and while they're in the air tweeting insults at everyone and anyone. It's as if Don Rickles and Joan Rivers were running the world, and they weren't just comedians. ",
            "created": "Tue, 10 Oct 2017 16:36:57 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/embed/wLigBYhdUDs"
        },
        {
            "text": "<a href=\"https://github.com/scripting/Scripting-News/issues/35\">SQL question</a>: When I say a value is varchar (255) does that mean in every row it takes up 255 chars in the database? ",
            "created": "Tue, 10 Oct 2017 17:56:26 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=phaDyPNnIKg\">Jon Stewart</a> on Trump with Colbert. The best.  ",
            "created": "Tue, 10 Oct 2017 23:51:11 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/embed/phaDyPNnIKg"
        },
        {
            "text": "Yesterday I did an interview with <a href=\"http://www.internethistorypodcast.com/author/brian-mccullough/\">Brian McCullough</a> of the <a href=\"http://www.internethistorypodcast.com/\">Internet History Podcast</a>. We talked about many of the things you'd expect. When we got to podcasting, I realized his was exactly the kind of podcast I hoped would emerge when we did the work in the early-mid 2000s. Something that starts out as a hobby, a passion, an idea, and develops into real media with regular listeners. A <a href=\"http://scripting.com/davenet/2003/07/31/chrisLydonsWeblogForTheEar.html\">weblog for the ears</a> is what I called it back then. I'll let you know when the interview is available. ",
            "created": "Tue, 10 Oct 2017 15:05:06 GMT",
            "type": "outline",
            "image": "http:///scripting.com/images/2017/10/10/mrMet.png"
        },
        {
            "text": "BTW, you want to know how <a href=\"http://scripting.com/2017/10/10.html#a102156\">disgusted</a> I was with Maddow? I switched stations to watch the <i>Yankees</i> in the playoffs. I might have to get my head examined. The Yankees <a href=\"http://www.nydailynews.com/sports/baseball/yankees/yankees-putting-pressure-cracking-indians-entering-game-5-article-1.3552646\">won</a>, btw. And oddly enough I find myself rooting for them (really need to see a doctor). Why? Well Cleveland is favored to win it all this year. And I love to see the favorites get knocked off their perch. Same reason I pull against the Warriors. That the Yankees are underdogs now doesn't really mean that I don't hate the concept of the Yankees. I do.",
            "created": "Tue, 10 Oct 2017 15:12:01 GMT",
            "type": "outline"
        },
        {
            "text": "Another BTW, Brian thought, like virtually everyone I meet, that I am a Brooklyn boy. Not so. Why do they think that? Wikipedia incorrectly states that I am a Brooklyn native. I was born in a hospital in Brooklyn, that much is true. But I grew up in Queens. First in <a href=\"https://en.wikipedia.org/wiki/Jackson_Heights,_Queens\">Jackson Heights</a>, and then in <a href=\"https://en.wikipedia.org/wiki/Auburndale,_Queens\">north Flushing</a> (near Whitestone and Bayside). Ask anyone from Queens in that era if they came from Brooklyn (as I said on the podcast) and you're likely to get a (virtual) punch in the nose. And that, my friends, is where my hatred of the Yankees comes from. These days you see people wearing Yankees hats in Queens, but not when I lived there. ",
            "created": "Tue, 10 Oct 2017 15:14:04 GMT",
            "type": "outline"
        },
        {
            "text": "I turned off Maddow last night in disgust",
            "created": "Tue, 10 Oct 2017 14:21:56 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Last night I turned off the Rachel Maddow show in disgust. Never thought that would happen. They're going after Facebook on the flimsiest of pretense. She made it sound like there was collusion, something nefarious, as if Zuckerberg had sold out the United States to Russia to make Facebook richer. ",
                    "created": "Tue, 10 Oct 2017 14:22:04 GMT",
                    "image": "http:///scripting.com/images/2017/10/10/maude.png"
                },
                {
                    "text": "I have no idea why they're doing it, but it was coordinated. Ari Melber, earlier in the evening, became a panelist on his own show, and expressed the same ridiculous ideas. So much so that longtime tech journalist <a href=\"https://twitter.com/DavidKirkpatric\">David Kirkpatrick</a> started interviewing Melber. Melber was full of it, but Kirkpatrick was more polite. It doesn't reflect well on the rest of MSNBC's reporting.",
                    "created": "Tue, 10 Oct 2017 14:22:39 GMT"
                },
                {
                    "text": "I don't know what they're doing, it was never exactly journalism, but now it's become total advocacy. It's wrong and dishonest and as fake as anything you hear on Fox. I'll give her another try, maybe there's an innocent explanation, but they crossed over into something mean and evil last night, and I'm not going to support that. ",
                    "created": "Tue, 10 Oct 2017 14:23:32 GMT"
                },
                {
                    "text": "BTW, I am not a fan of Facebook, the company or the product, or Zuck. I do think they're evil, but not very likely in the way that Maddow et al say. Maybe it'll turn out they're onto something, then I'll apologize. But I think the odds of that are miniscule. ",
                    "created": "Tue, 10 Oct 2017 14:37:49 GMT"
                },
                {
                    "text": "Like I said I don't know what they're trying to do but whatever it is I'm sure it will end up restricting the First Amendment rights of users of the net. I don't think most  journalists give a damn about that, they care about their rights, not ours. Never have I seen a better demo of that than last night on Maddow, a former hero of mine. ",
                    "created": "Tue, 10 Oct 2017 14:26:38 GMT"
                }
            ]
        }
    ]
}