{
    "text": "October 12",
    "created": "Thu, 12 Oct 2017 14:26:06 GMT",
    "name": "12",
    "subs": [
        {
            "text": "<a href=\"https://github.com/scripting/Scripting-News/issues/37\">Braintrust query</a>: Error handling in mySQL package in Node. ",
            "created": "Thu, 12 Oct 2017 14:29:10 GMT",
            "type": "outline"
        },
        {
            "text": "\"Little Outliner\" tip: If you keep LO2 open all day every day, when you start work in the morning, reload the page. There's some kind of performance issue in the app that causes it to get slow if you leave it running too long. Reloading the page is the same as quitting and relaunching an app. \"Fargo\" didn't have this issue. I must be doing something differently, but I don't know what it is. <i>Still diggin!</i>",
            "created": "Thu, 12 Oct 2017 14:26:07 GMT",
            "type": "outline"
        },
        {
            "text": "A <a href=\"https://twitter.com/davewiner/status/918491881960558596\">message</a> to people who are angry at Twitter. ",
            "created": "Thu, 12 Oct 2017 15:31:45 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/918491881960558596"
        },
        {
            "text": "It seems to some, all men are responsible for the worst of men. It's analogous to blaming all Muslims for the acts of \"Muslim\" terrorists. It's one of the reasons I talk about \"Christian terrorists\" -- to make the point that it's a form of racism to connect a religion to the acts of murderers. So perhaps, instead of talking <a href=\"https://www.newyorker.com/culture/jia-tolentino/how-men-like-harvey-weinstein-implicate-their-victims-in-their-acts\">about</a> \"men like Harvey Weinstein,\" try \"rapists like Harvey Weinstein.\" That would help. ",
            "created": "Thu, 12 Oct 2017 14:44:56 GMT",
            "type": "outline"
        },
        {
            "text": "BTW, I look like Harvey Weinstein. So I realllllly resent it when people say he looks a certain evil way. Please. The awful stuff isn't on the surface. That's why body shaming is the worst thing. And it applies to men too. ",
            "created": "Thu, 12 Oct 2017 14:49:13 GMT",
            "type": "outline"
        },
        {
            "text": "It's a good time for the closing <a href=\"https://twitter.com/davewiner/status/918503175468060674\">monolog</a> in Killing Them Softly.",
            "created": "Thu, 12 Oct 2017 15:47:11 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/918503175468060674"
        },
        {
            "text": "Idea for a new social net: Last night <a href=\"https://en.wikipedia.org/wiki/Doc_Searls\">Doc Searls</a> was in one of my dreams. I don't remember what we were doing. But it was nice to see him. What if there were a place I could go to record that event. And what if by chance Doc recorded that I was in <i>his</i> dream last night. Then we'd know there was some kind of cosmic connection. How would we know if we don't have an app for it?  :boom:",
            "created": "Thu, 12 Oct 2017 14:30:18 GMT",
            "type": "outline"
        },
        {
            "text": "I see parallels in the way people attack Twitter today and the way the music industry reacted to Napster in 2000. The great thing about Napster was that ALL the music was there. And it sort of had an API. It could have developed into a music operating system. But it was attacked, and broken into pieces. And once that happens you know they almost never come back together. ",
            "created": "Thu, 12 Oct 2017 15:23:04 GMT",
            "type": "outline"
        },
        {
            "text": "An email to Doc worth preserving",
            "created": "Thu, 12 Oct 2017 16:50:39 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Hey it's like everything. I'm amazed that we still listen to journalists. I finally got re-awoken when I heard Rachel Maddow ranting about FB ads and Russia the other day. Did she somehow think that a human being at Facebook could have been involved in the content of the ad or who it was targeted at? It's all based on keywords and pointers to stuff on the web. ",
                    "created": "Thu, 12 Oct 2017 16:50:46 GMT",
                    "image": "http:///scripting.com/images/2017/10/12/redPill.png"
                },
                {
                    "text": "And how could Russians possibly know how to speak American English or know what our divisive issues are? Well they could have gone to school here. We are a remarkably open society. They could read academic journals, or watch conferences on livestreams, or even go to the conferences. They could read Nate Silver and Jon Chait and many others, the same columnists that Rachel Maddow and Chris Hayes read. Russia must have people who do what our CIA does. Read everything they can get their hands on and look for all kinds of changes and vulnerabilities. How do they think espionage works? You think they need help from Cambridge Analytica? Maybe there is a linkup there, I hope so -- but you're insulting our intelligence if you think the Russians can't carefully study us, the way we certainly study them.",
                    "created": "Thu, 12 Oct 2017 16:51:11 GMT"
                },
                {
                    "text": "I came away wishing they'd do a one-day training for journalists about how Facebook ads work. If they don't learn we're going to have the same kind of debacle that we had w Hillary's emails. "
                }
            ]
        }
    ]
}