{
    "text": "October 13",
    "created": "Fri, 13 Oct 2017 13:37:26 GMT",
    "name": "13",
    "subs": [
        {
            "text": "JY is helping with <a href=\"https://github.com/scripting/Scripting-News/issues/37\">yesterday's query</a>. 2nd opinion(s) sought.",
            "created": "Fri, 13 Oct 2017 16:00:51 GMT",
            "type": "outline"
        },
        {
            "text": "A Twitter <a href=\"https://twitter.com/davewiner/status/918930070772899841\">thread</a> I wrote without benefit of \"Electric Pork\". Freestyle. I think it's pretty good. It starts out like this: \"Twitter users who think you are a customer. You are not a customer. You are the product.\"",
            "created": "Fri, 13 Oct 2017 20:14:21 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/918930070772899841"
        },
        {
            "text": "I knew when I saw the web that's what I had been born to do. Just because people want to use Facebook doesn't change that simple fact.",
            "created": "Fri, 13 Oct 2017 16:08:43 GMT",
            "type": "outline"
        },
        {
            "text": "The last <a href=\"https://twitter.com/davewiner/status/918872261343444992\">phone booth</a> in Manhattan, possibly.",
            "created": "Fri, 13 Oct 2017 16:13:25 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/918872261343444992"
        },
        {
            "text": "One thing's for sure, if we want to have a chance to survive we're going to have to start seeing the good in each other.",
            "created": "Fri, 13 Oct 2017 13:54:43 GMT",
            "type": "outline"
        },
        {
            "text": "Yes indeed NYT, <a href=\"https://www.nytimes.com/interactive/2017/10/13/opinion/sunday/Silicon-Valley-Is-Not-Your-Friend.html?_r=0\">Silicon Valley is not your friend</a> but the <a href=\"http://scripting.com/liveblog/users/davewiner/2016/01/07/0801.html\">open web</a> is. As often is the case, corporate media has trouble seeing anything but corporate tech. But before there were tech companies, there was the web, which sprung from academia. It instantly wiped out the business models the tech industry had for networking, all of which were designed to lock users in. It took a couple of decades for Silicon Valley to re-establish lock-in, at least partially because news let them take over their distribution system. It may not be too late for the <a href=\"http://scripting.com/liveblog/users/davewiner/2015/12/27/0724.html\">open web</a>, but it needs a lot of help. ",
            "created": "Fri, 13 Oct 2017 13:37:27 GMT",
            "type": "outline",
            "image": "http:///scripting.com/images/2017/10/13/fatcat.png"
        },
        {
            "text": "Michelle Goldberg <a href=\"https://www.nytimes.com/2017/10/13/opinion/put-women-in-charge.html\">writes</a> about sexual harassment. She has only experienced it once, in college. Her theory, she has only worked in organizations with women at the top. That fosters an environment of respect. ",
            "created": "Fri, 13 Oct 2017 13:45:37 GMT",
            "type": "outline"
        },
        {
            "text": "Why I empathize with Twitter",
            "created": "Fri, 13 Oct 2017 18:34:13 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "In 2003, almost by accident, the company that I founded but had left, surprised me by directing requests to a popular domain to one of my colocated servers. I tried to keep it running but there was too much traffic. I couldn't do the work required to stabilize the service, i had a new job and my health was still iffy after heart surgery, and I would have had to buy a bunch more servers, and there was no revenue to support it. So I had to turn the service off. Really the only choice was to risk my health, and spend a lot of money. ",
                    "created": "Fri, 13 Oct 2017 18:34:29 GMT"
                },
                {
                    "text": "A few of the users went on a campaign aimed at punishing me personally. Many of them had empty sites on the service, they had never published anything, so they didn't have anything at stake. I completely disclosed what happened. None of the bloggers referred to my post or the podcast I did explaining. They kept right on attacking. I appealed to blogging friends but they wouldn't say anything in my defense. ",
                    "created": "Fri, 13 Oct 2017 18:35:43 GMT"
                },
                {
                    "text": "Eventually the story was covered by mainstream journalists, and guess what -- they listened, and told my side of the story too. The ranters wanted something else, certainly not the truth. Most of the users just wanted their sites back. Quietly I worked with them, and got every one who wanted one a backup of their sites, personally, on my own time. ",
                    "created": "Fri, 13 Oct 2017 18:36:11 GMT"
                },
                {
                    "text": "I waited it out, they got tired I guess, but never forgot how awful they were. That's why I empathize with Twitter. ",
                    "created": "Fri, 13 Oct 2017 18:36:10 GMT"
                }
            ]
        }
    ]
}