{
    "text": "October 24",
    "created": "Tue, 24 Oct 2017 13:11:47 GMT",
    "name": "24",
    "subs": [
        {
            "text": "<a href=\"https://www.nytimes.com/2017/10/24/us/politics/jeff-flake-transcript-senate-speech.html?_r=0\">Jeff Flake</a> and I have opposite politics, but today I'm proud of him as a fellow American. We need more courage like his.",
            "created": "Tue, 24 Oct 2017 20:32:48 GMT",
            "type": "outline"
        },
        {
            "text": "Journalism is to Facebook as app devs are to Apple. Both are headed to the same place. Journalism must break out of the silos and become independent of Silicon Valley. The news product on Facebook is low quality. We need better. Editors whose job it is to keep the quality of the feed up. Without tech's involvement. We work best (devs) when we serve the news, not the other way around. The open web has been ready to work with journalism all along, now you all have to open the door just a bit to let us (back) in. We can't give you any money, sorry. But are anxious to give you great new tech. Thanks. ",
            "created": "Tue, 24 Oct 2017 15:20:15 GMT",
            "type": "outline",
            "image": "http:///scripting.com/images/2017/10/24/elizabethWarren.png"
        },
        {
            "text": "<a href=\"https://politicalwire.com/2017/10/24/exchange-of-the-day-59/\">Taegan Goddard</a>: \"Sen. Bob Corker (R-TN) gave an extraordinary interview to Savannah Guthrie on the Today Show.\"  What was so extraordinary? He told the truth. So much of what you hear on the news is lies that it's extraordinary when a politician says something so obviously true, any child could see.  Maybe we should take a step back and re-evaluate. Should we even let politicians on TV if all they're going to do is lie? What does that say about us as voters?",
            "created": "Tue, 24 Oct 2017 13:11:48 GMT",
            "type": "outline"
        },
        {
            "text": "I did something unusual yesterday, I skipped a day of blogging. Can't remember the last time I did that. ",
            "created": "Tue, 24 Oct 2017 13:14:42 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"http://scripting.com/davenet/1998/01/01/menStaySilent.html\">1998</a>: \"When you're ready to hear what men have to say, men will say more.\"",
            "created": "Tue, 24 Oct 2017 15:56:24 GMT"
        }
    ]
}