{
    "text": "Geographic welcomes",
    "created": "Thu, 24 Aug 2017 14:21:18 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "The other day my friend Francine Hardaway expressed concern, on Facebook, that people would think less of Phoenix because President Trump chose to give his dogwhistle-laced race-baiting hate-speech there. She wants smart reasonable people to locate there, and was concerned that people would think less of Phoenix because <i>El Orange</i> decided to throw his flames there. I assured her that nothing could be further from the truth. ",
            "created": "Thu, 24 Aug 2017 14:21:24 GMT",
            "subs": [
                {
                    "text": "<i>You're doing a good job of spreading the word. Until now I didn't know </i>anyone<i> was trying to get good people to move anywhere. Seriously. I've been suggesting that broadly. It wouldn't be hard to associate a geography with a new technology, just try to encourage a few people leading in the tech to move there. Imagine if there were no NBA and there are a few Steph Curry's floating around out there unaffiliated. Give them a university to play in, students to develop, and money to build what they need to build. And a nice place to live with a hot tub and a swimming pool and nice views and good bike riding and we're all set.</i>",
                    "created": "Thu, 24 Aug 2017 14:30:23 GMT"
                }
            ]
        },
        {
            "text": "Then this morning Thomas Madsen-Mygdal, founder of the excellent Reboot conference and many startups, also on Facebook, wanted to know what he should tell the new Danish tech ambassador to do. I had advice, similar to what I said to Francine. ",
            "created": "Thu, 24 Aug 2017 14:23:17 GMT",
            "subs": [
                {
                    "text": "<i>Do things to bring open tech to Denmark, to undermine the control big tech companies have over our means of communication. Focus on people not companies, the companies will follow. That's how Silicon Valley itself got to where it is.</i>",
                    "created": "Thu, 24 Aug 2017 14:28:51 GMT"
                }
            ]
        },
        {
            "text": "No one as far as I know lays out a welcome mat for people who are technologically creative. My opinion is based on looking for them. Silicon Valley is not one of those places. They are looking for cogs that fit into machines. They want to do the disrupting, and want to keep their power and money. I just want to make cool stuff that makes people more free. ",
            "created": "Thu, 24 Aug 2017 14:24:16 GMT"
        },
        {
            "text": "Denmark is pretty cool and Phoenix is hot. Some place where other people who love free tech congregate, where there's a hot tub and a swimming pool, a place to ride my bike and a free attitude about art and lifestyles, that wants a free and open developer community, that would be a place a lot of interesting people would come to. Of course Google and Facebook et al will open offices there. Then you won't have to take the red eye to Cupertino to be influential. They'll come <i>to you. </i>(Which is the true secret to being influential.)",
            "created": "Thu, 24 Aug 2017 14:25:40 GMT"
        },
        {
            "text": "<i>Note: I don't link to posts on Facebook. </i>",
            "created": "Thu, 24 Aug 2017 14:21:38 GMT"
        }
    ]
}