{
    "text": "Medium 3.0",
    "created": "Thu, 24 Aug 2017 15:23:23 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I got an email from Product Hunt yesterday announcing <a href=\"https://www.producthunt.com/posts/medium-3-0\">Medium 3.0</a>.",
            "created": "Thu, 24 Aug 2017 15:23:27 GMT"
        },
        {
            "text": "The page doesn't provide a narrative, a bulleted list saying how I should think about the new release. I did read <a href=\"https://www.theverge.com/2017/8/22/16180150/medium-paywall-articles-claps-author-payments\">one</a> of the trade websites, but they mostly talked about the new business model based on \"claps.\" It could be that's the main new thing about 3.0.",
            "created": "Thu, 24 Aug 2017 15:23:43 GMT",
            "image": "http:///scripting.com/images/2017/08/24/gecko.png"
        },
        {
            "text": "I've always been critical of Medium, not the software, but what they were doing to the community of individual web writers, people who <a href=\"http://scripting.com/2017/07/31.html#a091728\">blog</a>. At this point I'm not concerned about that. We're in the long tail of the demise of Medium. They'll try this, and something else, and then another thing, each with a smaller probability of making a difference, until they turn it off. At that point, if that happens (disclaimer: I'm often wrong), it will be a disaster. A lot of important stuff was published on Medium over the years. ",
            "created": "Thu, 24 Aug 2017 15:25:39 GMT"
        },
        {
            "text": "But imho Medium still has a bullet in the chamber. They can stop being a silo and become a foundation others can build on, not just a way for writers to make money. Invest in open sourcing all of it, commit to keeping the servers up indefinitely (possibly make a deal with a university) and then invest in the projects that develop out of it. I think it's a reasonable bet, and the best one available at this time to Medium shareholders. ",
            "created": "Thu, 24 Aug 2017 15:28:25 GMT"
        }
    ]
}