{
    "text": "Doc Quixote",
    "created": "Sat, 01 Oct 2022 13:38:34 GMT",
    "type": "outline",
    "description": "I don't want to shake the world. I want to have fun with my friends. That's it.",
    "metaImage": "http://scripting.com/images/2022/10/01/soFiStadium.png",
    "subs": [
        {
            "text": "I had a longish phone talk with <a href=\"https://en.wikipedia.org/wiki/Doc_Searls\">Doc Searls</a> a couple of days ago. Then he <a href=\"https://blogs.harvard.edu/doc/2022/09/30/from-hollywood-park-racetrack-to-sofi-stadium/\">wrote a post</a>  about a series of photos he took over 17 years, on airplanes approaching <a href=\"https://en.wikipedia.org/wiki/Los_Angeles_International_Airport\">LAX</a>, of a famous <a href=\"https://en.wikipedia.org/wiki/Hollywood_Park_Racetrack\">horse track</a> as it changed over the years, and eventually was torn down and a <a href=\"https://en.wikipedia.org/wiki/SoFi_Stadium\">football stadium</a> was built in its place. ",
            "created": "Sat, 01 Oct 2022 13:26:28 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I've known Doc for a long time, and I've seen at least two sides of the man. On one side is <b>Doc Quixote</b> who is ranting about <a href=\"https://cyber.harvard.edu/people/dsearls\">windmills</a>. He's great with words so he comes up with memorable ways of expressing the ideas. And Doc is the most <a href=\"https://en.wiktionary.org/wiki/affable\">affable</a> person I've ever known, so they love him as he rants at them. And the things Doc rants about <i>are</i> what we need to do <i>now</i> to start to be free. In other words he's right. But as we've grown old as friends I'm pretty certain that Doc will not live to see his ideas become reality. And nor will I, for my dream. I spent great time, energy and money, over many years to create the writing and programming environment I wanted to use and I wanted my peers to use, so we could <b>work together</b> to create species-saving communication tools, and just beauty -- nothing wrong with that. ",
            "created": "Sat, 01 Oct 2022 13:39:20 GMT",
            "flInCalendar": true
        },
        {
            "text": "An aside, when I read the story of <a href=\"https://en.wikipedia.org/wiki/David_Bowie\">David Bowie's</a> <a href=\"https://en.wikipedia.org/wiki/Death_of_David_Bowie\">last days</a>, he did something amazing when he knew he had a short time to live. He stepped back and got out of the way. He understood this is no longer his world. I think we could all benefit from learning that earlier in life. ",
            "created": "Sat, 01 Oct 2022 13:47:02 GMT",
            "flInCalendar": true
        },
        {
            "text": "When you're young, you think expansively, and as you get old reality sinks in and your imagination contracts. The horizon gets closer and closer. We don't get to mold the world, we are not gods, no matter how good or generous, smart of ruthless you may be, we all start out young and if we're lucky we get old and then we're gone. Nothing you did in your life will exist after you're gone. I own this, as a 67-year-old man, as I decide what to do each day. I don't want to shake the world. <i>I want to have fun with my friends.</i> That's it. And that's just right. ",
            "created": "Sat, 01 Oct 2022 13:45:41 GMT",
            "flInCalendar": true
        },
        {
            "text": "Then I think about my friend Doc, and the things he accomplished by <b>Just Being Doc</b>, doing the things he'd do anyway no matter the dragons he's slaying. He would take pictures of construction projects from airplanes over 17 years. He would know literally everything about broadcast radio. And he'd be very affable while doing all that. Those I think are the things that matter. It makes no sense to be a billionaire or an autocrat. Ideas will happen when it's their time, totally independent of what you do. ",
            "created": "Sat, 01 Oct 2022 13:46:59 GMT",
            "flInCalendar": true
        },
        {
            "text": "There are a bunch of ideas along this line in a <a href=\"https://twitter.com/davewiner/status/1576118495380529152\">thread</a> I wrote this morning all around DQ and JBD, and how the pattern is in my life-work too. I'll probably write more about that later.",
            "created": "Sat, 01 Oct 2022 13:51:13 GMT",
            "flInCalendar": true
        },
        {
            "text": "If you want, <a href=\"https://www.youtube.com/watch?v=xwtdhWltSIg\">play this song</a>, and go back to the top and read the story again. ",
            "created": "Sat, 01 Oct 2022 13:58:58 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}