{
    "created": "2025-01-03T05:00:00.000Z",
    "flInCalendar": true,
    "name": "03",
    "path": "2025/01/03",
    "text": "January 03",
    "type": "calendarDay",
    "subs": [
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=lhMDoBFYDmA\">Knicks on Friday night</a>: A big offline day here in the mountains, the show will resume tomorrow bright and early, Murphy-willing. Enjoy tonight's <a href=\"https://www.si.com/nba/thunder/news/okc-thunder-vs-new-york-knicks-1-3-updated-injury-report-betting-odds\">Knicks game</a> in OKC. Should be a great game. :smile:",
            "created": "Sat, 04 Jan 2025 01:00:24 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=lhMDoBFYDmA",
            "flInCalendar": true
        },
        {
            "text": "Gambling, sports, kids",
            "created": "Sat, 04 Jan 2025 01:45:48 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "<a href=\"https://paulkrugman.substack.com/p/the-plot-to-poison-childrens-minds\">Krugman writes</a> about social media is poisoning children's minds. ",
                    "created": "Sat, 04 Jan 2025 01:46:12 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I like that Krugman has resumed his blogging. ",
                    "flInCalendar": true
                },
                {
                    "text": "This means that sometimes I agree or disagree, or have mixed opinions, but I always learn something. That's what makes a blogger good imho.",
                    "flInCalendar": true
                },
                {
                    "text": "I don't know if I agree that children's minds are being poisoned. But I am pretty sure when people like Krugman and myself reach a certain age, and we are the same age, we start looking at new media that way. Maybe <i>our</i> minds are poisoned. My father called television the \"idiot box.\" But it eventually became the literature of my generation, often very good. But maybe laws can help.",
                    "created": "Sat, 04 Jan 2025 01:47:50 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "One thing I am sure of is that sports is being ruined by gambling. I can't imagine that a parent in 2025 would let their kids watch the NBA on TV, because it makes gambling appear to be a normal part of being a fan. Yet the NBA, which has a reputation of being socially forward-thinking, has swallowed the pill, and gambling is an integral part of coverage of the NBA now. ",
                    "created": "Sat, 04 Jan 2025 01:50:41 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Same with the NFL, MLB and tennis. ",
                    "created": "Sat, 04 Jan 2025 01:48:41 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "And is this why they can now afford to <a href=\"https://www.mlb.com/news/juan-soto-agrees-to-contract-with-mets\">sign players</a> to $765 million contracts? ",
                    "created": "Sat, 04 Jan 2025 01:52:28 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "They're all getting hugely rich, but I believe that they are certainly doing great harm to the new sports fans growing up now. ",
                    "flInCalendar": true
                },
                {
                    "text": "I am a no apologist for being a sports fan. I love the Mets and the Knicks, have flirted with the Niners, and have a place in my heart for the Cubs and Red Sox, and I know that gambling spoils what's fun about sports, can turn it into an awful addiction. I manage to be a fan without ever having bet on a game, even just a bet between friends. I don't see it as part of sports. It wasn't the way my family enjoyed sports. ",
                    "created": "Sat, 04 Jan 2025 02:47:29 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I was a math major and a 50+ year programmer, and I know that if you gamble enough you lose all your money. And as an addiction no gambler ever gets up from the table to enjoy their winnings when they win.",
                    "created": "Sat, 04 Jan 2025 01:46:33 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PS: I wrote this <a href=\"https://daveverse.wordpress.com/2025/01/01/gambling-has-infested-sport-in-new-unacceptable-ways/\">post</a> in WordLand on New Years Day, saving it for a good moment on Scripting.",
                    "created": "Sat, 04 Jan 2025 01:46:34 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}