{
    "created": "2025-01-09T05:00:00.000Z",
    "flInCalendar": true,
    "name": "09",
    "path": "2025/01/09",
    "text": "January 09",
    "type": "calendarDay",
    "subs": [
        {
            "text": "If you read this blog, I hope you'll take the time to listen to <a href=\"https://shownotes.scripting.com/scripting/2025/01/08/howIViewWordpress.html\">yesterday's podcast</a>. It's all about WordPress, a product that you won't read much about on this blog, going back through the <a href=\"https://www.google.com/search?q=site:scripting.com+wordpress\">archive</a>. I wasn't paying attention until 2023 when I began to see what an amazing product it is, not just for 2004 when it came out, but in 2024. My theory is that it's the basis for an incredible social web platform, much better than Threads, Mastodon, Bluesky and of course Twitter. That's what I'm talking about for 1/2 hour in this podcast. If you give me that much time, I'll change the way you see the world, or at least the way you see me. I think I'm right about this, with another layer on top of the WordPress foundation, it becomes newly relevant, and very timely, in ways that as far as I know, no one has been pushing it. I think for example that Ghost and Substack should be built on top of WordPress. The fact that they aren't gives a clue as to how portable your work is there, and how little choice you get in writing tools. Anyway, please make the time to listen. This is pivotal, and I don't think I'll ever be able to spell it out in writing, it's pure storytelling. Thanks!",
            "created": "Thu, 09 Jan 2025 14:43:27 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2022/11/28/ifyoudontlikethenews.png",
            "flInCalendar": true
        },
        {
            "text": "I started a <a href=\"https://github.com/scripting/Scripting-News/issues/316\">thread</a> for questions and comments re the podcast.",
            "created": "Thu, 09 Jan 2025 15:07:03 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Dear president Biden",
            "created": "Thu, 09 Jan 2025 14:08:17 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2025/01/09/carterFamily.png",
            "subs": [
                {
                    "text": "We demand that the Department of Justice to release <i>all</i> the special counsel reports behind the indictments of former president Trump. ",
                    "created": "Thu, 09 Jan 2025 14:09:15 GMT",
                    "image": "http://scripting.com/images/2023/02/28/presidentCarter.png",
                    "flInCalendar": true
                },
                {
                    "text": "Now, before the next government gets to do what <a href=\"https://apnews.com/article/donald-trump-ap-top-news-politics-russia-reggie-walton-fe8eee387b53888c478a24021fc101aa\">Barr did</a> to the Mueller Report, or worse? ",
                    "created": "Thu, 09 Jan 2025 14:16:54 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "We have a right to see what led to the indictments.",
                    "created": "Thu, 09 Jan 2025 14:12:48 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Now is the time to speak up, for once, it really matters. ",
                    "created": "Thu, 09 Jan 2025 14:10:42 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Let's make the earth shake for the Biden and Garland. ",
                    "created": "Thu, 09 Jan 2025 14:10:52 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It's time for one last chance to not be a scared Democrat. ",
                    "created": "Thu, 09 Jan 2025 14:11:03 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Speaking up is often a pointless exercise on the net, but this is one of those times when it could really make a difference. ",
                    "created": "Thu, 09 Jan 2025 14:08:50 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}