{
    "created": "2025-01-14T05:00:00.000Z",
    "flInCalendar": true,
    "name": "14",
    "path": "2025/01/14",
    "text": "January 14",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Why are all the people who hate AI so pissy about it. ",
            "created": "Tue, 14 Jan 2025 20:24:34 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "In the future I will be able to type a post into my blog and people who are following me will see it in their timeline.  ",
            "created": "Tue, 14 Jan 2025 20:15:22 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Peeve: TV shows or movies that show text messages that are impossible to read even if you stop the video and zoom in.",
            "created": "Tue, 14 Jan 2025 20:10:12 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "An internet of ideas",
            "created": "Tue, 14 Jan 2025 13:11:16 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I used to use Twitter for middle of the night ideas. These days I use one of Twitter's successors.   ",
                    "created": "Tue, 14 Jan 2025 12:59:26 GMT",
                    "type": "outline",
                    "flInCalendar": true
                },
                {
                    "text": "<a href=\"https://bsky.app/profile/scripting.com/post/3lfowjw3z6k2d\">Here's one</a>. \"We should be able to tweet from within any application that has the ability to create and edit text, and not just in tiny little text boxes.\" <a href=\"https://bsky.app/profile/scripting.com/post/3lfowjw4jrs2d\">And another</a>. \"The limits imposed by twitter initially in 2006 resulted in there being room for only very simple ideas. ",
                    "created": "Tue, 14 Jan 2025 13:20:59 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Self-contained isolated silos make progress impossible. We need an internet of ideas. Why should we depend on one small vulnerable company to handle all our internet publishing? It’s an old outdated idea. Look where our investment in Twitter left us, nomads searching for a new home, and what did we do, we went for basically the same deal as before. Oy. ",
                    "created": "Tue, 14 Jan 2025 13:21:27 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Re silos, are you watching the Apple TV+ series <a href=\"https://en.wikipedia.org/wiki/Silo_(TV_series)\">Silo</a>? I don't want to spoil it, but their idea of a silo is more less exactly what we're talking about with the silos or semi-silos of the twitter-like era. They know being a silo is not popular so they do little things to give you reason to believe they might not be a silo. But being a partial silo is like being partially pregnant. No such thing. If you're federated that means you peer with your competitors. Facebook, or whatever you call Mark Xuckerberg's company these days, just <a href=\"https://www.404media.co/meta-is-blocking-links-to-decentralized-instagram-competitor-pixelfed/\">cut off</a> an Instagram competitor and completely gave away that federation is a very conditional thing for them, even if a user of Instagram might also want to hook into flow from <a href=\"https://pixelfed.org/\">Pixelfed</a>. I never believed in their support of the fediverse. Now let's get some reality into these discussions. ",
                    "created": "Tue, 14 Jan 2025 13:21:47 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "<a href=\"https://bsky.app/profile/scripting.com/post/3lfoxxs7gy22x\">On Unix</a>. \"Learning Unix was when I learned that computer networks could be simple yet infinitely powerful. Before that for me it was just an inkling, a hunch. Reading the source code I wanted to make software that works like that. I hope I have, to some extent.\"",
                    "created": "Tue, 14 Jan 2025 13:01:41 GMT",
                    "type": "outline",
                    "flInCalendar": true
                },
                {
                    "text": "On <a href=\"https://en.wikipedia.org/wiki/Matt_Mullenweg\">Matt Mullenweg</a>, who surprisingly has become a polarizing figure in the tech world. Who could've seen that coming? Not me. \"<a href=\"https://bsky.app/profile/scripting.com/post/3lfoxsh7nd22x\">Radical idea</a>. Matt Mullenweg doesn’t like how things are going. He has every right to try to change it, to make it right. As do you, and I.\" I don't like that people have called him things like the Mad King. People used to say stuff like that about me. It's a substitute for trying to understand where someone is coming from. One of the things I learned about creating open technology is you attract people who don't contribute anything but expect you to work for them, for you to take orders from them. That is really what it comes down to, and it's crazy. If you feel strongly about something, either learn how to program, or make your freaking case with some humility, or offer a bounty, or just trust the universe. But giving people orders, there's no place for that. Matt could be right or wrong, or he could be right for himself. But he has the right to control his own destiny, as you and I do, to the extent that we can. ",
                    "created": "Tue, 14 Jan 2025 13:02:11 GMT",
                    "type": "outline",
                    "flInCalendar": true
                },
                {
                    "text": "I have my own vision for WordPress, as I've started to talk about here and Murphy-willing you should see more of that in the coming weeks. If you want a clue, listen to my <a href=\"https://shownotes.scripting.com/scripting/2025/01/08/howIViewWordpress.html\">podcast</a> from January 8, and then if you have questions, <a href=\"https://github.com/scripting/Scripting-News/issues/316\">ask them here</a>. I think it's a better bet that WordPress will be the backbone of the social web than any of the other candidates. I wouldn't mind being wrong, as long as we can peer with the eventual winner. I can't endorse a silo, even on the hope that it will be de-silo'd. I also don't believe in the <a href=\"https://en.wikipedia.org/wiki/Tooth_fairy\">Tooth Fairy</a> and <a href=\"https://en.wikipedia.org/wiki/Matt_Mullenweg\">Glinda</a> the good witch of the south. ",
                    "created": "Tue, 14 Jan 2025 13:06:01 GMT",
                    "type": "outline",
                    "flInCalendar": true
                },
                {
                    "text": "One more thing. In the middle of the night the Department of Justice released <a href=\"https://www.documentcloud.org/documents/25486139-report-of-special-counsel-smith-volume-1-january-2025/\">half of the report</a> on their case against president-elect Trump, a much anticipated bit of news. I didn't know it had been released, but when I woke up, and made the usual rounds, I checked in on Bluesky, Threads, Mastodon, Facebook and then finally Twitter, in that order. Guess where I discovered this news. Twitter. So when you think people move when they don't like what Musk does, or they find that Twitter is as polluted as some of the celebs do, understand this -- most people aren't affected by the noise. I don't see it unless I go look for it. Perhaps this is because I've been very liberal with blocking abusers, or more likely I don't have <a href=\"https://x.com/davewiner\">enough followers</a> to be an attractive target for the abusers, who behave like spammers. They post where the flow is, and my account isn't as attractive as (for example) Paul Krugman, Mark Cuban or Jay Rosen. It takes a lot to get people to move, and I suspect most people never will. If you operate a gasoline powered car, I bet you buy a lot of Exxon gas, even if you don't see their logo when you fill up. It's very hard to get away from companies who hurt our species, by design, unfortunately. ",
                    "created": "Tue, 14 Jan 2025 13:07:34 GMT",
                    "type": "outline",
                    "image": "https://imgs.scripting.com/2020/11/15/fatladysinging.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}