{
    "created": "2025-01-16T05:00:00.000Z",
    "flInCalendar": true,
    "name": "16",
    "path": "2025/01/16",
    "text": "January 16",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Before declaring democracy over, as our major news orgs and tech companies seem to have, remember there are still 50 states, most of whom still seem to accept that votes must be counted, and the winner is who gets the most, not the one who sends in a mob to trash the state Capitol.",
            "created": "Thu, 16 Jan 2025 20:28:15 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2020/11/26/uncleSam.png",
            "flInCalendar": true
        },
        {
            "text": "Now that I have a search engine for my blog, I can reliably look for all instances of <a href=\"https://daytona.scripting.com/search?q=%22wordle%20kitty%22\">Wordle Kitty</a> which was a character I was playing around with last year with ChatGPT. It even comes out in reverse chronologic order, and it's better than Google which ignores a lot of my blog these days. My own search engine doesn't do that of course.",
            "created": "Thu, 16 Jan 2025 17:22:37 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "When I buy a domain speculatively, I usually put up some kind of <a href=\"https://imgs.scripting.com/2025/01/16/placeholderScreenshot.png\">placeholder page</a> with a title, picture and tagline. Like <a href=\"https://feediverse.org/\">feediverse.org</a>. I pushed a link to it yesterday, and got back this possibly snarky response, but still thought provoking. Why isn't there a feed for the feediverse.org page. Good point! So if you were to put a feed on the home page of the open feediverse, what it be? A feed of posts to the <a href=\"https://bsky.app/profile/feediverse.bsky.social\">Little Feed Reader</a> account on Bluesky. I think that might be it. We can celebrate the day when that feed is mirrored on Bluesky (Inbound RSS ftw!) and we can shut down the stupid app that does the bridging. We had a <a href=\"https://cyber.harvard.edu/rss/rss.html\">standard</a> long before Bluesky came along, isn't it wrong for them to try to force everyone to use their reinvention? It doesn't say anything good about the people who made that choice, among interop-minded developers. It kind of violates our ethos imho.",
            "created": "Thu, 16 Jan 2025 14:29:33 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2019/12/06/dorothy.png",
            "flInCalendar": true
        },
        {
            "text": "Today's fortune cookie",
            "created": "Thu, 16 Jan 2025 18:04:05 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "My advice for today.",
                    "created": "Thu, 16 Jan 2025 18:04:16 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Tell someone they’re right.",
                    "flInCalendar": true
                },
                {
                    "text": "With gusto!",
                    "flInCalendar": true
                },
                {
                    "text": "Like this.",
                    "flInCalendar": true
                },
                {
                    "text": "You’re not just right, you’re <i>fucking</i> right!",
                    "created": "Thu, 16 Jan 2025 18:04:23 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}