{
    "created": "2025-01-17T05:00:00.000Z",
    "flInCalendar": true,
    "name": "17",
    "path": "2025/01/17",
    "text": "January 17",
    "type": "calendarDay",
    "subs": [
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=KEJ0PUw-lRk\">Video demo</a> of the new <a href=\"https://imgs.scripting.com/2025/01/17/searchboxScreenShot.png\">searchbox</a> on Scripting News. ",
            "created": "Fri, 17 Jan 2025 16:07:54 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Pretty sure there's no supportable reason to <a href=\"https://www.npr.org/2025/01/17/nx-s1-5258396/supreme-court-upholds-tiktok-ban\">ban TikTok</a>, any more than banning Facebook or Twitter would make sense.",
            "created": "Fri, 17 Jan 2025 19:26:03 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I've come to the conclusion that you can't really use <a href=\"https://daytona.scripting.com/search?q=chatgpt\">ChatGPT</a> as a programming partner. It doesn't understand the big picture, and if you try to explain it, it probably isn't getting it, and if it does, it will forget it quickly. It's basically fairly stupid, but a way better search engine than Google. Also, it never says it doesn't have enough info to answer the question and then an hour later you figure out the answer it gave you just doesn't work. I still think it's an incredibly useful too, just not as great as I used to think. In a couple of years it has never asked for more information before it answers. That's a clue. ",
            "created": "Fri, 17 Jan 2025 19:45:28 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2023/07/28/marshmallowManFromGhostbusters.png",
            "flInCalendar": true
        },
        {
            "text": "My newest server was down for an hour due to hardware problems at Digital Ocean. It appears to be running again. Please don't judge the <a href=\"http://scripting.com/2025/01/15/143544.html\">new search feature</a>, it was caught up in this outage. Oy.",
            "created": "Fri, 17 Jan 2025 17:54:26 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I've changed my <a href=\"https://bsky.app/profile/scripting.com\">Bluesky</a> avatar to <a href=\"http://scripting.com/mlk.png\">MLK's image</a> to celebrate his birthday on Monday, January 20. I dream of everyone wearing this button proudly on Monday in support of American democracy and progress. We are a proud country, beneath all the weirdness. ",
            "created": "Fri, 17 Jan 2025 16:01:41 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}