{
    "created": "2025-01-20T05:00:00.000Z",
    "flInCalendar": true,
    "name": "20",
    "path": "2025/01/20",
    "text": "January 20",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I just wrote a review for <a href=\"https://en.wikipedia.org/wiki/Industry_(TV_series)\">Industry</a> in \"Bingeworthy\", but it doesn't have a text editor. It farms the job off to \"WordLand\", which shoots the text back to Bingeworthy as the user publishes to WordPress and \"RSS\", in Markdown. So the text is on both BW and WP and the \"feediverse\". And through WordPress it has a <a href=\"https://daveverse.wordpress.com/2025/01/20/industry-was-great-until-the-end/\">presence on the web</a>. This is the goal, writing exists on its own, but can be shared in all the contexts it makes sense in, but it lives primarily in your blog, your home base. That's why WordPress is so important in the scheme of things. It's a consensus, this is where a lot of people are blogging in 2025. And there's a lot of mostly unexplored interop. And they don't break developers. This may not make total sense at this time, but soon, I hope to be able to point back at this post, and say it was the first time something important worked. ",
            "created": "Mon, 20 Jan 2025 17:40:42 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2017/12/23/sarahLynn.png",
            "flInCalendar": true
        },
        {
            "text": "BTW, actually the term \"social web\" is probably too big a compromise. The \"web\" part is the only part that's imho useful. The sad part is that \"social\" means \"we removed most of the features of the web.\" Why? Some vague sense that people would write too much if given the space. Or link too much. Or edit too much. Or be too emphatic. It's worse than Disneyfied -- at least at Disneyland you get actors, and color and rides, and bland food with tons of sugar and fat. But there is some fun and nutrition. In the social web, it's just memes and slogans. Not even much room for a metaphor. There's so much more to say about being human.",
            "created": "Mon, 20 Jan 2025 17:46:23 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "In the last days of Trump's first term, I had a <a href=\"http://scripting.com/misc/howlongfortrump/\">nice little web app</a> that told you how much time remained in his term. It was a one-line change to make it work again, which, sigh, is necessary now. ",
            "created": "Mon, 20 Jan 2025 19:14:51 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Twitter, in hindsight",
            "created": "Mon, 20 Jan 2025 17:01:29 GMT",
            "type": "outline",
            "metaImage": "https://imgs.scripting.com/2025/01/20/noCountry.png",
            "subs": [
                {
                    "text": "There's a <a href=\"https://www.youtube.com/watch?v=dRQtjVzj1bo\">great scene</a> in <a href=\"https://en.wikipedia.org/wiki/No_Country_for_Old_Men\">No Country For Old Men</a>, where a character is facing imminent death, but he's arguing with the character who will kill him, who asks if all your great ideas led to this (his death) how good were the ideas (paraphrasing).",
                    "created": "Mon, 20 Jan 2025 17:02:00 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Along those lines.. If Twitter was such a great idea but it led to the death of democracy (for now at least) maybe it wasn't such a great idea. Maybe when we try to reboot we should try something <i>realllly</i> different.",
                    "created": "Mon, 20 Jan 2025 17:02:19 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "<a href=\"https://www.goodreads.com/quotes/5543-insanity-is-doing-the-same-thing-over-and-over-again\">As they say</a> -- Insanity is doing the same thing over and over again and expecting different results.",
                    "created": "Mon, 20 Jan 2025 17:02:28 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PS: This started as a thread on Bluesky.",
                    "created": "Mon, 20 Jan 2025 17:34:56 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Pam McQuesten, dear friend",
            "created": "Mon, 20 Jan 2025 15:01:20 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Sad news: Longtime friend <a href=\"https://www.google.com/search?q=Pam+McQuesten\">Pam McQuesten</a> passed away on January 1 after a brief illness. ",
                    "created": "Mon, 20 Jan 2025 14:03:40 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I <a href=\"https://www.facebook.com/groups/1681058035952686/posts/1681610715897418/\">knew Pam</a> in Silicon Valley, as we were starting up Living Videotext in 1983. Our office was on <a href=\"https://www.google.com/maps/place/Elwell+Ct,+Palo+Alto,+CA+94303/@37.4320011,-122.1062105,1048m/data=!3m2!1e3!4b1!4m6!3m5!1s0x808fba3f1e2d0db3:0x2fd030af404448b3!8m2!3d37.4320011!4d-122.1036356!16s%2Fg%2F1tgb__w0?entry=ttu&g_ep=EgoyMDI1MDExNS4wIKXMDSoASAFQAw%3D%3D\">Elwell Court</a> in Palo Alto, just off 101, near the golf course and airport. Pam was managing editor of <a href=\"https://en.wikipedia.org/wiki/Byte_(magazine)\">BYTE</a>, the class act of tech pubs in the early personal computer business, then editor of <a href=\"https://en.wikipedia.org/wiki/Popular_Computing\">Popular Computing</a>, the magazine for the people (ie users of computers). When she was at BYTE, her office was on the same floor as ours. ",
                    "created": "Mon, 20 Jan 2025 15:14:44 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The tech industry was rough even then, all the young egos, people who were sure they could do everything, not much collaboration, lots of betrayal. She was one of the few people I could talk with on a personal level, with trust and intelligence. We talked about the future of the technology we were creating, and what we wanted from all this. She was a mentor, like a big sister, best friend, someone I trusted and loved. A very rare friendship. ",
                    "created": "Mon, 20 Jan 2025 15:02:11 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "BTW, her name in the 80s, before her marriage to Paul McQuesten, was Pam Clark.",
                    "created": "Mon, 20 Jan 2025 15:00:53 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Our paths crossed again a few years ago on Facebook. I invited her to join a private group I have with friends I love and trust, to share the life I had at my \"pond house\" in the Catskills. ",
                    "created": "Mon, 20 Jan 2025 15:02:37 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I wanted to post a brief remembrance here in case any of Pam's friends are tuned in, so they can be part of the <a href=\"https://www.facebook.com/groups/1681058035952686\">celebration of her life</a>.  ",
                    "created": "Mon, 20 Jan 2025 15:05:10 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Pam McQuesten in 2010 via <a href=\"https://www.flickr.com/photos/nitle/4523727367\">Flickr</a>. ",
                    "created": "Mon, 20 Jan 2025 15:08:46 GMT",
                    "inlineImage": "https://imgs.scripting.com/2025/01/20/pamMcquesten2010.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "It was their job",
            "created": "Mon, 20 Jan 2025 14:31:08 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Random observations posted on Bluesky in the early morning hours.",
                    "created": "Mon, 20 Jan 2025 14:31:24 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "<a href=\"https://bsky.app/profile/scripting.com/post/3lg63uypc7x2e\">5:09AM</a>: \"Biden had one job to do, and he didn’t do it.\"",
                    "created": "Mon, 20 Jan 2025 14:32:22 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "<a href=\"https://bsky.app/profile/scripting.com/post/3lg64cq35fd2k\">5:17AM</a>: \"The NYT had one job to do, and they didn’t do it.\"",
                    "created": "Mon, 20 Jan 2025 14:33:37 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "<a href=\"https://bsky.app/profile/scripting.com/post/3lg64klda3c2v\">5:21AM</a>: \"The NYT is the saddest excuse for the leading news org of the most significant democracy in human history. They flushed it down the fucking toilet. They, like the Washington Post, deserve to die in darkness.\"",
                    "created": "Mon, 20 Jan 2025 14:31:39 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "<a href=\"https://bsky.app/profile/scripting.com/post/3lg6ea3hnms22\">7:39AM</a>: \"Being impartial about last year’s election was not an option for the NYT. It was democracy’s Pearl Harbor. We will never forget or forgive what they did.\"",
                    "created": "Mon, 20 Jan 2025 14:33:06 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Editor's note: Soon, I will do all my writing in one place, and these kinds of snapshots will be easier to assemble.",
                    "created": "Mon, 20 Jan 2025 14:35:25 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}