{
    "created": "2025-01-23T05:00:00.000Z",
    "flInCalendar": true,
    "name": "23",
    "path": "2025/01/23",
    "text": "January 23",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Basically we have to <a href=\"https://bsky.app/profile/scripting.com/post/3lggfu2z3fs2g\">bring politics to the people</a>. ",
            "created": "Thu, 23 Jan 2025 17:30:49 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The <a href=\"https://mastodon.social/@stefan@stefanbohacek.online/113877779487496063\">W3C should've</a> gotten behind \"RSS\" long before they endorsed ActivityPub. They're controlled by big companies who are truly scared of interop, explains why most of their proposed standards go nowhere. BTW, I figure if <a href=\"https://daytona.scripting.com/search?q=matt%20mullenweg\">Matt</a> can openly discuss what's undermining WordPress as an open standard (which it is) no reason I can't tell the truth why the <a href=\"https://daytona.scripting.com/search?q=%22social%20web%22\">social web</a> is not even a web. It's all a big corporate con. Everywhere you look, ripping us off and selling us out.  ",
            "created": "Thu, 23 Jan 2025 17:17:41 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "To answer <a href=\"https://bsky.app/profile/mcuban.bsky.social/post/3lgbutbllnk2b\">Mark Cuban's question</a> of what could we do now to make things better. I forgot that I have two ready-made answers. First, let's get the Democrats or whatever its successor is called, on the air 365 days a year, every year, not just in election years, and have it do many things other than raise money to buy ads. We need to always be communicating with each other not just in season. You could see we had a problem when Obama's campaign website, which should have become whitehouse.gov was turned into a stupid feature of the site where people could petition their government. It said to voters, thanks we'll take it from here. We all saw that as putting us in our place. We must be invoved in governing, not just electing. Second, for podcasts and what's left of journalism, it should all move out out of the northeast and into the country. The hosts should be in St Louis, Dallas, Detroit, Atlanta, Seattle, Phoenix even Memphis, Miami and Charleston. That would change the focus not only symbolically, but they could insist that guests go there to be interviewed. Change the meaning of flyover country. People would feel different about the country and that would come through. Democrats tend to cater their ideas to people in the Northeast. This part of what Repubs say is very true. They do the same thing, only worse, but they are smart about pretending they don't. Third, amplify AOC. She's the leader we need. The Dems are too scared of Republican criticism. Stop worrying so much. If they're complaining that means it's working. Her interview on Jon Stewart's <a href=\"https://www.iheart.com/podcast/867-the-weekly-show-with-jon-s-86469341/episode/jon-aoc-260531325/\">podcast</a> this week is wonderful.",
            "created": "Thu, 23 Jan 2025 16:46:29 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2025/01/23/aoc.png",
            "flInCalendar": true
        }
    ]
}