{
    "created": "2025-01-25T05:00:00.000Z",
    "flInCalendar": true,
    "name": "25",
    "path": "2025/01/25",
    "text": "January 25",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Our best hope is that the factions within MAGA fight each other. We're assuming they have a way to keep everyone in line, but the more power they capture, the harder that's going to be.",
            "created": "Sat, 25 Jan 2025 16:31:05 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "It's been over 24 hours, and my <a href=\"https://bsky.app/profile/did:plc:oety7qbfx7x6exn2ytrwikmr/post/3lgibxvpz3k2x\">viral post</a> from yesterday is still getting <a href=\"https://imgs.scripting.com/2025/01/25/viralPostScreenshot.png\">lots of RTs and likes</a>. An observation -- it's made my <a href=\"https://bsky.app/profile/scripting.com\">Bluesky account</a> virtually unusable. Anything else I publish there is swamped by the viral post. I'm also working on a new version of the software that turns Bluesky into a <a href=\"https://bsky.app/profile/did:plc:fkwl6tbnev3vdx63bippmscy\">feed reader</a>. It will be able to manage multiple rivers, where the first version could only do one. The next reader will be all the posts from me on all the various services I post to that have outbound RSS feeds. After that, I have ideas for special feeds for specific publications. I want to help our friends in the blogging and news world, using the best communication tools available. I find now that people are much more open to ideas. This is good. But we should never be complacent. Learn from the competition. They were getting ready for this moment, we weren't. ",
            "created": "Sat, 25 Jan 2025 15:17:49 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2025/01/25/zelig.png",
            "imageLink": "https://bsky.app/profile/davefeediverse.bsky.social",
            "flInCalendar": true
        },
        {
            "text": "Hegseth",
            "created": "Sat, 25 Jan 2025 16:44:30 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Hegseth's job is to stay out of the way while the Heritage Foundation separates the military into those who take loyalty seriously and those who are retiring.",
                    "created": "Sat, 25 Jan 2025 16:44:34 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "For that job being an alcoholic is a plus. 😀",
                    "flInCalendar": true
                },
                {
                    "text": "They're interviewing for who wants to be his replacement. ",
                    "flInCalendar": true
                },
                {
                    "text": "His job is to keep the seat warm.",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}