{
    "created": "2025-01-28T05:00:00.000Z",
    "flInCalendar": true,
    "name": "28",
    "path": "2025/01/28",
    "text": "January 28",
    "type": "calendarDay",
    "subs": [
        {
            "text": "<a href=\"https://shownotes.scripting.com/scripting/2025/01/28/theRepubsAreTryingToKillYou.html\">Podcast</a>: The Repubs are trying to kill you.",
            "created": "Tue, 28 Jan 2025 18:51:31 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "If our political system worked we’d have wonderful heart-grabbing ads on TV about all the people who have meaningful jobs thanks to DEI. It wouldn’t be hard to make the Repubs look like Scrooges. Get people riled up. Another ad, about the people Trump pardoned and what they’re doing now. Wait till one of them commits a major crime and run <a href=\"https://www.c-span.org/clip/vignette/willy-horton-attack-ad/4495693\">Willie Horton</a> style ads. Make it understood who these people actually are. Trump has to own each and every one of them. This really isn’t hard. But the Dems think campaigns end. They don’t end. ",
            "created": "Wed, 29 Jan 2025 01:41:05 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2020/05/21/thinkUsa.png",
            "flInCalendar": true
        },
        {
            "text": "Another ad. Donald Trump on Mt Rushmore. Donald Trump on the $20 bill. The Washington Monument and Lincoln Memorial renamed Trump. Kennedy airport in NYC renamed Trump International. In the future the US will have only one founding father: Donald J. Trump.",
            "created": "Wed, 29 Jan 2025 01:53:25 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I thought this excerpt from <a href=\"https://contrarian.substack.com/p/departing-the-new-york-times\">Krugman's piece</a> about his move back to blogging was right on. \"For a while I tried to make up for the loss of the blog with threads on Twitter. But even before Elon Musk Nazified the site, tweet threads were an awkward, inferior substitute for blog posts.\" There's a need for a system that combines the full-featured writing of blogging and the timelines of twitter-like systems. ",
            "created": "Tue, 28 Jan 2025 22:28:19 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Is Bluesky billionaire-proof?",
            "created": "Tue, 28 Jan 2025 13:03:24 GMT",
            "type": "outline",
            "description": "Could what happened to Twitter, happen there?",
            "metaImage": "http://scripting.com/images/2025/01/28/failWhale.png",
            "subs": [
                {
                    "text": "Could what <a href=\"https://en.wikipedia.org/wiki/Acquisition_of_Twitter_by_Elon_Musk\">happened</a> to Twitter, happen there?",
                    "created": "Tue, 28 Jan 2025 13:03:30 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "To determine, ask yourself if you could continue to use it if it was acquired by a billionaire for their own personal political use?",
                    "flInCalendar": true
                },
                {
                    "text": "What would you switch to?",
                    "created": "Tue, 28 Jan 2025 13:04:21 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Would you have to give up your history and followers?",
                    "created": "Tue, 28 Jan 2025 13:04:21 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "And developers, what would you do if the billionaire acquirer dropped support for the api? How expensive and time consuming would it be to convert to a different protocol? Would you even bother?",
                    "created": "Tue, 28 Jan 2025 13:03:46 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "We’ve learned a lot from the billionaire acquisition of twitter. The answer to these questions made a lot of us think we’d never want to do this again. But despite all the misleading hype, we very much are repeating the mistakes.",
                    "created": "Tue, 28 Jan 2025 13:04:29 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The current owners of Bluesky would be crazy if they closed off the opportunity to get rich. But they shouldn’t be misleading users and developers into believing that it’s safe to trust this as an open platform that couldn’t be acquired and have its utility consumed the way twitter's was.",
                    "created": "Tue, 28 Jan 2025 13:04:36 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "This started as a <a href=\"https://bsky.app/profile/did:plc:oety7qbfx7x6exn2ytrwikmr/post/3lgsgmmhyf22q\">thread</a> on Bluesky of course. :-)",
                    "created": "Tue, 28 Jan 2025 13:06:03 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PS: Spoiler -- Bluesky is, as it is currently configured, not billionaire-proof. It's going to get acquired, it probably already has, based on what they're doing. Remember, pay attention to what they do, not what they say. It's just as true in tech as it is in politics, and these days, what's the difference anyway? ",
                    "created": "Tue, 28 Jan 2025 13:06:28 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PPS: If you're thinking ahh but there's <a href=\"https://en.wikipedia.org/wiki/AT_Protocol\">AT Protocol</a>, our ace in the hole. Please. Twitter had an <a href=\"https://en.wikipedia.org/wiki/Twitter#Technology\">API</a> too. It didn't make a difference. And AT Proto won't either unless there are proven systems that people are actually using that peer with Bluesky's servers, so those users can't be sold to the billionaire. We're nowhere near that. No one can say with any certainty that it's even possible. At this point the continued support of the API is entirely up to the owners of Bluesky. They could change it, break developers or completely drop it and the users and developers would have no recourse. ",
                    "created": "Tue, 28 Jan 2025 13:26:58 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PPPS: Can you imagine the founders of Bluesky wouldn't take $20 million each for their share?\n",
                    "created": "Tue, 28 Jan 2025 17:19:22 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}