{
    "text": "Communicating with Amazon",
    "created": "Fri, 20 Sep 2019 13:03:34 GMT",
    "type": "outline",
    "description": "On July 26, I ordered an outdoor thermometer. Not expensive, $10. But it was broken when I opened the package, and I cut my finger, it bled. ",
    "subs": [
        {
            "text": "Most of my orders with Amazon are uneventful. The product arrives when it was supposed to and it works and that's that. But sometimes something goes wrong.",
            "created": "Fri, 20 Sep 2019 13:03:57 GMT",
            "image": "http://scripting.com/images/2019/09/20/thermometer.png"
        },
        {
            "text": "On July 26, I ordered an <a href=\"https://www.amazon.com/gp/product/B00WNEJCBE/ref=ppx_yo_dt_b_asin_title_o00_s00?ie=UTF8&psc=1\">outdoor thermometer</a>. Not expensive, $10. But it was broken when I opened the package, and I cut my finger, it bled.   ",
            "created": "Fri, 20 Sep 2019 13:10:55 GMT"
        },
        {
            "text": "I went to the Order page and reported that it arrived broken. I just wanted to throw it out, not wanting to handle the broken glass, possibly injuring myself again, or someone who had to handle it at UPS or at Amazon. That was the right thing to do. The Amazon rep said OK, they would credit me for the thermometer. Honestly I was surprised it was that easy. I ordered another one (which arrived unbroken and I'm using it).",
            "created": "Fri, 20 Sep 2019 14:31:39 GMT"
        },
        {
            "text": "Well, about a week ago, I got an email saying I needed to send the thermometer back or I'd be charged for it. There was no way to respond. I got another notice a few days later saying they had charged me for it. "
        },
        {
            "text": "Okay $10 isn't going to make a difference to me, but it would make even less of a difference to Amazon. And they agreed to the arrangement, and it was the right thing to do. "
        },
        {
            "text": "So I thought I'd write it up <a href=\"http://scripting.com/2019/09/20/130334.html\">here</a> on my blog. Maybe someone in an executive role at Amazon will see it, and will change their system so it's easier for customers to talk to them, and make sure when they agree to something, they stick to it. ",
            "created": "Fri, 20 Sep 2019 13:04:09 GMT"
        }
    ]
}