{
    "text": "<a href=\"https://en.wikipedia.org/wiki/Enes_Kanter\">Enes Kanter</a>, an NBA player for the Boston Celtics, wrote a <a href=\"https://twitter.com/EnesKanter/status/1450869180283203589\">tweet</a> saying the leader of China is a \"brutal dictator.\" And of course China is <a href=\"https://www.cnbc.com/2021/10/21/nba-china-boston-celtics-enes-kanter-slams-xi-over-tibet.html\">shitting its pants</a>. This is a big problem. They don't understand that there's a line they're not allowed to cross. In the US, Kanter has a right to his opinion. And the leader of China <i>is</i> a brutal dictator.  And even if there's some question about it, Kanter is allowed to say what he thinks. This is a similar problem to the one they're having at Netflix with Dave Chappelle's show which I have not watched. I find him incredibly offensive. I'd love to have a private conversation with him where I ask what he's trying to accomplish. I find his stories humiliating. Is there some lesson I'm supposed to learn? If so, could we skip to that part. Anyway, I won't watch him. <a href=\"https://www.nytimes.com/2021/10/20/business/media/netflix-protest-dave-chappelle.html\">Employees at Netflix</a> were offended too, and they want Netflix to remove him. That's just as wrong as what China is doing to pressure the NBA about Kanter. One more. The NYT fucked up when they fired <a href=\"https://www.google.com/search?q=site%3Ascripting.com+donald+mcneil\">Donald McNeil</a>. I think even the assholes who forced him out would agree, as their coverage of Covid is now bullshit, where before McNeil was canned, it was stellar. They had no place trying to control what appears in the NYT. They just work there. It's a platform for speech, I think even the most jaded and cynical reporter at the NYT would agree with that. And just because you get a paycheck from the NYT, that doesn't empower you to control other people's speech, same as China and Netflix. I wrote <a href=\"http://scripting.com/2021/10/20/194852.html?title=whenPeopleLoveRss#a194954\">yesterday</a> that when Zuck rolls out his new thing next week, we'll find out if the journalists properly understand their role. There will be no fake news yet on their new platform for them to complain about. But I guarantee you it will restrict speech in an effort to appease the journalists. Will they see this, and call bullshit? Or will their vanity and narcissism prevail. Obviously they don't care about our speech, but will they mind being so visible about not honoring it?",
    "created": "Thu, 21 Oct 2021 12:35:59 GMT",
    "type": "outline",
    "image": "http://scripting.com/images/2021/10/21/enesKanter.png",
    "flInCalendar": true
}