{
    "text": "Ignore the NY Times",
    "created": "Tue, 20 Aug 2024 13:58:36 GMT",
    "type": "outline",
    "description": "The new Democratic Party must not make the mistake that Biden did, must not subjugate itself to the press. When they go on the attack, you must respond.",
    "subs": [
        {
            "text": "When President Biden took the stage last night at the DNC, I had a moment of buyer's remorse. He looked so good in his black suit, and the pictures of the new candidates, and their spouses, looked comical in comparison to the <i>president</i> who was about to speak. ",
            "created": "Tue, 20 Aug 2024 13:52:34 GMT",
            "flInCalendar": true
        },
        {
            "text": "Why did Walz have a permanent frown on his face. I find his presence next to Harris is almost always awkward. He's taller, and moves a lot. I noticed this with Sanders when he was debating Clinton in 2016. She stood still and Sanders waved his hands a lot. She spoke quietly, he shouted. ",
            "created": "Tue, 20 Aug 2024 14:05:56 GMT",
            "flInCalendar": true
        },
        {
            "text": "Biden shouted last night, and he was mostly unplugged. On the team, but you have to wonder, how did the journos get so much power that they could force this change. He gave a fine speech. I'm not sure that pushing him aside, net-net, was a win for us. Maybe Harris will be a sugar high.",
            "created": "Tue, 20 Aug 2024 13:59:06 GMT",
            "flInCalendar": true
        },
        {
            "text": "One thing I know for sure, the new Democratic Party must not make the mistake that Biden did, must not subjugate itself to the press. When they go on the attack, you must respond. Break their wall of objectivity, these people are political players, and so far not subject to rebuttal. That must end. If they want to be in the middle, then don't pretend they aren't. ",
            "created": "Tue, 20 Aug 2024 13:59:15 GMT",
            "flInCalendar": true
        },
        {
            "text": "They will yell about the First Amendment, which also applies to elected leaders and candidates for office, and there is no special right for publications like the NYT, they have no immunity to First Amendment speech about them. ",
            "created": "Tue, 20 Aug 2024 14:08:33 GMT",
            "flInCalendar": true
        },
        {
            "text": "To the extent we can, it's time to push them aside. ",
            "created": "Tue, 20 Aug 2024 14:03:00 GMT",
            "flInCalendar": true
        },
        {
            "text": "When someone quotes the NYT in frustration, I have a mantra I repeat over and over, \"Ignore the NY Times.\" I'm going to paste it in 25 times now so you get the idea. Ignore the NY Times. Ignore the NY Times. Ignore the NY Times. Ignore the NY Times. Ignore the NY Times. Ignore the NY Times. Ignore the NY Times. Ignore the NY Times. Ignore the NY Times. Ignore the NY Times. Ignore the NY Times. Ignore the NY Times. Ignore the NY Times. Ignore the NY Times. Ignore the NY Times. Ignore the NY Times. Ignore the NY Times. Ignore the NY Times. Ignore the NY Times. Ignore the NY Times. Ignore the NY Times. Ignore the NY Times. Ignore the NY Times. Ignore the NY Times. ",
            "created": "Tue, 20 Aug 2024 14:08:43 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}