{
    "text": "Our big loop",
    "created": "Wed, 13 Jun 2018 13:17:58 GMT",
    "type": "outline",
    "description": "All of this has happened before, and it will all happen again.",
    "subs": [
        {
            "text": "I want people to be able to put up their own web servers. Not companies. Not people with Computer Science degrees. People. Anyone. Everyone.  ",
            "created": "Wed, 13 Jun 2018 13:23:47 GMT",
            "image": "http://scripting.com/images/2018/06/13/cylon.png"
        },
        {
            "text": "I think every journalist should learn how to set up and run a web server. I think any student, no matter how young, should learn, if they want to. The doors to publishing should be open to everyone. It's never been easier, and it could be getting easier all the time. That should be one of the <a href=\"https://dictionary.cambridge.org/us/dictionary/english/overarching\">overarching</a> goals of our profession, to make what we do easier and easier, all the time. To make what we did ten years ago something anyone can do. It's the nature of software, that once we know what we can do that we make it easy for everyone to do it.",
            "created": "Wed, 13 Jun 2018 13:24:17 GMT"
        },
        {
            "text": "<i>But</i> there's no doubt that the browser vendors want to go the other way, to raise the barriers, to make it harder for newcomers, young or old, to launch their own boats into the mighty ocean of the web. They may be righteous or <a href=\"https://www.merriam-webster.com/dictionary/treacherous\">treacherous</a>, or some of both, but their motives don't matter, what matters is the net-effect, and that is to restrict publishing to the initiated, the priesthood. To keep the <a href=\"http://www.dictionary.com/browse/rabble\">rabble</a> from interfering. ",
            "created": "Wed, 13 Jun 2018 13:23:40 GMT"
        },
        {
            "text": "If they succeed, and at this point I think they will, I have no doubt what will happen next. We'll just invent the web all over again. With a new Mosaic, a new Marc Andreessen, a new Google, etc. It's how tech works. Just when Bill Gates thought he had it all wrapped up, in 1994, that his software was at the base of every stack, <a href=\"http://scripting.com/davenet/1994/10/18/billgatesvstheinternet.html\">along comes the web</a> to knock him off his perch. Google is ripe for this disruption. They don't see it coming, but it's coming all the same. ",
            "created": "Wed, 13 Jun 2018 13:26:31 GMT"
        },
        {
            "text": "This phenomenon is why I'm seriously thinking of changing the <a href=\"http://scripting.com/images/2018/06/13/slogan.png\">slogan</a> at the top of my blog from ",
            "created": "Wed, 13 Jun 2018 13:34:23 GMT",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "<i>It's even worse than it appears</i> to  ",
                    "created": "Wed, 13 Jun 2018 13:34:38 GMT"
                },
                {
                    "text": "<i>All of this has happened before, and it will all happen again.</i>",
                    "created": "Wed, 13 Jun 2018 13:34:43 GMT"
                }
            ]
        },
        {
            "text": "I will try to have a good backup of my websites, so if we need to transition it will be possible to do so.",
            "created": "Wed, 13 Jun 2018 13:27:22 GMT"
        }
    ]
}