{
    "text": "A cascade into dysfunction",
    "created": "Thu, 20 Jul 2017 14:10:34 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I just did yet another server move. This all got started by me saying What The Heck to a question a hosting company asked. Would you like a free upgrade from 2Gb of memory to 4Gb? Pause. Sure! Let's go. Click. Wait. Reboot. Two days later I realize something critical broke in the transition. ",
            "created": "Thu, 20 Jul 2017 14:13:17 GMT",
            "image": "http://scripting.com/images/2017/07/20/wilma.png",
            "permalink": "http://scripting.com/2017/07/20.html#a101317"
        },
        {
            "text": "Apparently they didn't perfectly copy the file system, some permissions didn't come across. No idea where the problem is and Dropbox support was probably a piece of software not a human, they just asked questions that I had already answered. A human would have been able to read my email. It's possible they could have told me what permission didn't get set because the error message told me to contact tech support, with a code that looked like a database index of some kind. ",
            "created": "Thu, 20 Jul 2017 14:11:00 GMT",
            "permalink": "http://scripting.com/2017/07/20.html#a101100"
        },
        {
            "text": "So rather than try to fix what's wrong with the server, I provisioned a new one. This is like having a flat and deciding it's impossible to fix it so I got a new car instead. This made all kinds of things cascade into dysfunction. Including my Mac desktop which is prone to rainbow cursors if you change something material (rebooting is enough of a change apparently). ",
            "created": "Thu, 20 Jul 2017 14:12:19 GMT",
            "permalink": "http://scripting.com/2017/07/20.html#a101219"
        },
        {
            "text": "Here we are in 2017 and things don't work any better than they did in 1987. But our toys certainly are much bigger and better. And who doesn't like playing <a href=\"https://en.wikipedia.org/wiki/52_Pickup\">52-pickup</a> with a bunch of virtual servers. ",
            "created": "Thu, 20 Jul 2017 14:13:04 GMT",
            "permalink": "http://scripting.com/2017/07/20.html#a101304"
        }
    ],
    "permalink": "http://scripting.com/2017/07/20.html#a101034"
}