{
    "created": "2025-07-10T04:00:00.000Z",
    "flInCalendar": true,
    "name": "10",
    "path": "2025/07/10",
    "text": "July 10",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Have they made ChatGPT more stupid in the last couple of days? Or maybe I'm starting to see the problem. I was trying to debug a piece of software that sends mail. I use <a href=\"https://aws.amazon.com/ses/\">Amazon SES</a>. I wanted to see if the software was actually communicating with the server, and thought for sure there must be a log of requests on the AWS system. Where is it? I asked ChatGPT. It starts telling me to check all these things and never got to the part about where the log is. So I said, just tell me where the log is. Again, it tells me about all these nice things I should check first. I asked again, this time in ALL CAPS which is how I communicate that I really mean it. Again more bullshit. So I think to ask <i>Is there a log? </i>No, it says, actually there isn't one. ",
            "created": "Thu, 10 Jul 2025 15:33:55 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2024/06/11/nakedJenToday.png",
            "flInCalendar": true
        },
        {
            "text": "I took a long drive today on back roads, down toward Poughkeepsie, and on the way back a big pickup swerved into my lane. I had to swerve away from it and hit the brake, and had a bit of a <a href=\"https://en.wiktionary.org/wiki/conniption\">conniption</a>. Got me thinking. Who was it that did this. Man or woman, young or old, spaced out or thinking about getting a <a href=\"https://en.wiktionary.org/wiki/libtard\">libtard</a> to freak out, all kinds of thought. Then I remembered what keeps us safe in situations like this, very few people are going to deliberately try to kill us this way because they would die too. <a href=\"https://en.wikipedia.org/wiki/Mutual_assured_destruction\">Mutual assured destruction</a>. But I'm a programmer, trained to always think of things that could go wrong, then I realized omg, what if it were a <a href=\"https://thenewswheel.com/this-tesla-drove-itself-to-its-owner-the-video-is-both-fascinating-and-alarming/\">self-driving car</a>? Someone could program it to assassinate a random or specific person, or worse, hack the car remotely, or hack a thousand cars everywhere at the same time to kill people all over the world. I thought we could prevent this by right now requiring there always be a <a href=\"https://en.wikipedia.org/wiki/Human_sacrifice\">human sacrifice</a> in every car, sort of a hostage to assure good behavior, sometimes. ",
            "created": "Thu, 10 Jul 2025 20:54:35 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}