{
    "created": "2025-07-22T04:00:00.000Z",
    "flInCalendar": true,
    "name": "22",
    "path": "2025/07/22",
    "text": "July 22",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I think I figured out why the AI companies want to do web browsers. It’s so that they can create an application development platform for people who want to write apps that run inside a new environment where the OS is a LLM. Lots of interesting possibilities. Imagine how the OS API might work. You could restructure a database by explaining in English how you want it restructured. In the freaking code. Could we bury Algol-like languages the same way we buried assembly and machine languages? Do we have the courage to imagine such things?",
            "created": "Tue, 22 Jul 2025 20:26:18 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "\"You're an important caller,\" the machine lied, as if it were human. \n",
            "created": "Tue, 22 Jul 2025 15:27:49 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "New WordLand release, <a href=\"https://this.how/wordland/versions.opml#1753189296000\">v0.5.24</a>, fixes a problem in previous release that kept the Markdown icon from appearing in some user's icon bars. ",
            "created": "Tue, 22 Jul 2025 13:04:35 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "O Journos!",
            "created": "Tue, 22 Jul 2025 21:27:39 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I hate it when journos say the Dems are in trouble, or hopeless or whatever, it shows how poisoned their point of view is. ",
                    "created": "Tue, 22 Jul 2025 21:27:45 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "When people are fed up with Trump, if that should happen, then whatever the Democratic Party is meant to become it will become exactly that at that moment. ",
                    "flInCalendar": true
                },
                {
                    "text": "The voters are where your attention should be, and think of them as people not as numbers. ",
                    "created": "Tue, 22 Jul 2025 21:28:10 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "That's my best advice for a Tuesday. ",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}