{
    "created": "2025-07-29T04:00:00.000Z",
    "flInCalendar": true,
    "name": "29",
    "path": "2025/07/29",
    "text": "July 29",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Lots of embarrassing typos in a post yesterday on why I need WordLand. I did something unusual, I fixed the <a href=\"http://scripting.com/2025/07/28.html#a122818\">post</a> this morning, and cleared up some of the ideas. It was an important post and equally important to get it right. I also <a href=\"https://canada.wordcamp.org/2025/why-i-need-wordland/\">cross-posted</a> it on the WordCamp Canada site.",
            "created": "Tue, 29 Jul 2025 10:41:10 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2023/09/09/poe3.png",
            "flInCalendar": true
        },
        {
            "text": "I needed a \"featured image\" for my WordCamp <a href=\"https://canada.wordcamp.org/2025/why-i-need-wordland/\">post</a>, so I gave ChatGPT a simple <a href=\"https://imgs.scripting.com/2025/07/29/aPlaceCalledWordland.png\">assignment</a>. \"Imagine a place called WordLand.\" Last year this was a miracle, now it's so-what, but I still think it's a freaking miracle. ",
            "created": "Tue, 29 Jul 2025 10:47:48 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Now here's the real reason I need \"WordLand\" and if you write for WordPress sites, I think you'll want it too. It's because WordPress is like the <a href=\"https://en.wikipedia.org/wiki/Microsoft_Word\">Microsoft Word</a> of web writing. If you ask someone how they do their site, in 2025, it's probably going to be WordPress. So if someone invites you to write a guest post on their blog, chances are pretty good I can write it in WordLand, and it'll be archived in my collection of writing, and easy for me to find, because that's what WordLand does for writers. So I was able to create the new post on the WordCamp site in less than a minute, and it was completely painless. And that's the point. Here's the screen shot:",
            "created": "Tue, 29 Jul 2025 11:08:06 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "My WordCamp Canada <a href=\"https://canada.wordcamp.org/2025/why-i-need-wordland/\">post</a>, edited in WordLand. ",
            "created": "Tue, 29 Jul 2025 11:18:15 GMT",
            "type": "outline",
            "inlineImage": "https://imgs.scripting.com/2025/07/29/wordLandForCanadianPost.png",
            "flInCalendar": true
        },
        {
            "text": "But what about Substack and Ghost? A lot of people do their writing there too? What about those people. Here's the cool part for all people who write on the web. The API we use in WordLand to hook up to WordPress is <a href=\"https://github.com/Automattic/wp-calypso/tree/trunk/packages/wpcom.js\">open and documented</a>. They don't break their APIs in WordPressLand. At least so far. You could say that API is a standard. And I bet it would be a lot easier for Ghost, for example, to support a limited subset of that API than it has been to get ActivityPub support implemented. Because the WordPress API is what I would call \"really simple,\" and that's the thing I value most about a good API.  ",
            "created": "Tue, 29 Jul 2025 11:11:02 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"http://scripting.com/2024/10/05/142118.html\">Last year</a>: \"There could be a developer community writing apps that all join up in the middle in WordPress's database. Pretty powerful idea!\"",
            "created": "Tue, 29 Jul 2025 11:47:37 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Apologize to customers",
            "created": "Tue, 29 Jul 2025 20:28:23 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "<a href=\"https://bsky.app/profile/kevinkelly.bsky.social/post/3lv4vlgcpkp22\">Kevin Kelly writes</a>: \"When a customer of yours complains, always apologize first and ask, 'What can we do to resolve this?' even if it is not your fault. Acting as if the customer is right is a small tax to pay to grow a business.\"",
                    "created": "Tue, 29 Jul 2025 20:28:32 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Amen. Google sent an email saying my Google Fi account was going to be cancelled if i didn't do something, so I clicked the link, everything looked fine. They sent more emails like this, again everything seemed in order. I contacted them via support (hard to find) and they said everything looked fine. They also said I should be sure there was enough credit in the account. I wrote back saying that was insulting, I've been a customer for a long time, and have never missed a payment, and they should apologize for the threats and wasted time. I got back a <a href=\"https://imgs.scripting.com/2025/07/29/googleFiLotsOfWords.png\">long email</a> that did everything but apologize. They also threw in a little gaslighting, talking about my emotional state (frustrated, unsettled). Companies aren't allowed to have opinions about customers' emotions, esp over email.",
                    "created": "Tue, 29 Jul 2025 20:29:01 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Google needs to take a basic lesson in how to treat customers. ",
                    "created": "Tue, 29 Jul 2025 20:32:15 GMT",
                    "inlineImage": "https://imgs.scripting.com/2025/07/29/googleNeedsHelpWithThis.png",
                    "flInCalendar": true
                },
                {
                    "text": "PS: My feeling was more <i>surprise</i> that Google, a large company with billions of users and millions of customers couldn't get something this simple right. ",
                    "created": "Tue, 29 Jul 2025 20:34:31 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}