{
    "text": "Is this why Musk got cold feet?",
    "created": "Fri, 20 May 2022 18:49:38 GMT",
    "type": "outline",
    "metaImage": "http://scripting.com/images/2022/05/20/muskWavingGoodbye.png",
    "description": "Musk and his partners are squeezed in a hard-to-have-foreseen way. ",
    "subs": [
        {
            "text": "Why is Musk trying to pull out of the Twitter deal?",
            "created": "Fri, 20 May 2022 19:16:53 GMT",
            "flInCalendar": true
        },
        {
            "text": "I don't think it has much to do with how many bots are using Twitter, or whether Democrats are assholes, or even that Musk did or didn't show his dick to a stewardess. I think what really matters is what's happening to Tesla stock, and with it, Musk's wealth.",
            "created": "Fri, 20 May 2022 18:59:37 GMT",
            "flInCalendar": true
        },
        {
            "text": "Here are some facts.",
            "created": "Fri, 20 May 2022 19:00:46 GMT",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "Musk sent his acquisition offer to Twitter on <a href=\"https://qz.com/2167563/an-annotated-history-of-elon-musk-buying-twitter/\">April 13</a>. ",
                    "created": "Fri, 20 May 2022 18:49:49 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "On that day <a href=\"https://www.google.com/search?q=%24tsla\">Tesla stock</a> was trading at $1022.37 per share.",
                    "created": "Fri, 20 May 2022 18:50:39 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Today Tesla is selling for $645. That's about a 37% drop. ",
                    "created": "Fri, 20 May 2022 18:51:30 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "I don't know for sure, but I'd guess that Musk and his partners are all borrowing to buy Twitter. They certainly don't want to sell stock to raise the money to buy Twitter because that would be a taxable event. And if you take out a loan with your stock as collateral, you don't have to sell the stock, so -- no taxes. It's how rich people buy things. Even not-so-rich people do it. A moderately wealthy person who could afford to pay cash for a house, probably would just take out a loan, to avoid paying taxes. ",
            "created": "Fri, 20 May 2022 18:52:52 GMT",
            "flInCalendar": true
        },
        {
            "text": "But the huge drop in Tesla stock, and whatever stocks Larry Ellison is borrowing against to raise the money for his part of the deal, means that the bankers who are lending against that stock as collateral will want more stock. No problem you say, they all have lots of stock. But maybe he's already used that stock as collateral on other loans? Who knows how much of a stretch this is for Musk. He might not have enough stock to do the deal now. But he signed the deal, so.. ",
            "created": "Fri, 20 May 2022 19:04:43 GMT",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://www.google.com/search?q=%24tsla\">$TSLA</a> before and after April 13.",
            "created": "Fri, 20 May 2022 19:28:08 GMT",
            "inlineImage": "http://scripting.com/images/2022/05/20/tsla.png",
            "flInCalendar": true
        },
        {
            "text": "Musk and his partners are squeezed in a hard-to-have-foreseen way. The deal has become more expensive and harder to do. And maybe the market \"correction\" isn't done yet. Maybe Tesla will be worth half what it was, or less?",
            "created": "Fri, 20 May 2022 18:54:57 GMT",
            "flInCalendar": true
        },
        {
            "text": "BTW, if you want to get an idea of what this is like, season one of <a href=\"https://en.wikipedia.org/wiki/Succession_(TV_series)#Season_1_(2018)\">Succession</a> has the young Kendall Roy in a similar bind. :smile:",
            "created": "Fri, 20 May 2022 19:07:34 GMT",
            "flInCalendar": true
        },
        {
            "text": "Unless the market and $TSLA recover quickly this downturn is hitting Musk a lot harder than it would have if he had not done the Twitter deal. But he did, so he's kind of fucked, or so it seems. ",
            "created": "Fri, 20 May 2022 18:56:53 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}