{
    "text": "The fakest of fake news",
    "created": "Sat, 03 Jun 2017 17:44:13 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "On Twitter a friend <a href=\"https://twitter.com/mathewi/status/870997022169591808\">laments</a> that Wired was right about the web being \"dead.\" ",
            "created": "Sat, 03 Jun 2017 17:44:19 GMT",
            "image": "http://scripting.com/images/2017/06/03/wiredWebIsDeadFreeGift.png",
            "permalink": "http://scripting.com/2017/06/03.html#a010619"
        },
        {
            "text": "This gives me a sick feeling, because there's no objective truth to evaluate. A doctor could declare an animal dead, sometimes even that's debatable, but a concept, which is all the web is, never lived, so it could never die.",
            "created": "Sat, 03 Jun 2017 18:10:55 GMT",
            "permalink": "http://scripting.com/2017/06/03.html#a020655"
        },
        {
            "text": "It's the fakest of fake news. There's no there there. Impossible to <a href=\"http://scripting.com/stories/2011/12/13/whyAppsAreNotTheFuture.html\">argue</a> with, only possible to hurt. The only people who gain from it are those who wish it were dead. Who work to make it dead. ",
            "created": "Sat, 03 Jun 2017 17:45:36 GMT",
            "permalink": "http://scripting.com/2017/06/03.html#a010636"
        },
        {
            "text": "Journalists widely said Apple was dead in the mid-90s. It didn't kill Apple, but it did put a lot of developers out of business, and set the art of software development back probably by a decade or more. So journalist-based hype has a practical effect in addition to selling magazines. (BTW, they <a href=\"https://duckduckgo.com/?q=apple+is+dead&t=h_&ia=web\">still say</a> Apple is dead.)",
            "created": "Sat, 03 Jun 2017 17:46:36 GMT",
            "permalink": "http://scripting.com/2017/06/03.html#a010636"
        },
        {
            "text": "The web is our commons, it's the Central Park of the internet. Yes progress happened quicker a number of years ago. But as with Apple, we know that sometimes things that feel like they aren't growing actually are, we just couldn't see it.",
            "created": "Sat, 03 Jun 2017 17:48:11 GMT",
            "permalink": "http://scripting.com/2017/06/03.html#a010611"
        },
        {
            "text": "The web actually is big, and getting bigger. We use it all the time. <i>Dead</i> is absolute. In no way does that word apply to the web. And I wish people would stop and think before using it. ",
            "created": "Sat, 03 Jun 2017 17:54:39 GMT",
            "permalink": "http://scripting.com/2017/06/03.html#a010639"
        }
    ],
    "permalink": "http://scripting.com/2017/06/03.html#a010613"
}