{
    "text": "Let's run ads on Fox News",
    "created": "Sat, 16 Dec 2017 14:50:27 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Sometimes I watch the news just to pass the time. I'm reading stuff on my iPad, playing a game, thinking, making dinner, whatever, and I have the news on in the background. Usually it's MSNBC, but sometimes they're too loud or repetitive, so I switch, looking for a Law & Order rerun, or if I get really desperate, I might turn on Fox News, just to see what the Trump Propoganda Machine is selling. It's always the same. <i>They're</i> out to get us. <i>They're</i> stealing our shit. <i>We</i> work hard and <i>they</i> collect welfare. They vs We. We are good, they suck.",
            "created": "Sat, 16 Dec 2017 14:50:33 GMT",
            "image": "http://scripting.com/images/2017/12/16/clooney.png"
        },
        {
            "text": "So I was surprised to see <a href=\"https://www.youtube.com/watch?v=IbJQsbrwos0\">an ad</a> for \"the Y\" on Fox News -- showing people of all races, genders, abilities, ages and religions, getting along, doing things together, hanging out, laughing, being friends. The message is this: The Y is where we all come together. ",
            "created": "Sat, 16 Dec 2017 14:52:54 GMT",
            "urlvideo": "https://www.youtube.com/embed/IbJQsbrwos0"
        },
        {
            "text": "Obviously the ad is an editorial, trying to say to the Fox viewers, hey you know everyone else is just like you and we should try to get along. As I said, I was surprised. But on second thought, why not? Fox is there to make money and they make money from ads, and presumably the Y pays for their ads, so go for it.",
            "created": "Sat, 16 Dec 2017 15:06:37 GMT"
        },
        {
            "text": "It works the same on MSNBC. I see ads for all kinds of strange things, confirming Judge Gorsuch, for example. A young woman says she worked in The Obama Administration (whatever that means) and she thought Gorsuch was a good guy. He could be trusted. Maybe he's not such a Scalia or Thomas. Or they say the deficit is bad, that's why we have to cut spending, or the middle class deserves a tax cut, even though we were just told (on MSNBC) that the tax cut isn't for the middle class. They must pay for these ads because they're worth it. They must sow some doubt in liberal news-watchers. ",
            "created": "Sat, 16 Dec 2017 14:55:24 GMT"
        },
        {
            "text": "I'm tired of waiting for the Democratic Party to get its shit together. Let's start a PAC and run this message, before it's too late:",
            "created": "Sat, 16 Dec 2017 14:57:22 GMT",
            "subs": [
                {
                    "text": "Fact: Donald Trump, president of the United States has a weird as yet undetermined relationship with Russia. He probably owes them a lot of money. We need to know about this. Since the president hasn't been forthcoming, we're using the FBI.",
                    "created": "Sat, 16 Dec 2017 14:57:47 GMT"
                }
            ]
        },
        {
            "text": "I envision George Clooney saying this behind a desk in an office with an American flag on the wall. Sipping a cup of coffee. I am not fake news. I'm not a Democrat or Republican, just an American. I want to know where Trump's loyalties lie, who's paying him, that's why I support the FBI. ",
            "created": "Sat, 16 Dec 2017 14:58:21 GMT"
        },
        {
            "text": "Supporting the FBI should be an easy idea to sell on Fox. ",
            "created": "Sat, 16 Dec 2017 14:59:17 GMT"
        },
        {
            "text": "We need the skills to create the ad, and the money to run it. I think we can get the money. I'd kick in $100 for sure, maybe even $1000. If the ad were good enough, you would too. And I think so would a fair number of people who voted for Trump. All we want to know is what he won't tell us. Where does his money come from?",
            "created": "Sat, 16 Dec 2017 14:59:27 GMT"
        },
        {
            "text": "That's the idea. ",
            "created": "Sat, 16 Dec 2017 15:00:37 GMT"
        }
    ]
}