{
    "text": "My dialog with Joe Trippi continues",
    "created": "Tue, 22 Jun 2021 17:55:08 GMT",
    "type": "outline",
    "metaImage": "http://scripting.com/images/2021/06/22/abrams.png",
    "description": "There's no way in a two-party system if one party disintegrates, that the other party doesn't also fall apart.",
    "subs": [
        {
            "text": "<i><a href=\"http://scripting.com/2021/06/08.html#a152650\">Last time</a> it was an open podcast, this time an open email. </i>",
            "created": "Tue, 22 Jun 2021 17:55:16 GMT",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://twitter.com/JoeTrippi\">Joe</a>, I listened to your <a href=\"https://podcasts.apple.com/us/podcast/inside-gops-plot-to-white-wash-january-6th-conversation/id1530639447?i=1000526220530\">interview with Michael Cohen</a>. really liked the negotiating with hostages idea. It's true, they are hostages, and it made me stop and think because at first i thought you said hostage-takers.    ",
            "created": "Tue, 22 Jun 2021 17:55:41 GMT",
            "flInCalendar": true
        },
        {
            "text": "Working to get Dems elected is not enough. The Democratic Party is in the way. It might be better to run ads attacking them first. To establish that something unusual is going on, that the Dems are weak and disorganized and not the answer.",
            "created": "Tue, 22 Jun 2021 17:58:03 GMT",
            "flInCalendar": true
        },
        {
            "text": "There's no way in a two-party system if one party disintegrates, that the other party doesn't also fall apart.",
            "created": "Tue, 22 Jun 2021 17:58:42 GMT",
            "flInCalendar": true
        },
        {
            "text": "In order to compete with the Repubs, which we have to do, the Democratic Party has to be pushed into the background.",
            "created": "Tue, 22 Jun 2021 17:58:50 GMT",
            "flInCalendar": true
        },
        {
            "text": "We need an answer to Donald Trump. It's not as Michelle Obama said when they go low we go high. That's wrong. we need to go lower. Sorry. This isn't church, you don't get to heaven by being pious.",
            "created": "Tue, 22 Jun 2021 17:59:06 GMT",
            "flInCalendar": true
        },
        {
            "text": "Michael Cohen has some of what's needed. I really liked what he said about driving sign trucks through neighborhoods stating obvious truths that everyone knows that they never say on TV. It's a brilliant idea. He's a brilliant guy. ",
            "created": "Tue, 22 Jun 2021 17:59:37 GMT",
            "flInCalendar": true
        },
        {
            "text": "I don't think the Lincoln Project is the right banner for you to fly under. No matter what they do they identify as Republicans. i don't know if you're a basketball fan but that's like saying the 76ers or Nets should lead us in our quest to win the title. (Both have been eliminated). They are brilliant advertisers, but they are not leaders because they have the Republican stink on them.",
            "created": "Tue, 22 Jun 2021 18:00:05 GMT",
            "flInCalendar": true
        },
        {
            "text": "We need someone strong, believable, and most important new.",
            "created": "Tue, 22 Jun 2021 18:00:53 GMT",
            "flInCalendar": true
        },
        {
            "text": "BTW, someone who has leadership qualities -- Stacey Abrams. I found when she endorsed Joe Manchin's election reform platform I had to go look at it. Because I trust her and believe in her intelligence. ",
            "created": "Tue, 22 Jun 2021 18:00:57 GMT",
            "flInCalendar": true
        },
        {
            "text": "Do a podcast with her Joe, ask her what we should be doing now. I'd listen to that one. ",
            "created": "Tue, 22 Jun 2021 17:55:47 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}