{
    "text": "The old weblogs.com feeling",
    "created": "Sun, 18 Jun 2023 16:57:54 GMT",
    "type": "outline",
    "metaImage": "http://scripting.com/images/2023/06/18/weblogsComScreenShot.png",
    "description": "You could quickly see which blogs had updated recently so you knew there was a reason to go there. ",
    "subs": [
        {
            "text": "One of the nice things about \"FeedLand\" is we can all look at each other's feed lists to get ideas about what to subscribe to.",
            "created": "Sun, 18 Jun 2023 16:58:17 GMT",
            "flInCalendar": true
        },
        {
            "text": "Yesterday I was playing with ideas, looking at a bunch of different people's collections, and I saw in <a href=\"https://feedland.org/?username=jjn1\">John Naughton's feed list</a> a reminder of a centerpiece of the early blogging world, weblogs.com. You could quickly see which blogs had updated recently so you knew there was a reason to go there. It was the beginning of what eventually became Twitter, Google Reader, Facebook, etc.",
            "created": "Sun, 18 Jun 2023 16:58:47 GMT",
            "flInCalendar": true
        },
        {
            "text": "Over time as more blogs came online, it got diluted, we had to come up with something better and luckily \"RSS\" came along, and without much thought we switched over to that and weblogs.com fell into disuse. ",
            "created": "Sun, 18 Jun 2023 16:59:03 GMT",
            "flInCalendar": true
        },
        {
            "text": "Here's an <a href=\"https://web.archive.org/web/20021123211136/http://www.weblogs.com/\">archive.org snapshot</a> and <a href=\"http://scripting.com/images/2023/06/18/weblogsComScreenShot.png\">screen shot</a> of weblogs.com from November 2002. ",
            "created": "Sun, 18 Jun 2023 17:07:31 GMT",
            "flInCalendar": true
        },
        {
            "text": "Looking at <a href=\"https://feedland.org/?username=jjn1\">Naughton's list</a> I had the old weblogs.com feeling! These are all people I'm interested in, but I don't have them in their own category anywhere, so I never see it like that.",
            "created": "Sun, 18 Jun 2023 16:59:53 GMT",
            "flInCalendar": true
        },
        {
            "text": "With a bit of coordination it would be pretty cool to have a FeedLand page that tracked a bunch more Old School bloggers who are still blogging, or give ones who aren't a reason to restart. ",
            "created": "Sun, 18 Jun 2023 17:00:11 GMT",
            "flInCalendar": true
        },
        {
            "text": "Partial screen shot of Naughton's list shortly after this item was posted.",
            "created": "Sun, 18 Jun 2023 17:21:33 GMT",
            "inlineImage": "http://scripting.com/images/2023/06/18/feedlistscreen.png",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}