{
    "text": "An old friend: Richard MacManus",
    "created": "Wed, 21 Jun 2017 10:29:51 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Richard is one of the old school bloggers. He started <a href=\"https://web.archive.org/web/20031014183603/http://readwriteweb.com\">ReadWriteWeb</a> in 2003. It started as a Radio UserLand project and grew into a leading tech publication, something which I'm personally proud of. ",
            "created": "Wed, 21 Jun 2017 10:33:59 GMT",
            "image": "http://scripting.com/2016/03/10/clown.png",
            "permalink": "http://scripting.com/2017/06/21.html#a060659"
        },
        {
            "text": "He has a <a href=\"http://altplatform.org/2017/06/20/building-a-blogroll-in-2017/\">new blog</a> up and running. I've added it to my <a href=\"http://scripting.com/river.html\">personal river</a> here on Scripting News. He asks about where the blogrolls have gone, a topic I <a href=\"http://scripting.com/2017/06/18.html#a110612\">wrote about</a> a couple of days ago. Richard would certainly be in my blogroll.",
            "created": "Wed, 21 Jun 2017 10:25:16 GMT",
            "permalink": "http://scripting.com/2017/06/21.html#a060616"
        },
        {
            "text": "Maybe the subscription list <a href=\"http://scripting.com/2016/09/23/otherBlogsLikeScriptingNews.html\">for</a> my <a href=\"http://bloggers.scripting.com/\">blogger's river</a> would make a good start for my blogroll, or vice versa? Something we didn't do in the first iteration is make our rivers public. Nowadays I'm doing that routinely. A few examples are in the left sidebar here on \"Scripting News\".  ",
            "created": "Wed, 21 Jun 2017 10:40:31 GMT",
            "permalink": "http://scripting.com/2017/06/21.html#a060631"
        },
        {
            "text": "Richard has turned to <a href=\"https://indieweb.org/\">IndieWeb</a> for the latest on open web tech. That's fine, but you have to look elsewhere too, because as he's discovered, they only embrace part of the open web. It's too bad they chose such an inclusive name, but have an exclusive approach. For example, they have avoided \"RSS\", for reasons I'm sure I don't understand (I've listened, so no need to repeat the reasoning). We need all the advantages we can get because there are <a href=\"http://scripting.com/2017/06/18.html#a090658\">serious</a> <a href=\"http://scripting.com/2016/10/03/turnsOutLessFacebookIsOk.html\">headwinds</a> these days for blogging. RSS is serious open web technology. To not build on it is unthinkable, for me at least. ",
            "created": "Wed, 21 Jun 2017 10:30:33 GMT",
            "permalink": "http://scripting.com/2017/06/21.html#a060633"
        },
        {
            "text": "Re integration between writing and reading, another topic of interest to Richard, all my rivers <a href=\"http://scripting.com/images/2017/06/21/postingFromARiver.png\">hook</a> into \"Radio3\", which is my latest <a href=\"http://scripting.com/links.html\">linkblogging</a> tool. For reading, I encouraged Richard to look at \"Electric River\", it's the closest to what Radio UserLand did with aggregation in 2002. It runs on your Mac desktop, as the original did. When he wants to go all-in with rivers, nothing can take the place of \"River5\", which is getting both modular and deep. I'm doing more work on that. Rivers have not finished evolving as far as I'm concerned. ",
            "created": "Wed, 21 Jun 2017 10:32:27 GMT",
            "permalink": "http://scripting.com/2017/06/21.html#a060627"
        }
    ],
    "permalink": "http://scripting.com/2017/06/21.html#a060651"
}