{
    "text": "I'm flying blind about energy use",
    "created": "Sun, 06 Mar 2022 13:25:35 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Here's an idea of how to cut fuel consumption for electricity. ",
            "created": "Sun, 06 Mar 2022 13:31:56 GMT",
            "flInCalendar": true
        },
        {
            "text": "My electric bill has been going up, dramatically. Not sure how much this is due to rising energy cost, or my purchase of a <a href=\"http://daytona.scripting.com/?q=tesla&collection=scriptingnews\">Tesla</a> electric car last year, or something else. I use electricity for lots of things. More all the time.",
            "created": "Sun, 06 Mar 2022 13:36:18 GMT",
            "flInCalendar": true
        },
        {
            "text": "What's the difference in cost between keeping the thermostat at 65 vs 60? Maybe it's insignificant, or maybe it's very significant. I have no idea. ",
            "flInCalendar": true
        },
        {
            "text": "I have no tools to tell me what my electric consumption is graphed over time. If I did, I could for example, unplug the car and see how much the consumption goes down. Or turn down the thermostat to 60 and see what happens.",
            "flInCalendar": true
        },
        {
            "text": "Who knows what my car is doing when I'm not watching? It has a mind of its own. Not like old cars that did nothing when they're turned off, my Tesla is always waking up and doing stuff. I bet that uses energy. ",
            "flInCalendar": true
        },
        {
            "text": "Maybe one of my devices is somehow malfunctioning and using a lot of energy and I could reduce consumption by replacing it, or leave it turned off unless I'm using it. ",
            "flInCalendar": true
        },
        {
            "text": "We're all flying blind. Let's create the tools to optimize energy use. I bet it would save a lot of money and be a good way to cut energy consumption. ",
            "created": "Sun, 06 Mar 2022 13:32:01 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}