{
    "text": "May 4",
    "created": "Tue, 04 May 2021 13:18:34 GMT",
    "type": "calendarDay",
    "name": "04",
    "subs": [
        {
            "text": "Fifty years ago today: <a href=\"https://www.youtube.com/watch?v=YX95QSKBODo\">Four Dead in Ohio</a>.",
            "created": "Tue, 04 May 2021 14:12:15 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=YX95QSKBODo",
            "flInCalendar": true
        },
        {
            "text": "One year ago today: \"People seem to feel it's over, they see the weather changing, winter is finally over, summer is here,  we must have survived, time to go out and play. That's evolution for you. Of course the virus is still out there hunting us.\"",
            "created": "Tue, 04 May 2021 20:32:52 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I wonder if people who feel that wearing a mask or getting vaccinated is giving up too much freedom, realize that you have absolutely zero freedom if you are hospitalized with Covid. You can't get up from bed, can't go home, can't even take a piss on your own. ",
            "created": "Tue, 04 May 2021 14:36:58 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I question the idea that 1/2 of our legislative government can be trying to overthrow it. I think there has to be a radical response to this. Pretending it's possible is imho impossible. ",
            "created": "Tue, 04 May 2021 14:20:25 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Two controversial questions",
            "created": "Tue, 04 May 2021 13:19:14 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I wrote a couple of potentially controversial tweets yesterday and earlier today. I'm happy to say everyone responded respectfully, and at least tried to respond to the questions I asked. ",
                    "created": "Tue, 04 May 2021 13:18:35 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The first was about political discussions at work. The issue was raised by the recent controversy at the Basecamp company, which had suspended political discussions on the company's internal message boards. Later it came out that they were getting criticism for an internal list they kept of customers with \"funny\" names. I wrote about this on <a href=\"http://scripting.com/2021/04/28.html#a163250\">April 28</a>.",
                    "created": "Tue, 04 May 2021 13:19:42 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Here's what I wrote in a <a href=\"https://twitter.com/davewiner/status/1389523386930499585\">twitter thread</a> earlier today.",
                    "created": "Tue, 04 May 2021 13:21:02 GMT",
                    "subs": [
                        {
                            "text": "It’s a privilege to spend the day discussing politics instead of doing the job you were hired to do. At least some jobs could not work that way. Could a bus driver? An assembly line worker. A teacher. A tech support worker. A cashier at Starbucks. A cop. Emergency room doctor.",
                            "created": "Tue, 04 May 2021 13:21:41 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Suppose you worked at a company handling customer service calls. It’s a grind. All those angry people you deal with. But it’s a job. One of your colleagues spends much of their time on an internal discussion board commenting on the people they work with.",
                            "created": "Tue, 04 May 2021 13:21:57 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "They start talking about you! You looked at someone funny in the lunchroom. You might be a white supremacist. Do you keep answering support calls, or join the discussion. You’re worried you might lose your job. Someone saw you reading a suspicious magazine.",
                            "created": "Tue, 04 May 2021 13:22:06 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "If you can't tell, as a former founder of two companies, I think people should keep political discussions at work to an absolute minimum. It should be possible for people with different political views to work together. This, to me, is one of the central features of freedom. You are free to believe what you believe and so am I. But we can and must still respect each other, and the highest form of respect in my opinion is to create something with each other. Personal blogs are good places to express political opinions, so is Twitter. But not work. ",
                    "created": "Tue, 04 May 2021 13:46:04 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The other <a href=\"https://twitter.com/davewiner/status/1389318466524618759\">thread</a> was about the use of the forbidden n-word to apply to white people.",
                    "created": "Tue, 04 May 2021 13:22:28 GMT",
                    "subs": [
                        {
                            "text": "Dave Chappelle uses the n-word to speak about individual white people. ",
                            "created": "Tue, 04 May 2021 13:23:54 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "What is it supposed to mean?",
                            "flInCalendar": true
                        },
                        {
                            "text": "Suppose Dave says a white person is his n-word. ",
                            "flInCalendar": true
                        },
                        {
                            "text": "Is that white person then permitted to reciprocate? ",
                            "flInCalendar": true
                        },
                        {
                            "text": "If so, how?",
                            "flInCalendar": true
                        },
                        {
                            "text": "And please no abuse. Thanks. ;-)",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "The best <a href=\"https://twitter.com/tanyaweiman/status/1389378245888512007\">response</a> imho came from Tanya Weiman.",
                    "created": "Tue, 04 May 2021 13:24:14 GMT",
                    "subs": [
                        {
                            "text": "Go the <a href=\"https://www.youtube.com/watch?v=PK-DSm--rww\">Larry David</a> route and say My Caucasian!",
                            "created": "Tue, 04 May 2021 13:25:09 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "I like that a lot, but only if you feel affection toward the person. I don't feel that way about Chappelle. I think he's using it as an act of hostility, knowing there's no way for a white person to respond in kind. But thanks to Larry David, if you have the chutzpah to talk back, we have a good response! ",
                    "created": "Tue, 04 May 2021 13:25:24 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Karri Carlson asked me to listen to <a href=\"https://twitter.com/heykarri/status/1389388998154412037\">comments</a> by Ta-Nahisi Coates, which I did, specifically pointing at 3:23 in the video. I understand that blacks use the n-word as a term of endearment for each other and it's not something white people are entitled to an opinion about, according to Coates. Whatever he says, we can have opinions about whatever we want, as he has negative opinions about white people, and expresses them. At 3:23 he makes a generalization which I found offensive. I don't think I own everything. Further I don't <i>want</i> to use the n-word, and further, please don't use that word to refer to me. Thanks.  ",
                    "created": "Tue, 04 May 2021 13:26:20 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}