{
    "text": "May 7",
    "created": "Fri, 07 May 2021 13:49:58 GMT",
    "type": "calendarDay",
    "name": "07",
    "subs": [
        {
            "text": "Thanks to John Naughton for the very nice <a href=\"http://scripting.com/images/2021/05/07/naughtonOnArtShow.png\">writeup</a> of \"Art Show\" in his <a href=\"https://memex.naughtons.org/friday-7-may-2021/33696/\">Memex 1.1</a> blog and newsletter.",
            "created": "Fri, 07 May 2021 13:53:30 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "BTW I've heard it asked -- what's the big deal about \"Art Show\" -- I could write it in an afternoon. Well maybe you could (actually no you can't), but that's not the point. The points are this: 1. Art and 2. A <a href=\"https://github.com/scripting/artDownloader#the-fan-feeds\">community</a> of curators doing it for love. But really it's about #1. It's nice to add art to your life where ever it makes sense. Beautiful images scrolling through the screen of a computer is a good thing, if that's what you like. If my development work ever was about prowess, that part of my life is long-gone. It's something young people worry about. Perhaps a residual part of the mating dance. As you get older, you're constantly reminded that you have no prowess. And gentler things, like appreciating other people's artistic visions, come to the front. So why do Art Show? It's the art, dummy! :smile:",
            "created": "Fri, 07 May 2021 13:55:30 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/05/07/michelangelo.png",
            "flInCalendar": true
        },
        {
            "text": "Today's <a href=\"https://www.nytimes.com/2021/05/07/podcasts/the-daily/coronavirus-herd-immunity-vaccine.html\">Daily podcast</a> was sad, both because we learned that herd immunity is slipping away  and also because [%search: Donald McNeil%] wasn't there to explain it in context of all his other prognostications. ",
            "created": "Fri, 07 May 2021 19:09:10 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Google Maps on my iPhone has been giving bad driving directions around <a href=\"https://www.google.com/maps/place/Kingston,+NY+12401/@41.9273842,-74.0692088,12z/data=!3m1!4b1!4m5!3m4!1s0x89dd0f012dc98127:0x41d7895a5832c913!8m2!3d41.9270367!4d-73.9973608\">Kingston, NY</a>. Sending me on a five mile loop to go somewhere that's less than 1/2 mile away. This is new behavior. I wonder if it is related to my blog not supporting <a href=\"http://this.how/googleAndHttp/\">HTTPS</a>. (That was a joke, but it could happen. Their search index for my blog gets worse all the time. And I believe that <i>is</i> punishment for not obeying their edict.)",
            "created": "Fri, 07 May 2021 15:44:45 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1390703697630580737\">Why people hate Elon Musk</a> starts a <a href=\"http://thesaurus.land/?word=rambling\">rambling</a> Twitter thread. ",
            "created": "Sat, 08 May 2021 00:57:38 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The changes happening in the Republican Party are more than disturbing. Given that there have been no charges or arrests of <a href=\"https://www.cnn.com/2021/03/05/politics/swalwell-trump-giuliani-brooks-lawsuit/index.html\">political leaders</a> for instigating the January 6 attack on the US Capitol, it's fair to assume that it will happen again, and next time it: 1. Might be successful and 2. It will happen with the full support of one of the two major political parties. We are sleeping through this. ",
            "created": "Fri, 07 May 2021 13:49:59 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I listened to another Kawasaki podcast, an interview with <a href=\"https://guykawasaki.com/mark-manson/\">Mark Manson</a>, a deliberately foul-mouthed young man. They talked about people's legacies. I don't doubt that people want to leave something behind, but as I've aged, I've come to an unorthodox view of this. With <a href=\"https://www.worldometers.info/world-population/\">8 billion</a> people on the planet, if we all succeed at leaving something of ourselves behind, what a fucking mess that would be! Some of these behind-leavings will cancel each other out. And others will be horribly misguided, they'll be exactly the wrong thing to leave behind. A better approach, imho, is to do things that please you, and others. Be kind. Help people. And whatever is left behind, incidentally, from that all that, is what you leave behind. Don't consciously try to change the world. Just do your thing. I'm not perfect about this. I would like to see what I've written, both in software and prose, survive me. They won't take up a lot of space. And, in all likelihood <i>none</i> of it will survive me, I'm aware of that. What can I do but shrug? Even so, I'm <i>still diggin!</i>",
            "created": "Fri, 07 May 2021 14:04:47 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/05/07/subtleArtOfNotGivingAFuck.png",
            "imageLink": "https://www.amazon.com/Subtle-Art-Not-Giving-Counterintuitive/dp/0062641549/ref=asc_df_0062641549/?tag=hyprod-20&linkCode=df0&hvadid=312643571004&hvpos=&hvnetw=g&hvrand=6785547708999327692&hvpone=&hvptwo=&hvqmt=&hvdev=c&hvdvcmdl=&hvlocint=&hvlocphy=1023511&hvtargid=pla-394582189134&psc=1",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}