{
    "text": "May 8",
    "created": "Sat, 08 May 2021 14:36:54 GMT",
    "type": "calendarDay",
    "name": "08",
    "subs": [
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1391044631513665546\">Poll</a>: Have you invested in cryptocurrency such as BitCoin?",
            "created": "Sat, 08 May 2021 15:01:27 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1391044631513665546",
            "flInCalendar": true
        },
        {
            "text": "I'm working on the docs for Drummer's <i>twitter</i> verbs today, and came across a few <a href=\"https://twitter.com/i/lists/2091338/members\">examples</a> from the early days of Twitter lists. ",
            "created": "Sat, 08 May 2021 16:00:59 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The reason <a href=\"https://nymag.com/intelligencer/article/elizabeth-warren-book-persist-campaign-memoir-2020.html\">Warren's campaign failed</a> is that once she was the frontrunner and people got a good look at her, they didn’t like her. She’s kind of what you’d expect, a <a href=\"https://hls.harvard.edu/faculty/directory/10935/Warren\">Harvard professor</a>. They do well at the top of academia, but don’t have a popular touch, and I’m being generous. Certainly there was some sexism, people who wouldn't vote for a woman under any circumstances, but she became the frontrunner with everyone aware of her gender. A woman candidate could have won the nomination in my opinion, someone like <a href=\"https://en.wikipedia.org/wiki/Amy_Klobuchar\">Amy Klobuchar</a> or Michigan governor <a href=\"https://en.wikipedia.org/wiki/Gretchen_Whitmer\">Gretchen Whitmer</a>. It's ridiculous to conclude that a woman couldn't get the nomination, esp since the Democratic nominee in 2016 was a woman. If Warren wants to be president she's going to have to listen to people outside her bubble. People who will, as they say, speak truth to power. ",
            "created": "Sat, 08 May 2021 14:37:41 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/08/07/elizabethWarrenActionFigure.png",
            "flInCalendar": true
        },
        {
            "text": "When you hear about new strains of Covid that are ripping into India, as an American do you feel as if it's far away and won't affect me? Does it make you want to get vaccinated? What if our vaccines don't protect against the new strains? Are you ready for a new lockdown?",
            "created": "Sat, 08 May 2021 14:36:55 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "As a basketball fan this is how I look at where we are with Covid in the US. We have a 2 point lead going into the fourth quarter. Our two star players are out with injuries. Our fans are going home, they think the game is won. I know anything could happen at this point.",
            "created": "Sat, 08 May 2021 14:51:11 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Front page of the NYT one year ago today.",
            "created": "Sat, 08 May 2021 21:56:05 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2021/05/08/nytFrontPageOneYearAgoToday.png",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}