{
    "text": "May 9",
    "created": "Sun, 09 May 2021 13:07:38 GMT",
    "type": "calendarDay",
    "name": "09",
    "subs": [
        {
            "text": "Happy Mother's Day to my <a href=\"http://scripting.com/2018/02/26/024939.html\">mom</a>, where ever she be. :heart:",
            "created": "Mon, 10 May 2021 00:34:38 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Our problem is we live our lives on TV. In our minds we’re badasses like the characters on TV. Our lives feel dramatic, but they’re imaginary.",
            "created": "Sun, 09 May 2021 13:07:39 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Puzzle I saw on Twitter, sorry I don't have the link. Suppose I have three numbers. The second is the square of the first, the third is the square of the second and the first is the square of the third. What are the values of the three numbers? I didn't seen their solution. ",
            "created": "Sun, 09 May 2021 13:13:49 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "More re <a href=\"http://scripting.com/2021/05/08.html#a143741\">Elizabeth Warren</a> as a candidate for president. We liked the idea of Warren more than we liked Warren herself. I saw her on TV during the campaign, and this idea hit me square between the eyes, she's talking to us like we're in the <a href=\"https://hls.harvard.edu/faculty/directory/\">faculty</a> lounge at Harvard Law School. Very top down. Center of the universe, only this isn't a good image to project to voters. They want to feel feel understood, which is weird because the candidate is doing the talking. HLS faculty make good <a href=\"https://en.wikipedia.org/wiki/List_of_law_schools_attended_by_United_States_Supreme_Court_justices\">Supreme Court justices</a>, not presidents. We had one with Obama. And he was funnier than Warren. She's got a real mean streak. Not good for someone who wants to lead the Free World. Clearly they understood this problem when she launched her campaign, because they presented her as a down home single mom from Oklahoma. She may have been that at one time, but that's not who she is today. ",
            "created": "Sun, 09 May 2021 14:39:35 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/05/09/neverthelessShePersisted.png",
            "flInCalendar": true
        },
        {
            "text": "Dear PC police, I use the term <a href=\"https://www.google.com/search?q=site%3Ascripting.com+%22black+people%22\">black people</a> often enough. :smile:",
            "created": "Sun, 09 May 2021 19:33:10 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}