{
    "text": "May 11",
    "created": "Tue, 11 May 2021 16:44:03 GMT",
    "type": "calendarDay",
    "name": "11",
    "subs": [
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1392240236109996033\">If Giuliani is arrested, Trump will pardon him</a>. Yes, I know former presidents can't pardon people. But Trump says he won. A fair number of people agree. Some work in law enforcement. Let this fester a few more months. There will be a \"controversy\" about who the \"real\" president is. I said Trump will pardon him. Who will do what about that? How many days of fake rage will this generate on CNN, MSNBC, Fox, etc. No one seems to grasp the kind of twisted horror show American politics is becoming. Also, what happens if a Democratic senator dies. It's good to have programmers around. We are paid to think of the worst thing that could possibly happen. ",
            "created": "Tue, 11 May 2021 23:07:14 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Interesting <a href=\"https://twitter.com/sabre23t/status/1391981493438668802\">tweet</a> from a person named SMS. \"I would love to see how your outliner app can work with Logseq. A few Obsidian users had got Logseq to work with Obsidian on the same folder.\" Lots of new terms in that sentence. He posted a pointer to this <a href=\"https://forum.obsidian.md/t/logseq-a-perfect-companion-for-obsidian/10887\">post</a>. Okay so <a href=\"https://obsidian.md/\">Obsidian</a> is something like Roam, but it's an open system, where Roam is a silo with lots of lock-in. So we like Obsidian over Roam, instantly -- simply because our tools (yours and mine) have a chance of participating, where Roam, well we can use their outliner, and get locked-in, which I don't see happening any time soon. \"LO2\" is where we start. Since outlines are in an easily used and open format dating back over 20 years, and can be made accessible to any web-able app (by making them public), it should be possible to <i>easily</i> hook it up to Obsidian or any similarly open platform. This is a good place to start. Now, this has to be a community thing, because I'm busy working on a new product, and don't want to detour. And that's why we support open formats and protocols, so there are no limits on what users and devs can do. See my <a href=\"http://scripting.com/2021/05/10/164703.html?title=myNolockinPledge\">no-lock-in pledge</a>. This isn't new, it's the same idea I've been using since I started developing commercial software, way back with ThinkTank in 1983. ",
            "created": "Tue, 11 May 2021 16:44:04 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/sabre23t/status/1391981493438668802",
            "image": "http://scripting.com/images/2020/06/29/alice.png",
            "flInCalendar": true
        },
        {
            "text": "BTW, here's <a href=\"http://scripting.com/\">my blog</a>, and this is the <a href=\"http://electricserver.scripting.com/users/davewiner/electric/blog.opml\">OPML file</a> it's generated from. Gives you an idea of how a chronologic outline can be turned into a publication. My blog has been running since 1994, and for most of it, I've been writing it in my outliner. I did take a few detours to use other tools I was working on, but realized eventually that the only writing tool for me is the outliner. ",
            "created": "Tue, 11 May 2021 16:54:02 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Testing local file system with Logseq",
            "created": "Tue, 11 May 2021 17:09:37 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Okay I don't know much about either <a href=\"https://github.com/logseq/logseq/blob/master/README.md\">Logseq</a> or <a href=\"https://www.google.com/search?q=mozilla+local+filesystem\">local file systems</a>, but I'm just trying it out, starting on <a href=\"https://logseq.com/\">this page</a>. There was a box I clicked on that asked it to connect with the local file system. I was expecting something like localStorage, but it's not, it's better. The files are stored in a folder on my local system. That means they can be used by, or generated by, other apps. Very nice. I'm not sure what Logseq does with them from there, if they can be connected with other apps in some way.  ",
                    "created": "Tue, 11 May 2021 17:09:55 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Anyway, here are two screen shots. ",
                    "created": "Tue, 11 May 2021 17:12:13 GMT",
                    "subs": [
                        {
                            "text": "1. A simple <a href=\"http://scripting.com/images/2021/05/11/editor.png\">outline</a> as I edit it. ",
                            "created": "Tue, 11 May 2021 17:12:21 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "2. What that <a href=\"http://scripting.com/images/2021/05/11/markdown.png\">generates</a> in Markdown.",
                            "created": "Tue, 11 May 2021 17:12:37 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "Here's an <a href=\"https://web.dev/file-system-access/\">intro</a> from Google to the <a href=\"https://wicg.github.io/file-system-access/\">File System Access API</a>, updated in April 2021. ",
                    "created": "Tue, 11 May 2021 17:36:45 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}