{
    "text": "May 13",
    "created": "Thu, 13 May 2021 11:50:58 GMT",
    "type": "calendarDay",
    "name": "13",
    "subs": [
        {
            "text": "<a href=\"http://this.how/opmlChecklist/\">New Howto</a>: Examples, source code and advice for people adapting outliners to read and write OPML. ",
            "created": "Thu, 13 May 2021 20:33:19 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Knicks clinch, I'm ecstatic",
            "created": "Thu, 13 May 2021 12:47:39 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "The Knicks suck in so many ways. But this year they suck less. Last night the <a href=\"https://sports.yahoo.com/knicks-clinch-playoff-berth-first-021855101.html\">Knicks clinched</a> a spot in the NBA playoffs. Tears are streaming down my sad old face as I write this. The first playoff year since 2012-13, the season of <a href=\"https://bleacherreport.com/articles/1747434-timeline-of-jeremy-lins-rise-to-linsanity-and-journey-to-where-he-is-today\">Linsanity</a>. This year it's a team full of Linsanity. Randle, Barrett, Derek Rose, Quickley, Bullock and so many more. A lovely team like the 1969 Mets. So the <a href=\"https://youtu.be/Yb0HCTe1ET4?t=30\">paper bags</a> come off our heads, at least for a while. We're no long staring into space wondering how a team could possibly suck as bad as the Knicks. Fans being kicked out of the Garden by the owner for telling the truth about him and his stinkin team. Phil Jackson, his triangle offense and all the lousy trades. This was the year the superstars of the NBA spit on the Knicks and went to Brooklyn. There must be a Basketball God who looked at this and said, my dear friends, fate is not in the hands of KD, Kyrie and Harden. I am the master of fate. The Knicks believed in themselves and we came to believe in them, however tentatively. And meanwhile, thankfully, Melo, playing in Portland, seems happy in his new role. For one day in May, pandemic or not, all is good because god loves us and we love the Knicks. ",
                    "created": "Thu, 13 May 2021 11:50:59 GMT",
                    "image": "http://scripting.com/images/2021/05/13/knicksFan.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Double-square brackets revisited",
            "created": "Thu, 13 May 2021 12:47:23 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "<a href=\"http://scripting.com/2021/05/12.html#a142449\">Yesterday</a> I explained what the &lsqb;[square brackets]] are doing in the various outlining products that support them. But I got it wrong. They are simpler than I thought, and represent a feature we had in our web CMSes going back to <a href=\"http://scripting.com/clay/whatdoesclaylooklike.html\">Clay Basket</a> in 1995. They're doing the same thing they do in Wikis.",
                    "created": "Thu, 13 May 2021 12:38:09 GMT",
                    "type": "outline",
                    "flInCalendar": true
                },
                {
                    "text": "Suppose you've written something in an outline entitled Bill Gates vs The Internet. Then a year later you could link to the <a href=\"http://scripting.com/davenet/1994/10/18/billgatesvstheinternet.html\">story</a> with &lsqb;[Bill Gates vs The Internet]]. ",
                    "created": "Thu, 13 May 2021 12:48:50 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It's useful if you give titles to what you write, but this is an old discussion not just in blogland but elsewhere apparently. To programmers it is convenient if every piece has a title. But the truth is most items in web and personal writing don't have titles, in this sense: there isn't an obvious title for them, if you had to come up with one it would be convoluted, and probably collide with some other convoluted title, depending on how long you had been writing. ",
                    "created": "Thu, 13 May 2021 12:49:19 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Most of the things I write don't get titles, so this feature, with this definition, would be fairly useless to me. I use permalinks in their place, therefore I've made it really easy to generate an <a href=\"https://www.w3schools.com/tags/tag_a.asp\">anchor tag</a> in my writing. ",
                    "created": "Thu, 13 May 2021 12:50:10 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "When I started blogging in 1994, all my pieces had titles, but over time, I realized my daily writing comes in long and short bits, and even many of the longish ones don't get titles. I'm not writing for a magazine or newspaper. I'm writing a blog. My thoughts. ",
                    "created": "Thu, 13 May 2021 12:50:40 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I see how they get around this in Roam by starting a new outline every day, and giving it a title, which is the date. I could do that in my blogging outline, and even in my development status outline. But I have to say I've never wished for such a feature. Maybe now that I know they use them so much in other products I'll get more ideas. ",
                    "created": "Thu, 13 May 2021 12:51:04 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "In the meantime, I automatically put a <i>created</i> attribute on every node, which is a string representation of the date-time, for example: Thu, 13 May 2021 16:41:07 GMT. From that I generate a permalink for the node, which is displayed next to it in the web rendering by a purple poundsign. If you're reading this piece on the web, you'd see a purple poundsign next to each paragraph. ",
                    "created": "Thu, 13 May 2021 16:41:07 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Lots more to say. In Roam et al, they use links as private connectors. When I refer to a piece called My Favorite Soup that refers to my piece with that title, not yours. But in a wiki, which is a group writing tool, there's only one piece with that name. ",
                    "created": "Thu, 13 May 2021 12:51:19 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Our outlines have attributes, and conventions for what the attribute names mean. For example, if a node has type \"include\" and a \"url\" attribute, that's an include node. The url points to an OPML file. When you expand the node in an outline, we read the file, parse it, and insert its contents under the include node. All that happens instantaneously for not-too-large included outlines. Some people call these transclusions, we call them includes. It's the outline equivalent of an HTML link. In Drummer it will be possible to have these link to specific nodes in outlines. Bookmarks can already do this, in the Drummer in development.",
                    "created": "Thu, 13 May 2021 12:52:32 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "We also have <a href=\"https://www.google.com/search?q=site%3Ascripting.com+glossary\">glossaries</a>. And they are explained in lots of places.",
                    "created": "Thu, 13 May 2021 12:55:26 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Here may be the biggest difference between my outline world and the nascent ones. I've tried out lots of approaches to lots of different things in the over 40 years I've been working on outliners. I'm happy to share what I've learned, and I think all of it is applicable to the connected world we live in. But there are also advantages to being a newcomer to this stuff, you start with a clean slate. You might think of something that takes another 40 years to develop, where my horizon doesn't extend nearly that far. ",
                    "created": "Thu, 13 May 2021 12:55:37 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "There are also big differences in the way our outliners work. I could explain that in a podcast, but don't have the time to write it up now. The takeaway is that without open modular connections between the components via APIs, this new burst of outlineism will end up with a sad story of silos and stagnation, not a wonderful explosion like the earlier open platforms. One silo vs a thriving ecosystem -- either approach could win. It's happened both ways in the past. We have to be careful to learn from past mistakes in evolving open platforms. ",
                    "created": "Thu, 13 May 2021 12:56:52 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "For that, I wrote <a href=\"http://this.how/standards/\">Rules for standards-makers</a>. ",
                    "created": "Thu, 13 May 2021 12:59:53 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}