{
    "text": "May 17",
    "created": "Mon, 17 May 2021 12:48:45 GMT",
    "type": "calendarDay",
    "name": "17",
    "subs": [
        {
            "text": "Good words to begin an email with: 1. Thanks. 2. Sorry. 3. I agree.",
            "created": "Mon, 17 May 2021 15:25:31 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Maybe the CDC was smart in <a href=\"https://www.cdc.gov/coronavirus/2019-ncov/vaccines/fully-vaccinated.html\">rescinding</a> their mask mandate for the fully vaccinated. We who are vaccinated are safe. If you want to get sick and die, then don't get vaccinated. We're going on without you. Hmm. I don't know. I don't think it'll work, but maybe.",
            "created": "Mon, 17 May 2021 12:48:46 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I hear there were <a href=\"https://www.reuters.com/business/media-telecom/booming-podcast-industry-comes-age-with-ambies-awards-show-2021-05-15/\">podcast awards</a> last night. The companies sponsoring it are the ones trying to own podcasting. If they succeed we will all lament how podcasting used to be something anyone can do, but now they're all Disneyland and Burger King. You know when blogging started getting big, all the news orgs said they started blogs. We said yeah if you use blogging software to publish your articles that's not a blog. The point of both blogging and podcasting is that they are media open to anyone. No one can create rules that you have to adhere to, like Apple with their app store. Facebook has standards, and the same journalists who tried to usurp blogging want them to make them make us conform with more of their rules. What can you say, except corporatism keeps trying to own everything. Nice, good for them, but it's boring and fucked up. ",
            "created": "Mon, 17 May 2021 12:50:38 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/11/20/offWithTheirHeads.png",
            "flInCalendar": true
        },
        {
            "text": "I don't know why I continue to watch <a href=\"https://en.wikipedia.org/wiki/List_of_The_Handmaid%27s_Tale_episodes#Season_4_(2021)\">Handmaid's Tale</a>. It's the most ridiculously written show. Every scene is more ridiculous than the one before it. People keep changing their minds. One scene a character is in Toronto, safe from Gilead, then they show up in Chicago at the front, in the closing scene, meant as some kind of cliffhanger, I suppose. What is she doing in Chicago the writers must have thought we'd all be wondering. Can't wait till the next episode. Knowing there will be no good reason other than she felt she belonged there or some stupid shit like that. Aunt Lydia is a big power broker in Gilead, even though she's one of hundreds of aunts and a loser, and ridiculous. June Osborne keeps ranking on her. No explanation why this aunt is the new boss, except that she's played by one of the stars of the show. I should've stopped watching it a long time ago. But I obviously hate myself enough to keep going.",
            "created": "Mon, 17 May 2021 12:50:54 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I'm caught up with <a href=\"https://www.metacritic.com/tv/mare-of-easttown/season-1\">Mare of Easttown</a>. It's good. Kate Winslet. I'll wait for the ending to say if the story is good. ",
            "created": "Mon, 17 May 2021 13:21:35 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "In general we don’t like it when foreigners criticize us, but if it’s Trump, go right ahead.",
            "created": "Mon, 17 May 2021 23:34:43 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Dear Amazon",
            "created": "Mon, 17 May 2021 17:36:21 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Dear Amazon, if the listener has to stream these shows on your site, then they are not podcasts. Would you please not call them that. It's just radio. Come on, play fair. Open platforms are where innovation comes from. Don't eat the seed corn that belongs to all of us. ",
                    "created": "Mon, 17 May 2021 17:36:24 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Amazon's corporate-casts, masquerading as casts-o-the-people.",
                    "created": "Mon, 17 May 2021 17:37:26 GMT",
                    "inlineImage": "http://scripting.com/images/2021/05/17/amazonCorporateCasts.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}