{
    "text": "May 23",
    "created": "Sun, 23 May 2021 13:07:39 GMT",
    "type": "calendarDay",
    "name": "23",
    "subs": [
        {
            "text": "Watching the <a href=\"https://nypost.com/2021/05/22/nets-shake-off-rust-and-then-cruise-to-game-1-win-over-celtics/\">Nets game</a> last night, I felt sad for the Celtics, which is a milestone because I generally hate the Celtics, but I hate the Nets so much more. They filled Barclay's with fans. Where did they come from? Every city has fair-weather-fans, New York is no exception. The Yankees fans who root for the Mets when they're in the World Series, for example. Mets fans root against the Yankees no matter what. We <i>like</i> the Red Sox, because they torment the Yankees. These New Yorkers like that three carpetbaggers, KD, Kyrie and Harden decided they wanted to own an NBA team, and Brooklyn was available. This has nothing to do with New York, or even the Nets. It's just three players in the prime of their careers, all headed for the Hall of Fame, and all of them total fucking assholes. Which usually isn't a bad thing in NY, except that the Knicks are the team we actually love, and they're rising to the occasion. Their series with Atlanta, which starts tonight at the Garden, is probably going to turn out to be much better basketball than the coming rout by the top-seeded Nets of the low-seeded Celtics.",
            "created": "Sun, 23 May 2021 13:27:53 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/05/23/celticMascot.png",
            "flInCalendar": true
        },
        {
            "text": "The Republican Party is being re-formed in the model of the Russian government. It's as if Putin owns one of the two parties in our two-party system. The problem is if this persists, it will not be a two-party system.",
            "created": "Sun, 23 May 2021 17:11:15 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Brad Silverberg, who I was just thinking about, wrote a <a href=\"https://twitter.com/bradsilverberg/status/1396451375538651137\">tweet</a> on a subject I was getting ready to write about, in response to something <a href=\"https://twitter.com/jayrosen_nyu/status/1396445625911291904\">Jay Rosen tweeted</a> earlier. The question is does any news about Matt Gaetz really matter? He's a nobody. Obviously he did a lot of awful things, and he should be expelled from Congress, for that, and for voting to overturn a legal election (the latter being more in line with the news I care about). Same with Marjorie Three Names (a term coined by Silverberg). That they are tolerated by Repubs is news, but not super important. What matters is why aren't we actively trying to head off the looming permanent hijacking of American democracy? Why are our news channels content in reporting the points on the curve instead of the curve itself. When the 2022 election comes and the Repubs take over the House, then, when it is too late, will they report on how the next presidential election is meaningless because the Republican House will never let the election stand, if the Republican candidate should lose. That Democrats will never win another election. Whose fault will it be when it's too late? We have an incredible chance right now to get ahead of the history that the Repubs are trying to write. Why are we giving up? Maybe the people who can't watch the news as we drive off the cliff, are right?",
            "created": "Sun, 23 May 2021 13:08:50 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2010/07/15/car.gif",
            "flInCalendar": true
        },
        {
            "text": "Tools for thought",
            "created": "Sun, 23 May 2021 13:49:49 GMT",
            "type": "outline",
            "description": "The organizing power of a personal computer and network applied to the act of thinking.",
            "metaImage": "http://scripting.com/images/2021/05/23/escher.png",
            "subs": [
                {
                    "text": "<a href=\"https://www.google.com/search?q=%22tools+for+thought%22\">Tools for thought</a>. That's what the new category, with outliners at the core, is called. I endorse the name. It's a good one. Our first product at [%search: Living Videotext%], shipped in 1983, was called [%search: ThinkTank%]. Pour your your thinking into the outline structure, and then as time goes by reorganize the outline to reflect what's happened with these ideas. Right off the bat, that's a different use-case from the ones used by the TFT people. There are others.  ",
                    "created": "Sun, 23 May 2021 13:49:58 GMT",
                    "image": "http://scripting.com/images/2021/05/23/rheingoldCover.png",
                    "imageLink": "https://mitpress.mit.edu/books/tools-thought",
                    "flInCalendar": true
                },
                {
                    "text": "Our first ads had a big title: See what you think. We sold to people who understood <i>that</i> they think, were self-aware enough to have ideas about <i>how</i> they think, and were interested in tools that could make their thinking more powerful, as a spreadsheet makes financial planners more powerful. Or a database makes running a business less expensive and more personal. We applied the power of a personal computer to the act of thinking. And it worked!",
                    "created": "Sun, 23 May 2021 14:12:20 GMT",
                    "collapse": "true",
                    "subs": [
                        {
                            "text": "The <a href=\"https://www.nytimes.com/1983/05/17/science/personal-computers-software-first-idea-processor.html\">first review</a> of ThinkTank -- ever. In the NYT, in 1983. ",
                            "created": "Sun, 23 May 2021 14:27:05 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "The <a href=\"http://static.scripting.com/larryKing/images/2014/02/18/uglyThinkTankAd.jpg\">back cover</a> of the first commercial release in ThinkTank, the one that was reviewed in the NYT.",
                            "created": "Sun, 23 May 2021 14:27:48 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "It's weird for me, because I'm sure I come off as arrogant, a know-it-all, but the truth is that I've been far down the road these young people are just starting down. I believe I know how a lot of this turns out. ",
                    "created": "Sun, 23 May 2021 13:54:57 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "For example, one of the TFT thought leaders last night compared this stuff to the beginning of blogging, something I also know a lot about. If he knew the truth it would blow him away. The first blogging tools <i>were outliners,</i> because that's what I use to write. And I still think that blogging and outlining are basically the same thing. I'm using my outliner right now to write this post. ",
                    "created": "Sun, 23 May 2021 13:56:26 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Anyway there's so much more to say. I'm glad to have the opportunity. And I want to be clear, I want to help the young folk. I want to make sure we don't lose all the progress that's already in the bank. I want the interfaces to be open, simple, steady, efficient and most important, compatible. Creating 18 different silos will waste decades of future development. It's still very early and the interfaces mostly don't exist, so it's not too late to make this more like the blogging world and less like Facebook (more likely a dozen Facebooks, btw).",
                    "created": "Sun, 23 May 2021 13:57:32 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The three basic components that make up the TFT world. ",
                    "created": "Sun, 23 May 2021 13:58:47 GMT",
                    "flNumberedSubs": "true",
                    "subs": [
                        {
                            "text": "Outliners, of course. ",
                            "created": "Sun, 23 May 2021 14:00:17 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Databases which store the outlines, and maybe do discovery on what's stored there, and ",
                            "created": "Sun, 23 May 2021 14:00:22 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Renderers which view the outliner as an authoring tool, and produce a visualization of an outline or a section of an outline, as a bullet chart (presentation), tree chart or the display that the VCs love, the connected graph where you can zoom in on stuff and the blocks re-arrange. ",
                            "created": "Sun, 23 May 2021 14:00:26 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "But there are other views of this world. Outlines are great structures for programming! Python started off in that direction, but stopped before they got to the good stuff imho. We went much futher with \"Frontier\". We also used the outliner to manage the object database and user interface structures. You used the same outliner to browse through the data kept by the runtime kernel. ",
                    "created": "Sun, 23 May 2021 14:00:33 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "But, even that's just the beginning. Something I haven't seen explored in any of the TFT products is the idea of an outline as a file system. With the outlines being a permanent container for all kinds of work. File systems are of course outlines. Instead of the mediocre tools for managing file systems on the major OSes, why not have a great one! That was the idea behind ThinkTank and its successors. ",
                    "created": "Sun, 23 May 2021 14:01:39 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "How do you know this is right? Pop up and look at the structures in your computer and on the net. They are all outlines. So if you're thinking of an outline as an inherently small thing, you're not seeing the full picture. ",
                    "created": "Sun, 23 May 2021 14:02:59 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Again, I'm aware that this could come off as arrogant. But what do you do when a group of brilliant young visionaries discover what you discovered when you were one of them, in the mid 1970s, and spent the rest of your career exploring and developing, while the rest of the computer world pretty much ignored you? First you celebrate! It's not a lost cause after all. Then you ask yourself as I am, how do you approach this. What I've decided so far is that I am going to continue to develop \"Drummer\", and I'm going to push in every way for zero lock-in, user choice everywhere, and clean simple and extensible APIs for each of the components. And of course I will be writing all through this process, as long as I can, because that's the other thing I do -- blog. Not only do I create the software for this stuff, I create it for myself because this is how I think, it's why I knew to develop this stuff in the first place. ",
                    "created": "Sun, 23 May 2021 13:50:06 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}