{
    "text": "May 24",
    "created": "Mon, 24 May 2021 14:03:53 GMT",
    "type": "calendarDay",
    "name": "24",
    "subs": [
        {
            "text": "Today's song: <a href=\"https://www.youtube.com/watch?v=wN35w-trGRo\">These Boots Are Made For Walking</a>.",
            "created": "Mon, 24 May 2021 21:32:03 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=wN35w-trGRo",
            "flInCalendar": true
        },
        {
            "text": "What could the Repubs do that would cause the Dems to expel them from Congress, making the filibuster totally irrelevant.",
            "created": "Tue, 25 May 2021 02:47:18 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "My project for last week and this week was to get \"Drummer\" running in <a href=\"https://www.electronjs.org/\">Electron</a> so it can be a desktop app in addition to a web app. I just hit a milestone -- I can now create and open files, and it remembers what tabs were open and when you restart they automatically re-open. The idea, as always, is to create a layer below which there are differences between the app that runs over the net, ie your files are stored on a server in the cloud, and the one that runs on the desktop, where the files are on your local system. For my most important writing, I prefer to use the Electron version. So hopefully by the end of the week I will be able to switch from the Electron app I've been using for the last four years, to the new Drummer-based system, which is much cooler, more \"Frontier\"-like.   ",
            "created": "Mon, 24 May 2021 18:16:38 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/09/10/drummer.png",
            "imageLink": "http://scripting.com/2021/04/03/133021.html?title=theMakingOfDrummer",
            "flInCalendar": true
        },
        {
            "text": "My car sent an email saying that one of my dashboard lights is on. I verified. I need to add water to my windshield washer. I feel loved. ",
            "created": "Mon, 24 May 2021 14:14:15 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Someone should tell the news industry that all the michegas over who barked at who and who should be cancelled, is not a good look for their readers and viewers who observe that our political system is in the process of turning from a dysfunctional two-party system into a one-party autocratic system that's planning racial and gender suppression and possibly even cleansing. ",
            "created": "Mon, 24 May 2021 14:03:54 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}