{
    "text": "May 25",
    "created": "Tue, 25 May 2021 11:47:31 GMT",
    "type": "calendarDay",
    "name": "25",
    "subs": [
        {
            "text": "I went to a local supermarket today where most of the store personnel were not wearing masks. I asked about it, and was told because they had been vaccinated they didn't have to wear them. I kept my mask on. I would have liked to have not worn the mask, but I think we should have kept wearing masks, until the pandemic is squashed in most of the world. It isn't yet. I'd prefer to err on the side of caution, but I guess we've decided it's over and that's it. But what if it isn't over?",
            "created": "Tue, 25 May 2021 15:50:17 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/05/25/theMask.png",
            "flInCalendar": true
        },
        {
            "text": "But <a href=\"https://donaldgmcneiljr1954.medium.com/the-end-is-near-no-seriously-142683fb085e\">Donald McNeil</a>, our pandemic guru, says Dave, take it easy, the end is near. <i>OK!</i>",
            "created": "Tue, 25 May 2021 21:36:15 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Our leaders lack the will",
            "created": "Tue, 25 May 2021 15:31:10 GMT",
            "type": "outline",
            "description": "Upsetting the Trumpians is inevitable and if done at the right time, probably survivable. ",
            "metaImage": "http://scripting.com/images/2021/05/25/civilWar.png",
            "subs": [
                {
                    "text": "I listened to <a href=\"https://twitter.com/joetrippi\">Joe Trippi's</a> podcast <a href=\"https://podcasts.apple.com/us/podcast/wapos-greg-sargent-on-gops-demise-and-future/id1523896927?i=1000523008931\">today</a>. An interview with <a href=\"https://www.washingtonpost.com/people/greg-sargent/\">Greg Sargent</a> of the Washington Post, who I read and think is smart. ",
                    "created": "Tue, 25 May 2021 15:31:15 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Trippi said what's obvious -- we're pretty fucked. ",
                    "created": "Tue, 25 May 2021 15:31:52 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "He didn't say this part: At this moment we're not out of options. But they all require doing something that will provoke the ire of Trumpkins. So far the Democrats have not wanted to provoke them. ",
                    "created": "Tue, 25 May 2021 15:32:05 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "This is when Democrats throw their hands in the air and give up. It's what they do on cable news, it's what they do in editorial board meetings at the great news orgs (when they're not fussing over who's woke enough to remain).  It's what Democratic incumbents do. It's what instant pundits on Twitter do. ",
                    "created": "Tue, 25 May 2021 15:32:33 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "What to do? I give up!",
                    "created": "Tue, 25 May 2021 19:49:58 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Here's the common thread:",
                    "created": "Tue, 25 May 2021 15:33:03 GMT",
                    "subs": [
                        {
                            "text": "1. We're <i>soooo</i> fucked.",
                            "created": "Tue, 25 May 2021 15:40:10 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "2. What can we do? ",
                            "created": "Tue, 25 May 2021 15:33:17 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "3. Throw hands in the air. ",
                            "created": "Tue, 25 May 2021 15:40:21 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "4. Give up.",
                            "created": "Tue, 25 May 2021 15:40:23 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "Upsetting the Trumpians is inevitable and if done at the right time, probably survivable. It's better to provoke them now rather than later. Now we have a rule of law government. If you let things run their course, when it happens a Trump will run the government. Nothing you or I do or say will matter. If you make too much of a stink you'll go to jail, or worse. ",
                    "created": "Tue, 25 May 2021 15:33:10 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "What a sad situation, where the people with a voice correctly parse the situation and then give up. ",
                    "created": "Tue, 25 May 2021 15:33:12 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Maddow did the same thing last night. Here's the problem, she spends 20 minutes prepping us. Then: what do we do? She may have an idea, but she doesn't say. Totally useless. Get out of the way. Time to say the truth or resign. ",
                    "created": "Tue, 25 May 2021 15:35:04 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The truth: The civil war is not just inevitable, it's here. ",
                    "created": "Tue, 25 May 2021 15:42:26 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "George Floyd, America and slavery",
            "created": "Tue, 25 May 2021 11:47:32 GMT",
            "type": "outline",
            "description": "The George Floyd murder is the most graphic evidence most of us have seen that slavery is very much still with us. ",
            "metaImage": "http://scripting.com/images/2021/05/25/georgeFloydWall.png",
            "subs": [
                {
                    "text": "Some thoughts about George Floyd, America and slavery",
                    "created": "Tue, 25 May 2021 11:48:34 GMT",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "He was killed the way disobedient slaves were killed.   ",
                            "created": "Tue, 25 May 2021 11:47:37 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "<i>Of course</i> if he were white he would not have been killed. ",
                            "created": "Tue, 25 May 2021 12:14:43 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "There have been other black people killed by police, recorded in video and shared on the web. Those were relatively instantaneous acts. George Floyd's murder was deliberate. It could have been stopped any time during the <a href=\"https://www.cnn.com/2021/03/29/us/george-floyd-timing-929-846/index.html\">nine minutes</a>. It was a delberate act. ",
                            "created": "Tue, 25 May 2021 11:49:30 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "It's hard to imagine in words what might have been going on in the head of the murderer. What did he think was going to happen? In his mind what was his relationship with Floyd? Did he see him as human or property? Did he think there would be consequences?",
                            "created": "Tue, 25 May 2021 12:16:40 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "I have a good American education, and read a fair amount of history as a child. I was fascinated with it, but until last year I had never read a first person account of slavery. Just facts. Dates. Politics. The war. Reconstruction. Jim Crow. Voting rights. ",
                            "created": "Tue, 25 May 2021 11:52:04 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Our official American history treated our black ancestors the same way slavery did, as property. They didn't have a voice. Their story remains largely untold.",
                            "created": "Tue, 25 May 2021 11:58:27 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "I am a first-generation American, a child of people who fled Europe for their lives during WWII and found safe haven in the United States. ",
                            "created": "Tue, 25 May 2021 11:59:16 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "America is  built on slavery the same way Windows is built on DOS. We never removed it from our operating system. The code is running every time America does something. It's part of our implementation. Some corrections have been put in place in an attempt to route around the most egregious wrongs of slavery, but those changes can be reverted and they are, right now. ",
                            "created": "Tue, 25 May 2021 12:11:34 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Being responsible is not the same thing as \"being the cause of.\" ",
                            "created": "Tue, 25 May 2021 12:02:50 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Your ancestors could have been living their own injustices, as mine were, but you and I now live in the United States, where the crimes (not a strong enough word) against Native Americans and African Americans are deeply ingrained. ",
                            "created": "Tue, 25 May 2021 12:19:25 GMT",
                            "isComment": "false",
                            "flInCalendar": true
                        },
                        {
                            "text": "We are responsible, in the sense that it is up to us to respond.  ",
                            "created": "Tue, 25 May 2021 12:19:55 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "BTW, if you haven't listened to the <a href=\"https://www.nytimes.com/2020/01/23/podcasts/1619-podcast.html\">1619 project podcast</a>, it's an easy way to quickly get a different perspective on America. There's a pretty good chance that you, like me, have not heard this story yet. Which is of course ridiculous. ",
                            "created": "Tue, 25 May 2021 12:04:08 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "I think that everything we do to try to get out of the slavery system is doomed to fail until everyone understands the history. We have to teach it in the schools to people of all races. This is America, your country. Here are the problems you will have to deal with when you grow up, so you might as well learn about them now. ",
                            "created": "Tue, 25 May 2021 12:22:35 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "By coming to America, we became part of a culture and political system that was built on slavery. We haven't yet shaken that off. The George Floyd murder is the most graphic evidence most of us have seen that slavery is very much still with us. ",
                            "created": "Tue, 25 May 2021 11:59:12 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}