{
    "text": "May 29",
    "created": "Sat, 29 May 2021 13:04:17 GMT",
    "type": "calendarDay",
    "name": "29",
    "subs": [
        {
            "text": "Ruth Bader Ginsburg: \"Fight for the things that you care about, but do it in a way that will lead others to join you.\"",
            "created": "Sat, 29 May 2021 13:04:18 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "How tech comes into existence",
            "created": "Sat, 29 May 2021 13:57:29 GMT",
            "type": "outline",
            "description": "Right now we're in a dangerous situation where few people have a good picture, and they aren't the people we listen to. ",
            "subs": [
                {
                    "text": "It's so important to <a href=\"https://aeon.co/ideas/coding-is-not-fun-it-s-technically-and-ethically-complex\">change</a> the public perception of \"coding\" because it's needed if we're going to have good communication about issues in all the software and networking systems our world is built on.",
                    "created": "Sat, 29 May 2021 13:57:37 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Think about the pandemic doctors we got to know in the last year. Networking technology is just as complex and evolving as theirs is. And we haven't even sorted out who to go to to get the scoop. Consequently, there's so much awful journalism about tech. It has always been thus, in my entire 40-plus year career in tech. It isn't getting better, and the push to create millions of \"coders\" is going in the wrong direction. ",
                    "created": "Sat, 29 May 2021 14:01:51 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I haven't worked inside a company in a long time, but I imagine the problem is bad there too. And within my communities, many people don't understand why all the bugs don't disappear at once. Or why I made the software do something they don't like. Because they don't see a process. How can you blame them, even if they were here with me, all they would see is someone typing at a keyboard, going for walks, hanging out. How that turns into functionality, they don't even know that it does turn into functionality.",
                    "flInCalendar": true
                },
                {
                    "text": "I remember a lot of the gestalts when I was learning how to develop software initially. And I was a student of this stuff, getting an advanced degree. Most people have a much more casual relationship with tech. That's okay, but some people *have* to understand to be able to do their jobs.",
                    "flInCalendar": true
                },
                {
                    "text": "A famous NYT columnist once said something I made just blinked into existence through the magic of the internet. This person makes a lot of money. His books sell in the millions. He interviews heads of states and CEOs, but there is no one he listens to who will tell him when he garbles the most basic idea of how tech comes into existence. ",
                    "flInCalendar": true
                },
                {
                    "text": "I want people to understand how it really works. Right now we're in a dangerous situation where few people have a good picture, and they aren't the people we listen to. ",
                    "flInCalendar": true
                },
                {
                    "text": "PS: This is also a <a href=\"https://twitter.com/davewiner/status/1398639564466671626\">Twitter thread</a>. ",
                    "created": "Sat, 29 May 2021 16:17:19 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}