{
    "text": "May 30",
    "created": "Sun, 30 May 2021 13:28:58 GMT",
    "type": "calendarDay",
    "name": "30",
    "subs": [
        {
            "text": "When an idea is right it snaps into your mind like it always was there.",
            "created": "Mon, 31 May 2021 03:20:37 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "If the Knicks end up losing, the moment their fate was decided was when they gave Julius Randle the <a href=\"https://www.si.com/nba/2021/05/26/julius-randle-son-surprises-him-most-improved-player-award\">Most Improved Player</a> award. Just before the first game of the playoff series. Who decided that timing? Tempting fate. God'll always <a href=\"https://www.youtube.com/watch?v=kpSw5tREOxQ\">get you for that</a>. If I were advising Randle, I'd urge him to throw the award into the <a href=\"https://www.tripsavvy.com/how-to-walk-across-the-williamsburg-bridge-nyc-4158670\">East River</a> before Game 5.",
            "created": "Sun, 30 May 2021 20:35:42 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I listened to a <a href=\"https://podcasts.apple.com/us/podcast/spike-lee-on-the-knicks-resurgence/id1050430296?i=1000523437231\">New Yorker interview with Spike Lee</a> about this year's Knicks. There was a surprise, he didn't watch the NBA bubble last year. I didn't either. It was too sad. The NBA now, finally, is back. And having the Knicks do so well this year, and it being the immediate post-pandemic season, it's like both happened at the same time and one was the cause and the other was the effect, though it's impossible to say which is which. I would like to hear <a href=\"https://en.wikipedia.org/wiki/Spike_Lee\">Spike Lee</a> ramble about the Knicks, for an hour or so, or really as long as he wants. ",
            "created": "Sun, 30 May 2021 13:56:37 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/05/30/spikeLeeKnicksFan.png",
            "flInCalendar": true
        },
        {
            "text": "In the early days of the web there were purists who thought HTML should be edited by hand. I was not one of them. As soon as I got involved in 1994, I started working on <a href=\"http://scripting.com/autowebdocs/whatisautoweb_119.html\">AutoWeb</a>, the first step on the road to blogging.",
            "created": "Sun, 30 May 2021 20:00:59 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I wish the journalists would chase the connections between Repubs in Congress and Putin.",
            "created": "Mon, 31 May 2021 03:20:15 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "My new profile picture",
            "created": "Sun, 30 May 2021 13:28:59 GMT",
            "type": "outline",
            "description": "I have a current profile pic wherein I smile. Here's how I did it.",
            "metaImage": "http://scripting.com/images/2021/05/30/beeeegStufffff.png",
            "subs": [
                {
                    "text": "I guess <a href=\"https://en.wikipedia.org/wiki/Guy_Kawasaki\">Guy Kawasaki</a> is finishing up the edit of the interview we did a couple of weeks ago. He asked for a profile picture, I didn't have a good one, so I took this selfie yesterday. He wanted me to smile. This is something that usually I have trouble with in pictures, I get self-conscious, my smiles look phony -- because they are. I am not happy being photographed, I feel trapped.  ",
                    "created": "Sun, 30 May 2021 13:29:03 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "But Guy and I have been friends for a long time, and we were close in a very important time, around the launch of the Macintosh in 1984. If I didn't know Guy, I never would have gotten an early machine. The Mac was the perfect platform for our \"idea processor\" -- it attracted just the kind of people who would understand outliners. People who think, organize, analyze, do things. And Apple needed our software, Guy could see that. ",
                    "created": "Sun, 30 May 2021 13:40:52 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "In 1986, the Mac was set to explode and we had had enough time to create a killer outliner for the Mac, and as they say, the rest is history. So I thought of how much I value our friendship as I was taking the picture, and the smile came naturally, all on its own. ",
                    "created": "Sun, 30 May 2021 13:41:47 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "My profile pic for Guy's podcast. ",
                    "created": "Sun, 30 May 2021 13:32:49 GMT",
                    "inlineImage": "http://scripting.com/images/2021/05/30/beeeegStufffff.png",
                    "flInCalendar": true
                },
                {
                    "text": "PS: Guy used to call me Beeeeg Stuffff. He has a very <a href=\"https://en.wikipedia.org/wiki/Los_Angeles\">LA</a> way of speaking. I can <a href=\"http://scripting.com/2021/05/30/beeegStuff.m4a\">imitate</a> him saying it. That's what actually put the smile on my face, the same smile is there right now. Instead of saying Cheese, I said Beeeeg Stuff. ",
                    "created": "Sun, 30 May 2021 13:33:02 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PPS: Many of the nicknames people have for me are about my bigness. For example, Mike Boich and Dave Jacobs call me El Grandè. I like that one too, because has adds a Latin accent to my grandiosity.  ",
                    "created": "Sun, 30 May 2021 13:38:03 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PPPS: Another <a href=\"http://scripting.com/2021/05/30/heyBeegStuff.m4a\">imitation of Guy</a>, a slight variant on Beeg Stuff.",
                    "created": "Sun, 30 May 2021 13:39:36 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}