{
    "text": "NPR reporting is Republican",
    "created": "Thu, 31 Oct 2019 13:58:08 GMT",
    "type": "outline",
    "description": "NPR isn't reporting the news, they're reporting Republican spin.",
    "subs": [
        {
            "text": "NPR isn't reporting the news, they're reporting Republican spin.",
            "created": "Thu, 31 Oct 2019 13:58:18 GMT"
        },
        {
            "text": "For example this morning they talked for a half hour about the impeachment inquiry as a partisan issue, repeating the Republican claim that it's bad for the inquiry to be private. They said the Democrats in 1998 had the same objection, which wasn't true, because then there was a special prosecutor, Ken Starr, who did his inquiry in private before issuing his public report. As far as I know the Democrats never said this inquiry should be held in public. Even if they had it wouldn't have been. There are rules about the process designed to protect the accused and the process. NPR never presented the other side, how this all looks from the point of view of the Democrats, or more importantly, the Constitution, which is really what Trump has offended. (Could they cover a story without it being totally and inappropriatey partisan?)",
            "created": "Thu, 31 Oct 2019 13:58:42 GMT",
            "image": "http://scripting.com/images/2018/12/18/santa.png"
        },
        {
            "text": "This is why the hearings have been private. ",
            "created": "Thu, 31 Oct 2019 14:00:00 GMT",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "The DoJ wouldn't appoint a special prosecutor, so the House had to do it themselves.",
                    "created": "Thu, 31 Oct 2019 14:00:25 GMT"
                },
                {
                    "text": "Such inquiries are private to protect the accused because, if there is no indictment, they want to limit damage.",
                    "created": "Thu, 31 Oct 2019 14:00:35 GMT"
                },
                {
                    "text": "They want testimony to be private so the witnesses can't get their stories aligned.",
                    "created": "Thu, 31 Oct 2019 14:02:34 GMT"
                }
            ]
        },
        {
            "text": "The Repubs also complained, through their NPR voice, that the president should have been given a chance to present his evidence. He <i>was</i> given the chance, and chose to try to obstruct the process instead of participating. Makes the Republican complaint seem hollow. ",
            "created": "Thu, 31 Oct 2019 14:01:06 GMT"
        }
    ]
}