{
    "created": "2023-08-01T04:00:00.000Z",
    "flInCalendar": true,
    "name": "01",
    "path": "2023/08/01",
    "text": "August 01",
    "type": "calendarDay",
    "subs": [
        {
            "text": "It’s great finally we’re going to <a href=\"https://wapo.st/3OC0TOU\">fight back</a> against Trump.",
            "created": "Wed, 02 Aug 2023 01:31:04 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The Washington Post <a href=\"https://imgs.scripting.com/2023/08/01/badheadline.png?nodialog\">headline</a>, as with most other pubs, says that Trump is accused of trying to \"overturn the election.\" More accurate: he <a href=\"https://twitter.com/davewiner/status/1686554103793491968\">tried</a> to \"overthrow the government.\"\n",
            "created": "Wed, 02 Aug 2023 01:34:02 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I guess the <a href=\"http://daytona.scripting.com/?q=mets&collection=scriptingnews\">Mets</a> were reading my blog? In the lead-up to the trade deadline, they dumped the two three-time Cy Young winning pitchers, <a href=\"https://en.wikipedia.org/wiki/Max_Scherzer\">Scherzer</a> and <a href=\"https://en.wikipedia.org/wiki/Justin_Verlander\">Verlander</a>, they bought in the last two years, presumably in an effort to buy a championship, which totally didn't materialize. They traded them for young prospects, players they can develop. Maybe the Mets realized that they can't buy a kickass team, and that real fans aren't inspired by money, we want love, and <a href=\"http://scripting.com/2018/06/24/181734.html\">philosophy</a>. Maybe the Mets will once again be the Mets, in the spirit of Casey Stengel, Cleon Jones, Tom Seaver, Tug McGraw, Mookie Wilson and Ed Kranepool and far too many soulful players to mention in this small space. ",
            "created": "Tue, 01 Aug 2023 21:05:55 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2023/08/01/mrmet.png",
            "flInCalendar": true
        },
        {
            "text": "The monthly rollover now includes <a href=\"https://imgs.scripting.com/2023/08/01/sallyUpdate.png?nodialog\">update</a> to  \"Sally's Reader\".",
            "created": "Tue, 01 Aug 2023 12:51:17 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The Washington Post's <a href=\"https://www.washingtonpost.com/podcasts/post-reports/\">daily podcast</a> was <a href=\"https://twitter.com/grovesprof/status/1686351734489100288\">recommended</a> to me as a replacement for the now-nauseating NYT daily. Well the first <a href=\"https://www.washingtonpost.com/podcasts/post-reports/how-jason-aldeans-small-town-became-a-rightwing-anthem/\">episode</a> I tried was exactly as depraved, incompetent and disgusting as the NYT podcast. Do we disapprove of Jason Aldean's <a href=\"https://www.youtube.com/watch?v=b1_RKu-ESCY\">song</a> because we want to deprive him of his right to free speech as the podcast says over and over. Please. We object to it because it's an expression by white people of their desire to <a href=\"https://en.wikipedia.org/wiki/Lynching\">lynch</a> black people, like they used to do when America was Great, as the slogan goes. They want to make it Great Again. Specifically, so you could <a href=\"https://www.theguardian.com/us-news/2018/apr/26/lynchings-memorial-us-south-montgomery-alabama\">lynch</a> blacks, again, when you don't like the way they look at you or your sister or when they have land you want to buy and don't want to pay a fair price for, or when a rich white guy made you feel like shit and you wanted to prove there were people <i>you</i> could <a href=\"https://www.theguardian.com/us-news/2018/apr/26/lynchings-memorial-us-south-montgomery-alabama\">terrorize</a>. When a black life was worth nothing. And btw, they're not just coming for people of color and gays and trans people, or to turn women into slaves, they also like <a href=\"https://en.wikipedia.org/wiki/Final_Solution\">Hitler's final solution</a> for Jews. It's time for one of these pubs to have the guts to say out loud what the actual problem is with the Trumpsters like Aldean. They want to go back to when they could kill anyone with impunity. And btw, it doesn't matter if he \"really\" believes it or if it's a business model. It makes absolutely no difference. Someone should teach these pitiful spineless so-called reporters how and why to be angry. BTW, I live in a small town so fuck you Jason Aldean.",
            "created": "Tue, 01 Aug 2023 15:32:02 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2023/08/01/lynching.png",
            "flInCalendar": true
        },
        {
            "text": "They write themselves",
            "created": "Tue, 01 Aug 2023 16:04:30 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "From a <a href=\"https://www.facebook.com/dave.winer.12/posts/pfbid08DaZVAx1dsi3zaAckQBZYu9UF3CmypwFB9s7ntEQJzKG5f7bqTfPsn6x5QwCEpYgl\">Facebook post</a> on this day in 2015.",
                    "created": "Tue, 01 Aug 2023 16:04:34 GMT",
                    "collapse": "false",
                    "subs": [
                        {
                            "text": "My blog posts always \"just write themselves.\" If they don't I do something else. ",
                            "created": "Tue, 01 Aug 2023 16:04:34 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "For me, a blog post is just the culmination of something I've been thinking about or a story I've told in person a dozen times.",
                            "flInCalendar": true
                        },
                        {
                            "text": "It has to pop to the top of my consciousness a dozen times or more before I'm ready to write about it.",
                            "flInCalendar": true
                        },
                        {
                            "text": "I blog therefore because I: 1. Think. 2. Tell stories.",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "I subscribe to the NYT",
            "created": "Tue, 01 Aug 2023 12:39:44 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I subscribe to the NYT, probably the only newspaper in the US that tries to get away with charging you more for sports. ",
                    "created": "Tue, 01 Aug 2023 15:41:15 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I read less and less of their stuff, the only reason I keep it is that in some things they are authoritative for me at least, like TV and movie reviews. They'll probably start charging extra for that too. ",
                    "created": "Tue, 01 Aug 2023 15:41:12 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Also I am nauseated by the Daily podcast, used to be a big fan. I don't know what changed, me or them.",
                    "created": "Tue, 01 Aug 2023 15:41:02 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}