{
    "created": "2023-08-14T04:00:00.000Z",
    "flInCalendar": true,
    "name": "14",
    "path": "2023/08/14",
    "text": "August 14",
    "type": "calendarDay",
    "subs": [
        {
            "text": "<a href=\"https://mastodon.social/@mathowie@xoxo.zone/110888600127235668\">From Matt Haughey on Mastodon</a>. \"I know it’s petty but when you boycott a favorite podcast after it moves exclusively to Spotify for a couple years then learn they’re finally changing course and releasing their podcast normally again, it’s a pretty good feeling. Welcome back to the internet, podcast. Eat shit, Spotify.\" It's not petty, it's the open web winning. In podcasting we won, by setting the pattern early-on. People expect choice in how they listen, and reject gate-keepers. It's a genetic seed, and once it takes hold it's impossible to overcome. This is what podcasting is teaching us. ",
            "created": "Mon, 14 Aug 2023 15:27:34 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2017/10/20/wewon.png",
            "flInCalendar": true
        },
        {
            "text": "I think it must be very hard to rework the UI of an open source product because responsibility for different parts of the product are allocated according to the structure of the UI. Same for a product that's managed by a large development company with lots of users. It's virtually impossible to re-think the top-level structure of the product. Much the same way you can't re-think how the streets in a city work. Too much is built around the way things are. Maybe it's true for movies and books too? Hmmm. Maybe you can only make big changes early in the life of an idea. What set me going in this direction is the way the UI of Radio UserLand was organized. We decided to start over from scratch in 2001. We already had a blogging tool, Manila, which had grown into a sprawl as we invented new tools to hang on a structure that wasn't designed for so much functionality. With Radio, I wanted to see if we could take the same functionality and make it tight and focused. It worked. There were two main screens, one for writing (the home page) and one for reading (the first link off the home page). Here's a <a href=\"https://imgs.scripting.com/2023/08/14/radioUserland.png\">screen shot</a>. Could you rework a product like WordPress to work this way? Yes, I believe technically it's possible. It would just be another interface on the same functionality. It would not be able to do all that WordPress could, but for most people that's fine because most of what most people do can be covered by much less than all the UI, at least in theory, imho, ymmv, I am not a lawyer, murphy-willing, my mother loves me and all other disclaimers.",
            "created": "Mon, 14 Aug 2023 13:53:02 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2023/08/14/miniPatrioticSanta.png",
            "imageLink": "https://imgs.scripting.com/2023/08/14/radioUserland.png",
            "flInCalendar": true
        }
    ]
}