{
    "created": "2023-08-22T04:00:00.000Z",
    "flInCalendar": true,
    "name": "22",
    "path": "2023/08/22",
    "text": "August 22",
    "type": "calendarDay",
    "subs": [
        {
            "text": "<a href=\"https://github.com/a8cteam51/team51-markdown-rss\">A WordPress plugin</a> that adds the <a href=\"http://source.scripting.com/#1653758422000\">source:markdown</a> element to RSS feeds from the <a href=\"https://github.com/a8cteam51\">special projects group</a> at Automattic. I've wanted to see RSS and Markdown get together. We put support for it in FeedLand, and now there's a way to add it to any WordPress site. This will, long-term, add styling and links to RSS feeds, without opening the door to all the nasty stuff. I've been doing all kinds of interesting stuff with this group. An amazing confluence of philosophy. ",
            "created": "Tue, 22 Aug 2023 20:38:49 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2022/10/24/rssCoffeeMug.png",
            "flInCalendar": true
        },
        {
            "text": "A number of years ago I was driving long distance on an interstate highway. If memory serves, I was going west to east on I-80 in the midwest. I wanted to know if there was a [[Starbucks]] on my route that I could stop at to get caffeine and connect to the net. This was before wireless internet service was broadly available. I struck out. Couldn't find a way to do it. Tomorrow I'm driving west to east again, this time toward <a href=\"https://en.wikipedia.org/wiki/Cape_Cod\">Cape Cod</a>, and will have a little time to kill in transit, and was hoping to find a Starbucks where I could load up on caffeine and hook up to the internet. I asked <a href=\"https://chat.openai.com/share/95da70c8-28ad-4351-aabd-c42a2bd7f299\">ChatGPT</a>, which offered no answer, but suggested a <a href=\"https://www.google.com/maps/search/Starbucks+near+I-90+between+Albany+NY+and+Worcester+MA/@42.1286138,-72.3792273,10z/data=!3m1!4b1?entry=ttu\">Google Maps query</a> that unfortunately didn't work. It just showed me Starbucks around one of the endpoints of my search, Worcester, Mass. So based on this benchmark we still live in information impoverished times. ",
            "created": "Tue, 22 Aug 2023 11:42:32 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "appConsts.urlTwitterServer",
            "created": "Tue, 22 Aug 2023 13:36:28 GMT",
            "type": "outline",
            "description": "Who's to say the name Twitter isn't now in the public domain? ",
            "subs": [
                {
                    "text": "When I started building my Node.js codebase nine years ago, one of the first things I did was build a server to connect to Twitter for identity and to allow my apps to post stuff to Twitter. ",
                    "created": "Tue, 22 Aug 2023 13:30:45 GMT",
                    "image": "https://imgs.scripting.com/2020/07/08/spaghetti.png",
                    "flInCalendar": true
                },
                {
                    "text": "Over time more functionality was added to this <a href=\"https://github.com/scripting/nodeStorage\">blob of server software</a>, because it was easier to add it to a server that I was already running, than to create a new server for each new function. Eventually I cleaned it up and <a href=\"https://github.com/scripting/appServer\">properly modularized things</a>, but the name stuck. The server was still named <i>appConsts.urlTwitterServer</i> in my client software. It was never on my todo list to come up with a better name for it. ",
                    "created": "Tue, 22 Aug 2023 13:39:57 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Anyway at the end of last year I had to get my ass off Twitter asap, and I did it pretty cleanly, but the name persists. I just had to use it in a bit of maintenence for \"FeedLand\". I thought this could be the day, that for just this one app, I could give it a new name. I thought about it for a few seconds and deleted the idea. I decided to write a <a href=\"http://scripting.com/2023/08/22/133628.html\">blog post</a> instead. There's only so much damage I can do in a blog post. ",
                    "created": "Tue, 22 Aug 2023 13:37:22 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "And anyway, who's to say the name Twitter isn't now in the public domain? ",
                    "created": "Tue, 22 Aug 2023 13:46:18 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Maybe we should start naming all kinds of things Twitter. ",
                    "created": "Tue, 22 Aug 2023 13:39:26 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Just a thought. ",
                    "created": "Tue, 22 Aug 2023 13:38:42 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}