{
    "created": "2023-08-26T04:00:00.000Z",
    "flInCalendar": true,
    "name": "26",
    "path": "2023/08/26",
    "text": "August 26",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Today's song: <a href=\"https://www.youtube.com/watch?v=B3kFPBtc9BE\">In Your Eyes</a>.",
            "created": "Sat, 26 Aug 2023 22:40:16 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=B3kFPBtc9BE",
            "flInCalendar": true
        },
        {
            "text": "As a side-project I'm getting a bridge going between my world and wordpress.com, as a way of rebooting <a href=\"http://bingeworthy.io/tv/\">BingeWorthy</a> which I miss dearly. That's where I'm headed. Anyway, <a href=\"http://scripting.com/2023/08/23.html\">last week</a> I thought it worked, but hadn't tested the accessToken WP returns, and it was getting mangled going back and forth to my server. I've <a href=\"https://github.com/scripting/wordpressIdentity/blob/main/worknotes.md#82623-121410-pm-by-dw\">worked that out</a> today. I think it's going to be relatively smooth sailing from here, but I thought that a few days ago too. Praise Murphy. ",
            "created": "Sat, 26 Aug 2023 18:57:17 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/12/12/mastodon.png",
            "flInCalendar": true
        },
        {
            "text": "To anyone who thinks ChatGPT is useless, have a look at <a href=\"https://chat.openai.com/share/7ecef75d-7fb4-475c-940e-7834258da3e5\">this transcript</a> of a programming session I just did. If you know anything about programming, you can see a really high quality collaboration going on here. Of course I am communicating with the AI. It's brilliant, as smart at programming as I am. Seriously. ",
            "created": "Sat, 26 Aug 2023 18:38:30 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Someday there will be a new twitter-like service with one feature that will blow the doors off this hugely dormant product area. Just support Markdown in your posts. That's it. (Wait there's more. Let's get a really nice RSS feed going for your service, just copy the <a href=\"https://rss.firesky.tv/?filter=from:scripting.com\">design</a> we did for Bluesky) and that'll be the knockout punch. Now federation becomes as simple as supporting these two features. No complex server stuff. Low tech and weblike.)",
            "created": "Sat, 26 Aug 2023 15:54:10 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I've been writing about <a href=\"https://www.google.com/search?q=future-safe+archives+site%3Ascripting.com\">future-safe</a> archives for many years, a way to put down $10K or so, and guarantee best efforts to keep my web presence going long after my death. But I expected it would be implemented by a long-lived university with the help of an insurance company, which is by definition a long-lived entity. It's good that <a href=\"https://wordpress.com/blog/2023/08/25/introducing-the-100-year-plan/\">Automattic is thinking</a> about this (there is no published plan, so far just an idea), maybe they'll seek a partnership with Harvard or Oxford, or <a href=\"https://en.wikipedia.org/wiki/Lloyd%27s_of_London\">Lloyds of London</a>. ",
            "created": "Sat, 26 Aug 2023 15:32:21 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I've removed the <a href=\"http://scripting.com/2023/08/23/220513.html\">Giuliani</a> and <a href=\"http://scripting.com/2023/08/24/005328.html\">Trump</a> mugshots from the <a href=\"http://scripting.com/\">home page</a>. The archive pages are still there. Too disturbing. ",
            "created": "Sat, 26 Aug 2023 19:03:18 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "It's 1994",
            "created": "Sat, 26 Aug 2023 18:51:24 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "It's 1994...",
                    "created": "Sat, 26 Aug 2023 18:51:30 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Press: No one is making Mac software.",
                    "flInCalendar": true
                },
                {
                    "text": "Dave: We are!",
                    "flInCalendar": true
                },
                {
                    "text": "Press: Everyone knows no one is making Mac software. ",
                    "flInCalendar": true
                },
                {
                    "text": "Dave starts blog.",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Waiting an hour for a shuttle bus",
            "created": "Sat, 26 Aug 2023 14:59:25 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I was a bit drunk the other night, waiting for a shuttle bus at the <a href=\"https://www.oceanedge.com/\">enormous hotel complex</a> I was staying at and the bus didn't arrive after an hour of waiting, and the light inebriation had turned into an annoying headachy feeling leaning toward a hangover. Sitting on the bench waiting for the shuttle while nice families and happy people went by made me feel more and more like an unhoused person, sprawled on a sidewalk in Manhattan. ",
                    "created": "Sat, 26 Aug 2023 14:37:27 GMT",
                    "image": "https://imgs.scripting.com/2023/08/26/cuckoo.png",
                    "flInCalendar": true
                },
                {
                    "text": "I returned to the hotel lobby, a total of three times while waiting, asking them to call the shuttle bus driver <i>again,</i> but on the third time they said the hotel manager would drive me to my room himself. (The room was a 10 minute drive, who knew how long a walk.) So he comes out and asks me questions to identify myself I guess to be sure I was entitled to a ride, and in answering his questions, which I felt were rude given that I had been waiting for his freaking shuttle bus for over an hour at this point (and I didn't say freaking, I said the impolite word it stands for) while I was listening for an apology which never came, which is probably part of the reason I was so irritated. ",
                    "created": "Sat, 26 Aug 2023 15:00:02 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Later when we were seated in his SUV he told me that I needed to be \"civil\" and not use f-bombs (I was sitting quietly at the time waiting to be taken to my freaking room so I could get over this hangover that was forming) and that was enough for me. ",
                    "created": "Sat, 26 Aug 2023 15:05:01 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I paused and said the kind of thing you wished you would have said at the time but I never had the guts before to say. Use your imagination. He got out of the SUV and left me sitting there. I don't know what he expected me to do. I eventually got out of the SUV and saw that the lost shuttle bus had finally arrived, and I got on it, and the manager once again lectured me on proper social behavior, from outside the bus, and I looked at him and told him to literally get lost. ",
                    "created": "Sat, 26 Aug 2023 15:01:18 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The driver then drove off, and we had a mostly pleasant converation where I explained what an asshole the manager was, noting that the driver did not disagree. ",
                    "created": "Sat, 26 Aug 2023 15:06:01 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "And btw, for the record I stayed at the hotel for two nights for over $1000. So I felt I was entitled to a certain amount of respect, if not for being a human being, for paying so much money to stay at such a <a href=\"https://www.oceanedge.com/\">shitty hotel</a>. ",
                    "created": "Sat, 26 Aug 2023 15:02:01 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PS: A Conde Nast <a href=\"https://www.cntraveler.com/hotels/cape-cod/the-mansion-at-ocean-edge-resort-and-golf-club\">reviewer</a> liked the hotel. Some people are really easy to please I guess. ",
                    "created": "Sat, 26 Aug 2023 14:52:10 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}