{
    "created": "2023-08-30T04:00:00.000Z",
    "flInCalendar": true,
    "name": "30",
    "path": "2023/08/30",
    "text": "August 30",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Today's song: <a href=\"https://www.youtube.com/watch?v=nHcGkGdiEHc\">Old Folks Boogie</a>. \"You know you're over the hill when your mind makes a promise that your body can't fill.\"",
            "created": "Wed, 30 Aug 2023 22:04:50 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I was once told by a famous and stupid NYT columnist that people my age have trouble learning about new tech, saying that I specifically had not aged well tech-wise. It was just an insult from a very stupid person, but it did hurt. Anyway, now that I'm much older I'd add aging means learning about all kinds of things, like sore and weak backs, knees, hips, memory, hair, lower metabolism, and all kinds of other things. My father as his health declined kept saying old age ain't for sissies, and I could see it in his body and his suffering, and now begin to feel it in my own. My advice -- ignore idiotic young folk, they'll find out soon enough, you don't need to explain it to them.",
            "created": "Wed, 30 Aug 2023 21:54:13 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I asked ChatGPT for a pep talk, and it <a href=\"https://chat.openai.com/share/a60bb2f8-deca-4882-a16c-cb48b7548535\">provided</a> a very nice one. Well worth the $20 I paid for August. BTW the same NYT columnist said ChatGPT is garbage because it isn't as smart as he is. Heh. :smile:",
            "created": "Wed, 30 Aug 2023 22:12:00 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I was interested in how <a href=\"https://clerk.ulstercountyny.gov/countyclerk/resources/small-claims-assessment-review-instructionshttps://clerk.ulstercountyny.gov/countyclerk/resources/small-claims-assessment-review-instructions\">small claims court</a> works in Ulster County, where I live. So I looked it up on Google reflexively. At the top of the page was the answer from their ChatGPT clone. Here's a <a href=\"https://imgs.scripting.com/2023/08/30/ulsterCountySmallClaimsCourt.png?nodialog=true\">screen shot</a>. They stepped into the slot ChatGPT was starting to occupy, and they have the <a href=\"https://www.google.com/\">prime real estate</a>. Note the word <i>reflexively</i> in the narrative above. I would perhaps have taken the question to ChatGPT if I cared enough and if it didn't require current info, but it's an extra two steps. But I went to Google first, still. ",
            "created": "Wed, 30 Aug 2023 14:20:07 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2021/05/02/fridaK.png",
            "flInCalendar": true
        },
        {
            "text": "A <a href=\"https://scripting1.wordpress.com/2023/08/13/a-chatgpt-story-about-the-1962-mets/\">story</a> I asked ChatGPT to write about the 1962 Mets. I gave it the basic themes, and a few seconds later, I had the story. It's a new kind of writing, and it's fun, and as a developer my tests can be more entertaining. If you're a programmer you know what I mean. ",
            "created": "Wed, 30 Aug 2023 14:08:09 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I've become interested in viewing WordPress in a different way, not as just a blogging system, or CMS, rather as a back-end for a twitter-like system, or my idea of what a twitter-like system should be. Rather than staying on the sidelines, as I have for the last 17 years or so, going right for the middle. I like WordPress because there's wordpress.com which is huge, millions of users and now a 100-year plan (or at least the idea of having one), and thousands of functioning clones that interop nicely. Does this sound familiar? And their devs are pretty friendly and open-minded, I've found. ",
            "created": "Wed, 30 Aug 2023 14:01:15 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}