{
    "text": "Apple hates devs, always has",
    "created": "Sat, 22 Aug 2020 13:32:42 GMT",
    "type": "outline",
    "description": "People at Apple hate their bosses And the press. And most of all, devs, and on top of the list loudmouth devs like me. ",
    "metaImage": "http://scripting.com/images/2020/08/22/appleBandleyDrive.png",
    "subs": [
        {
            "text": "In 1980-something I was invited to give a talk at Apple along with a reporter from the NYT. The idea was that we would give feedback to Apple people to help them work better with developers and the press. I took the assignment seriously. I showed up with a list of requests, things Apple could do to give their platform an advantage over the IBM PC, their chief competitor at the time. ",
            "created": "Sat, 22 Aug 2020 13:34:44 GMT"
        },
        {
            "text": "When I finished, Apple people lined up to give <i>me</i> feedback on how ungrateful I am. They do all the work and I make all the money and get all the glory. Funny thing, because I viewed it exactly the other way around. They had real salaries and benefits. I was always skating on thin ice. There were plenty of times when I didn't have any idea how I was going to pay the bills. They never had that concern. They could break me, I couldn't break them. They had all the power. They resented that the VPs at Apple would take my calls or respond to my emails, and those emails would be circulated with notes like \"Please do something about this,\" which of course resulted in nothing happening other than more resentment. The bosses didn't listen to them, but then again, they didn't listen to the bosses either. They really held the keys, the top people at Apple had no clue about how computers worked, so they were at the mercy of the people in the room who expressed their displeasure with me that day in the 1980s. ",
            "created": "Sat, 22 Aug 2020 13:35:09 GMT"
        },
        {
            "text": "I did have friends at Apple, people I could take to lunch and ask wtf just happened. It turns out that the rank and file at Apple hate everyone. They hate their bosses, their bosses' bosses. And the press. And most of all, developers. On top of the list loudmouth developers like me. ",
            "created": "Sat, 22 Aug 2020 13:37:38 GMT"
        },
        {
            "text": "What can you say. Some things never change. They were wrong then, developers saved their jobs over and over. Now they don't need anyone to save their jobs, they're floating on a vast ocean of cash. But someday they will need devs. When it works there's tremendous synergy between developers and platform vendors. But employees of the platform vendors are usually big obstacles to success. They hurt, feel unloved, unappreciated, underpaid, dispensible, ripped off. And I don't know of anything that can be done about that. As they say, it is what it is. ",
            "created": "Sat, 22 Aug 2020 13:38:05 GMT"
        }
    ]
}