{
    "text": "September 2",
    "created": "Sun, 02 Sep 2018 15:49:00 GMT",
    "name": "02",
    "subs": [
        {
            "text": "A new <a href=\"http://this.how/scriptingNews/nightlyArchive.opml\">FAQ</a> explains how I archive my blog to GitHub. If you're a tech blogger, please consider archiving your blog in a similar way. I provide the <a href=\"https://github.com/scripting/oldSchoolNightly/blob/master/oldschoolnightly.js\">source</a> to the Node app I use to do the backups.  ",
            "created": "Sun, 02 Sep 2018 16:43:47 GMT",
            "type": "outline"
        },
        {
            "text": "Avenatti works because while he cares how he's covered by the press, he doesn't follow their rules. The other Dems follow the rules. Hillary was the worst. So they could get her on her <a href=\"http://scripting.com/images/2018/09/02/butHerEmailsBig.png\">emails</a>, not because there was any substance, rather because she was \"defensive.\" They criticized her for following their rules. Heh. Break out, there's no penalty for doing so. ",
            "created": "Sun, 02 Sep 2018 20:31:45 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/09/02/emails.png"
        },
        {
            "text": "<a href=\"https://talkingpointsmemo.com/livewire/avenatti-says-hell-hold-resistance-rally-to-counter-trumps-texas-event-with-cruz\">Yes</a>. Always program a concert/rally opposite Trump's. Better comedy, more irreverent political ranting. Position Trump as the ridiculous imitation tinfoil-hat-wearing make-believe despot that he is.",
            "created": "Sun, 02 Sep 2018 20:15:10 GMT",
            "type": "outline"
        },
        {
            "text": "I'm finally watching <a href=\"https://en.wikipedia.org/wiki/The_Man_in_the_High_Castle_(TV_series)\">Man in the High Castle</a>. I had read the book, long ago, and found the first couple of episodes too dark. Just starting episode 4. No spoilers please.",
            "created": "Mon, 03 Sep 2018 02:02:36 GMT",
            "type": "outline"
        },
        {
            "text": "With all the Kavanaugh mischief, seems like Tuesday would be the PERFECT day for Mueller to drop indictments on Don Jr and Kush.",
            "created": "Sun, 02 Sep 2018 22:47:46 GMT",
            "type": "outline"
        },
        {
            "text": "One of my basic rules of discourse is to never tell another person to shut up as long as I can easily stop listening. And the converse, if someone tells me to shut up, or implies it, they're wrong, and I don't argue with them. But I have an exception to the rule. If a \"troll\" is destroying a community and people engage with the troll, I will tell them to stop, and explain, as lovingly as I can, that they're as much a part of the problem as the troll is. There is no excuse for engaging with a troll. ",
            "created": "Sun, 02 Sep 2018 16:48:09 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/09/02/kingTroll.png"
        }
    ]
}