{
    "text": "September 3",
    "created": "Mon, 03 Sep 2018 15:43:00 GMT",
    "name": "03",
    "subs": [
        {
            "text": "New season of <a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+%22bojack+horseman%22&t=hi&ia=web\">Bojack Horseman</a> on <a href=\"https://twitter.com/BoJackHorseman/status/1012002654325600256\">Sept 14</a>. :boom:",
            "created": "Mon, 03 Sep 2018 17:03:01 GMT",
            "type": "outline"
        },
        {
            "text": "Facebook broke the API that allowed me to cross-post there. Now I'm getting regular reminders from them about how I should be posting more stuff to Facebook, my readers are bored, they say.",
            "created": "Mon, 03 Sep 2018 16:56:46 GMT",
            "type": "outline"
        },
        {
            "text": "Fear of palindromes: <a href=\"https://twitter.com/heavenlyav/status/1035951243544412160\">aibohphobia</a>.",
            "created": "Mon, 03 Sep 2018 16:14:11 GMT",
            "type": "outline"
        },
        {
            "text": "this.how now has an <a href=\"http://this.how/\">index page</a> that links to the howtos. ",
            "created": "Mon, 03 Sep 2018 16:51:11 GMT",
            "type": "outline"
        },
        {
            "text": "Democratic priorities for the fall",
            "created": "Mon, 03 Sep 2018 15:43:01 GMT",
            "type": "outline",
            "description": "Oversight, concerts/rallies, starve the troll. ",
            "subs": [
                {
                    "text": "Campaign season starts today. Here are the priorities as I see it.",
                    "created": "Mon, 03 Sep 2018 15:43:07 GMT",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "<b>Campaign on oversight</b>. The reason the Dems must take back at least one chamber of Congress is then they can do oversight of the Trump Administration. Subpoenas and hearings to investigate how the cash flows between Trump and foreign entities, not just Russia.  ",
                            "created": "Mon, 03 Sep 2018 15:43:14 GMT"
                        },
                        {
                            "text": "<b>Concerts/rallies</b>. The Dems have completely ceded the ongoing entertainment campaign to Trump. His rallies are more like concerts, with a single comedian. He's a cross between <a href=\"https://en.wikipedia.org/wiki/Rodney_Dangerfield\">Rodney Dangerfield</a>, <a href=\"https://en.wikipedia.org/wiki/Joan_Rivers\">Joan RIvers</a> and <a href=\"https://en.wikipedia.org/wiki/Don_Rickles\">Don Rickles</a>. He's good but he's not that good. The Dems have the best comedians and musicians. They even have politicians who can <a href=\"https://www.youtube.com/watch?v=_3eC35LoF4U\">burn down the house</a>. Every Trump rally should be programmed against, provided for free to all the networks. Gradually push him off the air.",
                            "created": "Mon, 03 Sep 2018 15:44:17 GMT"
                        },
                        {
                            "text": "<b>Starve the troll</b>. He gets around the media and goes direct. This of course imho is a good trend long-term because it forces the media to become part of the people and vice versa. But in the immediate term, he controls discourse, he keeps the focus on himself, exclusively. Block the troll. And unfollow people who RT him, no matter how much you value their other contributions. Remember <a href=\"http://scripting.com/2018/08/22/151134.html\">trolls die in darkness</a>, and that's a good thing. ",
                            "created": "Mon, 03 Sep 2018 15:45:57 GMT"
                        }
                    ]
                },
                {
                    "text": "Impeachment is an issue for the voters, not the Democratic Party.",
                    "created": "Mon, 03 Sep 2018 18:35:09 GMT",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "Impeachment as a goal is like starting a football game saying your strategy is to score a touchdown. We must focus on rebooting our democracy. We not only have to think about the danger of Trump in the White House, we have to set our country back on its previous course. It was flawed, but at least we had a semblance of the rule of law. Impeachment isn't itself an answer. When the time is right, when there's overwhelming support for impeachment <i>and removal</i> among the people, then and only then will it be the next thing to do. ",
                            "created": "Mon, 03 Sep 2018 15:48:21 GMT"
                        }
                    ]
                }
            ]
        }
    ]
}