{
    "text": "September 6",
    "created": "Thu, 06 Sep 2018 15:24:07 GMT",
    "name": "06",
    "subs": [
        {
            "text": "There should be an inverted real estate market where buyers could list their requirements. Sellers could peruse, the way buyers scan Zillow now. Who knows if I'm looking in the right geography? There could be lots of places that match my desires. ",
            "created": "Thu, 06 Sep 2018 17:24:30 GMT",
            "type": "tweet",
            "tweetId": "1037754134102003717",
            "tweetUserName": "davewiner"
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1037743106240729091\">Poll</a>: Did the anonymous op-ed writer confess to a crime? I should have added \"not sure\" as a choice. I actually think that's the correct answer. Presumably the person took an oath to uphold the Constitution. Seems to me this is extra-constitutional at least, and it may be a violation.",
            "created": "Thu, 06 Sep 2018 16:43:53 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1037743106240729091"
        },
        {
            "text": "The anonymous op-ed",
            "created": "Thu, 06 Sep 2018 15:24:08 GMT",
            "type": "outline",
            "description": "This is no longer recognizable as our form of government. ",
            "subs": [
                {
                    "text": "I was in a real estate office in <a href=\"https://en.wikipedia.org/wiki/Woodstock,_New_York\">Woodstock, NY</a> when news of the anonymous op-ed came out. We all discussed it. I didn't get to read it until about 9PM. Here was my takeaway. ",
                    "created": "Thu, 06 Sep 2018 15:24:51 GMT",
                    "flNumberedSubs": "true",
                    "subs": [
                        {
                            "text": "We did not elect the anonymous columnist.",
                            "created": "Thu, 06 Sep 2018 15:25:13 GMT"
                        },
                        {
                            "text": "We've had a coup, ",
                            "created": "Thu, 06 Sep 2018 15:25:18 GMT"
                        },
                        {
                            "text": "And we don't even know who the new dictator is.",
                            "created": "Thu, 06 Sep 2018 15:25:21 GMT"
                        },
                        {
                            "text": "The NYT did not do us a service. They just supported an illegal government. ",
                            "created": "Thu, 06 Sep 2018 15:25:25 GMT"
                        },
                        {
                            "text": "If we don't stop this now, we will never put it back together.",
                            "created": "Thu, 06 Sep 2018 15:25:29 GMT"
                        }
                    ]
                },
                {
                    "text": "I listened to the <a href=\"http://podcatch.com/archive/2018/09/06/51142.html\">Daily podcast</a> on the subject on the drive back to the city. You should listen to it too. It makes my blood boil. Trump is president, for better or worse. The president runs the executive branch, not the people he hires, and certainly not anonymous people. This is no longer recognizable as our form of government. ",
                    "created": "Thu, 06 Sep 2018 15:25:47 GMT"
                },
                {
                    "text": "One of the theories they cite is that the piece may be intended to soothe Republican voters before the midterm elections. We, the American people, have an interest in Trump running the government he wants to run. For his supporters, they didn't elect these people to countermand his orders. And for those of us who desperately want him out of office, we want the real Trump to be visible, the one who was at the podium with Putin in Helsinki. So we can clearly see what we're voting for or against.",
                    "created": "Thu, 06 Sep 2018 15:27:09 GMT"
                },
                {
                    "text": "Same with the papers for Kavanaugh. It might not make a difference to how the Dems or Repubs vote, but it makes a difference to the voters. We want to know who just made it to the Supreme Court, while we still have a chance to vote out the people who put him there. They are hiding material facts, that's for sure. This is not acceptable. ",
                    "created": "Thu, 06 Sep 2018 15:28:56 GMT"
                },
                {
                    "text": "This has all gone way too far. I am angry at the Republicans, and at the NY Times. How presumptuous of them to let whoever this is rock our form of government without even attaching a name to it. I have not seriously considered cancelling my subscription to the Times before this, but now I don't know. This is fucking outrageous. ",
                    "created": "Thu, 06 Sep 2018 15:31:11 GMT"
                },
                {
                    "text": "\"I'm in control here,\" <a href=\"https://www.youtube.com/watch?v=zUKW0fL-OqY\">said</a> Secretary of State Alexander Haig in 1981 after President Reagan had been shot in an <a href=\"https://en.wikipedia.org/wiki/Attempted_assassination_of_Ronald_Reagan\">assassination attempt</a>. This was a huge deal at the time. We knew his name, and he had been confirmed by the Senate.",
                    "created": "Thu, 06 Sep 2018 16:21:40 GMT",
                    "urlvideo": "https://www.youtube.com/watch?v=zUKW0fL-OqY"
                }
            ]
        }
    ]
}