{
    "text": "September 21",
    "created": "Fri, 21 Sep 2018 14:58:12 GMT",
    "name": "21",
    "subs": [
        {
            "text": "At some point journalism has to look at the motives of journalists, because it’s material. What process led the NYT to run its <a href=\"https://www.memeorandum.com/180921/p69#a180921p69\">piece</a> today? It looks like <a href=\"https://en.wikipedia.org/wiki/Access_journalism\">access journalism</a>. Was it? Did they consider the consequences? It looks fake, btw. Was it? It feels like they sold us out, as they have been doing <a href=\"http://scripting.com/images/2018/09/02/butHerEmailsBig.png\">starting</a> with <a href=\"https://en.wikipedia.org/wiki/Hillary_Clinton_email_controversy\">Hillary's emails</a> (actually before that, in the <a href=\"https://observer.com/2015/04/judith-miller-carried-water-for-the-usas-worst-debacle-since-vietnam/\">buildup</a> to the Iraq War).",
            "created": "Sat, 22 Sep 2018 02:07:42 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/10/20/itchyscratchy2.png"
        },
        {
            "text": "This song, <a href=\"https://www.youtube.com/watch?v=U594N3AottE\">Africans</a> by Peter Tosh, is always in my mind. ",
            "created": "Fri, 21 Sep 2018 15:15:01 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=U594N3AottE"
        },
        {
            "text": "Wishlist item: I wish it were possible to write a driver for GitHub that would teach it how to display formats it doesn't know about, like \"OPML\" and \"RSS\". I write my development notes in OPML, and would like to have them be directly readable in GitHub. OPML has been stable for 18 years and RSS for 16. I think it would be safe to support them now. And this raises a question, can there be a process for vetting the code and adding it to the native capabilities of GitHub? I think most of the expertise in these formats exists outside their company. Are we ready for this kind of collaboration?",
            "created": "Fri, 21 Sep 2018 14:58:13 GMT",
            "type": "outline",
            "image": "http://scripting.com/2015/09/10/computerLib.png"
        }
    ]
}