{
    "text": "September 23",
    "created": "Sun, 23 Sep 2018 17:17:14 GMT",
    "name": "23",
    "subs": [
        {
            "text": "I want a user-owned browser. One that's free of the tech industry. Chrome was good when Firefox got slow and unfocused. And Firefox was good when MSIE was malware-infested and stagnant. But none of them were or are user-driven. We can't have a healthy web w/o a good browser.",
            "created": "Mon, 24 Sep 2018 02:09:21 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/09/24/monopolyDude.png"
        },
        {
            "text": "I assumed the backlog on the <a href=\"https://3.tesla.com/model3/\">Tesla Model 3</a> was longer than 4 weeks. ",
            "created": "Mon, 24 Sep 2018 01:58:35 GMT",
            "type": "outline"
        },
        {
            "text": "The <a href=\"https://www.wonkette.com/new-york-times-just-handed-trump-rod-rosensteins-head-on-a-stick-so-thats-awesome-2606855001.amp.html\">NYT report</a> on Rosenstein is as disturbing as Comey’s October surprise in 2016 re Hillary’s <a href=\"http://scripting.com/images/2018/09/02/butHerEmailsBig.png\">emails</a>.",
            "created": "Sun, 23 Sep 2018 23:11:47 GMT",
            "type": "outline"
        },
        {
            "text": "I don't see the point of polling for ordinary people. I get why political consultants and candidates would care. Even donors. But why should a voter care? I can't imagine ever making a decision on who to vote for based on poll results.",
            "created": "Sun, 23 Sep 2018 17:25:10 GMT",
            "type": "outline"
        },
        {
            "text": "Lifestyle real estate",
            "created": "Sun, 23 Sep 2018 17:17:15 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Suppose you could live in any time zone, as long as there was a major airport nearby, and you had certain requirements about weather, nearby universities, quality of bike riding, places to eat, real estate prices, or climate, even legal cannabis, politics (I can't live in a mostly-Republican place, I've tried).",
                    "created": "Sun, 23 Sep 2018 17:17:21 GMT",
                    "image": "http://scripting.com/images/2017/10/04/goldenGirl.png"
                },
                {
                    "text": "The consultant would have a good idea about the markets in each geography, and was pretty good at listening. The things that make a good real estate agent, but without being tied to specific geography.",
                    "created": "Sun, 23 Sep 2018 17:18:12 GMT"
                },
                {
                    "text": "With the advent of a global network, where you park yourself in physical space is more a matter of preference, it might not limit you in terms of employment.",
                    "created": "Sun, 23 Sep 2018 17:18:22 GMT"
                },
                {
                    "text": "I imagine totally virtual companies might even provide this kind of service to their most valued people. \"I feel like living in the mountains for few years, starting in August, make it so.\"",
                    "created": "Sun, 23 Sep 2018 17:18:01 GMT"
                }
            ]
        }
    ]
}