{
    "text": "September 24",
    "created": "Mon, 24 Sep 2018 14:58:20 GMT",
    "name": "24",
    "subs": [
        {
            "text": "I've got the serving-from-GitHub part <a href=\"http://englishblog1.scripting.com/posts/2018/09/24/154357.md\">working</a> now. Lots of loose ends. And this <a href=\"http://englishblog1.scripting.com/posts/2018/09/22/174921.md\">link</a> may only work for a few days. But it's progress. Also here are my worknotes for today.",
            "created": "Mon, 24 Sep 2018 19:50:20 GMT",
            "type": "outline"
        },
        {
            "text": "I get it. News doesn't care who the news favors. You got a scoop, you run with it, let the chips fall where they may. But.. that applies to current events. Things that happen today or yesterday, or a few days ago. Remember the word <i>news</i> comes from <a href=\"http://thesaurus.land/?word=new\">new</a> which means something that just happened. Another requirement of news is that it be unusual. As they say, a plane landing on time might be new, but it isn't news. A plane crash, that would be news, if it happened recently. So if you report something that happened 1.5 years ago, and is as unremarkable as a plane landing on time, and it results in news being made, and your sources being gleefully ecstatic, that's not news, that's <a href=\"https://duckduckgo.com/?q=define+cronyism&t=h_&ia=definition\">cronyism</a>, and you're indicted for no longer being about news. I've had this concern about the NY Times for quite a few years, since they were instrumental in providing the false justification for the war in Iraq. Then there were Hillary's emails. Thanks for that. And the anonymous op-ed. And then the bullshit report about Rod Rosenstein saying 1.5 years ago something <i>we want him to say,</i> like how do we dig out of this hole we're in? I don't know what to do about the NYT. I'd like to hear what they say about this. So far no reporter has asked them why they chose to run the story on Friday that's resulting in Rod Rosenstein's <a href=\"https://twitter.com/davewiner/status/1044239074851254272\">resignation</a> <a href=\"http://nymag.com/daily/intelligencer/2018/09/rosenstein-resignation-would-be-disaster-for-the-rule-of-law.html\">today</a>. And now what happens? Do you have any regrets NYT?",
            "created": "Mon, 24 Sep 2018 14:58:21 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/05/04/dorothy.png"
        }
    ]
}