{
    "text": "September 29",
    "created": "Sat, 29 Sep 2018 13:06:09 GMT",
    "name": "29",
    "subs": [
        {
            "text": "The <a href=\"http://scripting.com/images/2018/09/29/libertyCartoon.png\">illustration</a> of this moment in our civic life. ",
            "created": "Sun, 30 Sep 2018 00:31:30 GMT",
            "type": "outline"
        },
        {
            "text": "I was happy to see this <a href=\"https://twitter.com/behindyourback/status/1045864179171766272\">thread</a> on Twitter. And this <a href=\"https://twitter.com/AshleyJudd/status/1046156833487040512\">post</a> from Ashley Judd. We're in this together, people of all genders. ",
            "created": "Sun, 30 Sep 2018 00:05:03 GMT",
            "type": "outline"
        },
        {
            "text": "I wonder when the world is going to be fed up with us. Half of the US population feels like they've been screwed, and the funny thing is it's both halfs. And meanwhile we're the ones who are screwing everyone else. First we get them all going on <i>Let's Work Together to Solve Climate Change, </i>then we pull out of the group that we formed to do it. We make peace with Iran, bring everyone else along, and then we pull out. Meanwhile our currency makes us rich, everyone has to do all their international business using dollars. But we elect representatives who threaten to deliberately crash the dollar. Why? Who the fuck knows. I doubt if they know. How would you sleep at night if you were an Asian banker knowing that you had to trust this crazy country. We complain a lot, but have no idea what we do to others. That goes 1 million times over for the richest Americans. But even those struggling to get by, this is all being done in our name. If we wanted to stop it we could, we just need the will. ",
            "created": "Sat, 29 Sep 2018 14:55:52 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/09/29/drNick.png"
        },
        {
            "text": "The <a href=\"https://en.wikipedia.org/wiki/Tim_Berners-Lee\">founder</a> of the web, writing about his new startup that intends to re-decentralize the web, posts his announcement, a <a href=\"https://medium.com/@timberners_lee/one-small-step-for-the-web-87f92217d085\">web page</a> with a bit of text on it, in a VC-backed silo, to prove what? That he has a sense of humor? Is it <a href=\"https://twitter.com/davewiner/status/1046024987835019264\">really</a> too hard for him to put up a page on a website? ",
            "created": "Sat, 29 Sep 2018 13:06:10 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/09/29/theWebIsDeadFreeGift.png",
            "urltweet": "https://twitter.com/davewiner/status/1046024987835019264"
        },
        {
            "text": "The soup of abuse",
            "created": "Sun, 30 Sep 2018 00:13:42 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "My father was an alcoholic. He was a mean personal alcoholic. I think he learned it from his father. My mother was my father's enabler. She also was a victim of sexual abuse as a child. Her father was her abuser. She learned to be the enabler from her mother, who she hated. Her mother knew what her father was doing and was okay with it. As my mother knew what my father was doing. ",
                    "created": "Sun, 30 Sep 2018 00:13:52 GMT",
                    "image": "http://scripting.com/images/2018/09/29/soup.png"
                },
                {
                    "text": "My mother had a life, became a teacher and a school psychologist and ultimately a professor. I saw my mom in <a href=\"https://en.wikipedia.org/wiki/Christine_Blasey_Ford\">Dr Ford</a>, the mother I wish had. My mother never told her story. She couldn't talk about it. Only once, in the middle of the night, she called me, and told me a tiny bit of the story. It was like a confession. Before and after she refused to talk about it. I hope she talked about it with her therapist, but I don't know if she did. I have reasons to think she didn't. ",
                    "created": "Sun, 30 Sep 2018 00:14:32 GMT"
                },
                {
                    "text": "I learned what happened by going to therapy myself, for eight years, in my forties. My personality formed as the inverse of my parents. They were the mold, I was the product. You could infer their abuse from my issues. I learned a lot about myself. I learned that it wasn't my fault that my childhood home wasn't like <a href=\"https://en.wikipedia.org/wiki/The_Adventures_of_Ozzie_and_Harriet\">Ozzie and Harriet</a> or <a href=\"https://en.wikipedia.org/wiki/Leave_It_to_Beaver\">Leave it to Beaver</a>. My mom often implied that it was my fault. Kids are amazing at absorbing the judgment of adults.",
                    "created": "Sun, 30 Sep 2018 00:15:20 GMT"
                },
                {
                    "text": "I mention this as we start to discuss abuse more openly in our society. What I've wanted to say, I've ached to say, is that it's not an extraordinary event, it's the context within which we exist. We talk about abuse as if it was exceptional, but it's so much more. It's like talking about the game of chess by talking about chess pieces. Or a soup by looking at the peas, tomatoes, carrots. There's a gestalt. And that is still unmentionable. The abuse forms us. It gives us our issues. It creates problems that we have to overcome, or not. We each are assigned roles to play as children, it's hard to break out of the part you're given. To really get started healing, we have to pop up a level and look at our environment. ",
                    "created": "Sun, 30 Sep 2018 00:16:51 GMT"
                },
                {
                    "text": "When I watched Kavanaugh this is what I saw. A person failing to maintain the pretense that he has had a wonderful life, when his life has been a horror show. He drinks to avoid looking. He is so much my father, I feel I know him, and while I loathed my father for most of my life, I eventually saw his struggle, one he never overcame, a child who was never accepted by his parents. It's no wonder he couldn't cope with being a father. Same with my mother. Again Dr Ford provided a perfect screen for me. She did what my mother never could do. My mother never got within 100 million miles of what Dr Ford did. She couldn't even talk about herself to her children, maybe not even to her therapist. She never made peace with her father and mother. And as a result never made peace with herself. She longed for love, for acceptance, for peace, she never attained it. ",
                    "created": "Sun, 30 Sep 2018 00:17:31 GMT"
                },
                {
                    "text": "I think we're on the cusp of a huge revolution in humanity. Living in a soup of abuse and having to pretend everything is perfect, that's the world we're coming from. It's the only world we've known. At least I learned to tell myself the truth. That's progress. Now maybe we can get to a place where it's common to tell each other our truth. Then evolution can take off in a huge way. ",
                    "created": "Sun, 30 Sep 2018 00:24:04 GMT"
                }
            ]
        },
        {
            "text": "It's a hopeful moment",
            "created": "Sun, 30 Sep 2018 00:44:08 GMT",
            "type": "outline",
            "description": "I think this is the most hopeful moment in America since the election of 2016 and the revelations of #metoo.",
            "subs": [
                {
                    "text": "I think this is the most hopeful moment in America since the election of 2016 and the initial revelations of #metoo. ",
                    "created": "Sun, 30 Sep 2018 00:44:17 GMT",
                    "image": "http://static.scripting.com/larryKing/images/2014/05/25/goodHumor.gif"
                },
                {
                    "text": "We're getting close to talking about the real stuff, as a society. We haven't gotten there yet, but the testimony of both Dr Ford and Judge Kavanaugh represent truths never spoken so publicly before. Not even on Oprah. And it happened in the United States Senate, on TV, for everyone to see, everywhere. ",
                    "created": "Sun, 30 Sep 2018 00:45:38 GMT"
                },
                {
                    "text": "So far we've only been talking about incidents, but abuse is more than that, it's the <i>context</i> for our civilization. It's what we never talk about, publicly, and very rarely privately.  But there it was, through both of them, not just Ford. They both spoke their truth. Ford was more direct, but Kavanaugh was just as revealing.",
                    "created": "Sun, 30 Sep 2018 00:45:58 GMT"
                },
                {
                    "text": "What he showed us is a last-ditch effort of a horror show he was trying to present as the pinnacle. He shouldn't worry about teaching at Harvard, coaching basketball or serving on the Supreme Court, he should worry about how he's going to tell the truth, not so much to us, but to himself. ",
                    "created": "Sun, 30 Sep 2018 00:46:21 GMT"
                }
            ]
        }
    ]
}