{
    "created": "2023-12-07T05:00:00.000Z",
    "flInCalendar": true,
    "name": "07",
    "path": "2023/12/07",
    "text": "December 07",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Twitter poisoned our minds with the idea that by taking away the basic features of writing on the web they were encouraging people to write shorter, better, more to-the-point posts and that would make communication on the web like poetry. It was a very zen-like mystical idea, and imho totally wrong. And it's still repeated as if it were gospel -- it's a typical response when I beg for a standard that is more realistic, that incorporates the <a href=\"http://textcasting.org/\">basic features of web writing</a>: simple styles, links, optional titles, enclosures, the ability to edit and unlimited length. The fallacy of this response is that you are free to write however you want, if you feel your ideas are better communicated in short messages, go ahead. I want to use all the tools in my writing. And if you don't want to read all that I write or any of it, there are tools that make that easy. So everyone wins, and you don't have to try to impose your ideas of religiously pure writing on anyone but yourself. ",
            "created": "Thu, 07 Dec 2023 13:24:59 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2019/12/24/santa.png",
            "flInCalendar": true
        },
        {
            "text": "A <a href=\"https://en.wikipedia.org/wiki/Corollary\">corrollary</a> to the <a href=\"http://textcasting.org/\">textcasting</a> philosophy is that I should be able to use any writing tool I like to post to the web, and have it flow where ever I want. The idea of being forced to use a teeny little edit box to write my wonderful prose is as silly as bunding a word processor with a printer, and forcing you to use that editor if you want to print it with that printer. If I sent you a document written for my Brand X printer but you had Brand Y, sorry -- you can't read it. I'm at the point in my life where I have to explain to young folk how great things were when I was their age, but it's true in this case, when I was in my 20s and 30s, there were simple standards for text, and you could print documents produced by any writing tool on any printer. And as a result a wide variety of writing tools and editors were available, and there was lots of innovation in a very short period of time because everyone had competition they could learn from and had to keep up with. Now there's no reason for Twitter, Facebook, Threads, Instagram, Bluesky, Mastodon or whatever to improve their editors because after all you don't have any choice. That's another important facet of textcasting that we borrow from podcasting -- lots of ways to create and lots of ways to listen mean things <i>can</i> get better. With lock-in, they can't. ",
            "created": "Thu, 07 Dec 2023 13:38:32 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Why we want feeds in Bluesky",
            "created": "Thu, 07 Dec 2023 14:05:05 GMT",
            "type": "outline",
            "description": "Feeds should be the baseline of compatibility between social media platforms.",
            "subs": [
                {
                    "text": "My old friend <a href=\"https://www.google.com/search?q=site%3Ascripting.com+%22chuck+shotton%22\">Chuck Shotton</a> just <a href=\"https://bsky.app/profile/mrwheat.bsky.social\">showed up</a> on Bluesky. ",
                    "created": "Thu, 07 Dec 2023 14:05:13 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I love Chuck. We've been through a lot together over a long time. ",
                    "created": "Thu, 07 Dec 2023 14:05:28 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "We had a ton of fun in the early days of the web on the Mac. Chuck wrote the HTTP server we all used. And he loved Frontier, so we made our products work incredibly well together. ",
                    "created": "Thu, 07 Dec 2023 14:05:40 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Those were the days! :smile:",
                    "created": "Thu, 07 Dec 2023 14:14:37 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Anyway, of course I immediately followed Chuck in Bluesky, but then I realize, I can also follow him <a href=\"https://feedland.com/?feedurl=https%3A%2F%2Frss.firesky.tv%2F%3Ffilter%3Dfrom%3Amrwheat.bsky.social\">in FeedLand</a> because thanks to John Spurlock, <a href=\"https://rss.firesky.tv/?filter=from:mrwheat.bsky.social\">we have feeds</a> for every freaking Bluesky user. ",
                    "created": "Thu, 07 Dec 2023 14:06:13 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "<a href=\"https://www.google.com/search?q=site%3Ascripting.com+spurlock\">Spurlock</a> is a gifted programmer, like Chuck, who thinks creatively and doesn't mind priming the pump of a bootstrap, something Chuck and I have done many times in the past. (Chuck is an largely uncredited contributor to the bootstraps of RSS, XML-RPC, podcasting, object databases, content management systems, hey pretty much everything I've worked on since 1994 or so.)",
                    "created": "Thu, 07 Dec 2023 16:09:19 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Okay, now I get to the point. ",
                    "created": "Thu, 07 Dec 2023 14:08:11 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I want to build with confidence on the feed connection with Bluesky. Today I know the ability to <a href=\"https://feedland.com/?feedurl=https%3A%2F%2Frss.firesky.tv%2F%3Ffilter%3Dfrom%3Ascripting.com\">subscribe</a> to a <a href=\"https://rss.firesky.tv/?filter=from:scripting.com\">Bluesky RSS 2.0 feed</a> is there, but will it be there in the future? I would feel better if the feed support were built-into Bluesky, part of its basic feature set. Another very simple API that gets ideas out of Bluesky and anywhere feeds go, which is, as you know, everywhere. ",
                    "created": "Thu, 07 Dec 2023 14:08:21 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Feeds should be the baseline of compatibility between social media platforms. ",
                    "created": "Thu, 07 Dec 2023 14:09:34 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Working with Spurlock, we have given Bluesky a huge headstart, a lead in what I hope will be a race to feed support in all the social media apps, to hook them up to the worldwide feed bus. It's a way to get interop without having to concede that any comprehensive API is the winner. Think of RSS 2.0 support at the TCP of social networking, offering a <a href=\"https://en.wikipedia.org/wiki/Lowest_common_denominator\">LCD</a> compatibility to a world that desperately needs one. ",
                    "created": "Thu, 07 Dec 2023 14:09:59 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "And then after we have that, we can talk about the format of the data we're sending over this network. We have some work to do there too, but luckily the capabilities and limits of RSS 2.0 are a perfect match here. ",
                    "created": "Thu, 07 Dec 2023 14:11:19 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "In summary, the reason we want it is so we can do more with confidence with Bluesky, integrate it into more systems. ",
                    "created": "Thu, 07 Dec 2023 14:12:03 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The reason the Bluesky people should want it is that it offers a way to interop with all social nets, that will take almost no effort on their part, and there's no guesswork, we already know how to make feeds that will work pretty much everywhere, and it lets them take the lead in what will be an important way to communicate on the net. ",
                    "created": "Thu, 07 Dec 2023 14:12:24 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "And the reason it's good for all of us is we can start viewing the web once again as a fully supported writing environment, and let the writers of the world get to work on solving all our problems (of which we have many) and get the freaking technology out of their way. ",
                    "created": "Thu, 07 Dec 2023 14:13:19 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Think of it as the feed-iverse, it's easier and more low-level than the fed-iverse, and can be implemented in a weekend. And it's fun! ",
                    "created": "Thu, 07 Dec 2023 14:16:55 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Grandma on a snowy winter day",
            "created": "Thu, 07 Dec 2023 20:50:26 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Moose the cat sits in Grandma's lap while Lionel the dog keeps her feet warm.",
                    "created": "Thu, 07 Dec 2023 20:50:43 GMT",
                    "inlineImage": "https://imgs.scripting.com/2023/12/07/grandmaMooseAndBarnabyOnAColdDayInTheMountains.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}