{
    "created": "2023-12-08T05:00:00.000Z",
    "flInCalendar": true,
    "name": "08",
    "path": "2023/12/08",
    "text": "December 08",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Where is the Resistance?",
            "created": "Fri, 08 Dec 2023 15:40:19 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "We know journalists are not The Resistance, which begs the question -- who is and why aren't journalists searching for them?",
            "created": "Fri, 08 Dec 2023 15:02:59 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I heard <a href=\"https://en.wikipedia.org/wiki/Jeffrey_Goldberg\">Jeffrey Goldberg</a>, the Editor in Chief of The Atlantic, <a href=\"https://www.npr.org/2023/12/08/1218100652/writers-at-the-atlantic-examine-what-trumps-second-term-could-look-like\">on NPR</a> this morning talking about their <a href=\"https://www.theatlantic.com/magazine/archive/2024/01/donald-trump-second-term-policies/676176/\">special edition</a> about what a second Trump presidency would be like. I'd love to read it but I am not a subscriber. I'd like to hear Goldberg interviewed on what happened to buying an issue of a magazine just because I want to read it. I think it's actually a bigger story, because realistically, it's probably good journalism but won't do anything to prevent a second Trump term, where hearing him explain why they have such a bizarre economic model might help them try another approach and thus provide greater service, and very likely increase their revenue because it would give readers a way to ease into subscribing.",
            "created": "Fri, 08 Dec 2023 14:01:02 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2023/12/08/atlanticCover.png",
            "flInCalendar": true
        },
        {
            "text": "Goldberg said they are not <a href=\"https://chat.openai.com/share/797774d7-4770-46b8-863d-b7c62da4261c\">The Resistance</a>, they're journalists. Well then my question is what good are you exactly and why are you using up all the airtime? Why is NPR even bothering to interview you. He said it clearly, he was just trying to save his conscience for after the Nazis came to power in the US. We have bigger issues than Jeffrey Goldberg's conscience. Why doesn't NPR and The Atlantic go out and find The Freaking Resistance and introduce us to them. My grandfather said something to me when I was a little boy, with such clarity, I can never forget it. He said David, when the Nazis come (he was sure they would) you need to go up on the roof with a gun, and shoot them. He knew. He didn't say \"David, run\" or \"David, write an article in The Atlantic so you have a clear conscience.\" He said I should fight. With guns. That was the lesson he learned from his experience. So where is our Resistance? What the F are we waiting for?  ",
            "created": "Fri, 08 Dec 2023 14:39:44 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "\"Wait and see what happens\" is a losing strategy. By the time you figured out what happened, if you ever do, it's too late.",
            "created": "Fri, 08 Dec 2023 16:24:28 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Using Threads is giving up",
            "created": "Fri, 08 Dec 2023 15:33:39 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Cross-posted <a href=\"https://www.threads.net/@davew/post/C0mLHffsbNK\">from Threads</a>. ",
                    "created": "Fri, 08 Dec 2023 15:35:20 GMT",
                    "subs": [
                        {
                            "text": "I have a lot of trouble calling Facebook some other name.",
                            "created": "Fri, 08 Dec 2023 15:33:47 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "I feel like I'm being used.",
                            "created": "Fri, 08 Dec 2023 15:33:56 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "The company is still the same company it was when they locked up Facebook and fed us to the enemy during the 2016 election. I haven't forgotten.",
                            "created": "Fri, 08 Dec 2023 15:33:59 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Why are we letting them build our new online home if that's what this is supposed to be?",
                            "created": "Fri, 08 Dec 2023 15:34:12 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "This is part of recognizing the stakes in the next election folks, this is something you can do about it.",
                            "created": "Fri, 08 Dec 2023 15:34:16 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Using Threads is as dangerous as voting for Trump.",
                            "created": "Fri, 08 Dec 2023 15:34:21 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}