{
    "created": "2023-12-13T05:00:00.000Z",
    "flInCalendar": true,
    "name": "13",
    "path": "2023/12/13",
    "text": "December 13",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I'm pretty sure federation in social media is the wrong bet. We have to think more broadly. What are the benefits we want from interop in social media. Federation isn't itself a benefit. It's an idea hatched by techies who aren't thinking about how people actually use these systems and which features are valued and which are problematic. Imho, what's valued is the ability to publish something quickly, and without much fuss, and follow others, again easily without having to have a deep understanding of how these things are architected. No one but us programming plumbers cares. I think the idea of <i>conversation</i> not only is overrated, but it's where all the problems are, where all the abuse happens. If we focus on the benefits, quick dissemination of news, and the power of the individual to choose their sources and share them with others -- that's where the juice is. Imho of course, ymmv, praise Murphy, I am not a lawyer and my mother loved me, even though at times it was hard to tell. <span style=\"opacity: 0.4\">:heart:</span>",
            "created": "Wed, 13 Dec 2023 13:52:18 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2023/12/13/frozenOrangeJuiceFromHannafords.png",
            "flInCalendar": true
        },
        {
            "text": "I had a long chat yesterday with <a href=\"https://www.google.com/search?q=site%3Ascripting.com+%22Guy+Kawasaki%22\">Guy Kawasaki</a>. Along the way he wondered how I find something to write every day. The answer -- I don't find things to write, it doesn't work that way. I don't sit down in the morning and say OK now I have to write 1000 words and it doesn't matter what it's about. If I have something to say I say it. And as you can tell, I usually do have something to say, because I'm always thinking and planning, trying to figure out what I want, or if I already know, how to get other people to help me get there. A lot of trial and error, let's see if this way of putting it works, or that one, etc. There's a slogan for this -- <a href=\"http://scripting.com/stories/2009/08/09/narrateYourWork.html\">Narrate Your Work</a> -- and my work is narratable and creates its own record because I do my work right <a href=\"http://scripting.com/2023/12/13.html#a140021\">here</a>, because much of my work involves other people. Actually all of it. And if I can get the people I need to listen to me, ie read my blog, then we can work together (a recurring theme) to make great communication systems out of the web and avoid flushing our future down the toilet, which we always seem to be doing. ",
            "created": "Wed, 13 Dec 2023 14:00:21 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2019/12/24/searsCatalog.png",
            "flInCalendar": true
        },
        {
            "text": "Another time I blog about is when I figure something out that I've been trying to understand for a long time, in some cases my whole life. That still happens. The other day I found myself talking with a friend about love, why when someone says \"I love you\" it doesn't mean what it seems to. Love comes from understanding someone well enough that you know what they desire, what they ache to have, and you to try to help them get it. See all the qualifications in that. Try. Help. Them. In other words, you can love someone when you know them. And you don't give them what they want, you help them get it. You can't love someone who your whole idea of is based on a dream you have about them. That's different. Anyway, lots more to say about all this. It's a recurring topic. It might be the <i>only</i> topic. Someday they'll invent an AI that can analyze my writing and tell me if I've ever written for any other purpose than being worthy of love. ",
            "created": "Wed, 13 Dec 2023 14:25:03 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I miss \"Frontier\" so much. Debugging its database was several orders of magnitude less work than the Node+SQL setup where the runtime and the database are very far apart. In Frontier the database and the language are the same thing. And because Frontier did the rational thing with synchronization, it was handled in the kernel, the code you write doesn't have to worry about it, you can write reasonably readable code. In Node it's a real chore to come back to some code you worked on last a while back. Makes my mind tired, but I do it, because it's where I work now. ",
            "created": "Wed, 13 Dec 2023 16:15:29 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2019/12/26/frontier.png",
            "flInCalendar": true
        }
    ]
}