{
    "created": "2023-12-14T05:00:00.000Z",
    "flInCalendar": true,
    "name": "14",
    "path": "2023/12/14",
    "text": "December 14",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Not a lotta yadda yadda. Heard in a commercial and I had to write it down. We now return to our regularly scheduled program.",
            "created": "Fri, 15 Dec 2023 02:57:49 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "So, with the \"Bloggers\" category not yet ready for prime time, I've replaced it with my <a href=\"https://feedland.com/?river=true&screenname=davewiner&catname=all\">All category</a> from FeedLand, changing the <a href=\"https://imgs.scripting.com/2023/12/14/newstab.png\">title to News</a>. I know it's confusing. I think there's going to be a fair amount of this kind of shuffling in the weeks and months ahead, as we try to fit news and blogs together in interesting ways. You can read the Bloggers category on <a href=\"http://news.scripting.com/\">news.scripting.com</a>. ",
            "created": "Thu, 14 Dec 2023 22:02:46 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "BTW, even with <a href=\"http://news.scripting.com/\">News</a> no longer on the home page of scripting.com, it still gets more hits than the <a href=\"http://scripting.com/\">home page</a>. There's something there to look at. I want to do more to integrate the blog and the news. To make some kind of new publication that has a bunch of voices, yet doesn't spin out of control. ",
            "created": "Thu, 14 Dec 2023 21:05:51 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://forms.gle/wNEiUxkuAijRBY4L7\">Braintrust query</a>: What if I asked you for a list of your favorite blogs? It could be a podcast, or a tech news site. Something you think every Scripting News reader should see when there's something new? Just curious to know what news sources people think are the most interesting, valuable. ",
            "created": "Thu, 14 Dec 2023 20:35:08 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I've been re-bingeing the whole <a href=\"https://en.wikipedia.org/wiki/The_Crown_(TV_series)\">Crown series</a>, anticipating that there was going to be a new and <a href=\"https://www.metacritic.com/tv/the-crown/season-6/\">final series</a> of episodes, out today. I started watching the new one, and all of a sudden the two princes, William and Harry, are actual people. I have a lot of trouble with that, because of course I remember when they were born. However I'm pretty sure I'll go all the way through. There are a lot of hours of entertainment in The Crown and a few scenes that are truly spectacular (<a href=\"https://www.youtube.com/watch?v=rBwQICiGRmw\">like this</a>). I remember the really good ones of course, but there's an awful lot of <a href=\"https://www.merriam-webster.com/dictionary/schlock\">schlock</a>. One scene I had not remembered was a pretty good illustration of how fucked up people can be. Princess Diana had just gone on a <a href=\"https://www.youtube.com/watch?v=vqe-SuyAyWI\">tour of NYC</a>, her first international tour on her own, and it was (surprising to her) a huge success. Another British invasion. The people of NYC loved Diana (at least in the show, I don't remember this, I was living in California at the time). So she comes home, and the royal family, instead of cheering her, were angry with her for being so charming. Go figure. Her husband, Prince Charles is yelling at her and he asks her if she ever considered how <a href=\"https://en.wikipedia.org/wiki/Queen_Camilla\">Camilla</a>, Charles' one true love, would feel about Diana being so popular. Diana is <a href=\"https://en.wiktionary.org/wiki/gobsmacked\">gobsmacked</a> (as am I). Why would she think of that. How totally fucked up is that. Why should anyone, being themselves, being happy, worry about how anyone else might feel about their happiness? I've been in Diana's position a few times, achieving success, much deserved, and was reminded that this upset people who (apparently) didn't want me to succeed? I have even been asked that question. If you ever feel that way, that someone else's happiness is meant to make you feel bad, remember Carl Sagan's <a href=\"https://www.youtube.com/watch?v=wupToqz1e2g\">Pale Blue Dot</a> video. Really, <i>no one cares</i> if you are offended by someone else's happiness. Remember, none of this stuff amounts to anything in the big picture. We're very small, all of us put together, in the grand scheme of things. So if you're happy, good for you! And one other question -- is re-bingeing actually a word?? <span style=\"opacity: 0.6\">:smile:</span>",
            "created": "Thu, 14 Dec 2023 14:40:09 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2019/12/24/santa.png",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"http://scripting.com/2023/12/13.html#a140021\">Yesterday</a> I addressed the How Do I Write question, now let me address Why I Write. I write at least partially because I know there are good people who love my writing. Anyway, I love to write because there are people who love to read. And I feel connected to them. My mother was the prototype. We weren't very close in actual life, but she was a devoted reader of my blog. It gave us a connection. And I assume all daily or nightly readers of this blog have that kind of connection, whether I hear from them or not. And sometimes you do <a href=\"https://twitter.com/tanyaweiman/status/1735267625691701440\">hear from them</a>, and that's especially lovely.",
            "created": "Thu, 14 Dec 2023 21:58:03 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}