{
    "created": "2023-12-17T05:00:00.000Z",
    "flInCalendar": true,
    "name": "17",
    "path": "2023/12/17",
    "text": "December 17",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I read <a href=\"https://inessential.com/2023/12/17/on_mastodon_support_in_netnewswire\">Brent's piece</a> on Mastodon and NetNewsWire, holding my breath hoping he'd arrive at the same answer I did, and he did. \"RSS\" is perfect for Mastodon, it supports RSS, as does NNW (of course), and that's imho exactly the right way to connect the two. That's how we're doing it in \"FeedLand\". And in case Brent reads this, the same approach works for Bluesky, which has excellent RSS 2.0 support thanks to the work done by John Spurlock. The RSS 2.0 support there has more features than Mastodon's RSS feeds, but so far is not part of the Bluesky platform (I am urging them to adopt it). Here's the <a href=\"https://rss.firesky.tv/?filter=from:brentsimmons.bsky.social\">feed</a> for Brent's account on Bluesky, and <a href=\"https://rss.firesky.tv/?filter=from:scripting.com\">mine</a>. RSS is a perfect format for open non-silo'd social web apps. It gives us the most interop, most quickly. They should all be getting on board the RSS bandwagon, asap, imho. It's too good an opportunity to pass up. ",
            "created": "Mon, 18 Dec 2023 03:40:45 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2019/01/10/loveRss.png",
            "flInCalendar": true
        },
        {
            "text": "One interesting way to make our feed readers smarter about working with Mastodon and Bluesky is to do the same kind of mapping from account to feed we do with sites that support <a href=\"http://scripting.com/stories/2011/12/17/rssAutodiscovery.html\">feed discovery</a>. When we see the user is trying to subscribe to a Mastodon account, we know where its feed is, so subscribe to that. Same for Bluesky. I expect we'll do that for FeedLand via the <a href=\"https://github.com/scripting/reallysimple/tree/main/demos/feedhunter\">FeedHunter package</a>. ",
            "created": "Mon, 18 Dec 2023 03:55:20 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The last episodes of <a href=\"https://www.google.com/search?q=site%3Ascripting.com+%22the+crown%22\">The Crown</a> were absolute garbage. It's so bad that you notice the music and how dramatic it is for absolutely no drama on screen. I'm surprised the actors were willing to go along with it. The only good part was where the Queen does standup near the end of the last episode. Something like 80 hours of TV behind them, and all of a sudden this stoic character, with no sense of humor whatsoever, who can't even cry, is bringing down the house. Oh please. I had to stick around to see how bad it can get, now you don't. If I had to give it a rating it would be <a href=\"https://imgs.scripting.com/2023/12/17/ohthehumanity.png\">Oh The Humanity</a>.",
            "created": "Sun, 17 Dec 2023 18:24:14 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Picked a movie, <a href=\"https://en.wikipedia.org/wiki/The_Last_Duel_(2021_film)\">The Last Duel</a>, more or less at random, based largely on <a href=\"https://en.wikipedia.org/wiki/The_Last_Duel_(2021_film)#Cast\">who</a> was in it, and the fact that the <a href=\"https://www.nytimes.com/2021/10/13/movies/the-last-duel-review.html?unlocked_article_code=1.Gk0.YAJS.AGdcc4Vz9G0C&hpgrp=k-abar&smid=url-share\">NYT</a> gave it a critic's pick rating. It was good. But this isn't a movie review, it's a review of the user interface for choosing movies on streaming services. Why can't we integrate a site like <a href=\"http://metacritic.com/\">Metacritic</a> with Hulu, Netflix, Amazon, Max, AppleTV, et al. Just let me know what Metacritic says, and make it clickable, so I can see what the individual pubs had to say if I want more info. Don't make me look it up. People joke about how we spend our time scrolling around not watching anything. But it's true, I do it. Most of them are not worth the time, I suspect. But when you find one that's good, almost at random and even so had to do a lot of work to determine if it was worth a chance, and this has been going on for a decade, why doesn't one of these services just buy Metacritic and integrate it and make your users sing your praises everywhere online. How much could Metacritic cost? (They seem to be in trouble, a lot of the links generated by their CMS are broken.)",
            "created": "Sun, 17 Dec 2023 18:06:50 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2023/12/17/lastDuel.png",
            "flInCalendar": true
        }
    ]
}