{
    "created": "2023-12-25T05:00:00.000Z",
    "flInCalendar": true,
    "name": "25",
    "path": "2023/12/25",
    "text": "December 25",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Happy Christmas everyone who celebrates. I have a little business to do here on <a href=\"http://scripting.com/\">my blog</a> today, then the regular holiday schedule will begin starting tomorrow and probably go through the first week of January.",
            "created": "Mon, 25 Dec 2023 14:54:16 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2022/12/01/santa.png",
            "flInCalendar": true
        },
        {
            "text": "This period is often a time of innovation in the world of blogs, podcasting and feeds. For me this year, I'm using the time to do more work on CSS and basic user interface stuff for \"FeedLand\" and for news products like \"news.scripting.com\", which has been surprisingly popular. The new stuff will start showing up first in that site, pretty soon. The goal is to build on its popularity, to bootstrap a new platform. ",
            "created": "Mon, 25 Dec 2023 14:55:30 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I also want to write a bit more about RSS support in Bluesky, what it means, and ideas for next steps. BTW, here's a <a href=\"https://imgs.scripting.com/2023/12/25/emailToJayAtBluesky.png\">screen shot</a> of the email I sent to Jay Graber, the CEO of Bluesky, on Dec 12, asking for \"RSS 2.0\" support, which was released publicly ten days later on <a href=\"http://scripting.com/2023/12/22.html\">Dec 22</a>. ",
            "created": "Mon, 25 Dec 2023 14:59:23 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I made a change to how images are served from this blog, to see if the images are still blocked by GMail. Previously we redirected to an <a href=\"https://s3.amazonaws.com/scripting.com/images/2022/12/01/santa.png\">S3 file</a>, so we could use HTTPS and but not have to have the bits flow through one of my Digital Ocean servers, which after this change, they now do. For most of you this will be blah blah whatever blah blah zzzz, but some people may find it interesting.",
            "created": "Mon, 25 Dec 2023 15:34:47 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "BTW, there is only one <a href=\"https://cyber.harvard.edu/rss/rss.html\">RSS 2.0 spec</a>.  :smile: ",
            "created": "Mon, 25 Dec 2023 20:05:48 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}