{
    "created": "2023-12-30T05:00:00.000Z",
    "flInCalendar": true,
    "name": "30",
    "path": "2023/12/30",
    "text": "December 30",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Here's the <a href=\"http://scripting.com/code/newsproducthome/newsscriptingcom.json\">JSON spec</a> for news.scripting.com. Not done yet, still more stuff to add, and possibly change, but I think it looks pretty good so far. The previous version depended on OPML, and I wanted to move to JSON because OPML already has plenty to do in our world. :smile:",
            "created": "Sat, 30 Dec 2023 16:21:28 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2023/09/18/slugger.png",
            "flInCalendar": true
        },
        {
            "text": "When I say \"textcasting\" is \"applying the philosophy of podcasting to text\" -- what I mean in practical terms is that my flow of ideas is available \"where ever you get your text.\" Choice in subscribing has to be that fluid, commonsense, and choice is something people feel entitled to, as they do with podcasts. I've been told people would never understand the philosophy of podcasting, but they do, they understand they're entitled to choice in how to listen and thus producers are free to choose where to publish. Somehow text, which is so much easier to transmit than audio, is far less flexible. That's a mistake I want to undo, but I can't do it alone. I need to work with other people who have writing and reading tools, and people who have something to say and want all the features of writing to be at their disposal, and for it to be easy, inexpensive but not free of charge, and not owned by the titans of tech. Another <a href=\"https://www.youtube.com/watch?v=U7dBMYUyRAQ\">song</a> comes to mind. \"You can get it if you really want.\"",
            "created": "Sat, 30 Dec 2023 16:26:40 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Yesterday I wrote that <i>working together</i> is the challenge for open tech developers. If you're waiting for a big company to work with you, and we all are, the answer is you'll probably wait a long time, and you probably won't get there. It's not impossible, but it is improbable. So while you're waiting, why not work with a peer on solving a problem you both have in somewhat different ways, but make what you do compatible. That's what working together is about. It's not just that the people did it, but you created something that lives on that works together. There's even a <a href=\"https://www.youtube.com/watch?v=HH3ruuml-R4\">song</a> that goes with this. \"If you can't be with the one you love, love the one you're with.\"   ",
            "created": "Sat, 30 Dec 2023 16:04:14 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "There's been a bit of trouble on my servers the last couple of days, and as a result a couple of domains are not working for everyone, or are behaving in mysterious ways. I moved <a href=\"https://textcasting.org/\">textcasting.org</a> to a server that has a copy of <a href=\"https://github.com/scripting/pagePark/issues/25\">Caddy</a> installed, and therefore supports HTTPS. I am able to see the domain on my local machines, but not on my phone, and I'm getting reports that other people are getting empty pages. And theoretically there should be no way that people should get a non-HTTPS version of <a href=\"https://news.scripting.com/\">news.scripting.com</a>, but I'm seeing hits for the HTTP version in my log. Very weird. If you can shed any light on the problems from your end, please post a note <a href=\"https://github.com/scripting/Scripting-News/issues/285#issuecomment-1872208109\">here</a>. Thanks! What a way to end a year. Oy. ",
            "created": "Sat, 30 Dec 2023 14:46:55 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2023/10/02/debbieDowner.png",
            "flInCalendar": true
        }
    ]
}