{
    "created": "2023-12-31T05:00:00.000Z",
    "flInCalendar": true,
    "name": "31",
    "path": "2023/12/31",
    "text": "December 31",
    "type": "calendarDay",
    "subs": [
        {
            "text": "<a href=\"https://bsky.app/profile/andrewhickey.bsky.social\">Andrew Hickey</a> is this year's <a href=\"https://www.google.com/search?q=site%3Ascripting.com+Blogger+of+the+Year\">Blogger of the Year</a>. He's a prototypical blogger, exactly the kind of person I hoped would <a href=\"http://scripting.com/2022/04/13/165056.html?title=sourcesGoDirectExplained\">create</a> their own media having profound positive impact on people's lives. People like me. His <a href=\"https://500songs.com/podcast/\">500 Songs</a> podcast, which I've written about <a href=\"https://www.google.com/search?q=site%3Ascripting.com+500+songs\">many times</a>, focuses on a song in every episode and tells you how the pieces came together to create it. When a new episode comes out I greedily savor it, like a great <a href=\"https://www.google.com/search?q=site%3Ascripting.com+bagel\">bagel</a> from Zabar's or a new <a href=\"https://en.wikipedia.org/wiki/Quentin_Tarantino#Filmography\">Tarantino</a> movie. Two recent episodes, one about the <a href=\"https://500songs.com/podcast/episode-165-dark-star-by-the-grateful-dead/\">Grateful Dead</a> and the other about <a href=\"https://500songs.com/podcast/episode-171-hey-jude-by-the-beatles/\">Hey Jude</a>, changed my views of each of the groups, in the first case confirming an intuition, and in the other showing me how naive my idea of how a song comes together. I am envious of how the musicians work together, it may be a cuthroat industry, but it seems incredibly collaborative compared to how tech works, where we all pretty much ignore each other. Hickey isn't just a podcaster, he's also a blogger, and he does it in an unusual place, <a href=\"https://bsky.app/profile/andrewhickey.bsky.social\">on Bluesky</a>. He has things to say and that's of course what <a href=\"http://scripting.com/stories/2009/11/24/naturalbornBlogger.html\">NBB's</a> are all about. You may not care for their opinions, but you will know what they are. Anyway, if you like the Beatles, I highly recommend the <a href=\"https://500songs.com/podcast/episode-171-hey-jude-by-the-beatles/\">latest episode</a>, and if you like popular music, <a href=\"https://500songs.com/feed/podcast/\">subscribe</a> to <a href=\"https://feedland.com/?river=https%3A%2F%2F500songs.com%2Ffeed%2Fpodcast%2F\">500 Songs</a>. And if you know of any podcasts like this, please let me know. I always want to add to my podcast reading list. ",
            "created": "Sun, 31 Dec 2023 18:22:19 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2022/04/15/theEggman.png",
            "flInCalendar": true
        },
        {
            "text": "Hickey was <a href=\"https://www.newyorker.com/culture/podcast-dept/a-music-podcast-unlike-any-other\">profiled</a> in the New Yorker in July.",
            "created": "Sun, 31 Dec 2023 18:35:33 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "A quiet end for 2023. It was not a fantastic year, work-wise. I spent almost all my time working away from my interests. First project was completely replacing the identity system in the two apps I'm maintaining -- \"Drummer\" and \"FeedLand\", and letting the others end. No one ever says thanks for this kind of work, but it's as basic as converting a house from oil heat to a <a href=\"https://en.wikipedia.org/wiki/Heat_pump\">heat pump</a>. Some of the ducts still work, but things break in hard to find ways. I also converted FeedLand from a simple app that runs on a virtual server, to a scalable and durable app (we hope) that runs in a big cloud. This part was good, but again the work is far from where my expertise and interests lie. So at the beginning of a new year, I'm going to remind myself that I'm too old and not paid well enough (I'm not paid at all, heh) to do another year of this kind of work. I should be making writing and reading tools work better on the web. That's my mission. If it isn't related to that, please understand when I don't give it a high priority. Just one person here. Surprisingly resilient, but also quite tired. ",
            "created": "Sun, 31 Dec 2023 18:12:41 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2023/04/24/cheshireCat.png",
            "flInCalendar": true
        },
        {
            "text": "Sometimes I wonder if dying is like waking from from a dream, hopefully with friends and loved ones waiting for you, like going to a diner after seeing a movie together and you all talk about how you liked it, and if you want to see it again.",
            "created": "Mon, 01 Jan 2024 03:27:23 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}