{
    "text": "WordPress destiny, day 2",
    "created": "Sun, 06 Oct 2024 14:26:57 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Glad I wrote the piece I wrote <a href=\"http://scripting.com/2024/10/05/142118.html?title=wordPressDestiny1\">yesterday</a>. ",
            "created": "Sun, 06 Oct 2024 14:27:04 GMT",
            "flInCalendar": true
        },
        {
            "text": "I could have written it any time in the last year as I was investigating and developing on the WordPress API and back end, but now seemed to be a good time, with all the attention its getting, and Matt's interviews, I and others are getting a better idea of what the various components of the community are. I don't know about the rest of you, but I had only a vague idea of what WordPress is beyond a piece of software used for commerce and to a lesser extent these days, writing on the web.",
            "created": "Sun, 06 Oct 2024 16:03:17 GMT",
            "flInCalendar": true
        },
        {
            "text": "A few ideas -- not in any particular order:",
            "created": "Sun, 06 Oct 2024 15:07:39 GMT",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "From my point of view, blogging and the \"social web\", WordPress is being built <i>around</i> more than being built on, when it is such a <a href=\"https://textcasting.org/\">potent</a> and surprisingly open <a href=\"https://www.google.com/search?q=site%3Ascripting.com+coral+reef\">platform</a>. I took the time to look, and underneath the cluttered user interface is a strong foundation that you could build <i>any kind of writing software</i> on. ",
                    "created": "Sun, 06 Oct 2024 14:19:07 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "If a community developed at this level, writing tools, we'd be compatible at a very deep level, so the opportunities for <a href=\"https://www.google.com/search?q=site%3Ascripting.com+interop\">interop</a> are amazing. I don't say that lightly. (I had asked them to allow apps to attach their own data to posts for years, until I discovered earlier this year the API has that feature. If only they had listened to the question and answered it thoughtfully, we could have saved years. The company desperately needs an evangelism function.)",
                    "created": "Sun, 06 Oct 2024 15:34:18 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The WordPress platform could be a very strong part of the \"social web\". The comparison between developer freedom on the WordPress platform and the Facebook one (which is what Threads is built on) is stark. I have worked on the Facebook platform, btw -- and from a software design perspective it's brilliant, a breakthrough, something to emulate, which I did in the <a href=\"https://github.com/scripting/wpIdentity\">wpidentity</a> package I wrote. But from a policy standpoint, after the 2016 election Facebook's API was radically restricted, not something many people know about (it was a fully public event). WordPress has an API that doesn't appear to have any such limits, and even if they imposed them, in theory their server could be cloned (it's open source) but it certainly could be emulated at an API level. ",
                    "created": "Sun, 06 Oct 2024 14:32:35 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It's enticing. All those users -- there should be a market for writing tools there, but there isn't. Why is that??",
                    "created": "Sun, 06 Oct 2024 15:03:54 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I feel like we're like ships passing in the night. I thought I should point this out, at least once, as Matt and company go off in a direction I don't understand and don't see why I should want to. Did they care when the move to HTTPS undermined what remains of the original blogosphere? I don't see any evidence of it. It's like Walmart sought to build a shopping center on the remains of the <a href=\"https://en.wikipedia.org/wiki/Library_of_Alexandria\">Library of Alexandria</a>. People don't seem to have any respect for independent writing on the web, what we dreamed of in the beginning, and <i>the dream was realized.</i> No wonder the tech industry wants to tear it down. It contradicts a basic premise of the programming priesthood. And no wonder journalism doesn't defend it, they are offended by the idea of people writing for free, based on the incorrect assumption about what we do. We're their sources, dammit, not their competitors, at least if they would do their jobs (which is another problem altogether) and if they spent any time thinking and questioning before condeming.",
                    "created": "Sun, 06 Oct 2024 14:33:22 GMT",
                    "flInCalendar": true
                },
                {
                    "text": " Look at <a href=\"https://www.theguardian.com/commentisfree/2024/oct/05/the-blogosphere-is-in-full-bloom-the-rest-of-the-internet-has-wilted-dave-winer\">John Naughton's piece</a> today in the Guardian. He's doing more to focus attention on the web as a writing environment than the whole tech industry which is built on our work, especially Automattic. The ignorance and in some cases resentment in the industry is huge, something else Naughton points out so well. We can turn this around, I guess since WordPress is open source, it doesn't have to wait for Matt to turn in that direction. ",
                    "created": "Sun, 06 Oct 2024 14:37:16 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Just some thoughts as the world seems to be converging on something, not sure what. There are so many doors that are now open that never were before, the question is -- do we have the courage to connect the dots and work together, or do we all insist on going our own ways to a fairly dark future.  ",
            "created": "Sun, 06 Oct 2024 14:39:48 GMT",
            "flInCalendar": true
        },
        {
            "text": "PS: If you're a developer, this is the <a href=\"https://github.com/scripting/wpIdentity/blob/main/client/api2.js\">API</a> you use in browser-JS code for the wpidentity package. This was the way Facebook packaged their API for developers, and it was far more efficient than the way Twitter did and WordPress too. So I added this to the stack, and built on it. ",
            "created": "Sun, 06 Oct 2024 19:36:07 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}