{
    "text": "I want my karass",
    "created": "Sun, 01 May 2022 14:34:22 GMT",
    "type": "outline",
    "metaImage": "http://scripting.com/images/2022/05/01/vonnegut.png",
    "description": "A concept defined by Vonnegut in 'Cat's Cradle' which I believe can apply to software and networks. ",
    "subs": [
        {
            "text": "The problem on Twitter is that no one will hear this tweet. Because trying to stay in touch with 1000 people is utterly impossible. Some people follow many more. And then there are the people you don't follow who have a good idea. How do you keep that channel open without also leaving it open for scammers. We haven't figured that out yet. As far as I know, no one is trying. ",
            "created": "Sun, 01 May 2022 14:34:34 GMT",
            "flInCalendar": true
        },
        {
            "text": "What we are left with -- everyone's attention even for the things you follow relatively closely is infinitesimal, and it's constantly diminishing. So it gets even harder for ideas to circulate because nothing penetrates. How can I forward you something you need to know if I never see it?",
            "created": "Sun, 01 May 2022 14:35:50 GMT",
            "flInCalendar": true
        },
        {
            "text": "What I yearn for is a \"karass\" system, for the 12 people who I want to communicate with who I know will pay attention, and will let me build up ideas over a period of weeks or months. And I do the same for them. Their projects connect with mine, we're constanty improving the system, creating new gateways, modifying others. ",
            "created": "Sun, 01 May 2022 14:36:42 GMT",
            "flInCalendar": true
        },
        {
            "text": "I've had that work once in 2001, when I was working on Radio UserLand with a small team of people spread out over the world. Ever since I have been trying to recreate the experience.  ",
            "created": "Sun, 01 May 2022 14:39:15 GMT",
            "flInCalendar": true
        },
        {
            "text": "PS: According to the Wikipedia page on <a href=\"https://en.wikipedia.org/wiki/Cat%27s_Cradle#Bokononism\">Cat's Cradle</a>, a karass is \"a group of people linked in a cosmically significant manner, even when superficial linkages are not evident.\"",
            "created": "Sun, 01 May 2022 14:39:16 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}