{
    "text": "October 2",
    "created": "Sat, 02 Oct 2021 12:39:27 GMT",
    "type": "calendarDay",
    "name": "02",
    "subs": [
        {
            "text": "<a href=\"http://scripting.com/images/2021/10/02/bugFixEmoji.png\">What it feels like</a> when you're sure you've found the bug that's been kicking your ass, and it turns out you actually did. ",
            "created": "Sat, 02 Oct 2021 16:14:33 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Every time I read about how Biden's popularity is dropping, I wonder if there's any reality to this. If it were really a troubling sign that means in the next election, Americans will do what Germans did in 1932, we'll vote into power a fascist party, and open the US to concentration camps and mass exterminations of our own citizens. You may think this is wild, but before Covid the idea of 700K Americans dying of a disease that was largely preventable, because of disinformation from the government itself, that would have seemed like a paranoid delusion. I recorded a <a href=\"http://scripting.com/2020/03/05/aDeadlyVirusIstakingOverTheWorldAndTheUnitedStatesDoesntHaveAGovernment.m4a\">podcast</a> in <a href=\"http://scripting.com/2020/03/\">March 2020</a> to preserve that perspective. If the US actually does vote Repubs into power, we deserve what we get. ",
            "created": "Sat, 02 Oct 2021 14:48:39 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/03/19/beet.png",
            "flInCalendar": true
        },
        {
            "text": "The <a href=\"http://scripting.com/?tab=links\">Links page</a> on Scripting News should be more reliable and faster after the change I made in \"Radio3\" today. ",
            "created": "Sat, 02 Oct 2021 14:46:14 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Pet peeve: People talking about me in the past tense. Do me a favor, wait until it's true. ",
            "created": "Sat, 02 Oct 2021 12:45:16 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I added <a href=\"http://bingeworthy.io/tv/?id=https%3A%2F%2Fwww.metacritic.com%2Ftv%2Fsquid-game\">Squid Game</a> to the Bingeworthy database. My rating -- Good, after watching the first five episodes. I want to see how it turns out, it could become Loved, depending on what they do with the story, which so far is gripping.",
            "created": "Sat, 02 Oct 2021 12:42:33 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I'm watching <a href=\"http://bingeworthy.io/tv/?id=https%3A%2F%2Fwww.metacritic.com%2Ftv%2Fted-lasso\">Ted Lasso</a> just to see how bad a TV show can be. Best line so far: \"A sad white person is still a white person.\" Try changing that to black and see if it gets through the censors. Also a reporter that gives up his sources shouldn't be a reporter.",
            "created": "Sat, 02 Oct 2021 12:39:28 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Here's the big problem with Ted Lasso season 2. You have to like at least one character in a sitcom like Ted Lasso. That was the charm of season one, the star, the person the show is named after, was very likeable, and so were almost all of the others. Nice people, you cheer for them. This season you have to brace yourself because at any moment the formerly likeable Ted Lasso is going to do something supremely assholelike. I'm not joking. Come on. Anyway it's just like Apple to switch the user interface radically without any warning, just <a href=\"https://daringfireball.net/2021/10/the_tragedy_of_safari_15_quote_unquote_tabs\">ask Gruber</a> about where they moved the freaking <a href=\"https://support.apple.com/guide/safari/use-tabs-for-webpages-sfri11576/mac\">tabs</a> in the new version of Safari. It's conceivable that a character could reveal a very well hidden dark side and pull it off, but it's not very common and they totally don't pull it off. ",
            "created": "Sat, 02 Oct 2021 13:15:33 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}