{
    "text": "October 5",
    "created": "Tue, 05 Oct 2021 13:55:12 GMT",
    "type": "calendarDay",
    "name": "05",
    "subs": [
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=GXtwURDAIm4\">Apple's Celebrating Steve Jobs video</a>. Ten years since Steve Jobs died. Watching this video takes me back many years, to when we were young and full of hope and right in the middle of the whole thing. I had the same realization he had, that you can make the world conform to your ideas rather than the other way around. It may feel like things stay constant, but they're always changing. And the people who made the rules were no smarter or better than I am. I still hope to be able to pull a few more rabbits out of my hat. ",
            "created": "Tue, 05 Oct 2021 20:52:57 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=GXtwURDAIm4",
            "image": "http://scripting.com/images/2019/12/28/appleLogo.png",
            "flInCalendar": true
        },
        {
            "text": "Facebook is us",
            "created": "Tue, 05 Oct 2021 13:55:13 GMT",
            "type": "outline",
            "description": "It's human.",
            "metaImage": "http://scripting.com/images/2021/10/05/nySkyline.png",
            "subs": [
                {
                    "text": "<b>Rant! </b>",
                    "created": "Tue, 05 Oct 2021 13:55:18 GMT",
                    "subs": [
                        {
                            "text": "The bullshit about Facebook keeps coming. It's not a fucking autocracy, it's a carrier. You could say everything you say about FB about a city like NY. All the companies selling cigarettes were once hq'd in NY. The mayor of NY must be a cancer criminal, right? Such idiots. The journalists have no sense of perspective on <a href=\"http://scripting.com/2021/09/17/153104.html?title=facebookIsAtLeastEightThings\">what Facebook is</a>. It's hundreds the size of a city like NY. So much happens there. It's created mostly by the people who use it. It's what remains of all the great ideas of networking in the 90s and 00s. A ton of good stuff happens in FB, and a bunch of nasty shit, because -- because <i>Facebook is us</i> -- it's human. Get a fucking grip pundits. You're making asses of yourselves. I tried watching CNN last night. All these people fighting for their own continued existence and to hide the depravity of journalism are desperate to blame FB for fear someone might blame them. I was expecting to see McNamee (longtime friend) on TV last night, thankfully maybe he's gotten a bit of perspective himself, and realizes it isn't <i>just</i> about Zuckerberg. ",
                            "created": "Tue, 05 Oct 2021 14:22:28 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "<b>Plan</b>",
                    "created": "Tue, 05 Oct 2021 14:22:35 GMT",
                    "subs": [
                        {
                            "text": "How to radically restructure <a href=\"http://scripting.com/2021/09/17/153104.html?title=facebookIsAtLeastEightThings\">FB</a>.",
                            "created": "Tue, 05 Oct 2021 14:22:54 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Separate the users and the content from everything else.",
                            "created": "Tue, 05 Oct 2021 14:23:11 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Now figure out what that means and we have a plan. ;-)",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}