{
    "text": "October 6",
    "created": "Wed, 06 Oct 2021 13:18:29 GMT",
    "type": "calendarDay",
    "name": "06",
    "subs": [
        {
            "text": "If we [[default]], the damage to the US economy will be permanent. It won't just be a recession, because we eventually get out of recessions. Poverty will explode. This time the US really will become a third world country. And it won't just cause chaos in the US, it'll be world wide. The media should start explaining what a <a href=\"https://en.wikipedia.org/wiki/Reserve_currency\">reserve currency</a> is, how the US dollar is basically the only one, and what advantages it gives us (they're huge). Increasing the debt limit costs us nothing, not even money because we can print the currency we repay our debt with. All the Repub hype about economics is, like everything else they say, a lie. The US isn't a family on a budget, it's the foundation on which the world economy runs. Look at it this way, if your family could repay its debt by writing numbers on a piece of paper, would you worry about how much you owe? That a simple version of the reality for the US and our dollar. ",
            "created": "Wed, 06 Oct 2021 13:22:10 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/12/06/boom.png",
            "flInCalendar": true
        },
        {
            "text": "Facebook is so powerful because <a href=\"http://scripting.com/2016/05/04/1237.html\">Obama shut down his campaign</a> after winning in 2008. The tech industry organized the people around its values, which they were very <a href=\"https://www.businessinsider.com/people-at-obamas-tech-dinner-2011-2\">open</a> about. The Dems could've done it. Any news org could have. I begged them to do it, publicly and privately. Everyone who's complaining now, news people and politicians, punted, had no idea what FB did was possible, didn't listen when they were told. If they wanted their values represented, they should have done it themselves. That's how this works.",
            "created": "Wed, 06 Oct 2021 14:02:36 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "How about if we put together say $5 million offer to give to Sinema and Manchin if they vote for the big reconciliation package? If the bigco’s can bribe them, why not the people? It’ll end their careers of course, but at least they’ll have some money to soften the blow. ",
            "type": "tweet",
            "created": "Tue Oct 05 18:16:43 +0000 2021",
            "tweetId": "1445452909731143682",
            "tweetUserName": "davewiner",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1445636282697207811\">Poll</a>: Which should I get, Tesla or Peloton, neither or both?",
            "created": "Wed, 06 Oct 2021 13:20:11 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1445636282697207811",
            "flInCalendar": true
        },
        {
            "text": "I started watching <a href=\"https://www.npr.org/2021/10/01/1042318752/maid-review-netflix-tv-series\">Maid</a> on Netflix but it was too depressing, and that’s saying something after watching <a href=\"https://en.wikipedia.org/wiki/Squid_Game\">Squid Game</a> straight through.",
            "created": "Wed, 06 Oct 2021 13:18:30 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The US is on fire",
            "created": "Wed, 06 Oct 2021 15:54:45 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "This image is stark. ",
                    "created": "Wed, 06 Oct 2021 15:54:54 GMT",
                    "inlineImage": "http://scripting.com/images/2021/10/06/capitolOnFire.png",
                    "flInCalendar": true
                },
                {
                    "text": "Pretty sure it was Photoshopped, so don't take it literally. ",
                    "created": "Wed, 06 Oct 2021 15:56:19 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "But it reminds that there was an earlier attack on the World Trade Center, in <a href=\"https://en.wikipedia.org/wiki/1993_World_Trade_Center_bombing\">1993</a>, where the attackers tried to take down one of the buildings and failed. In the second attempt, both towers came down. ",
                    "created": "Wed, 06 Oct 2021 15:59:07 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "If this happened with the US Capitol, it would shatter America.",
                    "created": "Wed, 06 Oct 2021 15:58:38 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}