{
    "text": "October 10",
    "created": "Sun, 10 Oct 2021 15:12:09 GMT",
    "type": "calendarDay",
    "name": "10",
    "subs": [
        {
            "text": "Today is the 27th anniversary of this blog. To celebrate, I'm opening up \"Drummer\" to the world. I hope you love it as much as I do. :heart: ",
            "created": "Sun, 10 Oct 2021 16:28:04 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/10/10/sidebar.png",
            "flInCalendar": true
        },
        {
            "text": "And now, we can start talking about Drummer in concrete terms. Finally. The first thing you should try in Drummer is to write a few blog posts. Follow the first part of the <a href=\"http://docserver.scripting.com/drummer/blogging.opml\">Blogging howto</a>, do the Hello World post. Then write some more, about whatever you like. Learn how to write publicly in Drummer first, in other words. It's the best demo we have right now, today, in Oct 2021, of the power of outlines for public writing. ",
            "created": "Sun, 10 Oct 2021 17:01:47 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Another note and then I'll wait till tomorrow. In this case the Docs are a big part of the product. Back in February, I decided this time, rather than leave the docs as an afterthought, or hire someone else to write them, I would do it myself. For a couple of reasons. This could be the last big product ship I do in my career. Docs were always treated as an afterthought. I want to try, just once, making it not an afterthought. To let the docs have enough time to become something I'm proud of, and something I can invest more time in, like the software, after we ship. Instead of staying away from them, I wanted to reach in, and do it up. As a result I've done enough writing for a book this year, you'll see it not only in the docs linked into the sidebar of the docs pages, but also in the <a href=\"http://docserver.scripting.com/?verb=http.readUrl\">DocServer pages</a> for each of the built-in scripting verbs. Lots and lots more to say. ",
            "created": "Sun, 10 Oct 2021 17:04:03 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "If you have a question about Drummer, <a href=\"https://github.com/scripting/drummerSupport/issues/38\">this</a> is where it goes. ",
            "created": "Sun, 10 Oct 2021 21:55:52 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I'm shopping for a refrigerator. I've spent some time with various web interfaces, on Home Depot, Consumer Reports, Loew's, Best Buy, Amazon. They're all pretty bad, and could make a simple improvement that would completely eclipse the others. Here's the idea. I have a fixed space to put a fridge, and it's unusually narrow. I wish the designer of the house had left more space but it is what it is. Now, they make fridges in this shape, but they don't always have them in stock, esp now, when the supply chain is so disrupted. Here's the feature, it's a very Doc Searls-like thing, btw. I want to say hey Home Depot, this is the space I have. Let me know when you have a fridge I can buy that can be delivered within a couple of weeks. Instead they send me links to their website for refrigerators (at least they remembered that I'm shopping for one, so has Amazon) but they make me start over from scratch every time. That really sucks. Esp if they, at the moment, have a fridge that fits my very easy requirements. It would also be good for energy savings, because my current fridge is not running efficiently at all.  ",
            "created": "Sun, 10 Oct 2021 15:12:10 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/10/10/fridge.png",
            "flInCalendar": true
        },
        {
            "text": "Screen shot of today's blog",
            "created": "Sun, 10 Oct 2021 17:12:48 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Today's <a href=\"http://scripting.com/2021/10/10.html\">Scripting News</a> home page.",
                    "created": "Sun, 10 Oct 2021 17:12:59 GMT",
                    "inlineImage": "http://scripting.com/images/2021/10/10/inlineImage.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Frida Kahlo",
            "created": "Sun, 10 Oct 2021 18:33:14 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2021/10/10/selfPortaitWithABraid.png",
            "subs": [
                {
                    "text": "<a href=\"https://www.wikiart.org/en/frida-kahlo/self-portrait-with-braid-1941\">Self portrait with a braid, 1941</a>.",
                    "created": "Sun, 10 Oct 2021 18:33:19 GMT",
                    "inlineImage": "http://scripting.com/images/2021/10/10/selfPortaitWithABraid.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "The other side of Agile",
            "created": "Sun, 10 Oct 2021 15:51:54 GMT",
            "type": "outline",
            "description": "Users can learn to communicate more effectively with devs to get what they want and more.",
            "subs": [
                {
                    "text": "My longtime friend and sometime collaborator Andrew Shell is part of a program to write 30 posts in 30 days. Yesterday he wrote a piece about his career, and I got an idea for him, that I initially posted in a comment on Facebook, but wanted to include here. ",
                    "created": "Sun, 10 Oct 2021 15:52:02 GMT",
                    "subs": [
                        {
                            "text": "Andrew -- i had an idea for you. ",
                            "created": "Sun, 10 Oct 2021 15:20:37 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "First imho it would be a shame to ignore all the experience you have with software, both as a developer and a user.",
                            "created": "Sun, 10 Oct 2021 15:53:40 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "You could do something great by focusing on the interface between users and developers. A lot has been done about how programmers can be more effective when they listen to users (<a href=\"https://en.wikipedia.org/wiki/Agile_software_development\">agile</a>), but as far as I know nothing about the other direction -- how users can learn to communicate more effectively with devs to get what they want and to influence the future.",
                            "created": "Sun, 10 Oct 2021 15:53:59 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "It's a branch off what I keep <a href=\"https://twitter.com/davewiner/status/1447084856962424832\">coming back to</a> -- we don't teach how to write great <a href=\"https://www.google.com/search?q=site%3Ascripting.com+bug+reports\">bug reports</a>. It can be an incredible literary form, different from any other and they can be very human, because imho it's all about empathy. The user wants the dev to be empathetic with them, and the devs want empathy too, not just because it's more economical, but because it's because programmers are people too! A fact sometimes overlooked, perhaps. ",
                            "created": "Sun, 10 Oct 2021 15:54:55 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Anyway, best of luck with your exploration Andrew.",
                            "created": "Sun, 10 Oct 2021 15:55:55 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "BTW, as far as I know Andrew is posting these ideas on FB and Twitter, as screen shots, but I don't see where they're posted on the web. If they are, I'll add a link here. :smile:",
                    "created": "Sun, 10 Oct 2021 15:53:03 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}