{
    "text": "October 13",
    "created": "Wed, 13 Oct 2021 14:11:09 GMT",
    "type": "calendarDay",
    "name": "13",
    "subs": [
        {
            "text": "I've had <a href=\"https://www.youtube.com/watch?v=efnBmqXjrTU\">this song</a> in my head all day. So that makes it the song of the day I guess. ",
            "created": "Wed, 13 Oct 2021 21:41:45 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I was talking with my friend <a href=\"https://www.google.com/search?q=site%3Ascripting.com+dave+jacobs\">Dave Jacobs</a> last night and we got around to what should be done with [[Facebook]]. The only thing to do when a tech company gets too big, is to force them to unbundle. <a href=\"https://en.wikipedia.org/wiki/Product_bundling\">Bundling</a> is how their size becomes a problem for us. So, for example, [[Google]] owning the dominant search engine and the dominant browser means they're inevitably going to turn the web into a perfect way to continue to own search. That's all that's going to matter to them. But the web has more to do. Google doesn't care. Facebook has also been successful at strangling the open web, forcing all writing on the net to flow through them. Or at least keeping it from flowing outside of them. If Facebook's <a href=\"http://scripting.com/2016/05/18/1269.html\">fat ass</a> wasn't squatting over the web, there would be a lot more movement. That might not solve the problem of Nazis ruining the world, but at least it gives the rest of us a chance to organize and solve the other vexing problems we have to deal with. RIght now all we're tasked with doing is making Zuck even richer, and even Zuck must be bored with that by now. The task for FB is to make it easy for the rest of us to run our own FB's and stay in touch with the people who use his FB. That's what happens when you get as big as they are. And it's far from an unsolvable problem. In fact they already have all the software written. ",
            "created": "Wed, 13 Oct 2021 17:26:14 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/10/13/fatcat.png",
            "flInCalendar": true
        },
        {
            "text": "To people who wanted to use a custom domain for their \"Drummer\" blogs, we now have an <a href=\"https://github.com/scripting/drummerSupport/issues/67\">answer</a>. There's a new head-level attribute for your blog.opml file that tells the CMS where the links should point. It works on my <a href=\"http://clueless.lucky.wtf/\">test blog</a> for the clueless newbie. ",
            "created": "Wed, 13 Oct 2021 15:27:29 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "It's hard to imagine approval rating means anything in 2021. Even if you don't approve of Biden, are you really going to vote for Trump? It seems that even the Dems could market that you're better off not electing Hitler.",
            "created": "Wed, 13 Oct 2021 16:30:09 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "One of the saddest things I've ever heard is Jeremy Lin saying \"I think the NBA has given up on me.\" I would say to him, they had reasons to give up on you when you were 18 and every year since then. That's the way the world works. Assholes climb the ladder, and then think they can stop listening.",
            "created": "Wed, 13 Oct 2021 17:06:00 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "All those windows on the 4 train",
            "created": "Wed, 13 Oct 2021 14:26:26 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "An asshole NYT columnist once asked if I was too old to understand the latest technology. I was so offended, I didn't think to just answer the question.",
                    "created": "Wed, 13 Oct 2021 14:26:38 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The answer is unknowable. I think I understand a lot about tech, because I've spent my entire professional life trying to. I also have created some of the technology that young people feel so proud of understanding better than older people. I think I understand podcasting, for example, as well as any young-un.",
                    "created": "Wed, 13 Oct 2021 14:27:02 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Once when I was a kid, <a href=\"https://www.google.com/maps/dir/29-31+170th+Street,+Queens,+NY/The+Bronx+High+School+of+Science,+75+W+205th+St,+Bronx,+NY+10468/@40.8102893,-73.9598169,12z/data=!4m17!4m16!1m5!1m1!1s0x89c28a8078136589:0xcdf1c8651455269a!2m2!1d-73.7949205!2d40.7696434!1m5!1m1!1s0x89c2f39fba19f047:0x456fa7ab9f9bae18!2m2!1d-73.8914555!2d40.8779882!2m1!5e1!3e3!5i1\">commuting</a> to high school in the Bronx from Queens, I was struck by all the apartment houses whose windows faced <a href=\"https://en.wikipedia.org/wiki/4_(New_York_City_Subway_service)\">the 4 train</a>. Mile after mile. Countless windows facing the train. And behind them more buildings and more windows. ",
                    "created": "Wed, 13 Oct 2021 14:27:09 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Behind every window was a family, with all their challenges, accomplishments, pride, love, beliefs, bad habits, histories, everything. It gave me an idea, how could you possibly think you understand all that's going on. ",
                    "created": "Wed, 13 Oct 2021 14:27:43 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Now, 50 years later, I think the thing is to be open to learning from other people's experiences, and don't presume you understand anything better than anyone else, because when you do that, you close yourself off to learning from them.",
                    "created": "Wed, 13 Oct 2021 14:28:17 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I would say to that NYT asshole that it's the disease of your profession to think you don't have to listen anymore. It's also the disease of programmers, doctors, professors, everyone who gets somewhere in life, to think they've arrived at the top and they have a full understanding of everything they need to understand. That asshole could learn a lot from an asshole like me. All those years, he didn't. And that's not just his problem, because so many people listen to him, it's our problem too. Because he's not as informed imho as he could be. .",
                    "created": "Wed, 13 Oct 2021 14:28:40 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Why we use Twitter identity",
            "created": "Wed, 13 Oct 2021 14:05:00 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I got an email last night that said the person felt I had been hypocritical in using Twitter for identity for Drummer.",
                    "created": "Wed, 13 Oct 2021 14:05:13 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Obviously, I don't think I was hypocritical. ",
                    "created": "Wed, 13 Oct 2021 14:05:38 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I use Twitter for identity because they have a nice API that scales, and they have kept it open for this kind of use for many years. In all that time, they didn't change their mind because of new management, didn't deprecate anything, it just keeps running reliably.",
                    "created": "Wed, 13 Oct 2021 14:05:48 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Are you sharing some information with Twitter? Yes, a little, but not as much as you might think. They certainly never see your outlines. They don't know how many times you log in, that information doesn't pass through to them.",
                    "created": "Wed, 13 Oct 2021 14:06:35 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "We don't keep any information on that ourselves. I don't care. I'm not in any business at all, and certainly not in the business of knowing how much you do whatever you do.",
                    "created": "Wed, 13 Oct 2021 14:07:35 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "They don't know your location, btw -- if they know a location, it's the location of the server, which is at Digital Ocean. I'm not even sure where they keep their servers. That information it seems to me is of no value.",
                    "created": "Wed, 13 Oct 2021 14:08:09 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "If you don't want them to know <i>anything</i> about you -- just create a fake account for this purpose.  ",
                    "created": "Wed, 13 Oct 2021 14:08:48 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Also I want to build features around Twitter. It's a fact of life. It's there. It ain't going anywhere. If I chose not to use it for identity it wouldn't hurt them one bit. I'd have to write an identity server myself and I already have plenty of things to do trying to keep Drummer users happy.",
                    "created": "Wed, 13 Oct 2021 14:09:11 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Net-net -- I don't see a problem here. 😀",
                    "created": "Wed, 13 Oct 2021 14:10:49 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}