{
    "text": "October 16",
    "created": "Sat, 16 Oct 2021 12:58:36 GMT",
    "type": "calendarDay",
    "name": "16",
    "subs": [
        {
            "text": "I hope <a href=\"https://news.yahoo.com/joe-manchin-holding-crucial-climate-190052095.html\">Manchin</a> is getting paid more than $500K per year to sell out our last chance at having a planet that supports human life.",
            "created": "Sun, 17 Oct 2021 01:47:35 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1449535979413512192",
            "flInCalendar": true
        },
        {
            "text": "I have a thing. If they're <a href=\"http://scripting.com/images/2021/10/16/weather.png\">forecasting rain</a>, showers or even a thunderstorm, and it's not raining when I want to go out for a ride, I go out anyway. Worst that can happen is I get soaked, I reason. And I usually make it home in time. And often as soon as I walk in the door it starts to pour. That's exactly what happened today. I'm feeling very oxygenated and strong, writing this post in my bike clothes, and outside it's pouring cats and dogs. Amazing.",
            "created": "Sat, 16 Oct 2021 20:01:54 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/08/30/butHerEmails.png",
            "flInCalendar": true
        },
        {
            "text": "We know what we have to do -- we should be campaigning like everything is at stake (it is) instead we're hearing <a href=\"https://twitter.com/PhilArballo/status/1449427514397442048\">weak statements</a> like this. It's not his fault, btw -- the national Democrats are looking in the wrong direction. I don't know how they can do it, but they are. Where is the Lincoln Project, why aren't they turning out <a href=\"https://www.youtube.com/watch?v=VlJqf_9YYj0\">ads like this</a>, every day, about abortion rights? This is the big problem that the Democrats keep making. To them campaigns are about elections, but they're really about everything, 365 days a year. The campaign never stops. The campaign never stops. The campaign never stops. The campaign never stops. The campaign never stops. The campaign never stops. The campaign never stops. The campaign never stops. The campaign never stops. The campaign never stops. The campaign never stops. ",
            "created": "Sat, 16 Oct 2021 17:37:45 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I've been doing a lot of support this last week. Noted that a lot of times the problem is web caching. Learn how to get your browser to do a <a href=\"https://www.google.com/search?q=browser+hard+reload\">hard reload</a>. Always try that first. Once you have that mastered, it's amazing how much time you'll save.",
            "created": "Sat, 16 Oct 2021 13:49:16 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "R. Crumb",
            "created": "Sun, 17 Oct 2021 00:43:26 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "The P&J Coffee Shop, San Francisco.",
                    "created": "Sun, 17 Oct 2021 00:43:31 GMT",
                    "inlineImage": "http://scripting.com/images/2021/10/16/crumbCoffeeShop.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}