{
    "text": "October 17",
    "created": "Sun, 17 Oct 2021 15:05:49 GMT",
    "type": "calendarDay",
    "name": "17",
    "subs": [
        {
            "text": "I think you have to be very young and very healthy to be medication-averse. There are some people who make it to old age without needing medical care. My mother was one of those people, she didn't get sick until she was in her 80s. Me, on the other hand, I would have died before I was 10 if it wasn't for health care and antibiotics. I had a ruptured appendix, mis-diagnosed by a doctor as a stomach ache. Okay so medicine fucks up, a lot. I have limited vision because two eye doctors gave me bad advice and did surgery, the first fucked my left eye and the second made it worse. My hearing is blown in my left ear, because a doctor used a device to clear out earwax that damaged my eardrum. So now loud noise, including loud music, makes my head vibrate in an unpleasant way. Too bad, I used to love loud music. <i>But I am alive. </i>My life having been saved twice by medicine now. So when medicine says \"take this vaccine it'll make you safer against a horrible disease\" -- I take it. Gladly. Why? Because I get how medicine works to an extent and am appreciative for the life I would not have had were it not for medicine. ",
            "created": "Sun, 17 Oct 2021 19:34:35 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "\"Drummer\" is really going. I'm trying to scope out in my mind now where I want it to go. With all the programmers around now, and maybe more on the way, I'm thinking bigger in terms of open source projects that could spin out of Drummer. ",
            "created": "Sun, 17 Oct 2021 15:14:22 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/12/24/drummer.png",
            "flInCalendar": true
        },
        {
            "text": "In the back of my mind is the question of could we get a Linux version of \"Frontier\" going. That would send this project into the stratosphere, imho. Even after a year's work, Drummer is still a shadow of Frontier, which I use as my development platform for all of this. That's how I'm so productive. Invest as much time in tools as you do in product, and some years, invest all your time in tools. BTW, when I say a Linux version -- I mean an exact clone. The benchmark is whether it runs my software, not that it's a cool project. With these things it's the base of apps that matters. I think the language designers at big companies have lost the tune. The apps are what matters. That's why I program in JavaScript -- it's where all the code is. And that's why projects like <a href=\"https://blog.logrocket.com/what-is-deno/\">Deno</a> (A different arrangement of N O D and E) are such a bad idea. And deprecating the <a href=\"https://www.npmjs.com/package/request\">request</a> verb? Only the most commonly called function the whole fricking language. Deprecated!! Someone has lost their sense of what matters. It's as if one day they decided the new <a href=\"https://en.wikipedia.org/wiki/Tappan_Zee_Bridge_(2017%E2%80%93present)\">Tappan Zee Bridge</a> is too cool to drive cars over, so we'll require people to convert their cars so that the wheels are inside and the seats are outside. Always going backward is a good way to never get anywhere. BTW the Tappan Zee Bridge Is a beautiful bridge. It carries exactly the same traffic the old one did. ",
            "created": "Sun, 17 Oct 2021 19:42:09 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The <a href=\"https://upload.wikimedia.org/wikipedia/commons/thumb/3/37/TappanZeeBridgeFromBelow.JPG/600px-TappanZeeBridgeFromBelow.JPG\">old</a> Tappan Zee Bridge and the <a href=\"https://pix11.com/wp-content/uploads/sites/25/2021/08/AP20241634784176.jpg\">new</a> one. ",
            "created": "Sun, 17 Oct 2021 19:25:45 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I'm doing most of my writing these days in Drummer Land, but it's nice to remember that things I want to write about that don't belong there, still have a home, here.",
            "created": "Sun, 17 Oct 2021 15:18:01 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Car drivers suck. I usually ride my bike on the right edge of the road, making it easy for cars to pass. But if I have to make a left, I move left, and if a car approaches behind me, they have to momentarily slow. They always honk. I never carry a gun, but sometimes I wish I did (not really).",
            "created": "Sun, 17 Oct 2021 15:05:50 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}