{
    "text": "October 26",
    "created": "Tue, 26 Oct 2021 11:56:08 GMT",
    "type": "calendarDay",
    "name": "26",
    "subs": [
        {
            "text": "I am now <a href=\"http://scripting.com/drummer/blog/2021/10/26/215750.html?title=updateOnTheBigDateBug\">rewriting</a> a fairly large part of Old School.",
            "created": "Wed, 27 Oct 2021 03:15:44 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "\"Drummer\" has a <a href=\"http://docserver.scripting.com/drummer/general.opml#1634478289000\">command</a> that downloads a zip archive of all your files. It takes a couple of seconds, so it's really quick (OPML files compress nicely). Even so the users, some of whom are quite technical, are <a href=\"https://github.com/scripting/drummerSupport/issues/63#issuecomment-951849007\">writing scripts</a> to download them automatically. I love seeing this, because backups are the best insurance against software or server problems. And I like to see users take charge and solve problems for themselves. ",
            "created": "Tue, 26 Oct 2021 14:43:05 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Re Facebook and hate speech, every online system is a haven for all kinds of speech. No one knows how to control it, and esp not at the scale that Facebook operates. You could see the revelations differently, at least now Facebook is trying to control the damaging speech. That's progress. But we do have bigger fish to fry. Journalism has decided that we should all aim our hate at Facebook, exclusively. That's a Fox-like tactic. If we're blaming Facebook, I guess we can't blame the NY Times or the WSJ or CNN, MSNBC, etc. As authoritarianism rises, we have to watch our journalism, for signs they are manipulating our focus, for signs they are controlled by or pandering to the fascists. Right now most of us, regardless of <a href=\"https://news.gallup.com/poll/355526/americans-trust-media-dips-second-lowest-record.aspx\">what we say</a> to pollsters, accept what the press says as truth. ",
            "created": "Tue, 26 Oct 2021 12:11:00 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/03/26/comradeStalin.png",
            "flInCalendar": true
        },
        {
            "text": "Next time you hear yet another revelation that Facebook is a haven for hate speech, ask if you've gotten any info on what's going on inside the DoJ and why haven't there been any indictments of Republican insurrectionists. At least <a href=\"https://www.rollingstone.com/politics/politics-news/exclusive-jan-6-organizers-met-congress-white-house-1245289/\">Rolling Stone</a> has started to cover this. But where are the others? Surely there are patriotic insiders in Congress who would provide background info.",
            "created": "Tue, 26 Oct 2021 11:56:09 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}