{
    "created": "2021-10-30T04:00:00.000Z",
    "flInCalendar": true,
    "name": "30",
    "path": "2021/10/30",
    "text": "October 30",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I put this <a href=\"http://scripting.com/images/2021/10/30/message2.png\">message in a bottle</a> on facebook eight years ago. \"For the most part I feel very good about my Facebook friends.\" It's still true today. People who care should stop ignoring the people who use facebook. We matter.",
            "created": "Sat, 30 Oct 2021 16:33:56 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "A video <a href=\"https://www.youtube.com/watch?v=0AId6zUZYko\">demo</a> of Drummer's thesaurus feature.",
            "created": "Sat, 30 Oct 2021 16:14:19 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=0AId6zUZYko",
            "flInCalendar": true
        },
        {
            "text": "Did Dropbox change the period of time they keep changes? I thought they kept them forever. Was I dreaming? Now they say it's just 30 days. It's not a feature I use often, but when I do it's because I <i>need</i> it. It seems I can pay extra and get 180 days. I pay for Dropbox $119 per year btw. 180 days might as well be 30. How do I know in advance how far I need to go back to get the version I'm looking for. ",
            "created": "Sat, 30 Oct 2021 15:38:20 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I bought a Tesla and a Peloton. Neither have arrived yet. When I ride my bike I like to listen to music, or a podcast or an audiobook. I don't need a coach. I bought the Pelo because it's the best indoor exercise bike. Let's see if I can use it that way. Same with the Tesla. It feels like they both want me to join the cult.  ",
            "created": "Sat, 30 Oct 2021 14:23:41 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "We are the government",
            "created": "Sat, 30 Oct 2021 14:31:28 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Living in the <a href=\"https://en.wikipedia.org/wiki/Tri-state_area\">tri-state area</a> we get New Jersey political ads on TV. I saw one for <a href=\"https://en.wikipedia.org/wiki/Phil_Murphy\">NJ governor Murphy</a> running for re-election, but the speakers in the commercial are voters, saying what they want and at the end <a href=\"https://twitter.com/GovMurphy\">Murphy</a> says he agrees with all of it. That's a great commercial. It's great because it says something about our political system that we often forget. We are the government in the US, the people are. Show that you get it not with words but with actions. ",
                    "created": "Sat, 30 Oct 2021 14:31:33 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Tech marketing should work that way also. And journalism about tech. When you write about FB, don't forget the 2.9 billion people who use it. If the company were to disappear, we'd still want an online service where we could all gather. Better if there weren't a company running it, but that's the way it is nowadays.",
                    "created": "Sat, 30 Oct 2021 14:33:15 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "And let's see an apology from the NY Times  for <a href=\"http://scripting.com/images/2021/10/30/boomersSuckSaysTheNYTimes.png\">this horror</a> in yesterday's paper about the people who use Facebook. Of course they ignore everything I write here, but even so, they should apologize, even if they don't care what one blogger thinks.",
                    "created": "Sat, 30 Oct 2021 14:33:45 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}