{
    "created": "2021-10-31T04:00:00.000Z",
    "flInCalendar": true,
    "name": "31",
    "path": "2021/10/31",
    "text": "October 31",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Today's song: <a href=\"https://www.youtube.com/watch?v=TTsoZbRb_ow\">I never promised you a rose garden</a>.",
            "created": "Sun, 31 Oct 2021 20:20:45 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "It's not about <a href=\"https://twitter.com/Reuters/status/1454815421295521793\">saving the planet</a>, it's about saving ourselves. The planet will be fine. The wounds we create will be healed within a few million years. The planet's <a href=\"https://en.wikipedia.org/wiki/Age_of_Earth\">lifespan</a> is many tens of millions of years.",
            "created": "Sun, 31 Oct 2021 16:02:04 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/06/01/derrickRose.png",
            "flInCalendar": true
        },
        {
            "text": "Superteams are a bad idea. Sports isn't arithmetic. You can't make the best team by putting all the best players on the court at the same time. Because they were best in a different context. Esp in basketball, teamwork is everything. Chemistry. Feng shui. It's an art.",
            "created": "Sun, 31 Oct 2021 19:52:11 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The <a href=\"https://en.wikipedia.org/wiki/2021%E2%80%9322_Los_Angeles_Lakers_season\">2021-22 Lakers</a> are the ultimate superteam. LeBron James, Anthony Davis, Russell Westbrook, Rajon Rondo, Carmelo Anthony, Dwight Howard,  DeAndre Jordan. So much talent! They all came to be with <a href=\"https://twitter.com/KingJames\">King James</a> as he surely will win more titles. Now they don't have to retire without a ring. But it's a head-trip. How long will it take to work it all out, to find new roles for all these stars? And will they be patient enough to work it out? Entitlement doesn't win titles. ",
            "created": "Sun, 31 Oct 2021 19:56:07 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Meanwhile the <a href=\"https://en.wikipedia.org/wiki/2021%E2%80%9322_New_York_Knicks_season\">2021-22 Knicks</a> are the exact opposite of a superteam. Every player either a rookie or a medium-tier mid-career player, and a couple of players in their 30s, on the second squad. A few of the young players are potential stars. All of them achieving far beyond expectations, and are growing together as a team. They are fun to watch and root for. It's a team, not a group of stars. That's the thing to aspire to, people making each other better. Not a balance sheet that's expected to win everything. Where's the fun in that.",
            "created": "Sun, 31 Oct 2021 20:03:24 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "it was asked <a href=\"https://twitter.com/RexChapman/status/1454845999818678272\">on Twitter</a> why people don't like LeBron. <a href=\"https://twitter.com/davewiner/status/1454905160614957060\">My two cents</a>. He's not a friendly looking guy, like Melo for example. Also once you win two championships, you're just showing off. It's like leaving your starters in during <a href=\"https://en.wikipedia.org/wiki/Garbage_time\">garbage time</a> and they do fancy trick plays. After a time you think why not just sit down. That's LeBron. You're right it isn't fair, but that's <a href=\"https://www.youtube.com/watch?v=TTsoZbRb_ow\">the way</a> it goes. ",
            "created": "Sun, 31 Oct 2021 20:16:46 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "We could deliberately start to make an open and distributed Facebook, slowly, one step at a time. It isn't even a hard problem, nor would it be too costly, there's just work that just has to get done.  ",
            "created": "Sun, 31 Oct 2021 16:03:37 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The pilot said Fuck Trump",
            "created": "Sun, 31 Oct 2021 20:34:50 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2021/10/31/southwestPlane.png",
            "description": "The passengers were stuck with a lunatic flying the plane.",
            "subs": [
                {
                    "text": "First reaction of the <a href=\"https://news.yahoo.com/southwest-airlines-pilot-reportedly-used-172940102.html\">Southwest captain</a> saying Fuck Biden over the speakers was wow that's a line we didn't want to cross. Then it was pointed out by <a href=\"https://taibbi.substack.com/p/the-lets-go-brandon-freakout-goes\">Matt Taibbi</a> that <a href=\"https://www.youtube.com/watch?v=1zNr8Pf1QkY\">Robert De Niro</a> said Fuck Trump on national TV and the audience loved it, he got a standing ovation, said it again even.",
                    "created": "Sun, 31 Oct 2021 20:34:59 GMT",
                    "image": "http://scripting.com/images/2019/11/20/offWithTheirHeads.png",
                    "flInCalendar": true
                },
                {
                    "text": "That gets you thinking. But there's a difference between Biden and Trump. Biden will leave office peacefully, we all knew Trump wouldn't. So Fuck Trump was a cry for help, a plea for unity. We're all cursed by the fucker. Let's say out loud what the news people refuse to say.",
                    "created": "Sun, 31 Oct 2021 20:37:25 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "People who love Trump have nothing to fear from Biden. To think otherwise is lunacy, and when I think things through other people's lunacy doesn't enter into my reasoning. ",
                    "flInCalendar": true
                },
                {
                    "text": "Further, you're in a closed locked tube and this asshole is the fucking pilot. And he loves fascism, which is to say he is crazy. I want off the plane when I hear that. You get to turn off the TV show which you probably weren't watching anyway. But the passengers are stuck with a lunatic flying the plane. So it's not the same thing. ",
                    "created": "Sun, 31 Oct 2021 20:41:35 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}