{
    "text": "Lots of Yankees fans at the Garden yesterday to see the great Knicks team of last year show up for the first time. The game in Boston on Tuesday was disheartening. It's a new team with the core of last year's team. And when the fans started roaring when there was nothing happening on the court, last night at the (NY) Garden, it was because the Yankees had scored in the World Series game <a href=\"https://www.google.com/maps/dir/Madison+Square+Garden,+New+York,+NY+10001/Dodger+Stadium,+1000+Vin+Scully+Ave,+Los+Angeles,+CA+90012/@35.9504718,-117.3686049,9288091m/data=!3m2!1e3!4b1!4m16!4m15!1m5!1m1!1s0x89c25a21fb011c85:0x33df10e49762f8e4!2m2!1d-73.9934387!2d40.7505045!1m5!1m1!1s0x80c2c6f954005675:0x9e94554f839c09df!2m2!1d-118.2399583!2d34.073851!2m1!2b1!3e0?entry=ttu&g_ep=EgoyMDI0MTAyMy4wIKXMDSoASAFQAw%3D%3D\">2794</a> miles away in Los Angeles. This is the <i>inconvenience</i> of being a Knicks fan who hates the freaking Yankees. We have to share an NBA team. The Knicks are much more like the Mets than that other team. That's why it's so incredible to see the 2024 Knicks be able to manage both ends of the court, and completely shut down a team that last year beat them in playoffs, the Pacers, just like last year, but better. A validation of everything. Now the team has to stay healthy. But, even if they don't fly the Nazi flag at Trump's rally tomorrow, you know that they want to, and some of them probably brought them. It's a funny time for the Garden. The owner of the Garden btw is <a href=\"https://en.wikipedia.org/wiki/James_L._Dolan\">James Dolan</a>. We try to overlook that he owns the Knicks and he seems to be cooperating by staying out of the our faces. But he is known as a <a href=\"https://jipel.law.nyu.edu/the-power-of-exclusion-madison-square-garden-uses-facial-recognition-technology-to-ban-the-owners-enemies/\">vile man</a> to the people of New York.",
    "created": "Sat, 26 Oct 2024 14:52:43 GMT",
    "type": "outline",
    "image": "https://imgs.scripting.com/2017/12/10/thisIsNextYear.png",
    "flInCalendar": true
}