{
    "text": "I was lucky to grow up in NYC, and had to commute from Queens to the Bronx every day to go to school. Some days I took the <a href=\"https://bustime.mta.info/m/?q=Q44-SBS&l=\">Q44</a> bus over the <a href=\"https://en.wikipedia.org/wiki/Bronx%E2%80%93Whitestone_Bridge\">Whitestone Bridge</a>, and other days I took the <a href=\"https://bustime.mta.info/m/index;jsessionid=9F7ADE234676D22B101A192CAA31C55E?q=Q16&l=&t=&cacheBreaker=1717915338805\">Q16</a> to the <a href=\"https://en.wikipedia.org/wiki/7_(New_York_City_Subway_service)\">7 train</a> through Manhattan, and then the <a href=\"https://en.wikipedia.org/wiki/4_(New_York_City_Subway_service)\">4</a> or <a href=\"https://en.wikipedia.org/wiki/D_(New_York_City_Subway_service)\">D trains</a> up to 205th St in the Bronx. Took the same amount of time either way. So at age 15 I was able to go see the Grateful Dead after school at the <a href=\"https://en.wikipedia.org/wiki/Fillmore_East\">Fillmore East</a> on April 27, 1971. Midway through the set, a special guest band who they didn't introduce started tuning up on stage. We all wondered who they were. I now know the history thanks to the <a href=\"https://www.google.com/search?q=500+Songs+podcast+beach+boys\">500 Songs podcast</a>, and this was the return of a band that had fallen out of favor, a band whose hits we all heard on <a href=\"https://en.wikipedia.org/wiki/WABC_(AM)#The_Musicradio_77_era_(1960%E2%80%931982)\">WABC</a> and <a href=\"https://en.wikipedia.org/wiki/WNEW-FM#%22Where_Rock_Lives%22\">WNEW-FM</a>. When they started playing one of their biggest hits, <a href=\"https://en.wikipedia.org/wiki/Good_Vibrations\">Good Vibrations</a>, the audience erupted in ecstasy. <a href=\"https://en.wikipedia.org/wiki/The_Beach_Boys\">The Beach Boys</a> now looking a lot different, but playing the same wonderful California music from the 60s. They couldn't be more different from the Dead, but there they were up on stage together. They were back, this time for good. This is a recording of the whole concert, the link <a href=\"https://youtu.be/kRKY-S4wI1s?si=zTwSE5tvk6LKNjjb&t=2348\">points</a> to the beginning of Good Vibrations. You can hear the gasp of recognition, and the bands recognition of the recognition, and from their it was a party in a party, including a <a href=\"https://www.youtube.com/watch?v=kRKY-S4wI1s&t=2508s\">sing-along part</a> -- \"gotta keep those a lovin' good vibrations happening with you.\" We were all growing up very quickly, but we had a moment when we could return to a more innocent time. Lovely the way music pulls you back in time. <a href=\"https://en.wikipedia.org/wiki/Brian_Wilson\">Brian Wilson</a> wasn't there that night but his music certainly was. ",
    "created": "Thu, 12 Jun 2025 12:35:10 GMT",
    "type": "outline",
    "flInCalendar": true
}