{
    "text": "Democrats and men",
    "created": "Thu, 12 Jun 2025 14:02:45 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Yesterday I posted a link to my <a href=\"https://this.how/davewiner/politics.opml\">political disclaimer</a> from 2018. Also listened to a <a href=\"https://www.theatlantic.com/podcasts/archive/2025/06/david-frum-show-trumps-plot-against-the-2026-elections/683107/\">podcast interview</a> with Senator Gallego of Arizona who says, correctly, that the Democrats have work to do with men. It's true, speaking as a man who has been voting solid Democratic since Kerry, but I didn't stop being a man, which is something that makes me cringe to say it, the way I cringed at admitting to being Jewish when I was a kid. I lived in a place where hate of Jews was always just under the surface in school, but not so well hidden at the playground. ",
            "created": "Thu, 12 Jun 2025 13:56:51 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Men as a gender were really pushed into a corner we couldn't get out of during #metoo, all men, not just some. If they say they weren't they're lying. I went to a future of journalism conference in 2018, and the only thing men talked about, quietly, among ourselves, was how scared we were of losing everything. It really was bad, but since then it's eased. ",
            "created": "Thu, 12 Jun 2025 14:08:19 GMT",
            "flInCalendar": true
        },
        {
            "text": "I wrote about #metoo in my <a href=\"https://this.how/davewiner/politics.opml#1520013967000\">political disclaimer</a>, but didn't promote it for fear of retribution. I was threatened when I stood up for a friend whose life was ruined for as far as I could tell doing nothing wrong. If you don't shut up we'll do you too, basically. ",
            "created": "Thu, 12 Jun 2025 14:05:15 GMT",
            "flInCalendar": true
        },
        {
            "text": "Women are people just like men, and when they got to rage online against men, even people I thought I knew and were friends behaved abhorently. The way we imagine Trump might deal with us soon. ",
            "created": "Thu, 12 Jun 2025 14:09:33 GMT",
            "flInCalendar": true
        },
        {
            "text": "I have to add not all women, there were some who didn't forget that their male friends were still friends.",
            "created": "Thu, 12 Jun 2025 14:10:29 GMT",
            "flInCalendar": true
        },
        {
            "text": "It was very clear where the Democratic Party came down on all this, and of course, the Republicans took total advantage of this. If you want to understand the <a href=\"https://en.wikipedia.org/wiki/Manosphere\">manosphere</a> as you all call it, start here. I vote with you all, but absolutely abhor the way you pushed us all into a corner and shut down our pride. Women are people too and they can be just as ugly as men. If you believe otherwise you're believing lies. I speak from experience, I was raised to believe all women are saints. That lie did not prepare us well for life. ",
            "created": "Thu, 12 Jun 2025 14:10:43 GMT",
            "flInCalendar": true
        },
        {
            "text": "The good news is if the Democrats can make peace with men, there are a lot more votes available to us. We can put it behind us, but we can't ignore that in the late teens we went absolutely fucking batshit crazy about half of the electorate. It's amazing the whole thing didn't completely crumble, irrevocably. We can still fix it, but we have to acknowledge that men were hurt in that period. You all seem to have forgotten that we are just people too. ",
            "created": "Thu, 12 Jun 2025 14:05:52 GMT",
            "flInCalendar": true
        },
        {
            "text": "PS: Re-reading the #metoo section of the disclaimer I can't believe how I tiptoed around the truth. The truth I didn't dare say was it was a huge hate campaign as divisive as anything the Repubs ever did. In a country that was supposed to outlaw this, and from a political party that was supposed to be liberal. The \"both sides do it\" reality probably hasn't yet sunk in but the Democrats sided with sadists and fascists. No other way to put it. Men absolutely were silenced. Afraid to speak for fear of retribution. If you were on the wrong side of this you have some soul-searching to do. And you probably pushed a lot of people of all genders into voting for Trump. The Dems posture of \"who me?\" has an answer -- yes you. ",
            "created": "Thu, 12 Jun 2025 14:23:28 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}