{
    "text": "Back to <a href=\"https://www.amazon.com/s?k=conscious+loving&hvadid=616931433496&hvdev=c&hvlocphy=1023511&hvnetw=g&hvqmt=e&hvrand=10917777834147687715&hvtargid=kwd-300600239008&hydadcr=24659_13611768&tag=googhydr-20&ref=pd_sl_70zn362wrb_e\">Conscious Loving</a>, a <a href=\"http://scripting.com/2023/04/16.html#a031659\">thread</a> which started a few days ago. After reading the book many years ago, I had a teacher named Jeru, whose tapes I have put on the <a href=\"http://jeru.scripting.com/\">web</a>, who said many wise things that made a huge difference in my understanding of myself. But he also said one thing that I think was too judgmental -- that most love relationships have the partners taking turns acting like children. We, the students, laughed, as if to say -- yes but we're smart enough to not do that. To which I, Dave, now 25 years older and hopefully a little wiser, say yeah okay, that's cool, but please -- that's bullshit. Because we're <i>always</i> acting like children, all of us, because that's what we are. 99 percent of our energy comes from the child, maybe 1 percent from the intellect, the adult. The fun of life comes from the child. At our core, where our joy lives, we're kids, human puppies. Our partner is our best friend, and we play together and make huge messes, but our parents (our intellects) are watching over us, and are ready to step up if there's danger. But as long as it's fun, let the kids play. Most relationships I've had have been love-starved. We're expected to live up to an impossible standard, something out of <a href=\"https://en.wikipedia.org/wiki/The_Adventures_of_Ozzie_and_Harriet\">Ozzie and Harriet</a> or <a href=\"https://en.wikipedia.org/wiki/Leave_It_to_Beaver\">Leave it to Beaver</a>. Ward and June, Wally and the Beaver. All I've ever wanted is someone to let me love them, who I could learn from, who would read my stuff and laugh at my jokes and tell me I'm a good boy. I really meant what I <a href=\"http://scripting.com/2023/03/04/014347.html\">said</a> about getting from my human partner the same kind of <a href=\"http://scripting.com/2023/03/04/014347.html\">love a dog gets</a>. Okay so I tore up the pillows and pissed on the carpet. But you still love me right? Here let me get you the stick, now please throw it so I can be a <i><a href=\"http://scripting.com/2023/02/23/161945.html\">good boy</a></i> again.",
    "created": "Wed, 19 Apr 2023 12:16:08 GMT",
    "type": "outline",
    "image": "http://scripting.com/images/2019/09/25/blackLab.png",
    "flInCalendar": true
}