{
    "text": "November 1",
    "created": "Sun, 01 Nov 2020 14:54:07 GMT",
    "name": "01",
    "subs": [
        {
            "text": "This <a href=\"https://twitter.com/dtone612/status/1322899801743261696\">tweet</a> really grabbed me. \"I intubated a relatively healthy 86 year old man with covid in the ER at 4:30 this morning. He was alone, I was the last person he spoke with and he was confused. He’ll likely die in the ICU, alone. I don’t make any extra money for that.\" ",
            "created": "Sun, 01 Nov 2020 15:40:01 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/dtone612/status/1322899801743261696"
        },
        {
            "text": "I did the usual beginning of the month rollover for the blog, but this time I also made the October archive into a shareable outline. You can <a href=\"http://instantoutliner.com/m2\">click this link</a> to open the outline in \"LO2\". You can think of it as the source code for Scripting News, October 2020. ",
            "created": "Sun, 01 Nov 2020 15:47:15 GMT",
            "type": "outline"
        },
        {
            "text": "On Facebook, I'm getting another look at all the things I posed in the run-up to the 2016 election. One of the threads was a <a href=\"http://scripting.com/images/2020/11/01/clintonOdds2016.png\">screen shot</a> of the <a href=\"https://twitter.com/FiveThirtyEight\">538</a> graph showing the probability of a Clinton win over Trump over time. It took a real dive when <a href=\"https://www.nytimes.com/2016/10/29/us/politics/fbi-hillary-clinton-email.html\">Comey</a> announced he was <a href=\"https://www.insider.com/lone-fbi-agent-reopened-hillary-clinton-investigation-2019-10\">investigating</a> emails found on <a href=\"https://en.wikipedia.org/wiki/Anthony_Weiner\">Anthony Weiner's</a> laptop. Nate Silver said, in the aftermath of the election, when people complained about the polls, that Trump had a greater than 30% chance of winning. A baseball player who hits .300 is a pretty good hitter. 30% ain't zero. That said Comey <i>made</i> it 30%. The odds were a lot lower before his announcement.",
            "created": "Sun, 01 Nov 2020 15:09:52 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/03/11/hillaryClinton.png"
        },
        {
            "text": "Trump is a troll, and trolls thrive on novelty. They always have to be increasing the rage. From the <a href=\"http://this.how/trolls/\">Trolling howto</a>: \"Immunity to outrage builds up over time. What pissed people off six months ago will barely show up as a blip today. Luckily for Trump as he rises in stature, from poll-leader, to presumptive nominee, to one of two possible Presidents, his tweets automatically get more outrageous, because now they have half the weight of the office of POTUS behind them.\" Four years later his stature has not increased, and the tweets are just as crude. So his trolling juice doesn't work this time. No one cares. On the <a href=\"https://podcasts.apple.com/us/podcast/mike-murphy-joins-the-show-early-vote-last-stops-gop-future/id1523896927?i=1000496212559\">Trippi podcast</a> his guest <a href=\"https://en.wikipedia.org/wiki/Mike_Murphy_(political_consultant)\">Mike Murphy</a> said once you've seen <a href=\"https://en.wikipedia.org/wiki/Gallagher_(comedian)\">Gallagher</a> smash a <a href=\"https://www.youtube.com/watch?v=Nxls1KnKCA4\">watermelon</a>, you don't need to go back and see it again. That's Trump. Gallagher, <a href=\"https://en.wikipedia.org/wiki/Carrot_Top\">Carrot Top</a>, <a href=\"https://en.wikipedia.org/wiki/Joan_Rivers\">Joan Rivers</a>, <a href=\"https://en.wikipedia.org/wiki/Don_Rickles\">Don Rickles</a>, <a href=\"https://en.wikipedia.org/wiki/Rodney_Dangerfield\">Rodney Dangerfield</a>. We've been there done that and all we got was Covid-19.",
            "created": "Sun, 01 Nov 2020 15:20:40 GMT",
            "type": "outline"
        },
        {
            "text": "I wish I had a big Pause button, let's just hold here for a while. I'm more comfortable living in limbo than knowing the outcome of Tuesday's election. I'm sure everyone feels the same. I don't have any advice. Maybe buy something sinful and consume it with wild abandon. Or maybe read up on emigration out of the US, or painless ways to end it all. ",
            "created": "Sun, 01 Nov 2020 15:07:53 GMT",
            "type": "outline"
        },
        {
            "text": "I finally understand what <a href=\"https://en.wikipedia.org/wiki/Agile_software_development\">agile</a> means in programming, and of course, I've been doing it from the beginning of my programming career. Get something working, try it out, learn from it, perhaps go in a different direction, but always checking what I'm doing by using it and listening to users. <a href=\"https://en.wikipedia.org/wiki/Mitch_Kapor\">Mitch Kapor</a>, who I learned a lot from at Personal Software in the early 80s, worked this way. I ran <a href=\"https://en.wikipedia.org/wiki/Living_Videotext\">Living Videotext</a> on these principles. Everything <a href=\"https://en.wikipedia.org/wiki/UserLand_Software\">UserLand</a> did was developed this way. Now that I understand what it means, I might try to factor all the writing that's out there about it into a few words that explain the difference. I once encountered <i>anti-agile</i> development in a company where the software was developed using <a href=\"https://dod.defense.gov/\">DoD</a> procedures. Their philosophy was design the whole thing up front and give pieces of the project to different groups of programmers, who never saw the full spec, so no one knew what they were working on. The company went out of business very quickly. The team went on to form the core of another company, which also went out of business, each time because the product widely missed the mark.",
            "created": "Sun, 01 Nov 2020 14:54:08 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/11/01/lizLemon.png"
        }
    ]
}