{
    "text": "November 3",
    "created": "Tue, 03 Nov 2020 13:14:02 GMT",
    "name": "03",
    "subs": [
        {
            "text": "Finally, today -- it <i>is</i> a horse race! 🏇",
            "created": "Tue, 03 Nov 2020 13:22:39 GMT",
            "type": "outline"
        },
        {
            "text": "Tracy Chapman: <a href=\"https://www.youtube.com/watch?v=R1P1g4C-Jjg\">Talkin' Bout a Revolution</a>. ",
            "created": "Tue, 03 Nov 2020 17:51:01 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=R1P1g4C-Jjg"
        },
        {
            "text": "My parents weren't perfect, but they had democracy down. Each year my mother or father would take us voting with them. We went into the booth, watched while they flipped the switches in the old style voting booth, and then pulled the big lever that opened the curtain, logged the vote and we went on our way.",
            "created": "Tue, 03 Nov 2020 13:15:11 GMT",
            "type": "outline"
        },
        {
            "text": "When I was 17 I was too young to vote, but I really wanted <a href=\"https://en.wikipedia.org/wiki/1972_United_States_presidential_election\">McGovern</a> to win. I was campaigning for him, going door to door <a href=\"https://en.wikipedia.org/wiki/Far_Rockaway,_Queens\">where</a> ever the campaign sent us. My father didn't have a strong opinion, so he let me have his vote. One of the nicest most memorable gifts he gave me.",
            "created": "Tue, 03 Nov 2020 13:15:41 GMT",
            "type": "outline"
        },
        {
            "text": "It's weird that Trump doesn't have a big ballroom reserved for tonight filled with supporters, exchanging their viruses. ",
            "created": "Tue, 03 Nov 2020 13:14:21 GMT",
            "type": "outline"
        },
        {
            "text": "Joe Biden could stand in the middle of <a href=\"https://en.wikipedia.org/wiki/Fifth_Avenue\">Fifth Avenue</a> and shoot Donald Trump and I would still vote for him.",
            "created": "Tue, 03 Nov 2020 13:40:43 GMT",
            "type": "outline"
        },
        {
            "text": "The <a href=\"https://soundcloud.com/twistartups/twist-e1133\">interview</a> I did with Jason Calacanis is out. I haven't listened to it yet, but I will. Hope you like. :-) ",
            "created": "Tue, 03 Nov 2020 13:39:00 GMT",
            "type": "outline"
        },
        {
            "text": "I needed good <a href=\"http://scripting.com/code/testing/aceeditor/index.html\">demo code</a> for the Ace editor.",
            "created": "Tue, 03 Nov 2020 15:53:02 GMT",
            "type": "outline"
        },
        {
            "text": "I'm loving <a href=\"https://www.metacritic.com/tv/better-things\">Better Things</a>. It's smart, funny, classy, nutty, loving and lovable, and sexy. The characters are great because they all remind me of someone dear to me. It's not Le Grand Binge, it's more like an <a href=\"https://en.wikipedia.org/wiki/Amuse-bouche\">amuse-bouche</a>, something to <a href=\"https://en.wikipedia.org/wiki/Palate_cleanser\">cleanse the palate</a>, before going onto more serious fare. Right up there with <a href=\"https://en.wikipedia.org/wiki/30_Rock\">30 Rock</a>, another of <a href=\"http://my.bingeworthy.io/davewiner/\">my favorite</a> shows. I'm still in Season 1 on Better Things. Savoring each episode because it makes me feel good, in times when feeling good isn't the norm. ",
            "created": "Tue, 03 Nov 2020 13:23:21 GMT",
            "type": "outline"
        },
        {
            "text": "Assuming Biden wins tonight, I look forward to articles in <i>The Redneck Country Bugle</i> about how they failed to understand the coastal communities, where there are plenty of people who are not elites, rather people who pay attention to what politicians do, instead of how funny they are. ",
            "created": "Tue, 03 Nov 2020 13:26:41 GMT",
            "type": "tweet",
            "tweetId": "1323618005276909569",
            "tweetUserName": "davewiner"
        },
        {
            "text": "It's interesting as I write my blog today, knowing that when it goes out at midnight Eastern tonight, we'll know a lot more about what happened today, than I did as I was writing this michegas. ",
            "created": "Tue, 03 Nov 2020 13:14:03 GMT",
            "type": "outline"
        },
        {
            "text": "Today is the day America says, resoundingly, “Enough of this bullshit.”",
            "created": "Tue, 03 Nov 2020 13:31:44 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/11/03/uncleSam.png"
        }
    ]
}