{
    "text": "November 5",
    "created": "Thu, 05 Nov 2020 14:04:00 GMT",
    "name": "05",
    "subs": [
        {
            "text": "I ❤️ America.",
            "created": "Thu, 05 Nov 2020 16:45:01 GMT",
            "type": "outline"
        },
        {
            "text": "Devs who want to leave a legacy of code, keep a copy of everything on GitHub. Here's why. 1. They host your projects for $0, so your code can persist even if your heirs stop paying hosting bills. 2. They're owned by Microsoft which will probably be around for a while.",
            "created": "Thu, 05 Nov 2020 16:38:47 GMT",
            "type": "outline"
        },
        {
            "text": "Secretaries of State are the nerd heroes of our democracy.",
            "created": "Thu, 05 Nov 2020 16:31:34 GMT",
            "type": "outline"
        },
        {
            "text": "Debugging the polls. Why not be direct. Ask the person this question instead. Who's winning? Since the role of a poll is to feed the horse race, why beat around the bush. Ask the question you really want the answer to.",
            "created": "Thu, 05 Nov 2020 15:33:29 GMT",
            "type": "outline"
        },
        {
            "text": "A lot of dev work is taking things from one list and putting it on another. ",
            "created": "Thu, 05 Nov 2020 16:42:02 GMT",
            "type": "tweet",
            "tweetId": "1324391660764147713",
            "tweetUserName": "davewiner"
        },
        {
            "text": "Morning Coffee Notes",
            "created": "Thu, 05 Nov 2020 14:14:56 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2020/11/05/morningCoffeeAtPeets.png",
            "description": "While the campaign was still on, I didn't want to criticize the Dems for their rallies, which were basically impossible to watch.",
            "subs": [
                {
                    "text": "While the campaign was still on, I didn't want to criticize the Dems for their rallies, which were basically impossible to watch. They must've been even worse to be a speaker at. You take a gifted campaigner like Obama, who could get into a lovefest with an audience, he had so many good lines like Don't Boo, Vote. The crowd would boo just to get him to say it! Or he'd say <i>Fired up! </i>and everyone would scream <i>Ready to go! </i>Even watching the rallies on TV would get the <a href=\"https://en.wikipedia.org/wiki/Oxytocin\">love chemicals</a> to flow through your blood. But the drive-in rallies, while the idea seemed cute and innovative, as an idea, were, in practice, embarrassing. I kept wondering if the Dems could have done something like what the NBA and MLB did, with <a href=\"https://www.sportscasting.com/theres-a-surprising-amount-of-tech-behind-the-nbas-fake-crowd-noise/\">fake</a> <a href=\"https://www.si.com/mlb/2020/09/05/baseball-fake-crowd-nosie\">crowd</a> <a href=\"https://www.nbcbayarea.com/news/sports/the-invisible-crowd-inside-the-nfls-fake-crowd-noise-system/2381799/\">noise</a>. Everyone knew they were fake, but you didn't mind. Even though a basketball game with no crowd noise is actually kind of nice, as at a small college game, not having a crowd cheering and booing at the right times during the NBA Finals and the World Series would have been awful. ",
                    "created": "Thu, 05 Nov 2020 14:04:01 GMT",
                    "image": "http://scripting.com/images/2020/11/05/obama.png"
                },
                {
                    "text": "So the Repubs cut the corner, and went ahead and had viral-spreading events in the form of end-game political rallies. And they were wonderful. Trump, like Obama, really is in his element in those rallies. Once, because of a stubborn <a href=\"https://www.kaaltv.com/rochester-minnesota-news/president-trump-campaign-rally-rochester-october-30/5911428/\">local</a> <a href=\"https://en.wikipedia.org/wiki/Rochester,_Minnesota\">government</a>, he had to give a <a href=\"https://minnesota.cbslocal.com/2020/10/30/trump-rallies-in-rochester-with-spillover-from-250-capacity-showing-support-outside/\">rally</a> to a socially distanced group of 250 people, and his heart wasn't in it, and he left early. So the Repubs cheated. I think that's where a lot of his votes came from. If the campaign had ended with <a href=\"https://www.youtube.com/watch?v=rsGqrLkmFMU\">Trump on the balcony</a>, febrile, gasping for air and weak, pulling of his mask, then we would have gotten the Biden/Harris landslide that the polls predicted.",
                    "created": "Thu, 05 Nov 2020 14:07:55 GMT"
                },
                {
                    "text": "The really awful part is that the pundits, idiots, one and all, are ignoring the context of this election. As if it were a normal election where the candidates were playing on something of a level playing field. They weren't. The Repubs sacrificed hundreds of lives, and thousands of peoples' health and helped spread the virus that was already spreading uncontrollably. They weren't rallies for the presidency as much as they were rallies for the virus. Come get sick, and btw, also see the president dance. The people would have come out, just as much, for Obama and his mantras, or him <a href=\"https://www.youtube.com/watch?v=kzXcNgCr0nk\">brushing the dirt</a> off his jacket, or just looking like the stud he is. Or Biden telling stories of his lost family, and how great America still is, and how it'll all come back as soon as he's in the Oval. But they didn't, and that was the right thing to do. And the pundits, who really do need to be fired, are ignoring the whole thing, and pretending the Dems are out of touch, when they were totally committed to the reality that there is a deadly pandemic that is happening at the same time as the election.",
                    "created": "Thu, 05 Nov 2020 14:09:45 GMT"
                },
                {
                    "text": "This is kind of a replay of what happened in the final days of the primary, when people were mourning the loss of E Warren, and the impeachment was booting up. The virus was already the Big Story, but everyone was putting it off until they could get around to it. Same thing now. When we come back to the pandemic we will notice that <a href=\"https://www.buzzfeednews.com/article/peteraldhous/us-coronavirus-100000-daily-cases\">100K new cases yesterday</a>, an all-time record. But until we all focus on it, full time, and take our medicine, for real, we will never get out of this mode. ",
                    "created": "Thu, 05 Nov 2020 14:12:46 GMT"
                },
                {
                    "text": "Maybe next week the news can somehwat get back to reality.  And if the Biden win doesn't prove to be a mirage, we can all breathe a sigh of relief that the Orange Monster will be going back to where ever they will have him. I hear Florida voted for him, good -- he's theirs now. No backsies. ;-)",
                    "created": "Thu, 05 Nov 2020 14:12:34 GMT"
                }
            ]
        }
    ]
}