{
    "text": "November 6",
    "created": "Fri, 06 Nov 2020 14:00:24 GMT",
    "name": "06",
    "subs": [
        {
            "text": "The only time we have to listen to other Americans is when we vote. They can keep talking, that’s their right. But I can choose not to listen. There’s a limit to respect. I don’t listen to people when all they have to say is how they hate me.",
            "created": "Fri, 06 Nov 2020 14:36:20 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/11/06/selfie.png"
        },
        {
            "text": "The news should reflect what the Trumps are really doing with the lawsuits. They're going to pitch state legislatures that the election was stolen and they should appoint different electors. The lawsuits just have to get press coverage and show up in opinion polls. They wouldn't have to flip too many states with Republican legislatures. For example: Arizona, Georgia, Pennsylvania, Wisconsin, Michigan. ",
            "created": "Fri, 06 Nov 2020 15:30:13 GMT",
            "type": "outline"
        },
        {
            "text": "Assuming Trump refuses to leave the White House, here’s the plan. Turn the White House into our equivalent of Lenin’s tomb. Seal it off but, everyone but Trump can leave, send him food and water and people can visit to see the imprisoned former president. When he dies embalm him.",
            "created": "Fri, 06 Nov 2020 14:36:37 GMT",
            "type": "outline"
        },
        {
            "text": "Might be a good idea to stop referring to Republicans as Repubs, and call them what they are -- Trumps.",
            "created": "Fri, 06 Nov 2020 15:38:02 GMT",
            "type": "outline"
        },
        {
            "text": "CNN's <a href=\"http://scripting.com/images/2020/11/06/magicwall.png\">Magic Wall</a> is crap. They should have people entering the numbers that the announcer says from a keyboard. And the performance is awful. Get a higher-rated CPU. I can't believe how shitty all of them are.",
            "created": "Fri, 06 Nov 2020 15:02:23 GMT",
            "type": "outline"
        },
        {
            "text": "Even if the tech is old, slow and poorly organized -- <a href=\"http://scripting.com/images/2020/11/06/kornacki.png\">Kornacki</a> is king. He's the Batman of the United States of Gotham City.",
            "created": "Fri, 06 Nov 2020 15:07:19 GMT",
            "type": "outline"
        },
        {
            "text": "The first female vice-president. History.",
            "created": "Fri, 06 Nov 2020 14:20:51 GMT",
            "type": "tweet",
            "tweetId": "1324718460291682305",
            "tweetUserName": "davewiner"
        },
        {
            "text": "In hindsight Trump might’ve been smart to hold the RBG nomnination.",
            "created": "Fri, 06 Nov 2020 14:35:49 GMT",
            "type": "outline"
        },
        {
            "text": "I can see I'm not getting any work done today.",
            "created": "Fri, 06 Nov 2020 14:19:56 GMT",
            "type": "outline"
        },
        {
            "text": "Getting rid of the rat in the attic. ",
            "created": "Fri, 06 Nov 2020 14:01:08 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/11/06/gettingRidOfTheRatInTheAttic.png"
        }
    ]
}