{
    "text": "November 9",
    "created": "Mon, 09 Nov 2020 14:34:20 GMT",
    "name": "09",
    "subs": [
        {
            "text": "BTW the best place to write and publish a twitter thread isn’t in Twitter or Wordpress, it’s <a href=\"http://thread.center/\">thread.center</a>. ",
            "created": "Mon, 09 Nov 2020 20:31:30 GMT",
            "type": "outline"
        },
        {
            "text": "I've been raving about the <a href=\"https://www.amazon.com/Tribit-Micro-Bluetooth-Speaker-Waterproof/dp/B07VSPPQXC\">Tribit Stormbox</a> Bluetooth speaker to friends. The sound is great and large, but the package is small, sturdy, nice to hold the way an iPhone is. I have it strapped to the handlebar of my bike which I've been riding the last four days because the weather is so good. One more day, tomorrow, then it's going to cool off again. Definitely not November weather in the mountains. ",
            "created": "Mon, 09 Nov 2020 20:25:23 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/11/09/tribitStormbox.png",
            "imageLink": "https://www.amazon.com/Tribit-Micro-Bluetooth-Speaker-Waterproof/dp/B07VSPPQXC"
        },
        {
            "text": "It's pretty obvious the Repubs are improvising a coup of the US government. Goodbye Constitution.",
            "created": "Tue, 10 Nov 2020 01:50:23 GMT",
            "type": "outline"
        },
        {
            "text": "What's the future of the <a href=\"https://lincolnproject.us/\">Lincoln Project</a>?",
            "created": "Mon, 09 Nov 2020 15:28:58 GMT",
            "type": "outline"
        },
        {
            "text": "Sometimes people are wrong. The presidential election is one of those cases. Trump simply wasn’t doing the job. That’s an objective fact. When we get a president who is doing the job, and we elected one, the system will start working. And we desperately need it to work. So no, I’m not esp concerned about the feelings of Trump voters. They were wrong. We saved their lives. Maybe they’ll never appreciate it, but we did save their lives regardless.",
            "created": "Mon, 09 Nov 2020 15:30:26 GMT",
            "type": "outline"
        },
        {
            "text": "One of the reasons my blog doesn't work as <a href=\"http://scripting.com/rss.xml\">an RSS feed</a> is that I'm always adding links and editing text through the day. I am done by midnight before the <a href=\"http://scripting.com/email\">nightly email</a> goes out. But people who read via RSS only see the first version of a post. RSS as a format is fine, but the installed base of readers hasn't evolved at all since the beginning. ",
            "created": "Mon, 09 Nov 2020 15:15:49 GMT",
            "type": "outline"
        },
        {
            "text": "With a <a href=\"https://www.statnews.com/2020/11/09/covid-19-vaccine-from-pfizer-and-biontech-is-strongly-effective-early-data-from-large-trial-indicate/\">90% effective vaccine</a>, what percentage of the population has to be inoculated to kill the virus?",
            "created": "Mon, 09 Nov 2020 15:12:46 GMT",
            "type": "outline"
        },
        {
            "text": "OK we just had an election in the US, and we're doing the same thing we do after every election. Trying to figure out how 70 million people could (this time) vote for Trump after seeing him in action for four years. I had a lot of trouble understanding why people gave <a href=\"https://en.wikipedia.org/wiki/2004_United_States_presidential_election\">Bush</a> a second term, that was a stop-everything moment for me. I did a <a href=\"http://static.podcatch.com/manila/gems/un/cnNov3.mp3\">podcast</a> about it <a href=\"http://scripting.com/2004/11/03.html\">that day</a>, to preserve the moment. But this time I think maybe we're asking the wrong question. Why are so many people depressed? I think you have to be pretty sad to vote for Trump. I think that's what it's an expression of, sadness. What could we do to make living more fun? I know it's a weird question, but maybe someone has an idea. :boom:",
            "created": "Mon, 09 Nov 2020 14:45:21 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/11/09/ledSneaker.png"
        },
        {
            "text": "The Russians, apparently, did not hack the election, or at least if <a href=\"https://www.defenseone.com/threats/2020/11/big-2020-election-hack-never-came-heres-why/169806/\">they tried</a> it didn't work.",
            "created": "Mon, 09 Nov 2020 14:40:29 GMT",
            "type": "outline"
        },
        {
            "text": "If you're an NBA fan as I am, you know all about <a href=\"https://en.wikipedia.org/wiki/Inside_the_NBA\">Inside the NBA</a> on TNT. Charles, Kenny, Shaq and Ernie. They're funny, smart, irreverant, and when they get serious, have a deep understanding of basketball. I want something like that for politics. The cable shows are dull and repetitive. If you're not going to say much at least tell some good stories. ",
            "created": "Mon, 09 Nov 2020 14:42:36 GMT",
            "type": "outline"
        },
        {
            "text": "The Democrats should do some marketing, and connecting with their users (ie voters). Based on what I'm reading about the polls, they have a crude and often incorrect view of what they think and what influences them, what they look for in a candidate. Just read about <a href=\"https://www.nytimes.com/2020/11/09/us/politics/how-democrats-missed-trumps-appeal-to-latino-voters.html\">Hispanic voters</a> in south Florida and Texas voting for Trump, when the Dems thought they had their support. <i>Membership in the Democratic Party should mean something. </i>Or maybe we need to start another party, not to run candidates necessarily, but to organize voters. Maybe the Dems would get the idea that they should \"acquire\" this party. That's how change often happens in tech, btw. Key point I've raised over and over -- political parties and social networks belong together. The current crop of social nets are optimized for advertisers. No surprise they've made a mess of political organizing. ",
            "created": "Mon, 09 Nov 2020 14:34:21 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/11/09/weJustDid46.png"
        },
        {
            "text": "New Yorker cover after 2018 election.",
            "created": "Mon, 09 Nov 2020 15:10:05 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/11/09/newYorkerCover2018Election.png"
        }
    ]
}