{
    "text": "November 11",
    "created": "Wed, 11 Nov 2020 14:59:20 GMT",
    "name": "11",
    "subs": [
        {
            "text": "<a href=\"https://twitter.com/TimothyDSnyder/status/1326319545427107840\">A Twitter thread</a> from <a href=\"https://www.timothysnyder.org/bio\">Timothy Snyder</a>. He says we should be out in the street protesting now. \"Coups are defeated quickly or not at all. While they take place we are meant to look away, as many of us are doing. When they are complete we are powerless. In an authoritarian situation, the election is only round one. You don't win by winning round one. Peaceful demonstrations after elections are necessary for transitions away from authoritarianism, as in Poland in 1989, Serbia in 1999, or Belarus right now.\" ",
            "created": "Wed, 11 Nov 2020 15:16:16 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/12/06/dorothy.png",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://www.cnn.com/2020/11/11/politics/donald-trump-schedule-election/index.html\">CNN</a>: \"As Trump mounts a <a href=\"https://en.wikipedia.org/wiki/Coup_d%27%C3%A9tat\">fierce battle</a> to remain in office and refuses to concede the election he lost, he has shown little interest in the work of being President.\"",
            "created": "Wed, 11 Nov 2020 15:26:25 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Trump et al had months to prepare for this coup, most of us can't even believe it's happening.",
            "created": "Wed, 11 Nov 2020 18:22:21 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The Trumps aren't going to court to win, they're trying to create a hierarchy of grievances. First there was the cheating, so they took it to the courts but that was rigged too. ",
            "created": "Wed, 11 Nov 2020 14:59:21 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I just heard a rumor that Alec Baldwin is refusing to leave SNL.",
            "created": "Wed, 11 Nov 2020 15:00:57 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Did you get a chance to try the <a href=\"http://scripting.com/2020/11/04/175054.html?title=peopleLikeYou\">Similar Users command</a> in \"BingeWorthy\"? It came out in the middle of the election frenzy. When you choose the command, BingeWorthy looks through the database and finds people who like similar programs to you. You may get ideas by looking at their picks. Here's a <a href=\"http://scripting.com/images/2020/11/11/mySimilarUsers.png\">screen shot</a> of what it shows me. ",
            "created": "Wed, 11 Nov 2020 21:16:30 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "More exploration into the world of Fargo blogging. Here's the <a href=\"http://this.how/kimParkerBlog/fargo.opml?format=opml\">OPML source</a> for <a href=\"http://bloatware.org/users/kim/\">Kim Parker's blog</a>. Kim Parker is a fictitious person, a support person at a tech company called <a href=\"http://bloatware.org/\">Bloatware</a>. Her blog was the example I used in the docs for Fargo's CMS. Not sure why I used #attributes instead of using outline attributes, which are hidden and out of the way. But there you have it. A 2013 blogging system, does it differently than Old School. It's more like Frontier's CMS. ",
            "created": "Wed, 11 Nov 2020 17:42:47 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}