{
    "text": "November 16",
    "created": "Mon, 16 Nov 2020 17:53:19 GMT",
    "type": "calendarDay",
    "name": "16",
    "subs": [
        {
            "text": "Today's podcast listen: <a href=\"https://www.nytimes.com/2020/11/16/podcasts/the-daily/house-democrats-election.html\">The Daily</a> on the split in the Democratic Party. I think both sides are missing the obvious answer. Study the people who are voting for the Repubs. Listen. Think. The Democrats are rightly recognizing the minorities, but this may be misinterpreted by whites, esp white men. Correct that, not by trying to correct the voters, but correct the way you explain the party. The Democrats implement programs that are good for <i>people</i> regardless of race, ethnicity, gender, age. The Repubs are poison for the people. How hard could it be to come up with a simple way of saying that truth? I agree that <a href=\"https://en.wikipedia.org/wiki/Defund_the_police\">Defund The Police</a> was a terrible slogan, but it wasn't a Democratic slogan. Yes I know what it's supposed to mean, <a href=\"https://www.dictionary.com/browse/defund\">but</a> if the slogan were any good you wouldn't have to explain it. It's ripe for the Repubs. Stop leading with your chin. No one in their right mind is willing to get rid of the police. I want someone to come when I need help. Defund is the wrong word. ",
            "created": "Mon, 16 Nov 2020 17:53:20 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/11/16/carrots.png",
            "flInCalendar": true
        },
        {
            "text": "I have another related question. Why didn't the Dems run ads saying that the Repubs aren't doing their jobs, starting with the president. He's a bum. He doesn't show up for work. Hasn't had a briefing in months. McConnell lets the legislation pile up on his desk. They're basically <a href=\"https://en.wikipedia.org/wiki/Welfare_queen\">welfare queens</a>. I remember the Repubs campaigning about that, effectively. Why would we pay for people who do nothing for us?",
            "created": "Mon, 16 Nov 2020 18:07:16 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Another question. Why don't the Democrats make an issue out of everyone voting. We learned in the aftermath of the Nov 3 election that the Republican Secretaries of State are honorable people. If the Dems put that idea out there -- that the Repubs are abusing the rest of us by trying to stop us from voiting, well it's an American value that everyone gets to vote, it doesn't matter what race they are or how much money they have (an appeal to white voters, btw). Everyone has a say. That's American as apple pie. Why don't the Repubs get on board with that?  A nice way to push a wedge into the Repub voting block. <i>If poor whites start voting against Repubs, you better believe they're going to disenfranchise your ass. </i>",
            "created": "Mon, 16 Nov 2020 18:11:25 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}