{
    "text": "November 19",
    "created": "Thu, 19 Nov 2020 14:13:19 GMT",
    "type": "calendarDay",
    "name": "19",
    "subs": [
        {
            "text": "Today's song: <a href=\"https://www.youtube.com/watch?v=-DFhuE_XeT8\">Georgia on my Mind</a>. ",
            "created": "Thu, 19 Nov 2020 16:14:56 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=-DFhuE_XeT8",
            "flInCalendar": true
        },
        {
            "text": "As the secretaries of state in Arizona, Nevada, Georgia, Pennsylvania, Michigan and Wisconsin do their jobs, it's remarkable that the US is still the US when it comes to elections. We wondered how deep the corruption went. We could find no limit in Repubs in DC. But the states held. We have to root the corruption out. To do that Georgia must deliver again. It's down to Stacey Abrams vs Mitch McConnell. ",
            "created": "Thu, 19 Nov 2020 16:12:00 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I gave another $100 to <a href=\"https://secure.actblue.com/donate/fair-fight-1\">FairFight</a> to support the Democrats in the January 5 runoff in Georgia. ",
            "created": "Thu, 19 Nov 2020 14:50:12 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://twitter.com/JoeTrippi\">Joe Trippi</a> taught me something about politics. I said we, the people of the US, should buy ads in Georgia, asking the voters there to save our lives and vote for the Democratic candidates on <a href=\"https://en.wikipedia.org/wiki/2020_United_States_Senate_special_election_in_Georgia\">Jan 5</a>. I was <a href=\"http://scripting.com/2020/11/12.html#a215410\">very passionate</a> about it, but was only looking at it from my perspective. Here's what Trippi said: \"The South generally doesn't take well to people from 'outside' trying to influence them.\" That was generous, because <i>no one</i> takes well to that. It may be why <a href=\"https://www.nytimes.com/2020/11/17/us/maine-susan-collins.html\">Susan Collins</a> was re-elected in Maine even though Democrats from the rest of the country poured huge money into defeating her. It's also why <a href=\"https://www.politico.com/news/2020/02/26/jim-clyburn-endorses-joe-biden-117667\">James Clyburn</a> single-handedly got the nomination for President-elect Biden -- people in South Carolina listen to and trust him. It's also why <a href=\"https://www.newyorker.com/news/our-columnists/the-remarkable-effectiveness-of-pete-buttigieg-on-fox-news\">Pete Buttigieg</a> is a huge hit on Fox. They like a nice young <i>white</i> man even if what he says would be seen as socialism if it came from an outsider (ie person of color). You can't blame people for bonding with people who look like they do. It's part of who we are, not just Americans, not just whites, but everyone. It's also true that, as <a href=\"https://www.politico.com/news/magazine/2020/11/13/elissa-slotkin-braces-for-a-democratic-civil-war-436301\">Elissa Slotkin</a> pointed out, you can't win when you appear to be talking down to people, and an outsider automatically appears that way. ",
            "created": "Thu, 19 Nov 2020 14:17:24 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/07/27/weHaveMetTheEnemy.png",
            "flInCalendar": true
        },
        {
            "text": "What's the upshot of all this? Well, some part of the Trump electorate could probably be peeled off with better <a href=\"http://scripting.com/2020/11/17.html#a190035\">marketing to white people</a> by the Democratic Party. Have someone who speaks their language, and looks like them, explain each thing the party wants to do in Congress next year. Respect them. Talk straight, but use white person talk and do it where they live, in the middle of the country. What matters even more than what you say is how you say it and where you say it from. ",
            "created": "Thu, 19 Nov 2020 14:53:49 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Where's a good place to get customized holiday greeting cards?",
            "created": "Thu, 19 Nov 2020 14:13:20 GMT",
            "type": "tweet",
            "tweetId": "1329427591896424449",
            "tweetUserName": "davewiner",
            "flInCalendar": true
        },
        {
            "text": "An <a href=\"https://www.axios.com/trump-election-challenges-loss-biden-fb42c9df-485d-4494-aeb2-6b2acadeb32a.html\">article</a> on Axios points out something obvious that I missed. Trump, by litigating his misery over the election, is ratifying Biden's win, over and over. ",
            "created": "Thu, 19 Nov 2020 14:14:23 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The Incredible Sulk.",
            "created": "Thu, 19 Nov 2020 14:59:30 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/11/19/incredibleSulk.png",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}