{
    "text": "November 20",
    "created": "Fri, 20 Nov 2020 14:49:40 GMT",
    "type": "calendarDay",
    "name": "20",
    "subs": [
        {
            "text": "<a href=\"https://twitter.com/EdwardNorton/status/1329728889296355328\">Edward Norton</a> on Twitter on what Trump is really doing. I agree, and very well put. Short version. Trump is repeatedly stinking up the room, hoping to negotiate a deal where he is able to walk away, rich and with his head held high (in his own <a href=\"http://scripting.com/2020/09/07/160755.html?title=trumpolini\">Trumpolini</a> style), to live to fight another day. Norton says to call his bluff. Let him do his schtick and then say, no deal. BTW, every business and industry has one person who behaves so badly that they invariably get their way, because eventually no one wants to go as low as they are willing to go. I'm not going to name names, except Trump is the best at \"stinking up the room.\" He keeps doing it until you give up. McConnell is pretty good too. Stinking up the room is a super advanced form of trolling. ",
            "created": "Fri, 20 Nov 2020 16:25:43 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/11/20/mussolini.png",
            "flInCalendar": true
        },
        {
            "text": "The truly significant developments, when viewed in hindsight, are almost never the ones that were hyped at the time of their introduction. There are exceptions, the IBM PC and Mac, both created important platforms, were quick hits. But usually the impactful products develop over time, maybe that's because to be a great product you need a quiet period to adapt to how people use your product. Right now I'm thinking about the way ISPs are gradually moving away from the server model to the app model, as pioneered by Heroku. I still plan to look at Digital Ocean's new offering. I have used [%search: Glitch%] and of course [%search: Heroku%]. Glitch is free, can't beat that price, but you wonder if it's just an introductory offer? Heroku's per-app price was way too high, made it diseconomic, which is unfortunate because it was so much more rational a model than managing your own servers, which is what I've been doing since switching off Heroku. All this is part of a larger thread that maybe it's time to move away from static sites because net apps are being successfully commoditized. ",
            "created": "Fri, 20 Nov 2020 15:11:35 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I walked into a store the other day and was greeted by a smiling young woman. I smiled back, then she said \"Good morning sir.\" Oy. I took a deep breath and said, after a little thought, \"Good morning ma'am.\" Her face looked like I imagined my face did. I looked at her inquisitively (it's amazing how much conversation is wordless). She said she didn't like to feel so old. I said that's how I feel. (I then quoted my father when he was my current age.) \"Inside I still feel 19,\" I said. She smiled. I smiled. She said \"Well then Good morning dude.\" I laughed and said \"Good morning dude,\" and we went on with our business, having brought a little cheer to each other, I hope. She meant well. But inside the feelings are complex. I know that she and I are of different generations. When I was 40 years younger I could've flirted with her, but now I can't. But I can still dream. :heart:",
            "created": "Fri, 20 Nov 2020 14:49:41 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/04/09/santaCoke.png",
            "flInCalendar": true
        },
        {
            "text": "BTW, in the South it's a sign of respect for any man to call any woman ma'am, even one who is a lot younger, maybe even <i>especially</i> if she's younger. It's a sign of respect for the power and authority of women. I always liked that part of Southern culture. (I should be more specific, <i>white</i> Southern culture.)",
            "created": "Fri, 20 Nov 2020 15:03:46 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}