{
    "text": "November 21",
    "created": "Sat, 21 Nov 2020 14:12:41 GMT",
    "type": "calendarDay",
    "name": "21",
    "subs": [
        {
            "text": "Here's the deal on when we'll get back to \"normal.\" If you or someone you love gets the virus, probably never. Because no one knows what the lingering effects are. We know some people are devastated by the symptoms. And we don't know if people who appeared to have been symptomless really were, or people who appear to have recovered really are recovered. This is a new disease. Not much is known about it. It's weird and different. If you roll the dice, the cost of a losing bet is unknown. One Thanksgiving dinner of apparent normalcy isn't worth risking the rest of your life being crippled, disabled or in pain, or seeing someone you care about similarly affected.",
            "created": "Sat, 21 Nov 2020 17:13:34 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/04/19/coronavirus.png",
            "flInCalendar": true
        },
        {
            "text": "I'd like more randomness to the NBA rosters. Each year, after the draft: 1. Create a deck of cards with the images of each NBA player. 2. Throw away 2/3 of the deck at random. 3. Arrange the teams around a table. 4. Deal the cards out as if it were a card game.",
            "created": "Sat, 21 Nov 2020 16:00:11 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Maddow is back, I'm still here",
            "created": "Sat, 21 Nov 2020 14:12:42 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2020/11/21/maddow.png",
            "description": "The humiliation that this country is suffering at Republican hands is unacceptable. ",
            "subs": [
                {
                    "text": "I've watched Maddow the last two nights. It's great that she's back. In quarantine because her partner, Susan, got Covid and Maddow was exposed. So she did an incredible job of setting up a studio at home, by herself, yet she was so apologetic for the lack of makeup and the homeyness of the surroundings. I wanted to ask her to stop. We don't tune in her show for the makeup or the studio.",
                    "created": "Sat, 21 Nov 2020 14:15:35 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "She should take care of herself, because she's as essential to our sanity (speaking mostly for myself) as her partner is to her (as she explained on Thursday night so eloquently). She doesn't know it apparently, but a lot of us rely in her continued presence as a signal that we're still ourselves, no matter what we're asked to accept.",
                    "created": "Sat, 21 Nov 2020 14:32:59 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I've been hearing from readers of my nightly email that sounds a lot like what I just said about Maddow. It's kind of a heartbeat. Not so important whether we agree or not, just the continued presence of the email that arrives in the minute after midnight Eastern time, every day, as long as my heart is beating. That means something to people, and that means a lot to me. ",
                    "created": "Sat, 21 Nov 2020 14:16:13 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "<b>My new desk</b>",
                    "created": "Sat, 21 Nov 2020 14:45:17 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I've been planning on re-arranging my office for the last few weeks, bought a new office chair, cleared a larger space than I was using previously -- re-purposing the old desk I used for writing, at the one-bedroom Manhattan apartment for most of the 2010's. It has enough room for two monitors. And now I'm using it. It feels weird. Like I'm writing from a foreign country. Maybe as Maddow feels, being separated from her team, trying to believe her home office is just as powerful as the one in Manhattan. ",
                    "created": "Sat, 21 Nov 2020 14:17:12 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "My new desktop, like hers, is in the country. Funny thing is, I always assumed Maddow was coming, during the pandemic, from her home in the Berkshires. I guess she was still commuting to the city to do her show? These days you just don't know. ",
                    "created": "Sat, 21 Nov 2020 14:51:40 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "<b>We have limits</b>",
                    "created": "Sat, 21 Nov 2020 14:45:09 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Anyway, after watching last night's Maddow, the overwhelming thought is that we've way gone too far in tolerating the Republicans. It isn't enough to replace them in the White House, there has to be punishment for what they're doing. If Biden won't do it, we must do it. ",
                    "created": "Sat, 21 Nov 2020 14:19:59 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The humiliation that this country is suffering at Republican hands is unacceptable. Where is American pride? ",
                    "created": "Sat, 21 Nov 2020 14:53:17 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "<i>We, the people, elected a new president. It's a fact. </i>",
                    "created": "Sat, 21 Nov 2020 15:29:14 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Yet a minority party, with no honor, no sense of American pride, not an molecule of humility, stands in the way of our president starting to do our work, the work we chose him to do. Nothing trivial, just saving our fucking lives. For crying out loud. ",
                    "created": "Sat, 21 Nov 2020 15:29:17 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "<b>A dream and a plan</b>",
                    "created": "Sat, 21 Nov 2020 14:44:43 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I dream that at some moment the Repubs will snap to their senses and realize the awful thing they're doing to this country that treated them so well and ask what they can do. ",
                    "created": "Sat, 21 Nov 2020 14:55:04 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "For that eventuality I have prepared a plan.",
                    "created": "Sat, 21 Nov 2020 14:22:07 GMT",
                    "flNumberedSubs": "true",
                    "subs": [
                        {
                            "text": "An instant impeachment. One article. He tried to subvert the will of the people expressed in an election. Attach a few news articles about his meeting with Michigan legislators to try to bribe them.",
                            "created": "Sat, 21 Nov 2020 14:22:45 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "A two-hour trial in the Senate followed by a unanimous vote to remove him from office with instructions to the Secret Service to arrest him immediately.",
                            "created": "Sat, 21 Nov 2020 14:24:01 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Mike Pence takes the oath of office.",
                            "created": "Sat, 21 Nov 2020 14:40:32 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "The transition to the Biden Administration begins, with full cooperation from the Pence Administration. The GSA head, Emily Murphy, writes the letter. If she won't, she's fired immediatley, and if her replacement won't write the letter, she will be fired until someone in the GSA chain of command will legally authorize the transition.",
                            "created": "Sat, 21 Nov 2020 14:24:46 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Mitch McConnell is censured and removed from Congress. The governor of Kentucky appoints someone to finish his term. Don't miss that the Repubs in Congress have been complicit in Trump's attempt to subvert the election. McConnell is getting off easy. He gets to go home and count his money and ponder how lucky he is he wasn't tried and punished for his crimes. ",
                            "created": "Sat, 21 Nov 2020 14:25:46 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Trump is held, no bail, until charges can be brought by the incoming Attorney General. (I love the idea of <a href=\"https://en.wikipedia.org/wiki/Merrick_Garland\">Merrick Garland</a> being the new AG. It has symmetry.) ",
                            "created": "Sat, 21 Nov 2020 14:27:10 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Pence, we hope, will follow the advice of scientists to the letter during the transition, and stop the growth of the virus now. Have you seen the <a href=\"https://twitter.com/Max_Gorden/status/1329945642026684418\">video</a> of the airport in Phoenix? That must be happening all over the country. The air travel system must be shut down now, as it was in the aftermath of 9/11. It's carrying something much more lethal than terrorists. We need to care for the sick, and stop creating more sickness, and get ready for distribution of the vaccine. ",
                            "created": "Sat, 21 Nov 2020 14:28:16 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "If the Trump supporters take to the streets with guns, then they will be arrested and jailed pending trial. We simply can't tolerate people using force to make the majority do what they want. ",
                            "created": "Sat, 21 Nov 2020 14:30:34 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "We are the United States of America, no one pushes us around. ",
                            "created": "Sat, 21 Nov 2020 14:44:19 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "The mother lode",
            "created": "Sat, 21 Nov 2020 17:44:41 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "<a href=\"https://shop.fctry.com/\">FCTRY</a> action figure collection. ",
                    "created": "Sat, 21 Nov 2020 17:39:40 GMT",
                    "type": "outline",
                    "inlineImage": "http://scripting.com/images/2020/11/21/actionFigureCollection.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}