{
    "text": "November 22",
    "created": "Sun, 22 Nov 2020 15:42:54 GMT",
    "type": "calendarDay",
    "name": "22",
    "subs": [
        {
            "text": "Today's song: <a href=\"https://www.youtube.com/watch?v=Jne9t8sHpUc\">Ironic</a>. ",
            "created": "Sun, 22 Nov 2020 18:28:28 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=Jne9t8sHpUc",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1330559268118999041\">Sidney Powell</a> is Trolling 2.0.",
            "created": "Sun, 22 Nov 2020 17:12:04 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1330559268118999041",
            "flInCalendar": true
        },
        {
            "text": "I saw an ad on YouTube for a product I'm interested in, but didn't catch its name before they started showing me another ad.",
            "created": "Sun, 22 Nov 2020 18:34:19 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "As Thanksgiving is almost here, this is what I'm most thankful for. The functional parts of the American government held back the corrupt parts. We had a perfect national election. Squeaky clean. The Trumps are proving that. The courts, even judges appointed by Trump, are sticking to and enforcing the rule of law. Is that enough to keep the system going for a while longer? We don't know for sure, but right now, it looks like it is. And think of all the things that didn't hold. And the corruption that made that possible",
            "created": "Sun, 22 Nov 2020 16:20:07 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2011/11/24/turkey.gif",
            "flInCalendar": true
        },
        {
            "text": "A graph I'd like to see. 1. Make a list of all the most influential journalists. 2. Put their names on a map. 3. If journo A reads journo B, then draw an arc with a pointer going from A to B. That's it. I'd just like to see who influences who. ",
            "created": "Sun, 22 Nov 2020 16:04:28 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Jonah Peretti of Buzzfeed <a href=\"https://www.vox.com/recode/2020/11/19/21578476/buzzfeed-huffpost-new-york-times-jonah-peretti-interview-podcast?scrolla=5eb6d68b7fedc32c19ef33b4\">says</a> that because the NYT is behind a paywall and therefore only accessible to rich people, it can no longer be considered <a href=\"https://en.wikipedia.org/wiki/Newspaper_of_record#:~:text=A%20newspaper%20of%20record%20is,a%20newspaper%20of%20public%20record.\">The Paper of Record</a>. ",
            "created": "Sun, 22 Nov 2020 16:37:02 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "An <a href=\"https://twitter.com/aiddya/status/1329860731135782918\">interesting idea</a> on Twitter, <a href=\"https://mediagazer.com/201121/p2#a201121p2\">addressed</a> to future generations: \"So misinformation was free and facts were hidden behind a pay wall? And you all wondered why democracy was brought down by masses peddling conspiracy theories?\" It's a fun theory but it's not true. Buzzfeed, Axios, CNN and many others, are not behind paywalls, and are just as reputable as the ones that are. ",
            "created": "Sun, 22 Nov 2020 15:42:55 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "BTW, I almost never cite Buzzfeed, which is something I should try to correct. But it doesn't show up in my Google news searches. Or on Memeorandum. Or in other people's tweets. It isn't very visible in my world. ",
            "created": "Sun, 22 Nov 2020 15:52:37 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "As a reader I see the web as a single entity, I don't feel the boundaries that news orgs try to impose. Even when I pay to go through them. News was <a href=\"http://scripting.com/2020/06/16/133627.html?title=newsHasBeenUnbundled\">unbundled</a> a long time ago. It interferes with the flow, I want interesting ideas to circulate, to stimulate other ideas. I miss a lot of stuff that I shouldn't miss, not because I'm poor or can't pay, but because I don't want to subscribe, I don't want a relationship, I just want to read the story.",
            "created": "Sun, 22 Nov 2020 15:59:55 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I once had a script that gave me a breakdown of pubs I cite in my linkblog. I wonder what happened to it? Hmmm.",
            "created": "Sun, 22 Nov 2020 16:01:39 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}