{
    "text": "November 24",
    "created": "Tue, 24 Nov 2020 12:13:56 GMT",
    "type": "calendarDay",
    "name": "24",
    "subs": [
        {
            "text": "Today's song: <a href=\"https://www.youtube.com/watch?v=W0iA_rOcn9Y\">My Wife</a>. ",
            "created": "Tue, 24 Nov 2020 20:22:31 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=W0iA_rOcn9Y",
            "flInCalendar": true
        },
        {
            "text": "I wrote a script that's loading all my <a href=\"http://scripting.com/?tab=links\">linkblog links</a> going back to 2010 into a MySQL database. I'm almost getting good at this. :boom:",
            "created": "Tue, 24 Nov 2020 20:21:32 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I listened to yesterday's <a href=\"http://this.how/cuomo/\">Cuomo briefing</a>. Highly recommend it. Here's the <a href=\"http://scripting.com/cuomo/rss.xml\">RSS feed</a>. A story he tells: On TV companies are advertising Thanksgiving the normal way with people getting together for parties and big dinners. Lots of hugs. No masks or social distancing. This sends a message that we're back to normal. I know it's illogical, but with no one contradicting the message in as powerful a way (one or two news interviews with Dr Fauci isn't that powerful) people are relieved. But the density of virus now is very high. You might've gotten away with traveling in the summer when the virus was scarce, but now, it's everywhere, and the result is likely to be dramatic, awful, and the growth of the virus will make even more people get infected in December and January.",
            "created": "Tue, 24 Nov 2020 17:43:28 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/11/24/plasticFaceShields.png",
            "flInCalendar": true
        },
        {
            "text": "BTW, at the supermarket this morning I saw a guy wearing one of those <a href=\"http://scripting.com/images/2020/11/24/plasticFaceShields.png\">plastic face shields</a>. That's not protection for the virus. When you breathe, it goes around the shield and enters the environment with no filter. It's as if you weren't wearing a mask, because you're not. ",
            "created": "Tue, 24 Nov 2020 17:46:04 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "We're in a period where people who understand math and science have a survival advantage over people who don't. It's not even high math, btw -- just the kind of stuff you would have learned in high school, if you were paying attention. ;-)",
            "created": "Tue, 24 Nov 2020 18:43:45 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "A flaw in the Constitution we're learning about now, the period between an incumbent losing a bid for re-election, and the inauguration of his successor is unnecessarily long. This is a period when the president, as we're finding out now, can do real damage to the country. I expect we're going to learn a lot about what's happening now when Trump leaves, or maybe <a href=\"https://en.wikipedia.org/wiki/Trump_Tower_Moscow\">runs</a>. The smart thing to do would be to remove the president as soon as the election outcome is known. And pending investigation he should be put in jail, no bail. A nice one, of course, but still we need to check out what he did.",
            "created": "Tue, 24 Nov 2020 13:31:14 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Season 4 of <a href=\"http://bingeworthy.io/tv/?id=https%3A%2F%2Fwww.metacritic.com%2Ftv%2Fthe-crown\">The Crown</a> is good. About half way through, at the beginning of the Australia trip, I gave up. I felt it was unwatchable. But I gave it another try. It's quite a story. And the characters are more interesting than I gave them credit for, and the acting is good. The last scene of the last episode is the best. Ties it up in a ribbon. No spoilers. :boom:",
            "created": "Tue, 24 Nov 2020 13:05:38 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "An idea for a New Year's resolution. At least once a day agree with someone. Not silently. Say \"I agree with you.\" No qualification, not \"I agree with you, but..\" It's jarring at first, then liberating. And the responses will surprise you.",
            "created": "Tue, 24 Nov 2020 12:54:41 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://www.forbes.com/sites/patrickmoorhead/2020/11/21/apple-macbook-pro-13-m1-reviewwhy-you-might-want-to-pass/amp/\">This is why</a> I don’t trust reviews from journos who Apple chooses to review their products. They overlook the flaws that make the machine unusable. And all the gushing over what? A new CPU? Please. I can't tell what CPU any machine is running, and neither can you, unless you open the <a href=\"http://scripting.com/images/2020/11/24/macAboutSystem.png\">system About box</a>. My main concern about the new Macs with the new CPU is if VMWare runs on them, and if I can run \"Frontier\" in there. Otherwise forget it. I'll stick with my Intel iMac Pro I bought in 2017.",
            "created": "Tue, 24 Nov 2020 12:13:57 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/06/23/mrNatural.png",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}