{
    "text": "November 26",
    "created": "Thu, 26 Nov 2020 16:14:50 GMT",
    "type": "calendarDay",
    "name": "26",
    "subs": [
        {
            "text": "Happy Thanksgiving everybody! ",
            "created": "Thu, 26 Nov 2020 16:15:43 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Today's song: <a href=\"https://www.youtube.com/watch?v=m57gzA2JCcM\">Alice's Restaurant</a>. ",
            "created": "Thu, 26 Nov 2020 17:47:15 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=m57gzA2JCcM",
            "flInCalendar": true
        },
        {
            "text": "A <a href=\"https://www.youtube.com/watch?v=enRrQ_KqZvE\">wild turkey</a> came to visit the other day! 🚀",
            "created": "Thu, 26 Nov 2020 16:23:21 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=enRrQ_KqZvE",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1331994756440854529\">Poll</a>: Which company's products do you buy more than the others?",
            "created": "Thu, 26 Nov 2020 16:14:51 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1331994756440854529",
            "flInCalendar": true
        },
        {
            "text": "I am thankful for <a href=\"https://www.caranddriver.com/subaru/forester-2020\">my car</a>. It's really weird but since the pandemic started, I've had this huge appreciation for what a fine bit of engineering it is. For a relatively big car it handles really well, esp driving on muddy dirt roads, which I do every day. It has more headroom than any car I've owned, which is cool because my torso is huge. In most cars, designed for normal-size people, I hit my head getting in, and have to scrunch my body uncomfortably just to fit. I sail in and out of the Forester, and I can sit any way I want. You'd be amazed how important this is. It also has technological flourishes which while not as flashy as a Tesla, still blow my mind. For example, the car likes to stay in lane. You could have a collision if you really insist, but you would know you were doing it. Very rational design. But the biggest thing is this -- for a civilization that is tottering on the edge of oblivion in so many ways, if this is the pinnacle, the highest point we ever reach, I have to say, well done human species. Very nice work. ",
            "created": "Thu, 26 Nov 2020 20:19:45 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/02/24/subaruForester.png",
            "flInCalendar": true
        },
        {
            "text": "I’m thankful for <a href=\"https://www.radiowoodstock.com/blog/\">WDST</a>, a great rock music radio station, as good as <a href=\"https://en.wikipedia.org/wiki/KNBR-FM#Switch_to_Timeless_Rock\">KFOG</a>, on the radio dial where I live. ",
            "created": "Thu, 26 Nov 2020 16:52:15 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I'm thankful for the great food in Woodstock. For such a small town, there are an incredible number of great places to eat. Much of it is very affordable. I've lived in Berkeley, New Orleans and New York -- places known for great food -- and the food here is that good. And the farms are right here, so the food is often incredibly fresh. For a good bagel however, you still have to go to NYC. ",
            "created": "Thu, 26 Nov 2020 16:56:50 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "A bunch of big shots, including yours truly, are pretending we work for <a href=\"https://twitter.com/gruber\">Gruber</a>, after we all admitted that we couldn't work for anyone. Here's <a href=\"https://twitter.com/davewiner/status/1331877787582525440\">my vignette</a>. \"Dave has been ordered to add a feature to the app, and asked to explain why it’ll take so long to do. Finally Gruber in a fit of frustration asks for the source so he can add it himself over the holiday weekend. Dave gives him the code and starts work on a fresh project.\"",
            "created": "Thu, 26 Nov 2020 19:49:00 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I'm thankful to have survived the virus at least this far. Every day is a new day in this wonderful world. Of course I'm thankful Donald Trump is now a has-been, one-term, washed-up, lame-duck, impeached, loser. I have avoided listening to him and reading his tweets, all the time knowing they were possibly going to affect our lives, always in a bad way. At least for the time-being it feels like that is over. ",
            "created": "Thu, 26 Nov 2020 16:34:34 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I'm sure we've lost a lot in the last four years that we don't yet know about, especially in 2020. But the United States is still the United States. Journalism tends to make it appear worse than it is. In day to day life, at least where I live, things are much the same as before. The store shelves are still full. You can still buy a wonderful meal. Want to buy a car? You can. The roads are clear. Gas stations have gas. Supply chains work. The health care system is a mess, as before, but much worse right now. The laws for the most part are enforced (except for you know who and his friends). Western civilization created and tested three highly effective vaccines in record time. <i>We did this. </i>To Americans who hate elites, if you understand these sentences, you might want to think again about living in a country that values education, science and math enough to get these things done, pronto, when needed, to save <i>your</i> life. Yours. You. Now we're going to try to get our political system to work for us again. Maybe you can possibly not get in the way of that? I know that's a lot to hope for. :-)",
            "created": "Thu, 26 Nov 2020 16:37:40 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/11/26/uncleSam.png",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}