{
    "text": "November 27",
    "created": "Fri, 27 Nov 2020 15:55:47 GMT",
    "type": "calendarDay",
    "name": "27",
    "subs": [
        {
            "text": "In a way it's a shame the vaccines are coming, because if they weren't, we would have to learn to trust and work together, all of us, without exception. The virus would be like AIDS, which <a href=\"https://en.wikipedia.org/wiki/History_of_HIV/AIDS\">transformed sexuality</a> in the 80s and 90s. There wasn't much of a \"safe sex\" concept before AIDS. Back then, if we were as crazy as we are now, people would say \"it's my right not to wear a condom. You're infringing on my civil liberties!\" A condom to protect against STDs is fairly analogous to wearing a mask to protect against Covid. There is no vaccine for AIDS, roughly 40 years later. So we had to transform and learn new societal norms. We apparently will not have to do that for Covid-19. Shame. Because we really do need to learn how to work each other, for many other reasons. This is not the last crisis we're going to be facing collectively, and a new understanding of what our rights are is called for. ",
            "created": "Fri, 27 Nov 2020 16:43:48 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/12/24/santa.png",
            "flInCalendar": true
        },
        {
            "text": "I'm going to get the vaccine as soon as I can. If I get vaccinated, now you aren't my problem, not personally. I might urge you to get the vaccine or wear a mask because I care about other people, but it's not about me anymore.",
            "created": "Fri, 27 Nov 2020 17:30:45 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "In the early days of the virus I said it would <a href=\"https://www.google.com/search?q=site%3Ascripting.com+virus+smarter\">make us smarter</a> because there's no way out that doesn't require us to be smarter. It was true, we did get smarter. But we didn't have to work together. We will be able to get out of this, individually, even if people are in it only for themselves and some immature misguided sense of what their rights are. ",
            "created": "Fri, 27 Nov 2020 16:55:23 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The lame duck had a eruption yesterday, a very rude one, where he said he was the president of the United States and you don't talk to the president of the United States that way. Then I thought, is he really the president of the United States? He plays golf and other than that probably not much more. Can you say you're president of the United States if you aren't doing the job?  ",
            "created": "Fri, 27 Nov 2020 16:01:12 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/11/27/duck.png",
            "flInCalendar": true
        },
        {
            "text": "For the <a href=\"https://lincolnproject.us/\">Lincoln Project</a>.  Do you still live rent-free in Trump's head? I always wondered why campaigns stop entertaining us with videos when the election is over. That's when the fun starts, esp if you won. :boom:",
            "created": "Fri, 27 Nov 2020 15:55:48 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Something I wrote on Facebook in 2018. \"I hear a lot of baby boomer blame tonight. I just have one thing to say to you younguns. <span style=\"font-size: 90%\">NO ONE KNOWS WHAT THE FUCK IS GOING ON</span>. There I let you in on the secret. Now go \"run\" the world. Hahah.\"",
            "created": "Fri, 27 Nov 2020 17:14:32 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}