{
    "text": "November 28",
    "created": "Sat, 28 Nov 2020 14:07:34 GMT",
    "type": "calendarDay",
    "name": "28",
    "subs": [
        {
            "text": "Good morning sports fans!",
            "created": "Sat, 28 Nov 2020 14:07:35 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Not much in the way of sports happening now. In normal years this would be NBA season, and I'd be hunkered down in front of the TV zoning out. Never been much of an NFL fan, and this year it's ridiculous. So many games canceled due to virus outbreaks. ",
            "created": "Sat, 28 Nov 2020 14:07:50 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "There's a controversy on Twitter, a disagreement between tech and journalism as to whether people and companies should speak for themselves. The reporters generally say it's \"tone deaf\" to do so -- the reporters are going to nail you anyway. That's such nonsense. We do so many things, create so much good, and reporters' ability to judge it is so limited. Paul Graham, who I rarely agree with (sorry) said something I totally agree with, citing several founders. It's a familiar theme to readers of this blog. [%search: Sources Go Direct%]. Here's what I <a href=\"https://twitter.com/davewiner/status/1332591551508262912\">tweeted</a>: \"My own experience supports Paul Graham's advice. If you depend on journalism to let you do the great thing you’re doing, if they didn’t think of it first it’ll never happen. By going around them I was able to make blogging and podcasting happen. Create the media you need.\" That last sentence may be another motto in the making. ",
            "created": "Sat, 28 Nov 2020 14:21:28 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/10/05/monstersFullSize.png",
            "flInCalendar": true
        },
        {
            "text": "I'm in the middle of <a href=\"https://en.wikipedia.org/wiki/The_Undoing_(miniseries)\">The Undoing</a>, an HBO miniseries. It's not terrible. After the second episode I wondered if it was worth it, so I <a href=\"https://twitter.com/davewiner/status/1332490159955308555\">asked on Twitter</a> and was told other people felt the same. But there's a quality to HBO dramas that you don't see elsewhere. The stars, acting, music, everything is first-rate, even the writing, even if the plot is just so-so. The series finale is tomorrow night. I expect there will be a surprise in the end, if not, the time won't have been totally wasted. Nicole Kidman is fun to watch, and Donald Sutherland, who plays her father, is still Donald Sutherland. I have a theory about who really dunnit, but no spoilers. :rocket:",
            "created": "Sat, 28 Nov 2020 14:17:22 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "For journalism, the Trump cash cow era is over. He’s like the <a href=\"https://en.wikipedia.org/wiki/Wicked_Witch_of_the_West\">Wicked Witch of the West</a> in the Wizard of Oz, <a href=\"https://www.youtube.com/watch?v=j7GJcKuVGm8\">dissolving</a> into a puddle of ooze, self-pity and depression.",
            "type": "outline",
            "created": "Sat Nov 28 01:51:33 +0000 2020",
            "urlvideo": "https://www.youtube.com/watch?v=j7GJcKuVGm8",
            "flInCalendar": true
        },
        {
            "text": "We've wasted a shitload time repeatedly \"learning\" about the personality of an asshole foisted on us by the shitheads who voted for him. There's a certain symmetry to it.",
            "created": "Sat, 28 Nov 2020 16:15:59 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I’ve been right about a lot when it comes to networking our culture and politics. I’m sure I’m right about where <a href=\"http://scripting.com/2016/05/04/1237.html\">politics needs to go</a>, and have been waiting for decades for the Democratic Party to take a risk and try to win against the lunacy of Repubs.",
            "type": "outline",
            "created": "Sat Nov 28 01:29:26 +0000 2020",
            "flInCalendar": true
        },
        {
            "text": "A reminder <a href=\"http://scripting.com/2020/10/27/155932.html?title=weMustBeWorseThanTheRepubs\">from late October</a>, the Dems must be <i>worse</i> than the Repubs. There's no chance, from today's perspective, that they will be. So, sigh, here we go again.  ",
            "created": "Sat, 28 Nov 2020 14:11:29 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "If you don't like the news, go out and make some of your own.",
            "created": "Sat, 28 Nov 2020 17:15:24 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}