{
    "text": "November 29",
    "created": "Sun, 29 Nov 2020 14:15:02 GMT",
    "type": "calendarDay",
    "name": "29",
    "subs": [
        {
            "text": "Today's song: <a href=\"https://www.youtube.com/watch?v=fJwjLYRPxJY\">Dream a Little Dream of Me</a>. ",
            "created": "Sun, 29 Nov 2020 17:41:07 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=fJwjLYRPxJY",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"http://scripting.com/2020/11/29/whyYoureCrazyIfYouDontUseAnOutliner.m4a\">Podcast</a>: Why you're crazy not to use an outliner. It's just a tool, not a religion, or a cause, it has no mystical properties. It's just <i>useful. </i>Like you use a hammer for some things and a screwdriver for others. It's also easy to use. Text on rails. ",
            "created": "Sun, 29 Nov 2020 16:21:46 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2020/11/29/whyYoureCrazyIfYouDontUseAnOutliner.m4a",
            "enclosureType": "audio/mp4a-latm",
            "enclosureLength": "2236176",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"http://bingeworthy.io/tv/top/\">A new BingeWorthy page</a> shows the 100 top-rated programs. No log-in. Has its own metadata, so when you see it on Twitter or Facebook, it announces itself in a reasonable way. This came up yesterday when a friend asked what they should binge next. I had my <a href=\"http://my.bingeworthy.io/davewiner/\">own</a> recommendations ready to go, but I didn't have one for the whole community. You can help build BingeWorthy by helping spread the word about <a href=\"http://bingeworthy.io/tv/top/\">this page</a>. Thanks! :-)",
            "created": "Sun, 29 Nov 2020 15:41:08 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "An idea for an app the builds off Twitter. 1. Keep an online diary, real time, of shows you’re watching on Netflix, HBO, etc. 2. You can see a read out of what the people you follow are watching right now. 3. Later this can be built into TV sets.",
            "created": "Sun, 29 Nov 2020 14:15:03 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Try putting together a custom greeting card. A picture on the front. A sentence on the inside. A paragraph on the back. Send me 200, here's my credit card. All the sites are super powerful design tools with quirks and you can stare at the screen and not find any way to get to each of the elements. And they forget your font choice. And you have a funny feeling the thing you just edited is going on the back of the card not on the inside. Who wants to spend the money and time only to find that you created an unusable thing. I have a lot of experience as a web designer, so I can handle crazy complexity, but these sites have all beaten me. Every one of them. ",
            "created": "Sun, 29 Nov 2020 21:16:01 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/11/29/happyHolidays.png",
            "flInCalendar": true
        },
        {
            "text": "So here's a hypothetical question. I recall that as a boomer I am responsible for lots of stuff that's happening to people of later generations. Here's the question. Are <i>they</i> responsible for what's happening now?",
            "created": "Sun, 29 Nov 2020 14:19:39 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}