{
    "text": "November 30",
    "created": "Mon, 30 Nov 2020 14:48:59 GMT",
    "type": "calendarDay",
    "name": "30",
    "subs": [
        {
            "text": "Today's song: <a href=\"https://www.youtube.com/watch?v=1I2Xup9dwW4\">Words of Love</a>.",
            "created": "Mon, 30 Nov 2020 16:47:15 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=1I2Xup9dwW4",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://github.com/scripting/Scripting-News/issues/196\">Braintrust query</a>. For programmers, suppose you get an idea for Project A while you're working on Project B. How do you get that idea down, to make sure it shows up when you're thinking about next steps on B, without disrupting your flow on A? ",
            "created": "Mon, 30 Nov 2020 15:47:27 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"http://bingeworthy.io/tv/?id=https%3A%2F%2Fwww.metacritic.com%2Ftv%2Fthe-undoing\">The Undoing</a> was even worse than I could have <a href=\"http://scripting.com/2020/11/28.html#a141722\">imagined</a>. Still, it had HBO production values, acting, that part they do so well. I don't know what it is but HBO has a look and feel and the artists know how to be part of it. The story was utterly unbelievably lame. They copied an interesting Law & Order plot, it actually <i>was</i> the plot of an episode of L&O, and stretched it out to six fucking hours. There was one interesting plot twist, no spoilers. Also if they had cut the last episode off before it got ridiculous, I might have had a kind word for it. I've rated it a :fire: over on BingeWorthy. Only the second such show. Somehow they got me to watch to the end. I guess it was kind of relaxing. ",
            "created": "Mon, 30 Nov 2020 15:20:02 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I'd like to say something to my friends from Silicon Valley who have gravitated to venture capital. Not all that's good in tech flows through the VC industry. Y'all should become more aware of it. It's like your weather. A natural resource. It exists. ",
            "created": "Mon, 30 Nov 2020 15:15:57 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Trump never tried to get re-elected. He threatened so many Americans' sense of what's right, of what America is, it's remarkable he didn't lose by more. It's similar imho to the approach of journalism. They have no responsibility for their declining business. They insist, over many years, that the tech industry owes them money. Somehow it never occurred to them that what tech provides is what people want. They don't listen so how could they know? And they don't bend or they would have provided something better than Google, Facebook et al. Now they're doing what Trump is doing. Asking someone to undo their loss. Like Trump they could study their predicament and learn what they need to do differently. Unlike Trump they are still in business.",
            "created": "Mon, 30 Nov 2020 20:21:19 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "All daily writers hope to \"life rent-free in your mind.\" ",
            "created": "Mon, 30 Nov 2020 14:55:43 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "No public funding for news orgs",
            "created": "Mon, 30 Nov 2020 15:08:14 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2020/11/30/butHerEmails.png",
            "description": "If we fund them now, we forever freeze journalism as being no more than it is now.",
            "subs": [
                {
                    "text": "John Naughton's nightly email <a href=\"https://johnnaughton.substack.com/\">newsletter</a> is the only one I subscribe to. Rarely a night goes by that I don't read one of his stories, and they all change the way I think, which is why I read, and why daily writers write, at least the good ones. Anyway, one thing we disagree on is public funding for news orgs. He's a <a href=\"https://www.theguardian.com/commentisfree/2020/nov/28/for-the-sake-of-democracy-social-media-giants-must-pay-newspapers\">believer</a>, and I'm a fervent opponent. For so many reasons. But the main one is, if we fund them now, we forever freeze journalism as being no more than it is now. ",
                    "created": "Mon, 30 Nov 2020 14:49:00 GMT",
                    "image": "http://scripting.com/images/2019/02/23/herEmails.png",
                    "flInCalendar": true
                },
                {
                    "text": "The world has radically changed, and continues to change, journalism hasn't. And btw, also politics, because unfortunately the two go hand in hand. Politics can only go where journalism will let it go. We've learned that hard lesson during the Trump presidency. They have power to stop honorable people, but have no power over people who don't care.  ",
                    "created": "Mon, 30 Nov 2020 15:08:48 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Journalism blames Facebook and the rest of the web for the problems. Meanwhile their inability to build a functional two-way idea flow on the web has created the opportunity for all kinds of junk to flow in to take its place. This must not be where evolution stops. ",
                    "created": "Mon, 30 Nov 2020 15:09:16 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Both journalism and politics have to stop seeing the web as \"over there\" and put themselves fully in the middle of it. We are participants, we want to help, that's their job, to help us. If they do, we've proven we will flood them with money. So far, neither politics or journalism has accepted that as the basic change. ",
                    "created": "Mon, 30 Nov 2020 15:09:39 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Plenty of toilet paper",
            "created": "Mon, 30 Nov 2020 20:13:51 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "That's how you know the virus isn't too bad. ",
                    "created": "Mon, 30 Nov 2020 20:13:58 GMT",
                    "inlineImage": "http://scripting.com/images/2020/11/30/plentyOfToiletPaper.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}