{
    "text": "I want Bluesky to go away",
    "created": "Thu, 04 May 2023 13:32:59 GMT",
    "type": "outline",
    "description": "Jack please enjoy your wealth and play somewhere else and leave Twitter and post-Twitter alone.",
    "subs": [
        {
            "text": "I definitely want Bluesky to just go away. I don't like it because if it gains traction it has potential of replacing Twitter as the festering turd in the middle of what should have been a vibrant growing market that keeps anything else from rising in competition with it. ",
            "created": "Thu, 04 May 2023 13:27:51 GMT",
            "flInCalendar": true
        },
        {
            "text": "To people who say \"Oh Dave but it's federated and it has an open protocol\" -- yes I've heard that, but there are all kinds of games you can play, such that even if it's true (and so far it isn't), no competitor ever rises, or as soon as they do, they are foreclosed on. ",
            "created": "Thu, 04 May 2023 13:39:30 GMT",
            "flInCalendar": true
        },
        {
            "text": "I don't like it because it's Jack Dorsey. You say \"Oh Dave but Jack is just a board member\" to which I say oh please, I wasn't born yesterday. ",
            "created": "Thu, 04 May 2023 13:32:54 GMT",
            "flInCalendar": true
        },
        {
            "text": "The only way out of this Jack-induced nightmare is for: 1. It to fail quietly and 2. Jack to sit the fuck down and do something other than plant huge turds in the middle of what should be a vibrant thriving open market, which means there are lots of entrants, choice, and opporunities for cooperation and innovation. ",
            "created": "Thu, 04 May 2023 13:38:13 GMT",
            "flInCalendar": true
        },
        {
            "text": "If having a license from <i>The Jack</i> is a requirement, well we've already wasted 17 years on Twitter waiting for that to become something wonderful and it's fair to say now that it never did and never will, so Jack please enjoy your wealth and play somewhere else and leave Twitter and post-Twitter alone. Thank you. ",
            "created": "Thu, 04 May 2023 13:38:34 GMT",
            "flInCalendar": true
        },
        {
            "text": "Also -- see <a href=\"http://scripting.com/2023/05/04/142200.html?title=internetSocialMediaApps\">The Internet of Social Media Apps</a>. ",
            "created": "Thu, 04 May 2023 15:55:49 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}