{
    "text": "July 4",
    "created": "Sun, 04 Jul 2021 14:12:42 GMT",
    "type": "calendarDay",
    "name": "04",
    "subs": [
        {
            "text": "Today's song: <a href=\"https://www.youtube.com/watch?v=rdPOAhBp2Ag\">I'm Uncle Sam, how do you do?</a>",
            "created": "Sun, 04 Jul 2021 14:31:44 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=rdPOAhBp2Ag",
            "flInCalendar": true
        },
        {
            "text": "Suggestion: Choose to not be offended, at least once a day.",
            "created": "Sun, 04 Jul 2021 14:12:43 GMT",
            "type": "tweet",
            "tweetId": "1411689477337141250",
            "tweetUserName": "davewiner",
            "flInCalendar": true
        },
        {
            "text": "Do the Bucks need Giannis?",
            "created": "Sun, 04 Jul 2021 23:36:51 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "NBA fans, what's the best NBA podcast? Not too many ads, esp up front. Not too much bullshit about the people talking. Truly interesting ideas about what's going on.",
                    "created": "Sun, 04 Jul 2021 23:36:59 GMT",
                    "image": "http://scripting.com/images/2021/07/04/giannisActionFigure.png",
                    "flInCalendar": true
                },
                {
                    "text": "For example, the Bucks did so well with Lopez playing a role similar to <a href=\"https://en.wikipedia.org/wiki/Giannis_Antetokounmpo\">Giannis</a> in game 5, but in game 6 he's back to (mostly) shooting corner 3's? Why? I have a hunch. Giannis is kind of like Melo was when things worked without him at the Knicks in 2012. Nothing cool could happen on the Knicks, <a href=\"https://clutchpoints.com/carmelo-anthony-jeremy-lin-story-did-melo-force-linsanity-out-of-new-york/\">said Melo</a> (in my imagination) without it going through me, said Melo.",
                    "created": "Sun, 04 Jul 2021 23:37:25 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I also think Giannis is a liability, in that the Bucks play better without him because his <a href=\"https://www.youtube.com/watch?v=3yH5w7INbDA\">foul shots</a> break up any energy the Bucks build. It's a free timeout for their opponent. If Lopez can do what Giannis does, without the foul shot liability, who needs Giannis?",
                    "created": "Sun, 04 Jul 2021 23:38:03 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "America is not great",
            "created": "Sun, 04 Jul 2021 14:39:13 GMT",
            "type": "outline",
            "description": "I knew slavery was part of our legacy, but I didn't know that it was pretty much our whole legacy. ",
            "metaImage": "http://scripting.com/images/2021/07/04/insurrection.png",
            "subs": [
                {
                    "text": "I was taught as a youngster that the US was the greatest country ever, both at home and in school. I imagine this is the same education kids in every terrible country ever got. And my parents were biased, they were immigrants who would have died for sure in Europe during WW II if the US hadn't taken them in. ",
                    "created": "Sun, 04 Jul 2021 14:39:33 GMT",
                    "image": "http://scripting.com/images/2021/07/04/dempsey.png",
                    "imageLink": "https://twitter.com/MartinAchard/status/1411707571510054916/photo/1",
                    "flInCalendar": true
                },
                {
                    "text": "Over time they came to see the reality that the US is a seriously flawed country. But nothing would have prepared them for what we've seen in the last five years. My mom died in February 2018, so she did live to see Trump elected, but did not see the January 6 insurrection, and all the looney tunes that followed. She also missed out on the <a href=\"https://www.nytimes.com/interactive/2019/08/14/magazine/1619-america-slavery.html\">1619 Project</a> which was, for me a real head-turner. ",
                    "created": "Sun, 04 Jul 2021 14:47:24 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I knew slavery was part of our legacy, but I didn't know that it was pretty much our <i>whole</i> legacy. We fought and won a Civil War to purge ourselves of slavery, but that wasn't enough, Jim Crow undid a lot of the good that was done in post-Civil War America. The <a href=\"https://en.wikipedia.org/wiki/Voting_Rights_Act_of_1965\">Voting Rights Act</a>, passed in 1965 and <a href=\"https://georgewbush-whitehouse.archives.gov/news/releases/2006/07/20060727-1.html\">re-authorized</a> in 2006, has now been gutted by the Supreme Court. And the Republican-run states are rapidly moving to deprive citizens of color their voting rights. ",
                    "created": "Sun, 04 Jul 2021 14:50:01 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The fact is the US is an awful fucked up country. It doesn't live up to the promise of the Declaration of Independence or the Constitution for a huge portion of the population, and that means it doesn't mean shit for the rest of us. ",
                    "created": "Sun, 04 Jul 2021 14:48:09 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I am an American, nothing is going to change that, but if you asked me do I feel this is the greatest country ever, I'd say that's an idea we have to purge from our minds, the US is the opposite, it's a fat, lazy, spoiled, ridiculous excuse for a country. If we want to amount to anything we need to take a 180 degree turn now. ",
                    "created": "Sun, 04 Jul 2021 14:48:20 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "White trash riot on behalf of rich slave owners.",
                    "created": "Sun, 04 Jul 2021 23:27:39 GMT",
                    "type": "outline",
                    "inlineImage": "http://scripting.com/images/2021/07/04/whitetrash.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}