{
    "text": "July 9",
    "created": "Fri, 09 Jul 2021 13:35:58 GMT",
    "type": "calendarDay",
    "name": "09",
    "subs": [
        {
            "text": "I found it impossible to get excited about last night's <a href=\"https://www.theringer.com/2021/7/9/22569878/nba-finals-suns-bucks-chris-paul-devin-booker\">NBA finals game</a> between the Suns and Bucks. Two teams I spend no mental energy on. I know the Suns are great. I watch their teamwork, amazing stuff. That's what I love about sports, you see hugely talented people who spend their lives preparing to compete and, esp in basketball, it still matters how the least talented person on the team is doing. You don't see them complaining about each others' <a href=\"https://www.youtube.com/watch?v=4ltWN98PTJY\">manners</a>. They get on with it. They have a goal. Another reason this year's playoffs are interesting, no matter who wins, the players on the winning team will be champions for the first time. So they're playing for something that's real to them. Next year, if they make it back to the finals as the Warriors, Heat, Lakers, Cavaliers, etc have in recent years, you wonder how they get motivated. Another trophy, big eff'in deal. Anyway even with all the drama, I just don't care who wins. Maybe as the series progresses I will, but I doubt it -- it might be a <a href=\"https://www.si.com/nba/pacers/news/nba-finals-bucks-suns-one-gambler-made-an-11000-bet-that-this-will-happen\">sweep</a>. It looks like it will. ",
            "created": "Fri, 09 Jul 2021 13:39:27 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/05/07/subtleArtOfNotGivingAFuck.png",
            "flInCalendar": true
        },
        {
            "text": "Every time I switch my iPhone to a different computer, I have to start over with music. Why. After 15 years or so, couldn't they offer a way to back it up and then restore it? This must be some kind of copyright thing. I wish I had a phone that was rationally designed with the user in mind. I also have an Android phone, but as far as I can tell they broke the only way to copy music onto the device from a Mac. Not sure if a Windows machine is any better. Same reason I'd love to move my desktop act to Linux, but I can't do it without Frontier. Which is, btw, why I had to buy a new Mac. I mistakenly updated my iPhone and it wouldn't work with the Mac I keep un-updated so I can continue to run Frontier. All I have to say is this: Oy. What a mess. ",
            "created": "Fri, 09 Jul 2021 13:35:59 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Drummer for poets",
            "created": "Fri, 09 Jul 2021 14:28:55 GMT",
            "type": "outline",
            "description": "I'm thinking about how people will host their own Drummers.",
            "metaImage": "http://scripting.com/images/2021/07/09/poetsOnAPorch.png",
            "subs": [
                {
                    "text": "I'm thinking about how people will host their own Drummers. ",
                    "created": "Fri, 09 Jul 2021 14:32:42 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I don't want to run the only server, I might not even want to run the main server. I do want to continue developing the software. This is different from how Facebook and Twitter run, I'm not trying to create another walled garden. It's not the kind of work I like, or am particularly good at. It's much more like how WordPress works. Only I think Drummer can be even easier to set up and manage. ",
                    "created": "Fri, 09 Jul 2021 14:33:21 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I want to create networks of outliner users. I call this \"Communication with a big C.\" Not the wires, but the ideas that go over the wires. Nodes in my network are human minds, not computers. ",
                    "created": "Fri, 09 Jul 2021 14:34:53 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The world I imagine is something like 1980s software model with a much more efficient distribution system. And the product, unlike the one from the 80s, is built around networking, where the networking features of MORE and ThinkTank were barely a twinkle in the eye. There was no software to back it up ",
                    "created": "Fri, 09 Jul 2021 14:33:30 GMT",
                    "collapse": "true",
                    "subs": [
                        {
                            "text": "One of the reasons I wanted Symantec to <a href=\"https://techmonitor.ai/techonology/symantec_acquires_think_technologies\">buy</a> Think Technologies: they had one of the leading Mac email packages at the time, a product called InBox. There were two others, and I was friends with them too. I wanted desperately to get real networking support into MORE. Never happened, unfortunately, that had to wait for Frontier. ",
                            "created": "Fri, 09 Jul 2021 14:42:17 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "I'm starting to put the pieces together. One of them is to get the hosting working on systems like AWS, Digital Ocean and Glitch. So a user can just launch a server from a repo, have it mostly configure itself, have a Drummer server running in minutes. That's the goal. We have some experience with this, the various <a href=\"https://www.google.com/search?q=site%3Ascripting.com+%22for+poets%22\">For Poets</a> projects we've done here. ",
                    "created": "Fri, 09 Jul 2021 14:38:15 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I've started a <a href=\"https://github.com/scripting/Scripting-News/issues/216\">thread</a> if you have questions or suggestions. ",
                    "created": "Fri, 09 Jul 2021 14:40:31 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PS: For programmers, the key piece of software has a funny name. <a href=\"https://github.com/scripting/appServer\">daveappserver</a>. It's an application server, perfectly set up to host Drummer, because in fact it is what I use to host Drummer. :smile:",
                    "created": "Fri, 09 Jul 2021 14:52:13 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}