{
    "text": "July 14",
    "created": "Wed, 14 Jul 2021 11:47:03 GMT",
    "type": "calendarDay",
    "name": "14",
    "subs": [
        {
            "text": "In the early days of the web there were <a href=\"http://mindbomb.org/\">mind bombs</a> everywhere.",
            "created": "Wed, 14 Jul 2021 21:04:49 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"http://brandontoner.ca/\">Brandon has broken through</a>, a total server-land neophyte, broke through via pure <a href=\"https://github.com/scripting/Scripting-News/issues/217#issuecomment-879960207\">persistence</a>. He followed the example of my PagePark installation <a href=\"https://github.com/scripting/Scripting-News/issues/210#issuecomment-864612526\">on Glitch</a>, is using the <a href=\"https://github.com/scripting/pagePark/blob/master/docs/config.md#mirrors-works-like-redirects\">mirrors feature</a> in PP to render outlines from \"LO2\". He is motivated and I am inspired. ",
            "created": "Wed, 14 Jul 2021 15:23:59 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "My <a href=\"https://twitter.com/davewiner/status/1414945524101287938\">tweet about GitHub</a> yesterday got a fair amount of attention. I'm glad, because the idea is powerful and works. Further if GitHub/Microsoft made this a business priority, it could be streamlined for end-users, and be a revenue source, and an incredible developer platform, beyond what it already does. I would love to begin a conversation with MS, privately if they want, to figure out what's possible here. ",
            "created": "Wed, 14 Jul 2021 13:19:39 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I've been reading the <a href=\"https://www.amazon.com/Autobiography-Malcolm-Told-Alex-Haley/dp/0345350685\">Autobiography of Malcolm X</a>, and it's transformative for me. He's talking about whiteness from the point of view of a black man of my parents' generation. I can't agree with some of what he says, he's talking nasty shit about my people, and it's as oppressive as anything anyone says about blacks, even the stuff he quotes. Don't respond to oppression with more oppression. But overriding that is the bigger point, that the United States has been destroying the lives of black people since inception. I just spent <a href=\"https://www.youtube.com/watch?v=oIZDtqWX6Fk\">18 minutes</a> with the flipside of Malcolm X, a white academic, <a href=\"https://documentarystudies.duke.edu/people/john-biewen\">John Biewen</a>, explaining what it means to be white, in the same context as that which X describes, but from from the other side of the relationship. I think if you watch <a href=\"https://www.youtube.com/watch?v=oIZDtqWX6Fk&t=1095s\">this video</a>, it'll be the most transformative 18 minute video experience you've had in a long time. ",
            "created": "Wed, 14 Jul 2021 13:09:29 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=oIZDtqWX6Fk",
            "image": "http://scripting.com/images/2021/07/14/autobiographyOfMalcolmX.png",
            "flInCalendar": true
        },
        {
            "text": "Our ancestors were slaves, no matter your skin color, or where your ancestors came from. This is a mind bomb that has yet to go off in the brains of white Americans. But it must.",
            "created": "Wed, 14 Jul 2021 14:04:23 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The source of all our problems is that our government is controlled by stupid, mean, willfully ignorant rich assholes.",
            "created": "Wed, 14 Jul 2021 12:12:38 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Good morning sports fans! The \"NBA\" finals resume tonight, I'm actually going to miss basketball when it's over. But then the <a href=\"https://en.wikipedia.org/wiki/2020_Summer_Olympics\">Olympics</a> start, and after that my attention will finally turn to the Mets. I've got the rest of the year planned out. But the weather. Oy does it suck. I know there <a href=\"https://www.motherjones.com/environment/2021/07/none-of-the-old-rules-still-apply-when-the-driest-city-in-the-us-faces-a-catastrophic-drought/\">are</a> <a href=\"https://www.npr.org/2021/07/13/1013446314/amid-a-mega-drought-a-water-shortage-will-be-declared-along-the-colorado-river\">droughts</a> and <a href=\"https://oceanservice.noaa.gov/facts/heat-dome.html\">heat domes</a> elsewhere, but here we're living in a constant state of deluge. I take my bike ride every day, rain or shine. I used to skip rainy days but this summer that's not an option because it rains every damned day, and not just drizzle, hours of downpour. And the thunder last night. Who could sleep through that. Not this sports fan. I just want some beautiful warm summer weather. On the other hand the new rose bush I planted really seems to like all the wetness. ",
            "created": "Wed, 14 Jul 2021 11:47:04 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/07/14/rose.png",
            "flInCalendar": true
        },
        {
            "text": "Toaster ovens are now called \"air fryers.\" That's weird, but I just bought one, a <a href=\"https://www.amazon.com/dp/B01M0AWSJX?psc=1&ref=ppx_yo2_dt_b_product_details\">Cuisinart</a>, as recommended by <a href=\"https://www.nytimes.com/wirecutter/reviews/best-air-fryer/\">Wirecutter</a>. I love it. I've been using it every night, and my eating has become more healthy, and also much tastier. Total win.",
            "created": "Wed, 14 Jul 2021 11:56:27 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Interesting marketing",
            "created": "Wed, 14 Jul 2021 12:05:43 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Let's see. <a href=\"https://en.wikipedia.org/wiki/Martha_Stewart\">Martha Stewart</a> and <a href=\"https://en.wikipedia.org/wiki/Snoop_Dogg\">Snoop Dogg</a> recommend this new Bic lighter because it's great for lighting candles, and more! Haha omg. Lol. :smile:",
                    "created": "Wed, 14 Jul 2021 12:05:53 GMT",
                    "inlineImage": "http://scripting.com/images/2021/07/14/snoopAndMarthaRecommend.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}