{
    "text": "July 20",
    "created": "Tue, 20 Jul 2021 12:36:40 GMT",
    "type": "calendarDay",
    "name": "20",
    "subs": [
        {
            "text": "Still reading the <a href=\"https://en.wikipedia.org/wiki/The_Autobiography_of_Malcolm_X\">Autobiography</a> of [[Malcolm X]]. He asks if you think it's a coincidence that the US <a href=\"https://en.wikipedia.org/wiki/Atomic_bombings_of_Hiroshima_and_Nagasaki\">dropped the bomb on Japan</a>, a non-white country, instead of Germany, a white country. The official story is we used the bomb as soon as it was ready, but that could just be a story. He asks a good question, and many others. I wish we had more people around today asking questions like that. ",
            "created": "Tue, 20 Jul 2021 20:44:35 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "[[Bezos]] wants to move manufacturing into space. I had never heard that idea before seeing a quick interview today with <a href=\"https://www.cnn.com/videos/business/2021/07/20/jeff-bezos-blue-origin-space-launch-cooper-intv-sot-vpx.cnn\">Anderson Cooper</a> of CNN and the two Bezos brothers, who look very much alike. The rich one is the guy in the dorky cowboy hat. He says some industries that use up too much of the earth's resources would be better in space. I started to think about what he might have in mind. Server farms run on solar energy, and cooled by the vacuum of space. Perfect. On the other hand, who would regulate his businesses in space? No OSHA, no unions, no taxes or laws. I bet they're all thinking about this, and I kick myself for not having thought of it myself. ",
            "created": "Tue, 20 Jul 2021 15:14:44 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://twitter.com/jeffjarvis/status/1417491554617503744\">Jeff Jarvis wonders</a> why insurance companies haven't weighed in on [[Covid]] vaccination. For example, charging higher rates for unvacinnated people. Now that you mention it, I wonder why too.",
            "created": "Tue, 20 Jul 2021 15:00:29 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/jeffjarvis/status/1417491554617503744",
            "flInCalendar": true
        },
        {
            "text": "What's \"historic\" about [[Bezos]]' trip today? The first human in space was <a href=\"https://en.wikipedia.org/wiki/Yuri_Gagarin\">Yuri Gagarin</a> in 1961. The first American was <a href=\"https://en.wikipedia.org/wiki/Alan_Shepard\">Alan Shepard</a>. Gagarin orbited earth once. Shepard went up and down, did not orbit.",
            "created": "Tue, 20 Jul 2021 12:36:41 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "In [[Denmark]] they have a children's show about a <a href=\"https://en.wikipedia.org/wiki/John_Dillermand\">man with a huge penis</a> that he uses to help people. At first it's a little shocking to this American, but why shouldn't we think of a [[penis]] as something friendly and useful. I was brought up to think of my penis as something shameful, dirty, to hide, to apologize for. I can't imagine how I got those ideas, but they were and are there in my infant brain. Eventually we learn to have fun with our penises. Hopefully. Why not start as a kid? Thanks to [[John Oliver]] for his incredible little <a href=\"https://www.youtube.com/watch?v=A51mJjFyG_w\">tutorial</a>.  ",
            "created": "Tue, 20 Jul 2021 14:50:07 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=A51mJjFyG_w",
            "image": "http://scripting.com/images/2021/07/20/johnDillermand.png",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}