{
    "text": "July 21",
    "created": "Wed, 21 Jul 2021 12:43:29 GMT",
    "type": "calendarDay",
    "name": "21",
    "subs": [
        {
            "text": "What if Twitter or Facebook let you argue privately, one-on-one, with a random <i>anonymous</i> person who takes the other side on an issue you feel passionately about. You can say whatever you want, the other person can opt out at any time, so can you. Repeat as many times as you like.   ",
            "created": "Wed, 21 Jul 2021 14:20:46 GMT",
            "type": "tweet",
            "tweetId": "1417852861652905986",
            "tweetUserName": "davewiner",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1417845793311100931\">Poll</a>: Who is responsible for more mass-killing lies?",
            "created": "Wed, 21 Jul 2021 14:12:40 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1417845793311100931",
            "flInCalendar": true
        },
        {
            "text": "Idea: What if the vaccine is like a big gun and the virus is an army of BLMs and Antifas marching down the street, coming right at your house, with your kids inside! You must be a librul, you have no protection. ",
            "created": "Wed, 21 Jul 2021 13:29:15 GMT",
            "type": "tweet",
            "tweetId": "1417840502645399555",
            "tweetUserName": "davewiner",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://www.al.com/news/2021/07/im-sorry-but-its-too-late-alabama-doctor-on-treating-unvaccinated-dying-covid-patients.html\">Alabama doctor</a>: “One of the last things they do before they’re intubated is beg me for the vaccine. I hold their hand and tell them that I’m sorry, but it’s too late.” ",
            "created": "Wed, 21 Jul 2021 13:46:40 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "In the end I was rooting for the Milwaukee [[Bucks]]. I don't understand why, maybe it's because I had been following the east more than the west, largely due to the time difference. Or maybe it was my connection with Wisconsin? Whatever the reason I was happy last night because the Bucks won the series, 4-2, over the Phoenix Suns who are also an excellent team. I felt bad for [[Chris Paul]], this was his first chance in the finals and at age 37 perhaps his last, after a long playoff career, marred by injuries, and he didn't win, not just because the Bucks wanted it more. The playoff process is a long grind. He was still standing, but the Bucks prevailed -- because of <a href=\"https://en.wikipedia.org/wiki/Giannis_Antetokounmpo\">Giannis  Antetokounmpo</a>. He's a superstar in league with the <a href=\"https://www.youtube.com/watch?v=AooUnpj5nzE\">best</a>, plays through pain, and basically carried the team on his back. He is also famous as a terrible free throw shooter, but last night he made 15 of 16 free throws. Without that, the Bucks would've lost, and we'd be going to a game 7 showdown in Phoenix tomorrow night. The most important thing to me, and Giannis commented on it too, is that the Bucks are a team that was developed through the draft and trades, not as a superteam formed for the purpose of winning a championship, like the detestable [[Brooklyn Nets]]. The two stars of the Bucks, Giannis and <a href=\"https://en.wikipedia.org/wiki/Khris_Middleton\">Khris Middleton</a>, have been on the Bucks since 2013. I feel great that the NBA, despite the best efforts of the superteams, is still a game where talent and perseverance wins. The playoffs were good this year, it was the year the Knicks competed well, and <a href=\"https://en.wikipedia.org/wiki/Trae_Young\">young talent</a> impressed and entertained. Now it's time to shift to the Olympics which start on Friday, and the Mets who are in first place! ",
            "created": "Wed, 21 Jul 2021 12:43:30 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/07/21/giannis.png",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}