{
    "text": "July 28",
    "created": "Wed, 28 Jul 2021 14:48:49 GMT",
    "type": "calendarDay",
    "name": "28",
    "subs": [
        {
            "text": "I heard from a friend of [[Gary Sevitsky]], a colleague of mine in the late 70s at the [[University of Wisconsin]]. He and I were both smokers and grad students in Computer Science, so we'd go out for smoking breaks together while working at the Unix lab on <a href=\"https://www.google.com/maps/place/1210+W+Dayton+St,+Madison,+WI+53706/@43.0711993,-89.4087568,17z/data=!3m1!4b1!4m5!3m4!1s0x8807accf34599401:0xcbdcc82ca4309b0f!8m2!3d43.0711993!4d-89.4065681\">West Dayton St</a>. It was in one of our hallway smoking conversations that he told me about Lisp editors that understood structure. I loved the idea, but I was programming in C, so I decided to build an editor for that language, with the same idea. That started me down a <a href=\"http://scripting.com/dwiner/outlinersProgramming.html\">path</a> that to this day I'm still working on. The combination of outline structures and programming, it's a big deal. I never spoke with him after leaving [[Madison]], and after the [[Guy Kawasaki]] <a href=\"https://podcasts.apple.com/gb/podcast/guy-kawasakis-remarkable-people/id1483081827?i=1000528857811\">podcast</a> I heard from a friend of his who said that <a href=\"https://www.legacy.com/us/obituaries/stamfordadvocate/name/gary-sevitsky-obituary?pid=190783474\">Gary had died</a> at age 57, in 2013. He was a kind, brilliant man, and a friend from one of the best times of my life. ",
            "created": "Wed, 28 Jul 2021 21:19:43 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/07/28/garySevitsky.png",
            "flInCalendar": true
        },
        {
            "text": "In the future, kids will learn about the attempt to overthrow the government that failed, but they let the coup leaders stay in Congress and they tried again, and again, and again. Kids of the future will wonder why the people of America didn't force the politicians to evict the terrorists. Instead, it took 20 years to get them out of the government, in the meantime the planet became unlivable, billions died and civilization basically dissolved. Right now that's the story that should be being reported in the news. Wait longer, the story gets worse. ",
            "created": "Wed, 28 Jul 2021 21:04:06 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/07/18/annieHall.png",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=MRuS3dxKK9U\">Howard Beale</a>: \"I'm a human being god damn it, my life has value!\"",
            "created": "Wed, 28 Jul 2021 15:39:43 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=MRuS3dxKK9U",
            "flInCalendar": true
        },
        {
            "text": "Journalism is a ruling class, just like all the rest of them. Like the church they try to reserve a holy position for themselves, but it's a lie. ",
            "created": "Wed, 28 Jul 2021 15:30:57 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The big bug in our system is that the world is run mostly by people who are playing it safe.",
            "created": "Wed, 28 Jul 2021 16:01:01 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "If you're a [[PagePark]] user, here's a <a href=\"https://github.com/scripting/pagePark/issues/24\">potential security issue</a> I want to fix, but there is breakage, that's why I wanted to check with users first. ",
            "created": "Wed, 28 Jul 2021 15:57:15 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I'm still trying to figure out how to use [[tagging]]. The goal is to create an index, like the index in the back of a book. Maybe when I have enough tags I will be able to create a book from my writing here? It approximates the way we did the index in the back of software manuals at [[Living Videotext]]. Hmm. Maybe tagging would work well for the [[Drummer]] docs? Also my apologies to <a href=\"http://scripting.com/email\">email</a> readers, for some reason the tags don't show up in emails. I have to figure out why, but I'm not working near there at this time.",
            "created": "Wed, 28 Jul 2021 14:53:58 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I never expect to hear any challenging ideas on cable tv news, but yesterday I actually did hear one, in passing, from a surprising source, [[John Heilemann]], who I think of as the ultimate <a href=\"https://twitter.com/jheil\">parrot</a>. A good looking person, speaks well, but just shovels shit. But yesterday he said something \"out there\" not on the script they're all singing from on CNN and MSNBC. He said that Biden's response to the threat to democracy is too weak. He said if Biden was really signed on, he'd be putting roadblocks in the Repubs' way, every day. Using the incredible communication system that the White House can be, if used bravely, to expose the threat, again: Every. Damned. Day. I just gave [[Joe Trippi]], Dan Gillmor and Jay Rosen <a href=\"https://twitter.com/davewiner/status/1420401709214572545\">grief</a>, for only being willing to dip a toe in the water on the mess we're in. Trippi had an episode where he must've mentioned my name 20 times, but he never told his listeners <a href=\"http://scripting.com/2021/06/08.html#a152650\">what I told him</a> he had to do. And of course he's not doing it. Presumably because he's still holding on to the option of having a career if the Repubs prevail? Doesn't he see that won't happen. And we're all about the same age, in our mid-60s. This isn't time to be thinking about our careers, it's a time in our lives when we can afford to take some risks. Think about it next time you decide to play it safe. (That's the problem with every successful person, you can't trust them, even when they're old, they're so set in the groove of safe-playing, they'll never actually do anything to change how things work. And very few young people are willing to risk, or would know what to do if they did.)",
            "created": "Wed, 28 Jul 2021 15:13:41 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/05/13/knicksFan.png",
            "flInCalendar": true
        },
        {
            "text": "[[White Lotus]] on [[HBO]] got really <a href=\"https://www.metacritic.com/tv/the-white-lotus/season-1\">good reviews</a>, so I gave it a try. It <a href=\"http://bingeworthy.io/tv/?id=https%3A%2F%2Fwww.metacritic.com%2Ftv%2Fthe-white-lotus%2Fseason-1\">sucks</a>. Often overwhelmingly cringe-worthy. However I have watched the first three episodes and I can see that I'm probably going all the way. I also tried [[Manifest]] on [[Netflix]], a former NBC series that got <a href=\"https://www.metacritic.com/tv/manifest\">mixed reviews</a>. I knew from the start that it was <a href=\"http://bingeworthy.io/tv/?id=https%3A%2F%2Fwww.metacritic.com%2Ftv%2Fmanifest\">junk</a>, but I watched anyway because sometimes [[Junk TV]] is just right for the moment. You don't have to pay close attention to what's going on. They were trying to make another Lost, which was okay, but they didn't get there. It's just plain garbage. But it was #1 on Netflix last week. I haven't watched a series on Netflix in a long time, I wonder why I pay for it.  ",
            "created": "Wed, 28 Jul 2021 14:48:50 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "An idyllic summer day",
            "created": "Wed, 28 Jul 2021 16:02:09 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "On the <a href=\"https://ashokanrailtrail.com/\">Ashokan Rail Trail</a> yesterday.",
                    "created": "Wed, 28 Jul 2021 16:02:21 GMT",
                    "inlineImage": "http://scripting.com/images/2021/07/28/railTrail.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Frida Kahlo",
            "created": "Wed, 28 Jul 2021 16:07:38 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "<a href=\"https://www.wikiart.org/en/frida-kahlo/portrait-of-luther-burbank-1931\">Portrait of Luther Burbank</a>, 1931.",
                    "created": "Wed, 28 Jul 2021 16:07:42 GMT",
                    "inlineImage": "http://scripting.com/images/2021/07/28/portraitOfLutherBurbank.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}