{
    "text": "Forgive Twitter",
    "created": "Fri, 02 Jun 2017 13:30:29 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I've been hanging out online with a group of Mac influentials, and it's nice, but there's a problem (for me). They don't like Twitter and Facebook, and don't use them, and there's resistence to building tools that connect with them. I think this not a good thing. It bothered me. And then I finally figured out the source of the bother.",
            "created": "Fri, 02 Jun 2017 13:30:34 GMT",
            "permalink": "http://scripting.com/2017/06/02.html#a090634"
        },
        {
            "text": "First, I've asked, and the reason they don't like Twitter is that they fucked over their developers. It's true. I was one of them. I had a sizable base of Twitter software. But I expected it. So when it came I was neither surprised nor unprepared. What prepared me for it so well? The company whose products my friends are devoted to. ",
            "created": "Fri, 02 Jun 2017 13:31:43 GMT",
            "permalink": "http://scripting.com/2017/06/02.html#a090643"
        },
        {
            "text": "Apple taught me very well. There was a day in 1997 or 1998 when Steve Jobs got up on a very small stage in Cupertino and introduced the products that would replace us. It was as thorough a betrayal as ever has been done in the tech world. ",
            "created": "Fri, 02 Jun 2017 13:32:48 GMT",
            "permalink": "http://scripting.com/2017/06/02.html#a090648"
        },
        {
            "text": "Yet today I am writing this on a Mac. I have an iPhone hooked into the Mac, and an iPad charging in the living room. I've bought tens of thousands of dollars of Apple products. I also own a bit of Apple stock, bought in the aftermath of the betrayal. I wanted some upside from all the losses. I still hold the stock today, the profits on paper have been substantial. ",
            "created": "Fri, 02 Jun 2017 13:34:25 GMT",
            "image": "http://scripting.com/images/2017/06/02/twittergram.png",
            "permalink": "http://scripting.com/2017/06/02.html#a090625"
        },
        {
            "text": "I use Apple's products because they work the best for me. After spending a proper amount of time being pissed and being proud of my independence, I realized that I was the loser here, twice. First with the business and creative loss. And second because I had to use malware-infested Windows machines. Once I saw that I could be happy using a Mac, I said fuck it to my refusal and got on board, as a user this time, not a developer.",
            "created": "Fri, 02 Jun 2017 14:29:35 GMT",
            "permalink": "http://scripting.com/2017/06/02.html#a100635"
        },
        {
            "text": "Twitter today is different from the company that was so mean to its developers. That was pre-IPO Twitter. They were desperately trying to get in position to go public. They felt that developers were a problem. They behaved like all tech companies do. Selfish and short-sighted. Lots to not like there. ",
            "created": "Fri, 02 Jun 2017 13:35:40 GMT",
            "permalink": "http://scripting.com/2017/06/02.html#a090640"
        },
        {
            "text": "They <i>can</i> do it again. I assume they will. But for the time-being I am using them, because it makes sense to. ",
            "created": "Fri, 02 Jun 2017 14:14:35 GMT",
            "permalink": "http://scripting.com/2017/06/02.html#a100635"
        },
        {
            "text": "Twitter is also the place where news is distributed. I never believed in Facebook as a news place, but Twitter is a important for news flow. ",
            "created": "Fri, 02 Jun 2017 13:37:21 GMT",
            "permalink": "http://scripting.com/2017/06/02.html#a090621"
        },
        {
            "text": "And I think perhaps we can work with them. In the meantime they operate their servers at scale. The president of the United States uses Twitter. It's a fixture. Using Twitter is like flying United or Delta. You have to do it, no matter how much you don't like it. Imho.",
            "created": "Fri, 02 Jun 2017 13:38:01 GMT",
            "permalink": "http://scripting.com/2017/06/02.html#a090601"
        }
    ],
    "permalink": "http://scripting.com/2017/06/02.html#a090629"
}