{
    "text": "Fight against hell",
    "created": "Fri, 21 Jan 2022 16:52:50 GMT",
    "type": "outline",
    "metaImage": "http://scripting.com/images/2022/01/21/handmaidens.png",
    "description": "The thing that unites us is the hell the Trumpists have in mind for all of us. ",
    "subs": [
        {
            "text": "When people say we're \"fighting for democracy\" even that isn't strong enough.",
            "created": "Fri, 21 Jan 2022 16:53:04 GMT",
            "flInCalendar": true
        },
        {
            "text": "We must fight so we don't become a fascist country with slavery for Blacks, ovens for Jews and women turned into baby-producing handmaidens. And for a human-habitable planet. ",
            "created": "Fri, 21 Jan 2022 16:54:58 GMT",
            "flInCalendar": true
        },
        {
            "text": "If you think that isn't what's happening, well it is.  ",
            "created": "Fri, 21 Jan 2022 16:53:10 GMT",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "This country has never actually revoked slavery. A lot of people are still bitter about the outcome of the Civil War. Blacks are not, according to many Americans, entitled to the full rights of Americans.",
                    "created": "Fri, 21 Jan 2022 16:53:15 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Anti-semitism is also a foundation, not just of America, but most of the world. We heard Trump say that American Jews are really citizens of Israel, which emphatically is not true.",
                    "created": "Fri, 21 Jan 2022 16:53:16 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "And the last one, women as baby-producing handmaidens, that's what overturning Roe v Wade is for.",
                    "created": "Fri, 21 Jan 2022 16:53:21 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "And of course it's not just Blacks, Jews and women, there's a hellish place for every non-white non-male  non-Christian American. ",
                    "created": "Fri, 21 Jan 2022 16:53:29 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "And who knows why they don't want to keep the planet habitable for humans. Maybe they think God meant for them (and not us of course) to migrate to other planets. Whatever it is, it's another form of hell. ",
                    "created": "Fri, 21 Jan 2022 16:53:29 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Yet journalism still mostly sees it as a partisan horse-race and every step we take into the abyss is bad news for one or two people like Biden or Schumer. Their delusion by now is really a form of insanity. Forget about waking them up, we have to move past them. ",
            "created": "Fri, 21 Jan 2022 16:53:35 GMT",
            "flInCalendar": true
        },
        {
            "text": "The thing that unites us is the hell the Trumpists have in mind for all of us. ",
            "created": "Fri, 21 Jan 2022 17:07:17 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}