{
    "text": "January 1",
    "created": "Mon, 01 Jan 2018 15:07:25 GMT",
    "name": "01",
    "subs": [
        {
            "text": "Good morning and welcome to 2018. This should be an interesting year. Lots of decentralization and networking. More diverse voices heard. New tools developed. Less waiting for BigCo's to hear us. A way around the monoculture of journalism? A mind bomb every day. ",
            "created": "Mon, 01 Jan 2018 15:07:26 GMT",
            "type": "tweet",
            "tweetId": "947847390152790016",
            "tweetUserName": "davewiner"
        },
        {
            "text": "The great thing about New Year's Day is thank goodness we don't have to do a holiday season for another 8 months or so.",
            "created": "Mon, 01 Jan 2018 21:09:02 GMT",
            "type": "outline"
        },
        {
            "text": "I love the cold. There's nothing like a long brisk walk in the cold in NYC. For one thing, the streets are pretty empty. And because it's so cold you can really get your engine going and not overheat. I think I must be like some trees, they <a href=\"https://en.wikipedia.org/wiki/Chilling_requirement\">need</a> a hard frost to reset, to feel the time passing. In California, I'd go \"Oh shit another incredibly beautiful day.\" I like nice weather as much as the next guy. But <i>all</i> nice weather? No, not good for Mr Dave.",
            "created": "Mon, 01 Jan 2018 15:13:45 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/01/01/tree.png"
        },
        {
            "text": "<a href=\"https://en.wikipedia.org/wiki/I,_Tonya\">I, Tonya</a> is a very <a href=\"https://www.washingtonpost.com/opinions/i-tonya-and-you-too/2018/01/01/6a1be488-eccd-11e7-9f92-10a2203f6c8d_story.html?utm_term=.45188898edd4\">good</a> movie. Kind of like a Coen Brothers comedy. ",
            "created": "Tue, 02 Jan 2018 02:08:56 GMT",
            "type": "outline"
        },
        {
            "text": "I wrote <a href=\"http://scripting.com/2015/04/03/offenseOnPrinciple.html\">this piece</a> in 2015 about an exchange on my blog in 1994. \"I try not to get offended on principle,\" a friend wrote. Which freed me to write what I see. If we all adopted that value, the net would be a much more usable space.  ",
            "created": "Mon, 01 Jan 2018 15:27:12 GMT",
            "type": "outline"
        },
        {
            "text": "Minority opinions require protection",
            "created": "Mon, 01 Jan 2018 17:28:42 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "One regret I have for 2017 is that I didn't stand up for people who were stating an opinion, just their opinion, not a universal truth that everyone is forced to adopt, and being shouted down, police-state style. ",
                    "created": "Mon, 01 Jan 2018 17:30:32 GMT",
                    "image": "http://scripting.com/images/2018/01/01/bear.png"
                },
                {
                    "text": "The net has empowered people, that's good, but it's not good when it empowers people to silence others. Our system of government in the US is designed to protect minorities. It's true that only applies to the government, but it doesn't make it okay for mobs on the net and supposedly professional journalists to silence people with unpopular opinions. ",
                    "created": "Mon, 01 Jan 2018 17:30:34 GMT"
                },
                {
                    "text": "The mob is always ugly. I have to do better in 2018 at standing with those who are caught in its ire. ",
                    "created": "Mon, 01 Jan 2018 17:30:36 GMT"
                }
            ]
        }
    ]
}