{
    "text": "January 2",
    "created": "Tue, 02 Jan 2018 15:45:30 GMT",
    "name": "02",
    "subs": [
        {
            "text": "If you're tempted by <a href=\"https://www.fastcompany.com/40509751/apples-new-analytics-is-a-good-start-but-podcasts-need-more-data?partner=feedburner&utm_source=feedburner&utm_medium=feed&utm_campaign=feedburner+fastcompany&utm_content=feedburner\">Apple's podcast stats</a>, beware, once you're <a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+%22locked+in+the+trunk%22&t=hf&ia=web\">locked in there</a>, it's going to be hard to get out. Don't give up your independence for stats. \"There is a difference between riding in the car and being stuffed in the trunk,\" said a wise man once.",
            "created": "Wed, 03 Jan 2018 01:44:43 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/01/02/joeMontana.png"
        },
        {
            "text": "As you may know I've been searching for a show to binge, settled on <a href=\"https://en.wikipedia.org/wiki/Travelers_(TV_series)\">Travelers</a>, and I pretty much hate it, in the middle of season 2. It's taking the place of watching Law & Order reruns, a show I can space out while reading on my iPad or thinking about stuff. But in my search for something to involve my mind, I stumbled across Martin Scorcese's <a href=\"https://www.rollingstone.com/music/news/amazon-details-martin-scorseses-grateful-dead-documentary-w461551\">documentary</a> about the Grateful Dead. I got through the first episode, and <i>loved</i> it. And it ended on such a high note. It isn't about creating a massive work to be remembered by, Jerry totally saw through that. Anything you leave behind is bullshit. Just have fun, and you're achieving life's purpose. Made me wish Jerry were running the world instead of the <a href=\"http://scripting.com/images/2018/01/02/theOrangeBlob.png\">orange blob</a> sitting in the Oval.",
            "created": "Tue, 02 Jan 2018 17:25:50 GMT",
            "type": "outline"
        },
        {
            "text": "Twitter needs <a href=\"https://en.wikipedia.org/wiki/Artificial_intelligence\">AI</a> so that all mention of DJT's tweets can be (optionally) filtered out of a user's timeline. I have the president blocked, so I can't see his tweets. I would like to also block tweets about his tweets.",
            "created": "Tue, 02 Jan 2018 15:45:31 GMT",
            "type": "tweet",
            "tweetId": "948218797923688451",
            "tweetUserName": "davewiner"
        },
        {
            "text": "Feedback from a JavaScript user",
            "created": "Tue, 02 Jan 2018 16:30:06 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I've always thought listening to users is a virtue. In that spirit, let me say as a JavaScript developer, who's been doing it pretty much every day for the last five years or so, I've mastered the <a href=\"http://callbackhell.com/\">callback</a> way of writing apps in JS. Now, in the latest version of the language, there are a number of alternatives to this.",
                    "created": "Tue, 02 Jan 2018 16:25:23 GMT",
                    "type": "outline",
                    "image": "http://scripting.com/images/2018/01/02/michaelJordan.png"
                },
                {
                    "text": "One of the advantages of having a <a href=\"http://scripting.com/davenet/1995/08/22/chinesehouseholdrevisited.html#5\">consensus platform</a> like JS is that we all do things the same way. It works just like standards. Two ways of doing something is worse than one, no matter how much better the second way is. That's another way of stating <a href=\"https://en.wikipedia.org/wiki/Robustness_principle\">Postel's Principle</a>. In this case, I already have so much code written using callbacks, and my brain works in callbacks (a bigger hurdle), and I <i>like</i> callbacks. The only reason to use one of the other forms of async programming is that other devs are using them to document their ideas. There goes the consensus. ",
                    "created": "Tue, 02 Jan 2018 16:30:45 GMT"
                },
                {
                    "text": "Agreement in tech is the most precious thing, and designers often <a href=\"https://en.wikipedia.org/wiki/Not_invented_here\">devalue</a> it. The more agreement there is the more leverage we have, and the faster we can move. Remove consensus and we actually take steps backward, which is all too common in software. It makes it difficult to do multi-year or even multi-decade projects. (Not a dream, I have projects I've been working on for multiple decades.)",
                    "created": "Tue, 02 Jan 2018 16:35:43 GMT"
                },
                {
                    "text": "Anyway...",
                    "created": "Tue, 02 Jan 2018 17:12:17 GMT"
                },
                {
                    "text": "I'm having a similar problem with <a href=\"https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Statements/let\">let</a>, but it's somewhat different. In this case <i>let</i> is how <a href=\"https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Statements/var\">var</a> should have always worked. It would make sense to replace <i>var</i> with <i>let</i> everywhere. But if I do that with search and replace, I know some things are going to break, and they're going to be hard to find. There's never going to be a good day to do that. And my brain still uses <i>var.</i> Also I think <i>let</i> should have been called <i>local, </i>to indicate what it does, instead of <i>let</i> which is just a H/T to Basic, as far as I can tell.",
                    "created": "Tue, 02 Jan 2018 16:31:32 GMT"
                },
                {
                    "text": "BTW, as an old Pascal programmer I am a big fan of <a href=\"http://www.gnu-pascal.de/gpc/Constant-Declaration.html\">const</a>. That <a href=\"https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Statements/const\">one</a> is usable without any conundrums. ",
                    "created": "Tue, 02 Jan 2018 16:37:53 GMT"
                },
                {
                    "text": "Anyway, just some feedback from a user of the language.",
                    "created": "Tue, 02 Jan 2018 16:33:07 GMT"
                }
            ]
        }
    ]
}