{
    "text": "January 8",
    "created": "Mon, 08 Jan 2018 14:27:40 GMT",
    "name": "08",
    "subs": [
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/950451313430749184\">Poll</a>: Oprah Winfrey for president?",
            "created": "Mon, 08 Jan 2018 19:39:42 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/950451313430749184"
        },
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=VRiN5XjtjhE&feature=youtu.be\">Quick demo</a> of <a href=\"http://radio3.smallpict.com/2014/09/01/gettingStartedWithRadio3.html\">Radio3</a>, my browser-based linkblogging tool. ",
            "created": "Mon, 08 Jan 2018 19:43:41 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/embed/VRiN5XjtjhE"
        },
        {
            "text": "Oprah for president really is fake news. The press should back off. There is no presidential election coming up any time soon.",
            "created": "Mon, 08 Jan 2018 16:25:32 GMT",
            "type": "outline"
        },
        {
            "text": "I watched the beginning of the Golden Globes, the hubris still fully on display, with added depravity. I bet most of the people there used to kiss up to Harvey Weinstein. The \"joke\" about his death in 20 years seemed to tempt fate. Turned it off. These are not moral leaders.",
            "created": "Mon, 08 Jan 2018 14:42:51 GMT",
            "type": "outline"
        },
        {
            "text": "Something I wrote on Facebook three years ago",
            "created": "Mon, 08 Jan 2018 14:27:41 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I am not a Muslim, so what Muslims believe and what I believe are not the same thing.",
                    "created": "Mon, 08 Jan 2018 14:27:48 GMT"
                },
                {
                    "text": "I think the story of religion as told by the Qoran and the two versions of the Bible are nice stories, but have no basis in reality. They are bedtime stories our ancestors left for us so we wouldn't have to live paralyzed with fear over what dying means.",
                    "created": "Mon, 08 Jan 2018 14:29:04 GMT"
                },
                {
                    "text": "We are all searching for meaning in our lives. My guess is that if we actually knew the answer it would be horribly depressing to our egos. The answer isn't to force your will on other people it's rather to learn to live with uncertainty.",
                    "created": "Mon, 08 Jan 2018 14:29:11 GMT"
                },
                {
                    "text": "We aren't going to die so you can keep believing in the lies your religion tells you. Much better if you let your religion die and join the rest of us and develop a sense of humor about the fact that your life has no meaning.",
                    "created": "Mon, 08 Jan 2018 14:29:15 GMT"
                },
                {
                    "text": "While I wrote this I developed hiccups.",
                    "created": "Mon, 08 Jan 2018 14:29:18 GMT"
                },
                {
                    "text": "I think this is God telling me I'm on the right track.",
                    "created": "Mon, 08 Jan 2018 14:29:21 GMT"
                }
            ]
        }
    ]
}