{
    "text": "January 9",
    "created": "Tue, 09 Jan 2018 14:55:57 GMT",
    "name": "09",
    "subs": [
        {
            "text": "Really interesting \"River5\" bug <a href=\"https://github.com/scripting/river5/issues/14#issuecomment-356401672\">reported</a>. ",
            "created": "Tue, 09 Jan 2018 21:47:29 GMT",
            "type": "outline"
        },
        {
            "text": "Our challenge is to work together",
            "created": "Tue, 09 Jan 2018 21:58:12 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Suppose you expend X effort to get a job done. Further, suppose if you spend another 10% someone else will get the same job done. Another 25% and you leave enough behind so someone else can do the same job in a year, without your help. ",
                    "created": "Tue, 09 Jan 2018 21:57:54 GMT"
                },
                {
                    "text": "Given the challenges we have now, I'd say the value of just working cooperatively eclipses the value of the what you accomplish with the work alone, no matter how important it is. "
                },
                {
                    "text": "Every day I see more evidence that each of us is working for our own individual glory. I'd say that's the biggest problem we have, bigger than climate change, bigger than nuclear armageddon. Because if we can't get past this way of thinking we have no hope of solving the other problems in front of us, because they clearly require massive unprecedented cooperation. ",
                    "created": "Tue, 09 Jan 2018 21:58:24 GMT"
                },
                {
                    "text": "The moral is the story is this -- slow the fuck down and work with other people. Measure your success by the success of others. ",
                    "created": "Tue, 09 Jan 2018 22:00:39 GMT"
                }
            ]
        },
        {
            "text": "We flip flop each time",
            "created": "Tue, 09 Jan 2018 14:55:58 GMT",
            "type": "outline",
            "description": "I've noticed something -- each time we switch presidents we choose someone very different from the one before. ",
            "subs": [
                {
                    "text": "On Twitter, Touré <a href=\"https://twitter.com/Toure/status/950741703958306816\">says</a>: \"I don’t understand why Trump’s failure means we should ban wealthy celebrities from the Presidency.\"",
                    "created": "Tue, 09 Jan 2018 14:58:50 GMT"
                },
                {
                    "text": "To which I <a href=\"https://twitter.com/davewiner/status/950742888438226944\">said</a>: \"Banning is the wrong word. We flip-flop each time. The next one will be boring so we can all get some rest.\"",
                    "created": "Tue, 09 Jan 2018 14:59:48 GMT"
                },
                {
                    "text": "I've noticed something -- each time we switch presidents we choose someone very different from the one before. ",
                    "created": "Tue, 09 Jan 2018 14:57:15 GMT"
                },
                {
                    "text": "In my lifetime here are the switches I've witnessed. ",
                    "created": "Tue, 09 Jan 2018 14:56:03 GMT",
                    "subs": [
                        {
                            "text": "Nixon to Carter to Reagan to Bush I to Clinton to Bush II to Obama to Trump.",
                            "created": "Tue, 09 Jan 2018 14:56:05 GMT"
                        }
                    ]
                },
                {
                    "text": "And how I'd characterize the change.",
                    "created": "Tue, 09 Jan 2018 14:56:50 GMT",
                    "subs": [
                        {
                            "text": "Evil to saint to <a href=\"https://www.youtube.com/watch?v=0CCwxMvXPZo\">actor</a> to bureaucrat to scholar to beer drinker to professor to <a href=\"https://en.wikipedia.org/wiki/Useful_idiot\">idiot</a>.",
                            "created": "Tue, 09 Jan 2018 15:02:10 GMT"
                        }
                    ]
                },
                {
                    "text": "Yes I know I left out Ford, but we didn't choose him, Nixon did. ",
                    "created": "Tue, 09 Jan 2018 14:57:35 GMT"
                },
                {
                    "text": "According to this theory the Dems should nominate a former librarian to oppose Trump in 2020, if he makes it that far. ",
                    "created": "Tue, 09 Jan 2018 15:08:16 GMT"
                },
                {
                    "text": "Also, if we're going to have another celebrity president, have them run for governor first, and serve, and let's find out if they can do the job. Let <i>them</i> find out too.",
                    "created": "Tue, 09 Jan 2018 15:03:33 GMT"
                }
            ]
        }
    ]
}