{
    "text": "January 10",
    "created": "Wed, 10 Jan 2018 14:48:00 GMT",
    "name": "10",
    "subs": [
        {
            "text": "New truce with Facebook. Every day I try to write something with no links or style so I can post it to Facebook. I also post it to Twitter via <a href=\"http://pork.io/\">pork.io</a>.",
            "created": "Wed, 10 Jan 2018 15:19:02 GMT",
            "type": "outline"
        },
        {
            "text": "I got a <a href=\"https://github.com/scripting/Scripting-News/issues/58\">Chrome deprecation message</a> in the JavaScript console when I post HTML in some new software I'm working on. Encoding it fixed it. ",
            "created": "Wed, 10 Jan 2018 18:15:44 GMT",
            "type": "outline"
        },
        {
            "text": "I'd like to have a personal social net that's coffee house size. Play a few tunes, have a couple of drinks, tell a few stories, and come back tomorrow and the night after that. There's a bouncer at the door so if you come in all nasty and shit, we kick your ass out.",
            "created": "Wed, 10 Jan 2018 15:22:42 GMT",
            "type": "outline"
        },
        {
            "text": "I saw <a href=\"https://en.wikipedia.org/wiki/Three_Billboards_Outside_Ebbing,_Missouri\">Three Billboards Outside Ebbing, Missouri</a> yesterday. I really liked it. The best acting. A bunch of sad stories, told with humor. You know it has to be good cause Frances McDormand is in it. Like <a href=\"https://en.wikipedia.org/wiki/I,_Tonya\">I, Tonya</a> and <a href=\"https://en.wikipedia.org/wiki/Lady_Bird_(film)\">Lady Bird</a>, two other movies I've seen in the last few days, it's a story of a mother suffering for a daughter. All beautiful movies. The thing that makes a movie great, as always, is suspension of disbelief. If you get into the story, the movie is good. If you are still in the story the next day, it's great.",
            "created": "Wed, 10 Jan 2018 15:13:35 GMT",
            "type": "outline"
        },
        {
            "text": "In human relations there are no absolute truths, just points of view. That's why when someone says someone else is <a href=\"https://english.stackexchange.com/questions/177444/whats-the-metaphorical-meaning-of-tone-deaf\">tone deaf</a> -- the person who's doing the saying is the one who's out of tune. Further, if you're trying to rep a cause, you'd better do a lot of listening, or you won't do much persuading. No one wants to be proven wrong, and if that's what you're selling you're not going to be heard much. This is what my grandfather said to me as a very young person, he called it the art of living. I remember the words, even if I didn't understand the idea. Now I do. It's the thing life teaches you. Listen. ",
            "created": "Wed, 10 Jan 2018 14:48:01 GMT",
            "type": "outline"
        },
        {
            "text": "Who knew some people didn't like <a href=\"https://www.medicalnewstoday.com/articles/277627.php\">cilantro</a>? Personally, I really like the stuff. But if it tasted like death, as Julia Child <a href=\"http://mentalfloss.com/article/93008/julia-childs-lifehack-dealing-cilantro\">said</a>, well I wouldn't like it either. This is one area where I got good <a href=\"https://www.huffingtonpost.com/2015/06/24/why-does-cilantro-taste-bad-like-soap_n_7653808.html\">genes</a>. ",
            "created": "Wed, 10 Jan 2018 14:52:36 GMT",
            "type": "outline"
        },
        {
            "text": "A few weeks in and I love my <a href=\"http://scripting.com/2017/12/20.html#a173129\">Sony headphones</a> more and more. The great thing about them is they are so easy to wear. I gather most high end headphones put weight on your neck that's hard to bear. Not with the Sony's. I also bought a fancy pair of Bowers & Wilkins headphones. They sound great, but they don't wear so well. For one thing, they lose the connection to the iPhone too often, leaving me stranded on the street fumbling with Bluetooth, feeling like an idiot. Never happens with the Sony's. They seem to have the Bluetooth thing down. And the sound! It's so luxurious. For all kinds of music, even for listening to a podcast. If you listen a lot and can afford an upgrade, these is a seriously nice headset. ",
            "created": "Wed, 10 Jan 2018 14:53:27 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/12/20/sonyHeadphones.png"
        },
        {
            "text": "<a href=\"https://www.azlyrics.com/lyrics/bonnieraitt/everybodyscryinmercy.html\">Everybody's</a> crying mercy when they don't know the meaning of the word. ",
            "created": "Wed, 10 Jan 2018 14:57:48 GMT",
            "type": "outline"
        },
        {
            "text": "My unHappy iPhone",
            "created": "Wed, 10 Jan 2018 16:44:43 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "My iPhone is complaining about how I'm almost out of space. it says I can get more space by letting it upload all my photos to iCloud. The phone needs some AI because I deleted all my photos in an attempt to get rid of the message (copying them to a local 5TB disk, no I don't need your storage Apple).",
                    "created": "Wed, 10 Jan 2018 16:44:54 GMT"
                },
                {
                    "text": "I wish my iPhone had a button that I could click that would say -- delete all the shit that I never use or listen to or watch to free up 1/2 the space on the phone."
                },
                {
                    "text": "It seems the computer would be better at this than I am. I can't find all the shit I never use or listen to or watch. That's probably why I never use it, listen to it or watch it. ;-)",
                    "created": "Wed, 10 Jan 2018 16:45:35 GMT"
                }
            ]
        }
    ]
}