{
    "text": "January 12",
    "created": "Fri, 12 Jan 2018 13:53:15 GMT",
    "name": "12",
    "subs": [
        {
            "text": "President Shithole <a href=\"https://twitter.com/davewiner/status/951924990601031682\">goes</a> for his physical.",
            "created": "Fri, 12 Jan 2018 21:45:08 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/951924990601031682"
        },
        {
            "text": "\"XML-RPC\" started in 1998, which means it's about to be 20 years old. I think this is the first <a href=\"http://scripting.com/davenet/1998/02/27/rpcOverHttpViaXml.html#5\">post</a> about it. Not very specific. We were already working on it, but we hadn't yet hooked up with the people at Microsoft. From a quick scan it looks like the actual protocol we standardized on didn't come out publicly until June. Pretty sure we had something working internally at UserLand in March or April.",
            "created": "Fri, 12 Jan 2018 19:19:45 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/XMLRPCMAN.gif"
        },
        {
            "text": "Ooops. We missed the 20th anniversary of \"RSS\". The format that became RSS was rolled out in December 1997. Here's the <a href=\"http://scripting.com/davenet/1997/12/15/scriptingNewsInXML.html\">piece</a> where that was announced. I guess we missed the party. Open formats don't have PR firms. :boom:",
            "created": "Fri, 12 Jan 2018 19:27:39 GMT",
            "type": "outline"
        },
        {
            "text": "It's really weird, the date on the <a href=\"http://scripting.com/davenet/1997/12/15/scriptingNewsInXML.html\">piece</a> is wrong. It was December 27, not December 15. You can see that in the copy, it talks about being between Christmas and New Years. And mentions a <a href=\"http://scripting.com/davenet/1997/12/23/newGlasses.html\">piece</a> that wasn't written until December 23. And I actually remember that this was on the 27th. Somehow, at some point, my CMS screwed this up. Which is weird because this is a static file. Looks like it was rebuilt some time in 2004. In any case if anyone wonders, the date is incorrect. ",
            "created": "Fri, 12 Jan 2018 19:40:16 GMT",
            "type": "outline"
        },
        {
            "text": "An unusually long <a href=\"http://scripting.com/2018/01/12/occamAndWolff.m4a\">podcast</a> about Occam, Wolff, war, medicine, programming, debugging, hacking, Russia, war again, Pearl Harbor, Hiroshima, Nagasaki, Watergate, Buzzfeed News, Ben Smith, the dossier, ladders, the elite, working together, and the day it hits us that this is not Watergate, will be another day like <a href=\"https://en.wikipedia.org/wiki/United_States_presidential_election,_2016\">November 8, 2016</a>. The gatekeepers, the elite, don't want to give up their positions on the ladder, so ideas that threaten that can't get through. Instead we have to be <i>systematic</i> about letting ideas in. There's a lot of tough love in here, but it's important.",
            "created": "Fri, 12 Jan 2018 16:28:42 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2018/01/12/occamAndWolff.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "9088754",
            "image": "http://scripting.com/2016/10/19/fatcat.png"
        },
        {
            "text": "I was out walking in the morning rush hour in Manhattan, everyone looks so nice. I <a href=\"https://twitter.com/davewiner/status/951814209926508544\">wondered</a>, since #metoo has the world been treating attractive women better? Has cat-calling diminished? Leery looks? Inappropriate comments? ",
            "created": "Fri, 12 Jan 2018 13:53:16 GMT",
            "type": "outline"
        },
        {
            "text": "Wolff is Occam's News",
            "created": "Fri, 12 Jan 2018 15:05:47 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I've been <a href=\"https://www.google.com/search?safe=off&q=site%3Ascripting.com+occam\">pushing</a> the idea of Occam's News, where we talk about what's obvious not what we can prove. <a href=\"https://en.wikipedia.org/wiki/Michael_Wolff_(journalist)\">Michael Wolff's</a> approach is exactly that. It's not what you can prove, but it's what we know anyway. Both this and proof-based news are valid and needed.",
                    "created": "Fri, 12 Jan 2018 15:05:52 GMT"
                },
                {
                    "text": "Wars are fought with Occam's spy info, and guesswork about what the enemy is doing, and trying to figure out what's a decoy and what's real.",
                    "created": "Fri, 12 Jan 2018 15:06:27 GMT"
                },
                {
                    "text": "Also medicine. Sometimes they don't know what disease you have and they just start treating the one they think you might have and see if it works.",
                    "created": "Fri, 12 Jan 2018 15:07:37 GMT"
                },
                {
                    "text": "Programming, what I do, is most definitely not Occam-like, it's proof-based. But debugging is very much an Occam art.",
                    "created": "Fri, 12 Jan 2018 15:06:34 GMT"
                }
            ]
        },
        {
            "text": "MTP Daily is the worst cable show ",
            "created": "Fri, 12 Jan 2018 14:05:54 GMT",
            "type": "outline",
            "flDisqusComments": "true",
            "description": "There was a time, believe it or not, when both parties elected people who were fairly competent.",
            "subs": [
                {
                    "text": "I watched <a href=\"http://www.msnbc.com/mtp-daily\">MTP Daily</a> yesterday. For a few minutes, and then went back to work. It's an awful awful show. The worst of the worst. ",
                    "created": "Fri, 12 Jan 2018 14:18:43 GMT"
                },
                {
                    "text": "I hate the show because <a href=\"https://en.wikipedia.org/wiki/Chuck_Todd\">Chuck Todd</a> only talks about the horse race. I swear, the day after the 2016 election he was already talking about how people were \"positioned\" for 2020. This kind of analysis never means anything. Go back and listen to the talk about the 2016 election <a href=\"https://www.youtube.com/watch?v=FHkPadFK34o\">in 2015</a> for a clue.",
                    "created": "Fri, 12 Jan 2018 14:10:22 GMT",
                    "urlvideo": "https://www.youtube.com/embed/FHkPadFK34o"
                },
                {
                    "text": "And they don't even think about elections in a realistic way. Yesterday they were talking about how the Dems failed to sell competence last time (Hillary), so they probably shouldn't try that again. I wonder if they listen to themselves. There was a time, believe it or not, when both parties nominated people who were fairly competent. Even Ronald Reagan, who people thought was a joke, had served as governor of California before becoming president. ",
                    "created": "Fri, 12 Jan 2018 14:10:58 GMT"
                },
                {
                    "text": "Anyway, assuming competence is an attribute like hair color or gender, height or whatever, the next election is <i>exactly</i> the time to be selling competence. Why? Because the electorate <a href=\"http://scripting.com/2018/01/09/145558.html\">flip flops</a>. We always elect the opposite of what we elected last time.",
                    "created": "Fri, 12 Jan 2018 14:12:14 GMT"
                },
                {
                    "text": "For example, we elected Trump to follow Obama. ",
                    "created": "Fri, 12 Jan 2018 14:08:42 GMT",
                    "flNumberedSubs": "true",
                    "subs": [
                        {
                            "text": "Obama is black and Trump is a racist.",
                            "created": "Fri, 12 Jan 2018 14:12:41 GMT"
                        },
                        {
                            "text": "Trump throws tantrums and Obama's nickname is \"No Drama.\"",
                            "created": "Fri, 12 Jan 2018 14:12:50 GMT"
                        },
                        {
                            "text": "Trump is a complete idiot, drooling at the mouth, and Obama has a law degree, is a professor, a total technocrat who probably aced every test he took. Trump probably bought his grades with money or blackmail (probably blackmail).",
                            "created": "Fri, 12 Jan 2018 14:13:09 GMT"
                        }
                    ]
                },
                {
                    "text": "Extrapolating, the next president will probably be a woman, obviously -- but bland and reliable, not too old, known for listening and studious, even pious, and not rich. And <i>not</i> a celebrity.  ",
                    "created": "Fri, 12 Jan 2018 14:12:38 GMT"
                },
                {
                    "text": "Although I don't know much about her, I would take a good look at <a href=\"https://en.wikipedia.org/wiki/Amy_Klobuchar\">Amy Klobuchar</a> from Minnesota. She's intelligent, passionate, confident, speaks well, has a sense of humor, is well-educated, young but not too young, thoughtful, and has the right values to start to undo the damage done by Repubs during the reign of Trump.",
                    "created": "Fri, 12 Jan 2018 14:16:13 GMT"
                },
                {
                    "text": "Why not <a href=\"https://en.wikipedia.org/wiki/Kirsten_Gillibrand\">Kirsten Gillibrand</a>? She has many of the same qualities as Klobuchar, but she's from New York. I come from NY too, but I don't think our president should. NY is our largest city, but it's actually a pretty small place. Trump stood out in NY, but we're seeing how that doesn't work globally. But even if it's great to have a president from NY, remember we flip-flop, and I'd say the odds of two consecutive presidents from NY is pretty slim. ",
                    "created": "Fri, 12 Jan 2018 14:20:11 GMT"
                },
                {
                    "text": "Anyway, as you can see, there are some interesting things to think about for 2020, even though it's so far away. Of course they discussed none of this on MTP Daily yesterday.",
                    "created": "Fri, 12 Jan 2018 14:23:02 GMT"
                },
                {
                    "text": "PS: You want a courageous Democratic ticket? Klobuchar for president with <a href=\"https://en.wikipedia.org/wiki/Keith_Ellison\">Keith Ellison</a> as VP. Unlike most Democrats these two can complete a sentence without sounding like an idiot. Both from Minnesota, btw, but look at how different they are. They say to white men who vote Trump, fuck you -- you had your chance, this is the way things look now. Get a pair, growth the fuck up and let's really start winning. ",
                    "created": "Fri, 12 Jan 2018 14:35:02 GMT"
                }
            ]
        },
        {
            "text": "I have no idea what Facebook announced",
            "created": "Fri, 12 Jan 2018 13:53:38 GMT",
            "type": "outline",
            "description": "Since the Algorithm is proprietary, I don't know what it did before that was so different.",
            "subs": [
                {
                    "text": "They announced <a href=\"https://www.techmeme.com/180111/p25#a180111p25\">something</a>. ",
                    "created": "Fri, 12 Jan 2018 13:58:20 GMT"
                },
                {
                    "text": "What this all means, I have no freaking clue.",
                    "created": "Fri, 12 Jan 2018 13:59:50 GMT"
                },
                {
                    "text": "Since the Algorithm is proprietary, I don't know what it did before that was so different. I gather they're <a href=\"https://duckduckgo.com/?q=define+renege&t=hf&ia=definition\">reneging</a> on their deal with professional journalism? ",
                    "created": "Fri, 12 Jan 2018 13:55:27 GMT"
                },
                {
                    "text": "I always thought friends had huge influence over what I see in the timeline.",
                    "created": "Fri, 12 Jan 2018 13:57:57 GMT"
                },
                {
                    "text": "And won't Putin still be able to buy ads to fuel the virality of his mischief?",
                    "created": "Fri, 12 Jan 2018 13:58:07 GMT"
                }
            ]
        }
    ]
}