{
    "text": "January 18",
    "created": "Thu, 18 Jan 2018 14:16:02 GMT",
    "name": "18",
    "subs": [
        {
            "text": "There was an outage on <a href=\"http://scripting.com/\">scripting.com</a> earlier today. I let a domain expire, thinking it wasn't in use. Haha. Okay. I renewed it. It seems to be resolving here, so the outage should be over. Sorry. I'll be more careful in the future. :rocket:",
            "created": "Thu, 18 Jan 2018 18:32:00 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/01/18/travis.png"
        },
        {
            "text": "Journalists <a href=\"https://twitter.com/unclegrambo/status/954010704490713088\">still think</a> they were/are bloggers. Reporters using blogging tools is not blogging. Bloggers are reporters' sources. <a href=\"https://www.newyorker.com/culture/cultural-comment/the-end-of-the-awl-and-the-vanishing-of-freedom-and-fun-from-the-internet\">They say</a> blogging is over because their professional CMSes caught up? They're in a <a href=\"https://en.wikipedia.org/wiki/Reality_distortion_field\">bubble</a>. A profession that should be <i>good</i> at listening only actually listens to itself. ",
            "created": "Thu, 18 Jan 2018 20:02:03 GMT",
            "type": "outline"
        },
        {
            "text": "Much of what I read in #metoo writing paints men solely as women haters. That's all there is to say about us. Your father, brother, son, uncle, cousin, friends, we only exist to hate women. That of course is not true. I think what we all want, men and women, is to relax, to be loved, to feel safe, pleasure, acceptance, and secure for the moment. That's imho most of what we're looking for in love. No specific gender.",
            "created": "Thu, 18 Jan 2018 20:18:44 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/embed/t9a1JQi7G3k"
        },
        {
            "text": "<a href=\"https://github.com/scripting/feedsForJournalists/issues/3#issuecomment-358664338\">Update</a> on the \"Feeds for Journalists\" project. \"The current list doesn't have much meta-news or news-about-news. It's mostly just plain news. I am totally in favor of adding Canadian feeds, but for news orgs that are producing news about Canada, and news from a Canadian perspective.\"",
            "created": "Thu, 18 Jan 2018 15:24:01 GMT",
            "type": "outline"
        },
        {
            "text": "I support the NYT <a href=\"https://www.poynter.org/news/new-york-times-morphs-welcome-wagon-trump-supporters\">turning over</a> its editorial page to Trump voters. But we keep hearing from them. How about Clinton voters next. And black voters. And people who didn't vote. And so on. Let's hear more from people outside the elite bubble.",
            "created": "Thu, 18 Jan 2018 14:16:03 GMT",
            "type": "outline"
        },
        {
            "text": "Where you see Americans trashing each other online, use your imagination. How are trolls, some Russian, some from elsewhere, instigating to make it worse, increase the hurt, damage, deepen the division, make it more permanent?",
            "created": "Thu, 18 Jan 2018 14:17:29 GMT",
            "type": "outline"
        },
        {
            "text": "Little wrecked ecosystems",
            "created": "Thu, 18 Jan 2018 15:25:57 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "<a href=\"https://twitter.com/davewiner/status/954004529292480512\">With</a> Google Reader shutting down and Facebook pulling out of news, and now HuffPost withdrawing, I feel great. Vindicated. Optimistic once again.",
                    "created": "Thu, 18 Jan 2018 15:26:06 GMT"
                },
                {
                    "text": "There is no magic to platforms. Corporate platforms always end up as puddles. Little wrecked ecosystems that started with great bluster. ",
                    "created": "Thu, 18 Jan 2018 15:29:31 GMT"
                },
                {
                    "text": "The only platforms worth developing for are ones without a platform vendor. That is, open platforms based on open formats and protocols.",
                    "created": "Thu, 18 Jan 2018 15:38:44 GMT"
                },
                {
                    "text": "I was <a href=\"https://twitter.com/ericmbudd/status/954004936500551681\">asked</a> why Google Reader is on my list. ",
                    "created": "Thu, 18 Jan 2018 15:38:45 GMT",
                    "subs": [
                        {
                            "text": "They didn't support all of RSS, so blogging became limited to what Google Reader understood. And then they just threw it all out, like a massive oil spill, and did nothing to clean it up. In the end it would have been better if it never existed.",
                            "created": "Thu, 18 Jan 2018 15:38:56 GMT"
                        }
                    ]
                }
            ]
        },
        {
            "text": "Goodbye Huffington Post",
            "created": "Thu, 18 Jan 2018 14:50:04 GMT",
            "subs": [
                {
                    "text": "I tried writing at Huffington Post, many years ago, hoping to get more flow. When I finally got a hot story on HP, here's what they did.",
                    "created": "Thu, 18 Jan 2018 14:50:10 GMT",
                    "flNumberedSubs": "true",
                    "subs": [
                        {
                            "text": "Rewrote it.",
                            "created": "Thu, 18 Jan 2018 14:53:20 GMT"
                        },
                        {
                            "text": "Redirected traffic from my page to theirs.",
                            "created": "Thu, 18 Jan 2018 14:53:20 GMT"
                        }
                    ]
                },
                {
                    "text": "That's when the great experiment ended. :boom:",
                    "created": "Thu, 18 Jan 2018 14:50:30 GMT"
                }
            ]
        }
    ]
}