{
    "text": "January 24",
    "created": "Wed, 24 Jan 2018 15:09:42 GMT",
    "name": "24",
    "subs": [
        {
            "text": "This is a <a href=\"https://www.vox.com/first-person/2018/1/24/16925444/aziz-ansari-me-too-feminism-consent\">good story</a> to think about re #metoo and what's consensual and not. I have reservations about the piece, but am glad both people are anonymous. I applaud Vox for taking this approach. ",
            "created": "Wed, 24 Jan 2018 16:06:22 GMT",
            "type": "outline"
        },
        {
            "text": "Once a year I accidentally make a pot of excellent coffee. Today is that day for 2018.",
            "created": "Wed, 24 Jan 2018 15:09:43 GMT",
            "type": "tweet",
            "tweetId": "956182298411626496",
            "tweetUserName": "davewiner"
        },
        {
            "text": "Another thing, if enough people use the open web, not very many, we'll be able to boot up more open stuff like blogging, podcasting and RSS. All that stopped because y'all are using silos now, and that cuts off innovation.",
            "created": "Wed, 24 Jan 2018 15:10:42 GMT",
            "type": "outline"
        },
        {
            "text": "I went to Davos one year, in 2000. Didn't get invited back, but that was no surprise because the invite itself was a fluke. I wondered if I would go now if I were invited, and unless there were something specific I wanted to do with all those super rich people and their employees, and that seems pretty unlikely, I don't think I would go. It was worth going once. That's for sure. So I have a picture of all the things they talk about from there. And after a couple of days I unfollow all the people who live-tweet it. Enough with the star-fucking, ok.",
            "created": "Wed, 24 Jan 2018 15:33:05 GMT",
            "type": "outline"
        },
        {
            "text": "On the other hand I would love to go to a creative summit of unknown people who just wanted to jam. The people have to be great, but not famous, otherwise all you see is star-preening and star-fucking. As at Davos.",
            "created": "Wed, 24 Jan 2018 15:36:26 GMT",
            "type": "outline"
        },
        {
            "text": "I <a href=\"http://scripting.com/2017/11/09.html#a025848\">wrote</a> recently about being invited to a new media thing in Moscow in 2011. I was puzzled as to why I was invited, but I think I just figured out it must have been somehow connected to my one Davos visit. I hung out with a bunch of Russian reporters for one lunch. That might have been the connection. ",
            "created": "Wed, 24 Jan 2018 15:37:44 GMT",
            "type": "outline"
        },
        {
            "text": "Blogging is thinking aloud into an outliner that has a <i>Publish</i> button on it.",
            "created": "Wed, 24 Jan 2018 15:40:08 GMT",
            "type": "outline"
        },
        {
            "text": "I've now seen most of the Best Picture Oscar-nominated films. I haven't seen <a href=\"https://en.wikipedia.org/wiki/Get_Out\">Get Out</a> and <a href=\"https://en.wikipedia.org/wiki/Phantom_Thread\">Phantom Thread</a> yet. The only one I didn't like is <a href=\"https://en.wikipedia.org/wiki/The_Post_(film)\">The Post</a>. I just saw <a href=\"https://en.wikipedia.org/wiki/The_Florida_Project\">The Florida Project</a>. Beautiful movie. The kind of movie that I admire, even adore, for having a small plot but still holding my interest. The characters, the acting, the presentation are all so skillful and compelling that you fall into the movie and don't want to leave. Suspension of disbelief. Story-telling. I saw someone ask why you people like <a href=\"https://en.wikipedia.org/wiki/The_Shape_of_Water_(film)\">The Shape of Water</a> (they didn't, I did). I answer it with a question: Are you pulled into the story. If so, it's good. That's all there is to it. I can certainly see how one might not be pulled into the movie. That was the problem with The Post. It has all the best actors. It's shot perfectly. But none of it meant anything to me. I was waiting to be in the movie, and it never happened. ",
            "created": "Wed, 24 Jan 2018 15:40:49 GMT",
            "type": "outline"
        },
        {
            "text": "One more thing, I say this all the time, the same is true of software. If you forget you're using the software and your focus is on what's in your mind, the software is good. I saw this <a href=\"https://spectrum.ieee.org/video/geek-life/profiles/ted-nelson-on-what-modern-programmers-can-learn-from-the-past\">video</a> by Ted Nelson where he says software is art. As with a movie, the goal is to get out of your way and let you forget it's software. Same with painting and music. You go into yourself. You create your own story from mine.",
            "created": "Wed, 24 Jan 2018 15:53:44 GMT",
            "type": "outline"
        }
    ]
}