{
    "text": "January 29",
    "created": "Mon, 29 Jan 2018 15:01:18 GMT",
    "name": "29",
    "subs": [
        {
            "text": "Today the header graphic changed from <a href=\"http://scripting.com/images/2018/01/14/mlkAtRally.png\">MLK</a> to <a href=\"http://scripting.com/images/2018/01/29/hedyLamarr.png\">HL</a>.",
            "created": "Mon, 29 Jan 2018 17:07:56 GMT",
            "type": "outline"
        },
        {
            "text": "Hedy Lamarr",
            "created": "Mon, 29 Jan 2018 15:01:19 GMT",
            "type": "outline",
            "description": "The world doesn't accept that a person can have two gifts. You can't be a mind and a beauty.",
            "subs": [
                {
                    "text": "Over the weekend I saw the <a href=\"https://www.nytimes.com/2017/11/23/movies/bombshell-the-hedy-lamarr-story-review-.html\">documentary</a> about the life of Hedy Lamarr. A few observations. First, as advertised, she was perfectly beautiful. The kind of beauty that makes you think, viscerally, here is the most beautiful person. And daring, outspoken, brash, brilliant, creative, loved herself, and moved in the world with confidence. She had a mind. And the world doesn't accept that a person can have two gifts. You can't be a mind <i>and</i> a beauty.  ",
                    "created": "Mon, 29 Jan 2018 15:01:23 GMT",
                    "image": "http://scripting.com/images/2018/01/29/bombshell.png",
                    "subs": [
                        {
                            "text": "Watching this movie and the heroic and tragic life she led, made me look at parallels in my own life. It's why her story has so much to offer practically everyone, because people are much more complex than the stories the world tells about us. ",
                            "created": "Mon, 29 Jan 2018 15:28:53 GMT"
                        }
                    ]
                },
                {
                    "text": "Also, I finally understand her invention. You can encrypt communication by changing frequency at seemingly random times. Both the sender and the receiver know which frequency to tune to at any time, but the enemy doesn't. She thought of using something like a <a href=\"https://en.wikipedia.org/wiki/Piano_roll\">player piano roll</a> to coordinate the two. This method, which she got a <a href=\"https://www.google.com/patents/US2292387\">patent</a> for, is the basis for wifi, cell phones and Bluetooth. ",
                    "created": "Mon, 29 Jan 2018 15:06:17 GMT"
                },
                {
                    "text": "Her contribution was controversial at first, but in the early 90s, when she was still alive, she got credit and accolades. A somewhat happy ending, but because by that time she had had so much cosmetic surgery that her looks were ruined and she seldom went out, her son accepted the award for her. ",
                    "created": "Mon, 29 Jan 2018 15:29:48 GMT"
                },
                {
                    "text": "A personal note. I grew up believing we are related. It was something like <a href=\"https://www.factcheck.org/2017/12/elizabeth-warrens-pocahontas-controversy/\">Elizabeth Warren's story</a> about having Native American blood. Everyone said we were related, so I accepted it. Now I'm not sure. Her real name was <a href=\"https://en.wikipedia.org/wiki/Hedy_Lamarr\">Hedy Kiesler</a>. My grandfather's name was Rudy Kiesler. They appear to have been of the same generation, they were around the same age. My grandfather was deported from Germany around the same time she left, and emigrated to the US. She went to Hollywood. My grandfather had 12 siblings, so it was a huge family. Perhaps Kiesler was a common last name in Germany and Austria. Maybe someday we'll find out. ",
                    "created": "Mon, 29 Jan 2018 15:10:18 GMT"
                }
            ]
        }
    ]
}