{
    "text": "January 31",
    "created": "Wed, 31 Jan 2018 05:13:40 GMT",
    "name": "31",
    "subs": [
        {
            "text": "I knew podcasting was for real when I heard back from listeners who were surprised that's what my voice sounds like.",
            "created": "Wed, 31 Jan 2018 22:33:57 GMT",
            "type": "outline"
        },
        {
            "text": "I wish I had a time machine so I could travel to the future and read the history books to find out why all the Repub congresspeople retired back in 2018.",
            "created": "Wed, 31 Jan 2018 22:12:32 GMT",
            "type": "outline"
        },
        {
            "text": "It occurred to me after reading <a href=\"https://twitter.com/normative/status/958402142225739776?ref_src=twsrc%5Etfw&ref_url=https%3A%2F%2Ftalkingpointsmemo.com%2Fprime-beta%2Ftrump-is-explicit-why-not-believe-him\">this thread</a> on Twitter, that I'd like to start learning what it's like to be a blogger/pundit and computer programmer in Putin's Russia. Pretty good chance that's where we're going in the USA. Let's get it out now, in the form of a book, before they've completely locked down the press, and get it out in print, so it survives after the rule of law is gone. We can do a lot at this point to help ourselves on the \"other side.\" Listen to Trump. He wants to control speech. He's probably figured out how to get there. 2017 was a year of learning for him. Now he understands what he's up against. ",
            "created": "Wed, 31 Jan 2018 21:47:36 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/07/11/clock.png"
        },
        {
            "text": "Changed my <a href=\"http://scripting.com/images/2018/01/31/twitterMotto.png\">Twitter motto</a> to -- \"Blogging is thinking aloud into an outliner that has a Publish button on it.\" It was previously \"I've been blogging as long as there's been blogging.\"",
            "created": "Wed, 31 Jan 2018 20:02:04 GMT",
            "type": "outline"
        },
        {
            "text": "Light blogging the last few days. I'm head-down on a new piece of software, it's taking most of my attention. ",
            "created": "Wed, 31 Jan 2018 20:00:27 GMT",
            "type": "outline"
        },
        {
            "text": "Every blog should have a <i>Subscribe</i> button. In an open ecosystem this is a problem, a problem that silos don't have. Which is the advantage Twitter (a silo) has over the open web.",
            "created": "Wed, 31 Jan 2018 05:13:41 GMT",
            "type": "outline"
        }
    ]
}