{
    "text": "A thread re NYT and the tech web",
    "created": "Sat, 10 Apr 2021 16:17:55 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "<i>A <a href=\"https://twitter.com/davewiner/status/1380915375383138311\">thread</a> from my Twitter account..</i>",
            "created": "Sat, 10 Apr 2021 16:21:03 GMT",
            "flInCalendar": true
        },
        {
            "text": "I was having a discussion with <a href=\"https://twitter.com/TaylorLorenz\">Taylor Lorenz</a> about the difference between online media brought to us by the tech industry, and the world of the NYT and other journalism orgs. Here's a concise version.",
            "created": "Sat, 10 Apr 2021 16:18:08 GMT",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "The NYT et al present packaged stories and opinion. The presenters are vetted, conform to standards that are understood, but not well documented. (This is all my opinion btw.)",
                    "created": "Sat, 10 Apr 2021 16:18:36 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The online tech media presents largely unpackaged stories, with little or no vetting, and the standards are hard to implement because the systems are so vast.",
                    "created": "Sat, 10 Apr 2021 16:18:37 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "They're opposites. Night and day. And in conflict, but imho they need not be. ",
            "flInCalendar": true
        },
        {
            "text": "I've long felt we need hybrids. Probably unknown to most people at the NYT, there was a time, between 2002 and 2005, or so -- when I personally worked with them on this stuff. So I had a strong opinion about what they should do. They did half of what I asked, and that was pretty bold, and very successful. ",
            "created": "Sat, 10 Apr 2021 16:19:04 GMT",
            "flInCalendar": true
        },
        {
            "text": "The other half they didn't do. It would have brought a lot more voices into the NYT, but they would have been vetted, by the reporters of the NYT, simply by quoting them in a NYT piece. So they couldn't avoid the vetting if their stories had sources. And the thought was that anyone who is a source for the NYT is worth listening to and could use a platform. ",
            "flInCalendar": true
        },
        {
            "text": "What would have come out of it is something like what Substack is today. ",
            "flInCalendar": true
        },
        {
            "text": "It's hard to know how that experiment would have turned out, but I believed in the idea. Unfortunately it was immediately turned down. ",
            "flInCalendar": true
        },
        {
            "text": "My main contact at the NYT at the time was Martin Nisenholtz, so you can confirm this with him if you like. The first half of the deal resulted in the RSS standard for distributing news. Another little-known fact, imho RSS would have failed without the support from the NYT. Their trust in my small company was amazing, and we took good care of their brand and rep in the wild world of the web. This was in 2002. ",
            "created": "Sat, 10 Apr 2021 16:43:10 GMT",
            "flInCalendar": true
        },
        {
            "text": "PS: There's also the <a href=\"http://scripting.com/2001/01.html\">story</a> of how we found the cache of NYT syndicated content. That's what led to the deal we made a year later for RSS. ",
            "created": "Sat, 10 Apr 2021 16:43:11 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}