{
    "text": "Thoughts about political thinking",
    "created": "Mon, 29 May 2017 14:56:42 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "David Frum <a href=\"http://www.mediaite.com/tv/david-frum-trump-teams-russian-contacts-not-a-crime-but-a-loyalty-issue/\">says</a> rightly we need to think in terms of what we know not necessarily what is a crime. If we know our president thinks and acts like a Russian, we can't overlook that even if it isn't a crime. Think about the criteria you would use when deciding to fire or break up with someone. They don't have to have committed a crime for you to do either. ",
            "created": "Mon, 29 May 2017 14:56:51 GMT",
            "image": "http://scripting.com/images/2017/05/29/wonderWoman.png",
            "permalink": "http://scripting.com/2017/05/29.html#a100551"
        },
        {
            "text": "Another thought. Political groups and businesses use positioning to divide us into segments. Sometimes this is relatively harmless, as in positioning a product as appealing to <a href=\"https://www.secret.com/en-us\">women</a> or <a href=\"https://www.youtube.com/watch?v=NcGhLcVqxf0\">upper middle class</a> people. But when it segments us on racial lines, or appeals to hate, then it is something to call out. ",
            "created": "Mon, 29 May 2017 14:58:39 GMT",
            "permalink": "http://scripting.com/2017/05/29.html#a100539"
        },
        {
            "text": "A great example was the Wonder Woman movie. The promoters <a href=\"https://thenextweb.com/facebook/2017/05/26/theater-decimates-facebook-critics-ladies-wonder-woman-screening/#.tnw_XcYQszSG\">used</a> gender division to promote their product. It worked. And they left us with a wound and one more political division to deal with. It's always a good idea to put your circumstance, race, age, gender etc aside when deciding if a cause is worth supporting. It ought to matter a lot if there'e a for-profit product in the middle of the pitch.",
            "created": "Mon, 29 May 2017 15:00:14 GMT",
            "permalink": "http://scripting.com/2017/05/29.html#a110514"
        }
    ],
    "permalink": "http://scripting.com/2017/05/29.html#a100542"
}