{
    "text": "I was hoping for something spectacular from the first photo released from the JWST yesterday at 5PM, but when I saw it I had no idea what I was looking at. The explanations were technical, and while I am technical in some areas, the cosmos is not one of them. Also as someone who was raised in NYC -- I didn't grow up with a view of the cosmos as people who live in more rural areas do. So none of what we saw means much to me. We were told by experts that this was really impressive, I'm sure they're right -- but I was hoping for something that would make me gasp, that would give us all something to remember. I am old enough to remember the moon landing in 1969. I suppose there were some who said they shouldn't bother with a TV camera for live broadcasts, but they had it, and we saw Neil Armstrong climb down the ladder and say his famous first words. This moment is probably just like that. The first time we're seeing the cosmos as a peer, not from the point of view of someone on or near a planet, but from the perspective of a solar system. Maybe at some point we'll have a telescope outside of our solar system, but I won't be around for that. When I tuned in at 5PM for the great unveiling, I was greeted with nothing. There was nothing on the TV channels I tuned into. Nothing on Twitter. A few hours later on Twitter I saw a picture a bunch of blurry lights. I was told this was it. Come on folks, point the camera at something we know. Saturn perhaps. Maybe Earth. It's not what the telescope is for, I get it, nor was the moon landing for sending a TV show back to Earth, but we're the audience for the moment. Give us something we can remember. Anyway there's another moment coming up this morning, the official unveiling. I'm hoping to be emotionally overcome with pride and amazement and a bit more optimism for the future. Give us a show. Something we can write about and say \"I was there when..\"",
    "created": "Tue, 12 Jul 2022 13:07:01 GMT",
    "type": "outline",
    "flInCalendar": true
}