{
    "created": "2025-05-03T04:00:00.000Z",
    "flInCalendar": true,
    "name": "03",
    "path": "2025/05/03",
    "text": "May 03",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Today I spent (or wasted) hours trying to get my WebSockets code working properly with <a href=\"https://daytona.scripting.com/search?q=Caddy\">Caddy</a>. Hours with ChatGPT, realizing it has a long way to go before it can manage code like I can. It gets fixated on an approach and never takes a step back to think maybe we're going about this the wrong way. It's extremely annoying all the times it tries to take you off track, and it works, it does take you down <a href=\"https://en.wikipedia.org/wiki/Down_the_rabbit_hole\">rabbit holes</a> and then you realize it's only getting worse. The key is to not let it do that, but it's hard not to <a href=\"https://en.wikipedia.org/wiki/Anthropomorphism\">anthropomorphize</a> so you don't want to hurt its feelings. In order to not be murdered as a small child you have to learn manners. And the bots push that too far. Really do take advantage. Still it knows far more than I do about everything, so if I could only get it to just shut the f up already and let me think! For something so capable it really doesn't spend enough time thinking, it's fully preoccupied with <i>doing.</i> ",
            "created": "Sat, 03 May 2025 17:11:10 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2025/05/03/rabbit.png",
            "flInCalendar": true
        },
        {
            "text": "The <a href=\"https://en.wikipedia.org/wiki/Detroit_Pistons\">Detroit Psssstons</a> were truly great in the first round of the playoffs. And I was really gratified, ecstatic even, to see the Timberwolves give the Lakers a complete <a href=\"https://www.npr.org/2010/11/04/131075640/how-shellacking-came-to-mean-defeat\">shellacking</a>. I am so fed up with LeBron James. I can't imagine another team would want him. I can't imagine why he wants to win <i>another</i> freaking title. And I was really pissed off when people started saying they were contenders this year. Bull. Shit. And the reason I'm glad it was the Timberwolves is because <a href=\"https://en.wikipedia.org/wiki/Julius_Randle\">Julius Randle</a> is on that team now, and I hear he gets a fair amount of credit for their victory. The Knicks traded him for <a href=\"https://en.wikipedia.org/wiki/Karl-Anthony_Towns\">KAT</a> last summer. They're a solid team. And while <a href=\"https://en.wikipedia.org/wiki/Donte_DiVincenzo\">Donte DiVincenzo</a> isn't playing very well, we really need him back in NY, so maybe the Knicks can figure out a deal that makes sense. And why aren't the Knicks playing <a href=\"https://en.wikipedia.org/wiki/Precious_Achiuwa\">Precious Achiuwa</a>. He did great last year when <a href=\"https://en.wikipedia.org/wiki/OG_Anunoby\">OG</a> was injured. The Knicks have a good bench imho, they just don't get to play enough to be warmed up properly. So sad the way <a href=\"https://en.wikipedia.org/wiki/Miles_McBride\">Doooooce</a> performed in the Detroit series. Anyway it was exhausting. I would have been okay with the DP's winning, seriously -- I'm ready for baseball. And I don't imagine the next series, with the Celtics will be any kind of a walk in the park.",
            "created": "Sat, 03 May 2025 17:20:21 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Sometimes I think the Trumps are competing to kill the most humans.",
            "created": "Sat, 03 May 2025 17:17:39 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}