{
    "created": "2025-05-04T04:00:00.000Z",
    "flInCalendar": true,
    "name": "04",
    "path": "2025/05/04",
    "text": "May 04",
    "type": "calendarDay",
    "subs": [
        {
            "text": "ChatGPT is great for finding information on the public web, but I can't figure out how to find stuff I've worked on with ChatGPT in ChatGPT. There are big usability issues. I think it's getting better in some ways, but it's leaving me more scattered and disorganized than I was before when I took notes outside of ChatGPT. There's another problem, if I want to use my own editing and organizing tools, then the author of the software has to pay the vendor of the LLM for my users using it. That cuts me out, because I don't charge people to use my software, at least not so far, and I have no interest in being a reseller of LLM services. Same problem with Amazon and storage, why won't they sell storage to the user that they can allocate for use with my app, and others. That would give us the kind of power we used to have on the desktop where multiple apps could work on the same file at different times. If I want to make something that stores stuff in the cloud, I have to buy it and resell it. I have tried to discuss this with product runners at companies that could offer this service, it would fit in with what they did. There must be a legal reason here, ie who's responsible for the content being stored. ",
            "created": "Sun, 04 May 2025 15:13:59 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2024/10/10/ronaldMcGrimace.png",
            "flInCalendar": true
        },
        {
            "text": "If you get the <a href=\"https://subscribe.scripting.com/\">nightly email</a>, the text might be a bit more readable. I've increased the font-size from 17px to 18px. I've only been able to do this lately because I could tap into what ChatGPT knew about it, whereas before I was flying blind, with no idea of the unusual things that happen when HTML is sent via email. There is another option, click on the date at the top of each email and that will open the same stuff in the web. It can be easier to make the text larger there than it is in an email client. ",
            "created": "Sun, 04 May 2025 15:19:48 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}