{
    "created": "2025-05-07T04:00:00.000Z",
    "flInCalendar": true,
    "name": "07",
    "path": "2025/05/07",
    "text": "May 07",
    "type": "calendarDay",
    "subs": [
        {
            "text": "The Knicks are <a href=\"https://www.northjersey.com/story/sports/nba/knicks/2025/05/07/ny-knicks-celtics-game-2-score-mikal-bridges-jalen-brunson/83491430007/\">unbelievable</a>. It feels like 2015, when the Mets would be down 9-0 in the seventh, and you'd tune in to see how they would win. At the very end of the Knicks game tonight, when the Celtics were up by 1, I thought how would this feel if the Knicks came back so far and didn't win. I should've known better. All those insufferable years when we wore <a href=\"http://scripting.com/images/2023/04/27/knicksFansWithBagsOverHeads.png\">paper bags to hide our faces</a>, even if this is as far as the Knicks get this year, it will have been worth it. Sports teaches you to believe, if you wait long enough your team teaches you that. I've learned it from the Mets so many times, and the Knicks now. I just wish <a href=\"https://en.wikipedia.org/wiki/Walt_Frazier\">Clyde</a> were doing the color with Mike Breen doing the play by play. But who cares, this was great sports. Watching <a href=\"https://en.wikipedia.org/wiki/Monica_McNutt\">Monica McNutt</a> on MSG in a daze. It's like homecoming. I might just splurge for a ticket to Saturday night's game. It's a pretty easy drive.",
            "created": "Thu, 08 May 2025 02:04:07 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2021/05/30/spikeLeeKnicksFan.png",
            "flInCalendar": true
        },
        {
            "text": "I want the <a href=\"https://electrek.co/2025/05/07/hyundai-unveils-new-elexio-electric-suv-with-435-miles-range/\">EV's they're getting in China</a>. Because we've got these stupid trade barriers we can't get the latest tech. Imagine in say 1984 you were a developer outside the US and you couldn't get a Mac. Then, perhaps Trump's tariff might have a slight chance of working. Now we're on the outside looking in.",
            "created": "Wed, 07 May 2025 21:52:56 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "There's a <a href=\"https://this.how/wordland/dialogForPublish.opml\">new dialog</a> in WordLand that confirms the first time you publish a post, and offers to open it in the web browser. ",
            "created": "Wed, 07 May 2025 21:39:26 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}