{
    "created": "2025-05-12T04:00:00.000Z",
    "flInCalendar": true,
    "name": "12",
    "path": "2025/05/12",
    "text": "May 12",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Google may be forced, for the public good, to sell Chrome, or spin it off as an independent company. Who would you want it not sold to? If it were independent how would it make enough money to maintain the software? What should change? What should not?",
            "created": "Mon, 12 May 2025 15:37:22 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "There must be a group of librarians somewhere exploring ChatGPT-like products as a completely new library experience. ",
            "created": "Mon, 12 May 2025 15:13:18 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I worked my way through all six seasons of <a href=\"https://en.wikipedia.org/wiki/Peaky_Blinders_(TV_series)\">Peaky Blinders</a>. I had tried it a few times before and found it hard to get started, but this time I persevered, got to know the characters, and enjoyed the stories. I knew the series was about to end as we approached the end of the final episode, and thought things were about to wind down, and then it took a little turn, no spoilers, that maybe was the best ending for any series ever. Originally I thought that honor went to <a href=\"https://en.wikipedia.org/wiki/Six_Feet_Under_(TV_series)\">Six Feet Under</a>, which had a kickass ending too, but when I re-watched the series recently I realized the rest of the show was pretty awful. Ever had that experience when you thought a show was great, and then re-watched it and realized it was junk? That happened with <a href=\"https://en.wikipedia.org/wiki/Deadwood_(TV_series)\">Deadwood</a> too. After a while I just couldn't watch it, it was so insipid. What was I even thinking the first time around? Not sure what's next on the agenda. I know I'm watching the Knicks tonight, with a certain <a href=\"http://scripting.com/2024/05/17/134201.html?title=theKnicksAndTheEpicFart\">dread</a>. ",
            "created": "Mon, 12 May 2025 12:10:35 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2025/05/12/peakyBlinders.png",
            "flInCalendar": true
        }
    ]
}