{
    "created": "2025-05-13T04:00:00.000Z",
    "flInCalendar": true,
    "name": "13",
    "path": "2025/05/13",
    "text": "May 13",
    "type": "calendarDay",
    "subs": [
        {
            "text": "New WordLand feature: <a href=\"https://this.how/wordland/editAllCategories.opml\">Edit all categories</a> for a site.",
            "created": "Tue, 13 May 2025 14:12:53 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Video demo of the new <a href=\"https://www.youtube.com/watch?v=0G3nh7Mj8QI\">categories editor</a> in WordLand. I wanted to be able to add new categories and edit the descriptions of existing categories without having to leave WordLand. I feel that categories are an important part of writing.",
            "created": "Tue, 13 May 2025 13:32:18 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<img src=\"https://imgs.scripting.com/2025/05/13/knickGameCard.png\" style=\"float: right; border: 1px solid silver; margin-left: 10px;\">This is what it says on Google about tomorrow night's Knicks game vs the Celtics in Boston. I've pointed the red arrow at the part that makes me think I must be dreaming. <i>NYK leads 3-1.</i> Yesterday at this time (5:30PM Eastern) I was in a funk, sure that the Knicks were about to be obliterated by the Celtics who had blown out the Knicks on Saturday, and the beginning of last night's game confirmed that suspicion. The Knicks couldn't seem to hit a shot, and the Celtics were hitting 3-pointers over and over and over and over. My body chemistry shifted. I felt the doom members of an ancient tribe of primitive humans must have felt as we were losing a war for existence with a neighboring tribe. It's primitive, but it's real. However! In the second half it turned around. The Knicks came out with a purpose, unlike the previous two wins, this one was not a squeaker at the end. The Knicks were masterful. They won this game, not by luck or perseverence, rather simply by <i>being better</i> than the Celtics. The reigning champion Celtics who must've relaxed just enough to fuel the victory for the hometown boys. So we're up 3-1 now. The Celtics have to win the next three. If they lose one, it's over. No I didn't think we'd be here tonight. Remember that when you feel sure you know that something is going to turn out a certain way. You just never know, it could come out a different way, as unbelievable as that might be.",
            "created": "Tue, 13 May 2025 21:33:17 GMT",
            "type": "outline",
            "imagex": "https://imgs.scripting.com/2021/05/30/spikeLeeKnicksFan.png",
            "imagey": "https://imgs.scripting.com/2025/05/13/knickGameCard.png",
            "flInCalendar": true
        }
    ]
}