{
    "created": "2025-05-22T04:00:00.000Z",
    "flInCalendar": true,
    "name": "22",
    "path": "2025/05/22",
    "text": "May 22",
    "type": "calendarDay",
    "subs": [
        {
            "text": "The Knicks got beat last night. And the game seemed so won. When Brunson sat down in the fourth period because he was in foul trouble, the Knicks had a huge run that put them up by 17 with less than 3 minutes remaining. My numbers might be slightly off. Then they brought Brunson back, and it all flipped around. The Pacers were getting off shots where they weren't before, and their aim was deadly. So it wasn't just the Knicks folding, the Pacers were hot. The announcers were so clueless, the Knicks didn't need Brunson back. He was benched a good portion of the final blowout with Boston. I loved that. Showed he can sit down when needed, and the team will keep going. When he was injured in March, the Knicks faltered at first, but then they learned how to put it together with the remaining players which believe it or not are a full NBA team, a very competitive one. So when Brunson gets in foul trouble and the remaining Knicks are in a groove don't screw with it. That should be the lesson of last night's game. The Knicks were very good, net-net, but the Pacers were better and they won. ",
            "created": "Thu, 22 May 2025 15:51:03 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2021/05/13/knicksFan.png",
            "flInCalendar": true
        },
        {
            "text": "Where AI fits in",
            "created": "Thu, 22 May 2025 21:41:21 GMT",
            "type": "outline",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "The Beatles",
                    "created": "Thu, 22 May 2025 21:41:34 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Personal computers",
                    "created": "Thu, 22 May 2025 21:41:38 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The web",
                    "created": "Thu, 22 May 2025 21:41:42 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Napster",
                    "created": "Thu, 22 May 2025 21:41:46 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "AI",
                    "created": "Thu, 22 May 2025 21:41:50 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}