{
    "created": "2025-05-28T04:00:00.000Z",
    "flInCalendar": true,
    "name": "28",
    "path": "2025/05/28",
    "text": "May 28",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I love this <a href=\"https://sports.yahoo.com/nba/article/timberwolves-thunder-anthony-edwards-is-dealing-with-the-superstars-dilemma-against-okc-how-will-he-respond-150142061.html\">piece</a> about Anthony Edwards and how the OKC's guard against him by double-teaming, so he can't have the ball, and that allows them to steal the ball more often from other Minnesotan ball-handlers, and also limits Edwards opportunities to shoot, but it does make it more <i>possible</i> for others on the team to shoot. If he does his job, the pundits and fans say he's slumping (low points). But he's just doing his job. Same thing, flipped around -- when they say Brunson is scoring so many points, he's doing great, like LeBron or Kobe, but actually it's a sign the team is fucked up. Too dependent on one offensive player, the others are just standing around in case he wants to pass it to them. I exaggerate, but it does work out that way. What you want is a team where there are always lots of options, and to the extent that they're hot, the team is impossible to defend. But a Brunson holding the ball all the time makes it easier to beat the Knicks? That was (as I've said a few times) the problem with Melo. Now we've <i>seen</i> the non-Brunsons on the Knicks kick ass. If the Knicks don't make it past this round, and it is it seems pretty likely -- next season they should focus on configurations that have to sink or swim based on whether they can win without Brunson. Then, next year, we'll have something, perhaps. But I'm just a fan, seriously, no sarcasm. Same way I'm a fan of AI, I have no idea how it works, and I'm happy with that. And don't tell me it's like auto-complete, try using it for a while for real stuff, and tell me how you know that from using it. You don't. Each system has quirks that you have to learn the same way you have to learn the quirks of team members, and help them do stuff they're good at, so they can handle the ball and take shots without you getting involved. That's how you start to get teamwork. See how that works kind of like basketball? :-)",
            "created": "Wed, 28 May 2025 15:44:41 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2024/02/13/commanderDataStarTrek.png",
            "flInCalendar": true
        },
        {
            "text": "And btw, that's why I <a href=\"http://scripting.com/2025/05/21.html#a135615\">wanted</a> Chris Lydon to do interviews with people in his <a href=\"https://radioopensource.org/\">audience</a> who are tripping out on all the new power they're getting from AI. How is it augmenting their work? I know Chris well enough that he probably thinks it's not for him, too technical -- but that's the point -- the excitement with AI is not technical. That's the story all the other reporters are missing. It's the light in the users' eyes when they struggle to make you understand why it's the most incredible thing ever and they're so glad to have lived to see this. <i>That's</i> the freaking story. Help them get the ideas through. BTW, we have no idea how AI will rock our boat, we never did for other similar inventions. Who knew what the Beatles would lead to when they <a href=\"https://en.wikipedia.org/wiki/The_Beatles%27_1964_North_American_tour\">came to America</a>. They said (the Beatles did, with ridiculous humility) that they expected their fame will last a few years at most. PCs a few years later were supposed to be for the kitchen. Apple actually <a href=\"https://imgs.scripting.com/2025/05/28/appleKitchenComputer.png\">ran ads</a> saying that in the late 70s. And the web? Well Chris was around near the beginning of that and knows how our eyes glazed over at the utopia we were envisioning, and we know, to some extent how all that <a href=\"https://en.wikipedia.org/wiki/Donald_Trump#First_presidency_(2017%E2%80%932021)\">turned</a> <a href=\"https://en.wikipedia.org/wiki/Acquisition_of_Twitter_by_Elon_Musk\">out</a>. The AI story is a great one, and as Chris had very little understanding of blogs when he did the series of podcasts in 2003 and 2004 that should win the Pulitzer Prize for being so presicent and courageous, he's the right guy to get this story, if he has the patience and stamina. This is the <a href=\"http://scripting.com/2025/05/22/214121.html\">story</a>. Sure you <i>have</i> to cover Harvard v Trump but AI is a story of love from the users and that story hasn't been told yet, and it's a big one, like what were the Beatles for and why, in <a href=\"https://en.wikipedia.org/wiki/The_Beatles%27_1964_North_American_tour\">1964</a>. ",
            "created": "Wed, 28 May 2025 15:55:46 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2024/02/08/woodstock.png",
            "flInCalendar": true
        },
        {
            "text": "BTW, just for fun, a search for <a href=\"https://daytona.scripting.com/search?q=%22ole%20and%20lena%22\">Ole and Lena</a> jokes. :smile:",
            "created": "Thu, 29 May 2025 02:41:10 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}