{
    "text": "Elon bought the airport",
    "created": "Mon, 19 Aug 2024 20:08:28 GMT",
    "type": "outline",
    "description": "There are lots of scheduled flights in and out of X because it's where most of the traffic already goes.",
    "subs": [
        {
            "text": "Elon Musk bought the biggest airport on the social web. A major world hub like Atlanta, <a href=\"https://www.flightconnections.com/flights-from-london-heathrow-lhr\">London</a> or Dubai. ",
            "created": "Mon, 19 Aug 2024 20:08:44 GMT",
            "flInCalendar": true
        },
        {
            "text": "Bluesky is a regional airport in a cool place, maybe Austin. ",
            "created": "Mon, 19 Aug 2024 20:28:09 GMT",
            "flInCalendar": true
        },
        {
            "text": "Mastodon is a network of airports, like the ones served by <a href=\"https://www.ryanair.com/us/en/cheap-flight-destinations\">Ryanair</a> in Europe. ",
            "created": "Mon, 19 Aug 2024 20:28:13 GMT",
            "flInCalendar": true
        },
        {
            "text": "Threads is potentially one of the big airports like the one Musk bought, but it's not as much of a hub yet. <a href=\"https://www.flightconnections.com/flights-from-orlando-mco\">Orlando</a>? <a href=\"https://www.flightconnections.com/flights-from-frankfurt-fra\">Frankfurt</a>? ",
            "created": "Mon, 19 Aug 2024 20:28:05 GMT",
            "flInCalendar": true
        },
        {
            "text": "There are lots of scheduled flights in and out of X because it's where most of the traffic already goes. It's quite possibly not running that smoothly, like perhaps JFK in NYC, always a mess, under construction, huge traffic, broken systems. ",
            "created": "Tue, 20 Aug 2024 01:24:13 GMT",
            "flInCalendar": true
        },
        {
            "text": "But it does actually work pretty reliably most of the time. ",
            "flInCalendar": true
        },
        {
            "text": "When I was first getting started in tech, when we got the initial angel funding for <a href=\"https://en.wikipedia.org/wiki/Living_Videotext\">LVT</a>, I asked the lead investor, Bill Jordan, if Apple was going to go out of business. At the time, 1983, a lot of people said it would. He asked what their sales were. $1 billion, I said. He said they're not going away. Companies that large don't disappear. After 40 years of experience in tech since then, Bill was right. Companies that lead markets very rarely disappear. It <a href=\"https://en.wikipedia.org/wiki/Osborne_Computer_Corporation\">does</a> happen. But not often. More likely is Musk will right the ship, and it will grow to dominate the market. Threads will possibly be Pepsi or Avis. Mastodon will be Home Depot. Bluesky will be <a href=\"https://en.wikipedia.org/wiki/Laurel_Canyon,_Los_Angeles#Counterculture_of_the_1960s_and_1970s\">Laurel Canyon</a>. Or who knows? ",
            "created": "Mon, 19 Aug 2024 20:29:14 GMT",
            "image": "https://imgs.scripting.com/2019/11/14/weTryHarder.png",
            "flInCalendar": true
        },
        {
            "text": "But there's a high probability that Musk's company will be the market leader for the forseeable future. ",
            "created": "Mon, 19 Aug 2024 20:32:47 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}