{
    "created": "2022-08-06T04:00:00.000Z",
    "flInCalendar": true,
    "name": "06",
    "path": "2022/08/06",
    "text": "August 06",
    "type": "calendarDay",
    "subs": [
        {
            "text": "When I wrote about Utopia Bagels <a href=\"http://scripting.com/2022/08/05.html#a142053\">yesterday</a>, I forgot to mention that Whitestone is part of Queens. It's a weird thing, of the five boroughs of NYC, the oddball is Queens, where each neighborhood was once a town, and they kept it that way even when they all became part of Queens. So my parents' address was in <a href=\"https://en.wikipedia.org/wiki/Flushing,_Queens\">Flushing, NY</a> -- not Queens, NY as it would have been if we were in Brooklyn, The Bronx or Staten Island (actually not sure about Staten Island, it's the forgotten borough, more part of the Lost Cause of the Confederacy than the greatest city in the world). Manhattan is the other weird case for a different reason. You send your mail to Manhattanites to New York, NY -- in other words fuck the other boroughs, Manhattan is the <i>real</i> New York. In a city that's known for its self-centered arrogance, Manhattanites take it to the next level. Not only don't they acknowledge that the rest of the country exists, they don't even credit their fellow NYers. Gotta love it. :smile:",
            "created": "Sat, 06 Aug 2022 12:24:11 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2022/08/06/iHeartNY.png",
            "flInCalendar": true
        },
        {
            "text": "Wow I miss <a href=\"https://twitter.com/SummerStreets/status/1555873107667189761\">Summer Streets</a>. On three Saturdays in August, <a href=\"https://www1.nyc.gov/html/dot/summerstreets/html/home/home.shtml\">in NYC</a>, they close Park Avenue and 4th Avenue below it, all the way down to the Brooklyn Bridge -- and it's just for bikes and pedestrians. It's what NYC would be like if there were no cars. ",
            "created": "Sat, 06 Aug 2022 12:22:33 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "A reader thanked me for the <a href=\"http://scripting.com/2022/08/05.html#a141224\">tip</a> about Olbermann. \"With Maddow only one day a week, it's nice to know there is still a good, daily source of my kind of Snark and News available.\" My response: You're very welcome. But I think when you listen to Olbermann you'll realize as I did that Maddow wasn't cutting it. She stepped back because she lost her edge, she must've known it. I also think the MSNBC management must have been forcing her to not say the whole truth. Olbermann for now at least is unchained. But his show is owned by a <a href=\"https://en.wikipedia.org/wiki/IHeartMedia\">big corporation</a> so he'll probably eventually go stale too. But for now -- he's got it.  ",
            "created": "Sat, 06 Aug 2022 11:57:28 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Another thing about New Yorkers",
            "created": "Sat, 06 Aug 2022 14:19:20 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "You don't have to be Jewish.",
                    "created": "Sat, 06 Aug 2022 14:19:29 GMT",
                    "inlineImage": "http://scripting.com/images/2022/08/06/loveLevys.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}