{
    "created": "2022-08-08T04:00:00.000Z",
    "flInCalendar": true,
    "name": "08",
    "path": "2022/08/08",
    "text": "August 08",
    "type": "calendarDay",
    "subs": [
        {
            "text": "All articles about <a href=\"http://scripting.com/davenet/2000/10/06/dinnerWithDougEngelbart.html\">Doug Engelbart</a> talk about the mouse, and mention \"augmenting human intellect\" in a vague way, not explaining what it means, and that he actually developed real software people could use for that. Engelbart thought augmenting human intellect was his real life's work. I know because 1. he told me and 2. same with me. Augmenting human intellect sounds spacy, something only a genius could understand, which is why it's not a good term for something that's pretty simple. Using an outliner to take notes and manage a project is an example of the computer augmenting your intellect. Doing something for you that you are not as good at as a computer is. Using a spreadsheet to augment human intellect could mean doing what-if analysis on a projected balance sheet. Sharing a recipe on Facebook with a group of friends is another example. Remember, Engelbart was talking about this long before there were computers outside of research labs. What seems kind of obvious today was anything but obvious then. ",
            "created": "Mon, 08 Aug 2022 15:28:16 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2022/08/08/bootstrappingByEngelbart.png",
            "imageLink": "https://www.dougengelbart.org/content/view/226/269/",
            "flInCalendar": true
        },
        {
            "text": "I watched <a href=\"https://en.wikipedia.org/wiki/Breaking_Away\">Breaking Away</a> over the weekend. First time. The idealistic teen bike rider who worshipped Italian cyclists learns that <a href=\"https://www.youtube.com/watch?v=DJETB-MfpnQ\">everyone cheats</a>. A hard lesson, one that I never learned, and keep bumping up against. Maybe bumping is too mild a word. :smile:",
            "created": "Mon, 08 Aug 2022 14:13:02 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=DJETB-MfpnQ",
            "flInCalendar": true
        },
        {
            "text": "Did the NYT run <a href=\"https://www.nytimes.com/2022/08/07/us/politics/biden-abortion-catholic-history.html\">similar stories</a> about Trump being a weird and possibly ineffective advocate for enslaving women to carry unwanted or medically dangerous pregnancies?",
            "created": "Mon, 08 Aug 2022 14:08:26 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Reviewing the agenda for an upcoming Future of Thinking conference I realize -- if this really is the future -- we lost. Yet another promising tech that is going to be fought over like social media before it, and web browsers before that and PC operating systems before that. Winner take all and users be damned. It's not too late to make <a href=\"http://scripting.com/2021/05/23/134949.html?title=toolsForThought\">Tools For Thought</a> a rare exception, where no company can lock their users in, and keep them from switching, where every product has to do everything and therefore does nothing well, and no one has the incentive to make their products better and their users more powerful thinkers. As an elder of this industry, I can't stand by and say nothing, not that I could when I was just a young whippersnapper. For whatever reason I insist on my products being open to competition, and that makes it harder to win, and so be it. That's the way it should be! ;-)",
            "created": "Mon, 08 Aug 2022 12:34:47 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/11/29/instantPot.png",
            "flInCalendar": true
        },
        {
            "text": "Marie Vorobieff ",
            "created": "Mon, 08 Aug 2022 16:40:52 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2022/08/08/montparnasse.png",
            "subs": [
                {
                    "text": "<a href=\"https://livornodailyphoto.blogspot.com/2014/02/homage-to-friends-from-montparnasse.html\">Homage to Friends from Montparnasse</a>, 1962.",
                    "created": "Mon, 08 Aug 2022 16:40:29 GMT",
                    "inlineImage": "http://scripting.com/images/2022/08/08/montparnasse.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}