{
    "created": "2022-08-15T04:00:00.000Z",
    "flInCalendar": true,
    "name": "15",
    "path": "2022/08/15",
    "text": "August 15",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Some asshole steals all your photo albums, some of which contain launch codes for your nuclear missiles, and then has the gall to ask where his passports went. All while he's running around free to do more of this bullshit. We are a wimp country to put up with this miscreant.",
            "created": "Mon, 15 Aug 2022 22:44:59 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I was always taught the basics of a good story are <a href=\"https://en.wikipedia.org/wiki/Five_Ws\">who, what, when, where and why</a>. With Trump and his stolen top secret US government documents, we don't know who he was selling the secrets to. The what part -- we don't know either. They say nuclear secrets, but what if they got you access to world's banking system. That could be considerably more valuable. Why? With Trump there's only ever one reason -- if it makes him richer he's in. If not why bother. Our journalism repeats the same old bullshit over and over. ",
            "created": "Mon, 15 Aug 2022 16:26:25 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Gotta wonder why none of the news orgs are looking at this. I remember years ago when <a href=\"https://www.msnbc.com/transcripts/transcript-rachel-maddow-show-10-19-21-n1281957\">Maddow</a> was telling about <a href=\"https://en.wikipedia.org/wiki/Oleg_Deripaska\">Oleg Derapaska</a> and Trump. What ever became of him, and why did all the news orgs stop looking at how Trump was selling us out.",
            "created": "Mon, 15 Aug 2022 16:33:15 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Anything that gets us to hate each other based on race, age, gender is a wedge, and it's designed to keep us from unifying, which allows the assholes to keep control.",
            "created": "Mon, 15 Aug 2022 16:26:08 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}