{
    "created": "2022-08-16T04:00:00.000Z",
    "flInCalendar": true,
    "name": "16",
    "path": "2022/08/16",
    "text": "August 16",
    "type": "calendarDay",
    "subs": [
        {
            "text": "There's a problem with putting docs on GitHub: you can't redirect from the pages if you need to relocate them. Unless of course I'm missing something. ",
            "created": "Tue, 16 Aug 2022 19:54:27 GMT",
            "type": "tweet",
            "tweetId": "1559629988785274890",
            "tweetUserName": "davewiner",
            "flInCalendar": true
        },
        {
            "text": "Slippin Jimmy is back for the love",
            "created": "Tue, 16 Aug 2022 11:46:26 GMT",
            "type": "outline",
            "description": "Better Call Saul spoilers follow. You have been warned! 💥",
            "subs": [
                {
                    "text": "Better Call Saul spoilers follow. You have been warned! :boom:",
                    "created": "Tue, 16 Aug 2022 11:46:38 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The previous episode ended with the hero threatening to kill an old crippled woman whose mistake was trusting him. People thought this meant that his slide would continue in the finale, and it certainly did, but then it turned around -- and it became what I had hoped it would be -- a love story! ",
                    "created": "Tue, 16 Aug 2022 11:46:50 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "We didn't spend 14 years with this character, all the while knowing he had a good heart, he loved his brother and Kim, and all the old folks at Sandpiper, he really did love them, only to find out at the end his heart was cold and there was no redemption for our hero. I thought that would not be consistent with the writers of the show. ",
                    "created": "Tue, 16 Aug 2022 12:09:30 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "In the final scenes, we see the hero, sentenced to 86 years, doing the same thing he was doing at Cinnebon in Omaha, and as usual his fellow prisoners and guards had fallen in love with him, as we all did. In the final scene, he's back together with Kim, sharing a cigarette. He's still Slippin Jimmy with a heart of gold. And she's slippin around too, her ID as a lawyer hadn't expired. And the door is wide open for a sequel, btw. ",
                    "created": "Tue, 16 Aug 2022 11:49:57 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The final touch, where the actors come out one by one and thank us -- what a concept -- for our love of them. In all the finales of all the shows, great ones and not so great, I've never seen this done, and it ended this show with a heart on just the right note. :heart:",
                    "created": "Tue, 16 Aug 2022 11:51:38 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}