{
    "created": "2022-08-20T04:00:00.000Z",
    "flInCalendar": true,
    "name": "20",
    "path": "2022/08/20",
    "text": "August 20",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I try to post something every day mostly because I have no idea what my <a href=\"http://scripting.com/email/\">mail list software</a> would do if one day there were nothing new on my blog. So here's the obligatory post that will help me not have to worry about this one more time. Reminds me of the <a href=\"http://scripting.com/davenet/1995/10/26/dontfeedthegeeks.html#3\">time</a> I got a letter from my Scottish penpal saying \"sometimes my mother writes these letters for me.\" Never a more potent sentence. But this is really me, Dave -- coming to you late at night. ",
            "created": "Sun, 21 Aug 2022 03:11:07 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2022/08/20/brilliantFriend.png",
            "flInCalendar": true
        },
        {
            "text": "Turns out I did have something to say. I'm watching a great HBO series called <a href=\"https://en.wikipedia.org/wiki/My_Brilliant_Friend_(TV_series)\">My Brilliant Friend</a>. It got the highest <a href=\"https://www.metacritic.com/tv/my-brilliant-friend\">rating</a> on Metacritic, and it is deserved. Almost like watching <a href=\"https://en.wikipedia.org/wiki/Jennifer_Lawrence\">Jennifer Lawrence</a> (who I love) in her <a href=\"https://en.wikipedia.org/wiki/Winter%27s_Bone\">first movie</a>, and realizing there's going to be a lot more of this and being happy to be around to see all of it. There are three seasons, I'm only on episode 4 of season 1. I'm sure there will be a lot more to say about this.  In the meantime I'm just enjoying a beautiful film as a TV series about two children growing up in Naples in the 1950s. ",
            "created": "Sun, 21 Aug 2022 03:14:00 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}