{
    "created": "2022-08-21T04:00:00.000Z",
    "flInCalendar": true,
    "name": "21",
    "path": "2022/08/21",
    "text": "August 21",
    "type": "calendarDay",
    "subs": [
        {
            "text": "A new <a href=\"https://github.com/scripting/tweetFeedSupport/issues/5\">feature</a> for <a href=\"http://tweetfeed.org/\">tweetfeed.org</a>. ",
            "created": "Sun, 21 Aug 2022 15:56:11 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The <a href=\"https://twitter.com/JJohnsonLaw/status/1561321128160804864\">burglar got lost</a> and ended up in my house because it was confusing. And in the confusion my valuables ended up in their house.",
            "created": "Sun, 21 Aug 2022 16:44:37 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Most of my immediate ancestors, the ones I knew, had strong opinions. They're all dead now. Their opinions don't matter. So if the opinions mean nothing now, what did they mean when they were alive? I would say they meant nothing then too. And if it applied to them it must certainly apply to me. I find it relaxing to know I don't have to figure everything out, because it doesn't matter what I think. It just doesn't matter. Now innovation might matter, but most of it goes unrecognized. My uncle for example, invented a windmill that didn't need to be repositioned to catch the wind. If the wind was blowing it would capture the energy. Earlier this evening I <a href=\"https://twitter.com/ValaAfshar/status/1560757203870547970\">saw</a> it had been invented again, because no one heard about my uncle's invention, except for people who loved him. Even so, I think that matters, because his ideas led to more ideas. That's very different from opinions. Ken thought all kinds of things that, to me, were bullshit. He could have saved the energy, because it didn't end up meaning anything. Also how well did they communicate their ideas? My maternal grandfather, Rudy Kiesler, Ken's father, actually got a mention in the Wikipedia <a href=\"https://en.wikipedia.org/wiki/Arno_Schmidt\">page</a> for my great uncle, his brother-in-law. They said he was a <a href=\"http://scripting.com/images/2022/08/21/rudyKieslerCommunistQuote.png\">communist</a>! I spent a lot of time with him growing up and in million years I'd never have thought he was a communist. He was a voracious capitalist, but then -- he always seemed to support liberal causes. And he was a Mets fan. So maybe there was some truth to it? He definitely had strong opinions, that man, but he must not have communicated them effectively, or maybe he was hiding this from his grandhildren? Hmm. ",
            "created": "Sun, 21 Aug 2022 05:14:45 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/11/02/mrMet.png",
            "flInCalendar": true
        },
        {
            "text": "BTW, yesterday would have been my <a href=\"https://www.google.com/search?q=site%3Ascripting.com+%22eve+winer%22\">mother's</a> 90th birthday. She had a lot of opinions. But she also acted on them. That's the difference. The opinions aren't worth anything. But the actions matter. ",
            "created": "Sun, 21 Aug 2022 05:30:43 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "BTW, how do you know someone went to Harvard? They tell you. ",
            "created": "Sun, 21 Aug 2022 05:37:55 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}