{
    "created": "2023-01-02T05:00:00.000Z",
    "flInCalendar": true,
    "name": "02",
    "path": "2023/01/02",
    "text": "January 02",
    "type": "calendarDay",
    "subs": [
        {
            "text": "It's amazing what AI can do <a href=\"https://twitter.com/JuliaDavisNews/status/1609719192596381696\">these days</a>.",
            "created": "Mon, 02 Jan 2023 22:13:46 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "If you want to watch me update my blog outline you can do it <a href=\"http://scripting.com/code/testing/concordreader/?url=http://drummer.scripting.com/davewiner/blog.opml\">here</a>.  It seems to update in real time. I must have written this thing, but I don't remember doing so. Looking at the JavaScript console, it's quite sexy, hooked into the websocket protocol supported by \"Drummer\", which is of course where I am editing this mofo. When I let up on the keyboard for a second or two it sends an update. It's not updating on every keystroke; that would be wasteful. It's fun to watch while I type in one window and watch the update in the other one.",
            "created": "Mon, 02 Jan 2023 19:18:57 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/12/24/dontLookUp.png",
            "flInCalendar": true
        },
        {
            "text": "I asked <a href=\"https://chat.openai.com/chat\">ChatGPT</a> for a title for <a href=\"http://scripting.com/2023/01/01.html#a031124\">this blog post</a> -- \"A Blogger's New Year's Wish: A Place to Write, Edit, and Publish Without Boundaries.\"",
            "created": "Mon, 02 Jan 2023 15:50:49 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "BOTY 2022",
            "created": "Mon, 02 Jan 2023 22:08:14 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Here's a Google search for <a href=\"https://www.google.com/search?q=site%3Ascripting.com+boty\">BOTY</a>. ",
                    "created": "Mon, 02 Jan 2023 22:02:57 GMT",
                    "type": "outline",
                    "image": "http://scripting.com/images/2023/01/02/hcr.png",
                    "flInCalendar": true
                },
                {
                    "text": "After naming <a href=\"https://heathercoxrichardson.substack.com/\">Heather Cox Richardson</a> as my BOTY for 2022 <a href=\"http://scripting.com/2023/01/01.html#a032915\">yesterday</a>, I got a nice link <a href=\"https://twitter.com/JoeTrippi/status/1609884969765142529\">from Joe Trippi</a>, a famous political campaign manager and a good human being, saying this means something, and that led to a nice thank you <a href=\"https://twitter.com/HC_Richardson/status/1609905737668468736\">from Ms HCR</a> herself. Now I'm a nobody compared to her, but she was so gracious -- it made we wonder if grace is part of what makes someone a great blogger. ",
                    "created": "Mon, 02 Jan 2023 22:09:21 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "When I think of great blogging I think of <a href=\"http://scripting.com/stories/2009/11/24/naturalbornBlogger.html\">Julia Child</a>. She was on a mission to teach everyone who would listen about <a href=\"https://www.amazon.com/Mastering-Art-French-Cooking-Vol/dp/0375413405/ref=asc_df_0375413405/?tag=hyprod-20&linkCode=df0&hvadid=312061146391&hvpos=&hvnetw=g&hvrand=17119945012164616075&hvpone=&hvptwo=&hvqmt=&hvdev=c&hvdvcmdl=&hvlocint=&hvlocphy=1023511&hvtargid=pla-435445841003&psc=1&tag=&ref=&adgrpid=60223809057&hvpone=&hvptwo=&hvadid=312061146391&hvpos=&hvnetw=g&hvrand=17119945012164616075&hvqmt=&hvdev=c&hvdvcmdl=&hvlocint=&hvlocphy=1023511&hvtargid=pla-435445841003\">French cooking</a>. She would never miss an opportunity to praise someone for giving it a try. In the same way <a href=\"https://heathercoxrichardson.substack.com/\">HCR</a> believes in American democracy, and that appears to be the source of her grace. It certainly is a consistent theme through all her posts, <a href=\"http://feedland.org/?feedurl=https%3A%2F%2Ffeeds.megaphone.fm%2FVMP8436744812\">podcasts</a>, and the one book of hers that I have read. ",
                    "created": "Mon, 02 Jan 2023 22:09:57 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "BTW, I used the word \"sass\" to describe some of her blogging. I was thinking about the way she talks about Thomas Jefferson. It's good. It says to me, a person who got a fairly standard education in American History from New York public schools, that these founders that we all iconify and think were so great, actually were people, and some of them were not beyond reproach, like Jefferson. That's the source of my use of the <a href=\"https://www.google.com/search?q=define+sassy\">term</a> in yesterday's post.",
                    "created": "Mon, 02 Jan 2023 22:10:36 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "TV relationships",
            "created": "Mon, 02 Jan 2023 21:55:15 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I've been bingeing some highly rated but very mediocre TV series. What makes them so bad is how they present human relations. For example, it's very common for one character to approach another and ask \"Are you OK?\" with the clear implication that they are not. The person who is supposedly hurting, or sad, confused, troubled, about to die, grieving some horrific event (that we might know about) puts on a happy face and says \"No everything's fine, what makes you think I'm hurting, sad, confused etc?\" We know it's fake and so does the accuser. I imagine that a lot of people watching it think this kind of interaction is okay, but it's actually <a href=\"https://en.wikipedia.org/wiki/Gaslighting\">gaslighting</a> which is a terrible thing to do to another person.",
                    "created": "Mon, 02 Jan 2023 21:51:54 GMT",
                    "image": "http://scripting.com/images/2023/01/02/thePetries.png",
                    "flInCalendar": true
                },
                {
                    "text": "Another thing is how they portray romantic relationships. A wife is dancing wildly at a party. The husband grabs her and takes her home, and on the way back explains how embarrassing her behavior was to him. I want to yell at him -- hey who cares if you're embarrased. It has nothing to do with you. And she was having fun. I can imagine being married to you is pretty stressful. Etc etc. Or a young dude once gets to have sex with an older woman and is therefore obsessed with her for his whole life, even after he's married to a very nice age-appropriate woman. The way he describes his feelings might be the way an infant would describe their relationship with a caregiver. \"Without you I can't live,\" he says. Sorry but that's bullshit. The baby is dependent. No matter how you feel, you <i>can</i> live without your age-inappropriate GF. ",
                    "created": "Mon, 02 Jan 2023 21:56:18 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I think about all the great shows I've binged many times and wish there were more out there. ",
                    "created": "Mon, 02 Jan 2023 22:00:25 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "If you're interested, here are <a href=\"http://my.bingeworthy.io/davewiner/\">my Bingeworthy ratings</a> for shows. ",
                    "created": "Mon, 02 Jan 2023 22:00:41 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "If you see something that you think I would love, feel free to drop me an email. ",
                    "created": "Mon, 02 Jan 2023 22:25:41 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}