{
    "created": "2023-01-16T05:00:00.000Z",
    "flInCalendar": true,
    "name": "16",
    "path": "2023/01/16",
    "text": "January 16",
    "type": "calendarDay",
    "subs": [
        {
            "text": "One timeline for each user. Lots of choice, but one timeline. And there has to be a basic agreement on what goes in that timeline. What are the elements of a message. A way to define more types, without going to a standards body, which always crush the individual in favor of the bigco's. Something minimal, orderly, easy to document, lots of example code. Once I get finished with the new FeedLand release, I want to work on this. ",
            "created": "Mon, 16 Jan 2023 16:01:34 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/09/28/cowboy.png",
            "flInCalendar": true
        },
        {
            "text": "The WordPress user interface must be seen as a platform, a command line, and much higher level writing tools built to run on it. It should be possible to never see the UI of WordPress except for configuration and global settings, much the way you have <a href=\"http://scripting.com/images/2023/01/16/systemPreferencesMac.png\">System Preferences</a> on a Mac. This is why blogging software has languished. The software we use for blogging must fit into the One Timeline paradigm, above.",
            "created": "Mon, 16 Jan 2023 16:04:25 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "When I think of obvious missing tech products, I can’t do most of them, because as soon as the idea gained traction as a product it would be taken over by a big company, partly because users prefer that. So a lot of gaps never get filled. That’s the lesson from twitter shutting down the clients again. It isn’t just twitter, you as an independent developer, can’t step into any platform vendor’s territory, they will eventually take away your business.",
            "created": "Mon, 16 Jan 2023 16:26:20 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "If Google  succeeds at burying the open web, we'll create a new open easy to write for web that Google doesn't own. In my <a href=\"http://this.how/googleAndHttp/\">piece</a> about this I suggest we should just use the web since it already does what we will ultimately need. There will be too much creativity locked up behind Google's blackmailing, and it has an easy way to escape, we just need to create a new open web. TBL showed us how to do it, we'll just do it again.",
            "created": "Tue, 17 Jan 2023 02:48:01 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Debuggers and internal docs",
            "created": "Mon, 16 Jan 2023 18:13:22 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Developers who don't use debuggers limit the complexity of code they can create.",
                    "created": "Mon, 16 Jan 2023 18:13:29 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "If you don't document the inner working of your software you will break things unnecessarily, if you're the one who's working on it.",
                    "flInCalendar": true
                },
                {
                    "text": "If someone else is working on it, they'll beg to be allowed to rewrite your code so they can understand what's going on.",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Gmail shut me down",
            "created": "Mon, 16 Jan 2023 14:37:31 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2023/01/16/wagonTrain.png",
            "subs": [
                {
                    "text": "Last night while I writing some stuff Gmail said it detected that my computer was sending some kinds of unspecified messages, and they were concerned about it, so they logged me off. I could still check my email on my other systems. I tried to go through the \"prove this is you\" process, but when it said it had sent a message to my phone, no message arrived. When I got to that place on other systems, the message did arrive on my phone. ",
                    "created": "Mon, 16 Jan 2023 14:37:38 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I reviewed my account on Google, everything looks fine. The phone I have hooked it up to is an Android. I have a backup email address connected to my account. ",
                    "created": "Mon, 16 Jan 2023 14:43:22 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I changed my password, and re-logged-in on my various other systems, everything worked, but not on my desktop. The problem is -- no confirming message ever appears on my phone, or anywhere else I can read my Google chat messages. ",
                    "created": "Mon, 16 Jan 2023 14:43:34 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Their help system is unhelpful, they keep telling me things I already know and have tried. I can live without accessing Gmail from my desktop because oddly while Gmail won't work with Chrome, it works fine with Safari. But there are often links in my emails and when I click on them the pages open in Safari. So this is very disruptive to my workflow. I'd rather still use Chrome on my desktop because everything is set up to work there. ",
                    "created": "Mon, 16 Jan 2023 14:43:53 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "If you have any ideas please <a href=\"https://github.com/scripting/Scripting-News/issues/248\">post a note here</a>. <i>Thanks!</i>",
                    "created": "Mon, 16 Jan 2023 14:44:16 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Near the end of the day, still can't get GMail to open on my desktop. I've had it try to send me a security message to my Android phone, without luck. I've quit ever app, removed every extension to Chrome, still no luck. ",
                    "created": "Mon, 16 Jan 2023 23:12:04 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}