{
    "created": "2023-01-20T05:00:00.000Z",
    "flInCalendar": true,
    "name": "20",
    "path": "2023/01/20",
    "text": "January 20",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Sometime next week we'll start testing the <a href=\"http://scripting.com/2023/01/15/160957.html\">open source release</a> of the FeedLand server. Looking for people with experience running a WordPress server, or equivalent. It should be that level of complexity. I want to smooth out the experience, before releasing it publicly. If you're interested in participating, please send me an email. ",
            "created": "Fri, 20 Jan 2023 15:32:50 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/06/14/strongman.png",
            "flInCalendar": true
        },
        {
            "text": "The Twitter API still works. If that changes I'll let you know. Yes, they shut down the clients, but the people who make the clients should have known that was coming. It happened before. Every corporate platform vendor will defend their cash flow. If you bet otherwise, you're probably going to lose. If you don't like it, develop for an open platform or stay out of the platform vendor's path.",
            "created": "Fri, 20 Jan 2023 15:26:59 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Why aren't we <a href=\"https://twitter.com/TheDailyShow/status/1616421662219534337\">marching</a> over the Dobbs decision?",
            "created": "Sat, 21 Jan 2023 01:20:48 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/TheDailyShow/status/1616421662219534337",
            "flInCalendar": true
        },
        {
            "text": "Having trouble focusing on work today I posted a <a href=\"https://mastodon.social/@davew/109722242134122701\">load of bullshit</a> to Mastodon. ",
            "created": "Sat, 21 Jan 2023 01:33:57 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I went to Davos in <a href=\"http://scripting.com/2000/01.html\">January 2000</a>, just once, with a white badge (access to everything). Not as a journalist. I was a representative of the web, which was the hot thing at the time. Not sure what other people were doing but I was a celebrity and enjoyed all the attention. ",
            "created": "Fri, 20 Jan 2023 14:53:20 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "After Davos, I went to Amsterdam, to write and enjoy the local herb. Back then it was the only place in the west where you could buy and consume the weed openly and semi-legally. Scroll to the end of the <a href=\"http://scripting.com/2000/02.html\">February archive page</a> for pictures from Davos and Amsterdam, as well as a few pieces with closing thoughts about my experience at Davos. This is one of the advantages of blogging and keeping relatively decent archives. You get to relive experiences like this.",
            "created": "Fri, 20 Jan 2023 14:56:29 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The only question I was asked was <a href=\"http://scripting.com/davenet/2000/02/04/howToMakeMoneyOnTheInterne.html\">How To Make Money on the Internet</a>. The <a href=\"https://www.google.com/search?q=%22Davos+Man%22\">Davos Man</a> was skeptical. I did pretty well, in hindsight. :smile: ",
            "created": "Fri, 20 Jan 2023 15:02:29 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}