{
    "created": "2023-01-22T05:00:00.000Z",
    "flInCalendar": true,
    "name": "22",
    "path": "2023/01/22",
    "text": "January 22",
    "type": "calendarDay",
    "subs": [
        {
            "text": "There’s no comparison between Twitter and Mastodon for idea distribution. I routinely get hundreds of RTs on Masto. The Twitter system thinks the same ideas are worthless. I’m guessing virtually no one sees my tweets. For an idea why that is, see the next item. ",
            "created": "Mon, 23 Jan 2023 02:26:14 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Twitter made a change so that you have to click a link to see the recent posts from people you follow. Hard to remember to do that, and you end up seeing a lot of disgusting crap. The stuff an algorithm chose for you, including posts from people you blocked. But you can work around this. If you have a bookmark for accessing Twitter, <a href=\"https://twitter.com/search?q=filter%3Afollows%20-filter%3Areplies&f=live\">change it to this</a>. Now you'll only see items from people you follow. None of the bullshit their algorithm chose \"for you\" which is really \"for their advertisers\" or \"for whoever.\"  ",
            "created": "Sun, 22 Jan 2023 14:13:41 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/02/08/nancy.png",
            "flInCalendar": true
        },
        {
            "text": "There's much more to feeds than reading them! :smile:",
            "created": "Sun, 22 Jan 2023 16:43:33 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I unfollow people who use \"white male\" as code for \"evil asshole.\" Say what you have to say without the bullshit. ",
            "created": "Sun, 22 Jan 2023 16:41:08 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I hate when people explain in detail something they thought I needed to know because I said something that reminded them of it. ",
            "created": "Sun, 22 Jan 2023 14:19:05 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Trump was a free man...",
            "created": "Sun, 22 Jan 2023 14:21:31 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/2017/01/22/trumanWhiteHouse.png",
            "subs": [
                {
                    "text": "<i>I wrote this on <a href=\"http://scripting.com/2017/01/22/trumpWasAFreeMan.html\">Jan 22, 2017</a>, two days after Trump was inaugurated.</i>",
                    "created": "Sun, 22 Jan 2023 14:21:37 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Trump was a free man until he took the oath. ",
                    "created": "Sun, 22 Jan 2023 14:21:51 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "But once he assumed the office, and until he leaves, he belongs to us, the American people. I'm sure this is a new feeling for him. But we all must submit to something. The president submits to the people. ",
                    "flInCalendar": true
                },
                {
                    "text": "I can't imagine what hell it must be behind the closed door that leads to the press room. The ranting and screaming, the tears and the \"there there's\" from his staff, the promises to get even. ",
                    "flInCalendar": true
                },
                {
                    "text": "But he will keep bumping up against the reality that now, we own his ass, even the ones who thought his campaign was crazy and dangerous. The people who voted for him thinking it left the rest of us powerless are in for a surprise too. The other politicians you elected care about what we think, because they need us to keep their jobs. The election is over, now they're worried about the next election. And like it or not, they need us. ",
                    "flInCalendar": true
                },
                {
                    "text": "Harry Truman famously called the White House the \"crown-jewel of the federal penal system.\" ",
                    "flInCalendar": true
                },
                {
                    "text": "I don't know how Trump will come to terms with this. We have an idea of what a president does, says, how he or she reacts to events. We just had eight years with a guy who never lost his cool over anything. The new president sees a report on TV saying he lost the MLK bust in the Oval Office and he loses it? He has a long way to go before he is our president. He may hold the office but he hasn't embraced it yet.",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}