{
    "text": "I remember when I was a Comp Sci student at <a href=\"https://www.cs.wisc.edu/\">UW</a> taking the Compiler Design class, <a href=\"https://pages.cs.wisc.edu/~fischer/cs701.f05/lectures/Lecture01.pdf\">CS701</a>. It was the class that weeded out those who would get graduate degrees from those who would not. The class project was to write a compiler for an <a href=\"https://web.archive.org/web/20111114122103/http://www.eecs.qmul.ac.uk/~ohearn/Algol/intro.html\">Algol-like language</a> that the professor desgined. He gave us a set of test apps that we had to compile and run correctly. I didn't get it. I thought code generation was like a magic box. Somehow the machine had a copy of every program you could write, and when it saw you were asking for that one, it would just spit out the code. Knowing what I know now, this was a ludicrous idea, but it's the best your mind can do when you just don't get it. Then there was the moment when I did get it. I started writing a code generator for a <a href=\"https://en.wikipedia.org/wiki/While_loop\">while loop</a>, and plugged it into the <a href=\"https://en.wikipedia.org/wiki/Compiler-compiler\">compiler-compiler</a>, and saw what it generated worked. From that point on, it was just writing code. Same thing with the web. I thought of big data centers, until I visited one of the most popular sites on the web, <a href=\"https://en.wikipedia.org/wiki/Internet_Underground_Music_Archive\">IUMA</a>, and found it was just an old Sun terminal and a <a href=\"https://en.wikipedia.org/wiki/Pizza_box_form_factor\">pizza box computer</a>, sitting on the floor in a random dusty one-room office in <a href=\"https://www.google.com/maps/place/Santa+Cruz,+CA/@36.9758914,-122.04748,13z/data=!3m1!4b1!4m6!3m5!1s0x808e441b7c36d549:0x52ca104b2ad7f985!8m2!3d36.9741171!4d-122.0307963!16zL20vMGwwbWs\">Santa Cruz</a>. That's it? I couldn't believe it. So I'm sure there's a <a href=\"https://www.thefreedictionary.com/gestalt\">gestalt</a> like that for \"ChatGPT\". Behind the magic is a bit of software, as magical (or not) as my compiler, or the pathetic Santa Cruz machine with the huge net presence. I'm sure there's something very mundane behind the <a href=\"https://www.youtube.com/watch?v=NZR64EF3OpA\">curtain</a>, but for now I love the magic of it and I don't believe the explanations that say it's stupid. It feels really smart to me. ",
    "created": "Thu, 20 Apr 2023 17:45:24 GMT",
    "type": "outline",
    "image": "http://scripting.com/images/2022/07/26/motherOfDragons.png",
    "flInCalendar": true
}