{
    "text": "What is art?",
    "created": "Fri, 28 Mar 2025 12:47:53 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Yesterday I <a href=\"http://scripting.com/2025/03/27/131121.html\">posted</a> four new ChatGPT-created drawings, created with the latest upgrade of ChatGPT's drawing functions which are better than previous versions. The usual controversy is rekindled on the networks. The concern as always is that it learned how from human artists, puts artists out of business, and human artists create art, machines can't, and since this is created by software, it isn't art. ",
            "created": "Fri, 28 Mar 2025 12:47:55 GMT",
            "flInCalendar": true
        },
        {
            "text": "This gives me a chance to write a piece I've been wanting to write for a while. The meaning of art imho comes from what it says to and about the person observing it, what it does to them, how it changes them, what they experience. For most people, most of the time, they don't have any idea who created the art beyond their name, nationality and when they lived. If you see enough of their work, you learn about the work, not the person. What you learn from art is always going to be about yourself.  ",
            "created": "Fri, 28 Mar 2025 12:49:59 GMT",
            "flInCalendar": true
        },
        {
            "text": "My father once told me, in all seriousness, the cliche about an abstract work of art -- it isn't art, my father said. I said to him, Dad that you feel so strongly about it means to you it most definitely <i>is</i> art. I believe if he were more truthful about his response, he would say what's behind the feeling, he's experiencing dishonesty, stolen valor, the artist is a profiteer, the person who made it a <i>con</i> artist not a real artist. Pretty similar to what people say in 2025 about art-making machines. ",
            "created": "Fri, 28 Mar 2025 12:51:48 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}