{
    "text": "April 17",
    "created": "Tue, 17 Apr 2018 14:06:01 GMT",
    "name": "17",
    "subs": [
        {
            "text": "Imagine a Twitter where the limit wasn't expressed in the number of characters, but in the number of vertical pixels.",
            "created": "Tue, 17 Apr 2018 14:54:10 GMT",
            "type": "tweet",
            "tweetId": "986256705758597120",
            "tweetUserName": "davewiner"
        },
        {
            "text": "A friend who uses Feedly told me about his collection of NYT feeds. He sent a pointer, where Feedly offered me a chance to use his list. <i>But only on Feedly. </i>Ugh. Ideally, they would let me have the list in OPML form. I suspect they do, but if so, it's not obvious esp to someone who would want the list in OPML, i.e. someone who is not a frequent Feedly user, such as yours truly. This is the problem with commercial vendors who build on open formats. They don't reciprocate. They consume the openness. This <a href=\"https://www.goodreads.com/quotes/468991-all-of-this-has-happened-before-and-it-will-all\">happened</a> before. Even better if they offered a dynamic link to the user's collection, so I could add the link to the OPML to my reader and if his collection changed I'd be updated. Remember the <a href=\"http://scripting.com/2005/12/12.html#howToMakeMoneyOnTheInternetVersion3\">big idea</a> of the web, <i>people return to places that send them away. </i>Feedly is doing the opposite, trying to suck people in and hold them. This is the tech industry philosophy, and it will imho be its downfall.",
            "created": "Tue, 17 Apr 2018 14:27:15 GMT",
            "type": "outline",
            "image": "http://scripting.com/2016/05/25/monopolyDude.png"
        },
        {
            "text": "\"Hannity has no ethics\" is not news. ",
            "created": "Tue, 17 Apr 2018 14:48:03 GMT",
            "type": "outline"
        },
        {
            "text": "I <i>would</i> pay a <a href=\"https://twitter.com/davewiner/status/986234986574630912\">fee</a> to subscribe to a group of news pubs. I think this is necessary, but this should be created and managed independent of the tech industry. News already looks to tech to be its <a href=\"https://en.wikipedia.org/wiki/Age_disparity_in_sexual_relationships#Slang_terms\">sugar daddy</a> which leads to fawning coverage, and a huge conflict, at a time when tech is more in the news than ever, and deserving of scrutiny. Tech controlling news flow, especially Apple, which has little respect for criticism, free speech, spells the end of any semblance of independence of news. Also I'm hearing more that paywalls are seriously stifling the flow of news, at a time when we need <i>better</i> flow. Apple would not be good for that either. ",
            "created": "Tue, 17 Apr 2018 14:19:44 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/04/17/sugarDaddy.png"
        },
        {
            "text": "Apple's pencil",
            "created": "Tue, 17 Apr 2018 14:06:02 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I'm thinking about getting a new iPad, and said so on Twitter. I got a bunch of responses, including this <a href=\"https://mmitii.mattballantine.com/2018/04/17/the-little-white-doo-dah-that-changed-my-working-life/amp/?__twitter_impression=true\">blog post</a> from Matt Ballantine, who loves the iPad because of its compatibility with Apple's <a href=\"https://www.apple.com/apple-pencil/\">pencil</a>. Based on his report, I decided to get the new iPad and the pencil. I used to be a diagram person, as part of pitching ideas to other people, I'd develop what I called a <a href=\"https://en.wikipedia.org/wiki/Chalk_talk\">chalk talk</a>. A very good way to communicate, highly personal and persuasive. ",
                    "created": "Tue, 17 Apr 2018 14:06:05 GMT",
                    "image": "http://scripting.com/images/2012/05/11/ipad.gif"
                },
                {
                    "text": "Ariel Anbar posted a <a href=\"https://www.facebook.com/dave.winer.12/posts/709726209234787?comment_id=709814399225968&notif_id=1523953023107298&notif_t=feed_comment&ref=notif\">caveat</a> about the pencil on Facebook. ",
                    "created": "Tue, 17 Apr 2018 14:08:11 GMT",
                    "subs": [
                        {
                            "text": "My main problem with the Pencil is that it doesn’t hold a charge long when unused - maybe a couple of days - and recharging it requires an additional step beyond my nightly recharge of the iPad. So unless I get into a daily routine with it, I find it is usually dead in the moment of inspiration-driven need.",
                            "created": "Tue, 17 Apr 2018 14:08:57 GMT"
                        },
                        {
                            "text": "On the plus side, it recharges very quickly, but 5 min is an eternity when you suddenly have the need. Add to this the occasional need to mess around to get it to reconnect, and it is one of those really cool and tantalizing and useful but not-quite-up-to-its-lofty-potential pieces of tech.",
                            "created": "Tue, 17 Apr 2018 14:11:22 GMT"
                        },
                        {
                            "text": "As for how to carry it, there are many iPad cases that have solutions. Some are quite inexpensive.",
                            "created": "Tue, 17 Apr 2018 14:11:39 GMT"
                        }
                    ]
                },
                {
                    "text": "Hmmm. That's too bad. I wondered why Apple didn't promote the product more, maybe this is why. Even so, I think I'll give it a try. ",
                    "created": "Tue, 17 Apr 2018 14:09:09 GMT"
                }
            ]
        },
        {
            "text": "Imagine a world without blogging. ",
            "created": "Tue, 17 Apr 2018 14:49:47 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Imagine a world without phones."
                },
                {
                    "text": "In a world without phones, you could listen to people with beautiful voices speak words designed by psychologists to make you want to buy tacos or life insurance."
                },
                {
                    "text": "But you couldn't listen to your daughter or son.",
                    "created": "Tue, 17 Apr 2018 14:49:56 GMT"
                },
                {
                    "text": "Blogging lets us write for each other.",
                    "created": "Tue, 17 Apr 2018 14:49:58 GMT"
                }
            ]
        }
    ]
}