{
    "text": "April 23",
    "created": "Mon, 23 Apr 2018 14:13:43 GMT",
    "name": "23",
    "subs": [
        {
            "text": "<a href=\"https://github.com/scripting/river5/issues/22\">Braintrust query</a>: Tom Critchlow wants to run \"River5\" on <a href=\"https://glitch.com/\">Glitch</a>. Has anyone had any success with this?",
            "created": "Mon, 23 Apr 2018 17:47:19 GMT",
            "type": "outline"
        },
        {
            "text": "New header graphic, a distinctive <a href=\"http://scripting.com/images/2018/04/23/whitePlant.png\">white plant</a> I spotted in a planter on <a href=\"https://www.google.com/maps/place/944+Arlington+Ave,+Berkeley,+CA+94707/@37.8912232,-122.2751939,17z/data=!3m1!4b1!4m5!3m4!1s0x80857eacf59d0f33:0x8fbd8cd1059dd94f!8m2!3d37.8912232!4d-122.2730052\">Arlington Ave</a> in Berkeley in (let's say) 2007. The previous header was a springtime <a href=\"http://scripting.com/images/2018/03/28/kimAndXi.png\">picture</a> of Kim of North Korea and Xi of China. ",
            "created": "Mon, 23 Apr 2018 21:59:59 GMT"
        },
        {
            "text": "I would think that given the hype about blockchain that by now there would at least be a demo of something interesting to an average person.",
            "created": "Mon, 23 Apr 2018 21:39:54 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/988449969605660672"
        },
        {
            "text": "What has <a href=\"https://twitter.com/AnthonyHopkins/status/988087131938742273\">become</a> of Anthony Hopkins??",
            "created": "Mon, 23 Apr 2018 17:40:31 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/AnthonyHopkins/status/988087131938742273"
        },
        {
            "text": "A new kind of software I want to do. Starting with Node.js on the server and JavaScript in the browser as the foundation, ship sample apps or code examples that solve common problems with a neat simple API. We did this inside Frontier for many years, so there's plenty of prior art. The first one is a <a href=\"https://github.com/scripting/feedRead/blob/master/examples/readurl/read.js\">simple</a> feed reading <a href=\"https://www.npmjs.com/package/davefeedread\">API</a>. It takes the URL of a feed and calls back with either an error, or a JavaScript object containing the content of the feed, in a standard form, flattening the differences between the formats. Your code doesn't care. It also handles charset encoding. It's as simple as it can be. Now there's no excuse for not adding a feed reading capability to your Node app. ",
            "created": "Mon, 23 Apr 2018 15:20:21 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/06/29/accordionGuy.png"
        },
        {
            "text": "Without a strong tech press we can't have open formats and protocols, because the big tech companies will just usurp them, monetize them, squeeze all the juice out of them, and leave what remains to rot. We don't have journalism today that watches and reports on the power grabs of the tech industry. That's why it's so easy to expose corruption. It's lying around in the open for all to see. But if you look deeper you'll see how it all connects. No reporter has yet had the will or the requisite technology background to do it.",
            "created": "Mon, 23 Apr 2018 15:16:17 GMT",
            "type": "outline"
        },
        {
            "text": "I got a confusing <a href=\"http://scripting.com/images/2018/04/23/smugMugEmail.png\">email</a> this morning from Flickr, saying I'd have to migrate <a href=\"https://www.flickr.com/photos/scriptingnews\">my site</a> to SmugMug by May 25, or download and delete my site. Then I read their <a href=\"https://blog.flickr.net/2018/04/20/together-smugmug-flickr-faq/\">FAQ</a> that said I would only be agreeing to new terms and privacy policy. In 2014 I wrote a <a href=\"http://scripting.com/2014/08/03/theEphemeralityOfWhatWeCreateOnline.html\">post</a> saying someday Flickr will die. Today is not that day, but it certainly raises the question again. I don't know much about SmugMug. Not the greatest name ever. Might want to just call it Flickr, a better-known name that has been on shaky ground for a long time. Saying it's part of SmugMug now probably doesn't do much to add confidence. Just sayin. ",
            "created": "Mon, 23 Apr 2018 14:55:34 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/04/23/mug.png"
        }
    ]
}