{
    "text": "Woodstock on Netflix",
    "created": "Fri, 23 Aug 2019 14:38:34 GMT",
    "type": "outline",
    "description": "The Woodstock festival story from the point of view of the promoters.",
    "subs": [
        {
            "text": "I was looking through Netflix last night for something to watch, and they had this <a href=\"https://www.netflix.com/title/81135868\">Woodstock title</a>, so I clicked on it, thinking it was the Woodstock <a href=\"https://en.wikipedia.org/wiki/Woodstock_(film)\">movie</a> from 1970, but it was something new, <a href=\"https://www.thirteen.org/programs/american-experience/woodstock-kshqlw/\">from PBS</a>, and it told the story from the point of view of the promoters. How they got the idea, how it morphed from being a studio in the town of Woodstock to an outdoor concert on a field in <a href=\"https://en.wikipedia.org/wiki/Wallkill,_Ulster_County,_New_York\">Wallkill</a>, the town limited the attendance to 5000 (there were already hundreds of thousands of tickets sold) so they had to scramble with just a few weeks to go, find a <a href=\"https://www.google.com/maps/place/Historic+Site+of+the+1969+Woodstock+Festival/@41.699124,-74.8813829,17z/data=!4m8!1m2!2m1!1swoodstock+festival+bethel!3m4!1s0x89dca8a984798b11:0xe6d7490947a9149!8m2!3d41.7010945!4d-74.8804605\">new location</a>, build a stage, etc.  ",
            "created": "Fri, 23 Aug 2019 14:38:38 GMT",
            "image": "http://scripting.com/images/2019/08/23/woodstockPoster.png"
        },
        {
            "text": "They told story of how they <a href=\"https://en.wikipedia.org/wiki/Wavy_Gravy#Woodstock_Festival\">made</a> it such a peaceful cooperative event (it wasn't by accident). They were competent, smart, and driven -- and obviously under a lot of pressure from all sides, but they pulled it off. Remarkable and as it turns out, historic.",
            "created": "Fri, 23 Aug 2019 14:45:04 GMT"
        },
        {
            "text": "When I started watching i thought I'd watch for five or ten minutes, but I went all the way through. A great story well told. ",
            "created": "Fri, 23 Aug 2019 14:48:06 GMT"
        },
        {
            "text": "<b>It could have melted down</b>",
            "created": "Fri, 23 Aug 2019 15:16:05 GMT"
        },
        {
            "text": "They had to do a lot of stuff to prevent it from being a disaster.",
            "created": "Fri, 23 Aug 2019 15:08:12 GMT",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "For example, they chartered a jet to fly in Wavy Gravy and Hog Farm to do security. An inspired idea. ",
                    "created": "Fri, 23 Aug 2019 15:14:14 GMT"
                },
                {
                    "text": "Then the NYS governor (Nelson Rockefeller) wanted to send in the National Guard to clear the place without any thought to the scale of the event. They had to somehow prevent that from happening. ",
                    "created": "Fri, 23 Aug 2019 15:14:24 GMT"
                },
                {
                    "text": "They relied on army helicopters to shuttle medical personnel in, and that started rumors (remember this was 1969, it was as much an antiwar event as it was a music festival), and the guy on the PA system had to keep everything positive. ",
                    "created": "Fri, 23 Aug 2019 15:14:43 GMT"
                },
                {
                    "text": "Then it rained.",
                    "created": "Fri, 23 Aug 2019 15:14:51 GMT"
                },
                {
                    "text": "There was no food. ",
                    "created": "Fri, 23 Aug 2019 15:15:01 GMT"
                },
                {
                    "text": "Not enough toilets. ",
                    "created": "Fri, 23 Aug 2019 15:15:12 GMT"
                },
                {
                    "text": "Bad trips. ",
                    "created": "Fri, 23 Aug 2019 15:15:18 GMT"
                }
            ]
        },
        {
            "text": "People who knew how crowds work said there's no way this won't melt down, but it didn't. A lot of forethought went into it. Worth watching the show just for that part of the story.",
            "created": "Fri, 23 Aug 2019 15:14:06 GMT"
        }
    ]
}