{
    "text": "AI and the NYT",
    "created": "Tue, 12 Mar 2024 12:01:11 GMT",
    "type": "outline",
    "description": "How the NYT and other news orgs can create new products with their raw material -- news. ",
    "subs": [
        {
            "text": "Zach Seward, a friend from my days at <a href=\"https://www.niemanlab.org/about/\">Harvard</a> and NYU, got a kickass <a href=\"https://www.nytco.com/press/zach-seward-is-the-newsrooms-editorial-director-of-a-i-initiatives/\">job</a>, starting up the AI effort at the NYT.  He's just the right guy for it. Young, curious, creative, and very ambitious. And he has a strong startup journalism background. I couldn't think of anyone I'd want more to be in this position. ",
            "created": "Tue, 12 Mar 2024 12:01:15 GMT",
            "flInCalendar": true
        },
        {
            "text": "Now that he's published <a href=\"https://www.zachseward.com/ai-news-thats-fit-to-print-sxsw-2024/?ref=zach-seward-newsletter\">notes</a> for a talk he gave at SXSW, it's time to share some ideas I have for the NYT re AI.",
            "created": "Tue, 12 Mar 2024 12:02:52 GMT",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "Current events. This is something ChatGPT doesn't do. Not sure why. I'd like to be able to connect to <a href=\"https://ai.nytimes.com/\">ai.nytimes.com</a> and ask it to give me a rundown on the <a href=\"http://scripting.com/2024/03/09.html#a200615\">lawyer</a> who's testifying in Congress today about how our president is \"elderly.\" I don't want pointers to stories, though they should be included in the response, I want a custom report, like the ones ChatGPT provides, that answers the questions I have about the MAGA lawyer. Maybe the AI will just give me the story without the spin. ",
                    "created": "Tue, 12 Mar 2024 12:03:32 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "More useful NYT archives. When I was a kid I spent so much time at the <a href=\"https://www.queenslibrary.org/about-us/locations/central-library\">big library</a> in Jamaica (Queens)  going back through microfilm of the NYT from before I was born. So far all we've done is replicate the microfilm user experience (which is great and very useful) but the thing that ChatGPT does so well is prepare custom reports. All that source material, used to answer very specific questions. Answer questions like \"has anything notorious happened in the neighborhood I grew up in, as far as the NYT knows?\"",
                    "created": "Tue, 12 Mar 2024 12:05:36 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Sell a service to your readers where you manage the archive of their blogs, and in doing so you create a much broader archive for historians, journalists and others to study in the future, and, in the context of AI, feed it all kinds of perspective on the time we live in. Maybe in the future history won't be written by the winners (lotsa luck with that). Anyway, if at some point the NYT and other journalism outlets will harness the energy, knowledge and intelligence of the readers, why not start now? ",
                    "created": "Tue, 12 Mar 2024 12:07:13 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "I criticize the NYT a lot, I know. But that <a href=\"http://scripting.com/2018/06/24/181734.html\">means</a> I care. When I stop criticizing you'll know that I've given up. ",
            "created": "Tue, 12 Mar 2024 12:08:27 GMT",
            "flInCalendar": true
        },
        {
            "text": "Alan Kay <a href=\"https://www.azquotes.com/quote/707961\">said</a> of the Mac, it's the first personal computer worth criticizing. That's the spirit. ",
            "created": "Tue, 12 Mar 2024 12:14:17 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}