{
    "text": "Twitter could help fix news",
    "created": "Sun, 16 May 2021 14:48:53 GMT",
    "type": "outline",
    "description": "Two developments at Twitter mean they could start to fix the business model for news.",
    "metaImage": "http://scripting.com/images/2021/05/16/gatesStory.png",
    "subs": [
        {
            "text": "Twitter has a <a href=\"http://scripting.com/images/2021/05/16/newsbox.png\">box</a> in the upper right corner of their web interface that lists news stories they think I might be interested in. I almost always ignore it, or try to, because I've been trained to believe that clicking a link from that box is a total waste. ",
            "created": "Sun, 16 May 2021 14:48:59 GMT",
            "flInCalendar": true
        },
        {
            "text": "But I'm hoping two new developments with Twitter mean they may be doing something to fix that. ",
            "created": "Sun, 16 May 2021 15:16:48 GMT",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "They <a href=\"https://www.theverge.com/2021/5/4/22417852/twitter-buying-scroll-subscription-service-news-revue-newsletter\">bought</a> Scroll.",
                    "created": "Sun, 16 May 2021 14:50:26 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "They <a href=\"https://gizmodo.com/looks-like-twitter-may-be-working-on-a-subscription-ser-1846903280\">leaked</a> that they're going to have a $2.99 per month subscription plan. ",
                    "created": "Sun, 16 May 2021 14:50:31 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "The dream.",
            "created": "Sun, 16 May 2021 14:50:47 GMT",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "As long as Twitter is collecting money from me for the subscription, they can also let me give them say $25 per month to give to news publishers when I go from Twitter to reading their otherwise paywalled stories. ",
                    "created": "Sun, 16 May 2021 14:51:06 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "A story I was interested in.",
            "created": "Sun, 16 May 2021 14:51:43 GMT",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "This morning they had an item about how Bill Gates owns a big piece of Canada's largest railroad network. This is a current interest, how the non-philanthropist side of Bill Gates is more or less the same as before inventing his philanthropist alter-ego. I'm wondering how much the philanthropy is just good PR, vs a real change of the goals of a hugely rich and aging person (Gates and I were born in the same year, so I have an idea). He said, during his most active years in tech that someday he would stop being a predator, and start giving away his money. That's a full-time job he'd say.",
                    "created": "Sun, 16 May 2021 14:51:47 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Screen shots and links.",
            "created": "Sun, 16 May 2021 15:24:37 GMT",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "I clicked the link. <a href=\"http://scripting.com/images/2021/05/16/newsbox.png\">Screen shot</a>. It took me to Twitter's news page, but there's no obvious link to the story, just a synopsis (<a href=\"http://scripting.com/images/2021/05/16/topOfTwitterStoryPage.png\">screen shot</a>) that isn't even about the investments. Oy I've been sold a bill of goods, I thought to myself. I looked everywhere for a link to the story, but it doesn't seem to be there. ",
                    "created": "Sun, 16 May 2021 14:54:38 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Eventually I found a <a href=\"https://twitter.com/TorontoStar/status/1393658704529170432\">tweet</a> further down the page from <a href=\"https://twitter.com/TorontoStar\">@torontostar</a> with a link. I clicked it. Aha <a href=\"https://www.thestar.com/business/2021/05/15/how-did-bill-gates-end-up-owning-13-billion-worth-of-canadas-biggest-railway.html?utm_source=Twitter&utm_medium=SocialMedia&utm_campaign=Business&utm_content=billgates&utm_source=twitter&source=torontostar&utm_medium=SocialMedia&utm_campaign=&utm_campaign_id=&utm_content=\">here's</a> the story. <a href=\"http://scripting.com/images/2021/05/16/storyTopOfPage.png\">Screen shot</a>. I start reading. But after I get through the first paragraph, which is a repeat of what I had just read on Twitter, I am informed that this story is <a href=\"http://scripting.com/images/2021/05/16/paywallArrrrgh.png\">Exclusive to Subscribers</a>. Arrrrgh!! All that just to hit a freaking paywall? You gotta fucking be kidding me. ",
                    "created": "Sun, 16 May 2021 14:56:30 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Do they have UX people at Twitter?",
            "created": "Sun, 16 May 2021 14:58:56 GMT",
            "subs": [
                {
                    "text": "It seems they must know this <a href=\"https://en.wikipedia.org/wiki/User_experience\">UX</a> sucks. It didn't take me very long to figure that out. Maybe they don't know, so I'm doing them a favor by documenting it. Instead, please let's have a new rule Twitter, offer a deal to pubs via your new Scroll acquisition, they take down the paywall for readers coming from Twitter, in return they are paid a fair price for every click, and the news can start becoming useful, at least to Twitter users.",
                    "created": "Sun, 16 May 2021 14:59:10 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "This problem is festering!!",
            "created": "Sun, 16 May 2021 15:00:28 GMT",
            "subs": [
                {
                    "text": "The news industry complains they need money from the government. No that's not what they need. They need to offer their product in an easy to use way that isn't completely diseconomic. It's ridiculous, I am not even slightly in the market for the Toronto Star. I live two hours north of New York City in the US. But they got a story, apparently, that no US paper has, so they're entitled to some money for that. All they're getting from me now is grief. And btw, same with Twitter. Yes, I was interested in a story about the non-philanthropist Bill Gates, they got that right. But I do not have a subscription to the Toronto Star. Surely you can figure that out. If not, I'm willing to tell them which pubs I actually do have subscriptions to. Or better, to repeat myself for the 80,000th time, let me pay. I will pay you. You will make money. You will stop complaining about how there's no money and we can move on from this ridiculous stalemate. ",
                    "created": "Sun, 16 May 2021 15:00:39 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Thanks for listening.",
                    "created": "Sun, 16 May 2021 15:09:52 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}