{
    "text": "I'm not a \"coder\"",
    "created": "Sat, 04 Feb 2023 18:16:24 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "this started out as a mastodon post in this <a href=\"https://mastodon.social/@billseipel@fosstodon.org/109807807318592852\">thread</a> but i went way over the 500 char limit, so I just posted it here instead.",
            "created": "Sat, 04 Feb 2023 18:16:29 GMT",
            "flInCalendar": true
        },
        {
            "text": "i develop whole products as does marco.",
            "created": "Sat, 04 Feb 2023 18:16:46 GMT",
            "flInCalendar": true
        },
        {
            "text": "a funny thing happens when people think you do much less than what you actually do, they hire people to replace you.",
            "flInCalendar": true
        },
        {
            "text": "that's what happened with adam curry and myself back in 2005. he had no idea what i do, he and his partner ron bloom thought they could save some stock and they thought i was being \"difficult\" (I guess) by not taking orders from bloom, so they hired a couple of programmers to replace me, and guess what happened. nothing. they wasted $100 million in vc money, and barked up the wrong tree. if they had worked with me they wouldn't have done that, but they would have had to listen to a mere coder. ",
            "created": "Sat, 04 Feb 2023 18:17:34 GMT",
            "flInCalendar": true
        },
        {
            "text": "same thing happened when RSS became a VC thing, none of them wanted to work with me, so they hired \"software engineers\" and they created products that somehow weren't up to the opportunity. all the companies failed. none of the VCs had the vision or just common sense to bet on the only developer who had proven he knew what was actually going on. ",
            "created": "Sat, 04 Feb 2023 18:18:34 GMT",
            "flInCalendar": true
        },
        {
            "text": "all my career people have been minimizing what we do with disastrous results. go back to my first silicon valley gig, with personal software in 1980. the ceo of the company told me to my face he could do a better job writing the software i was doing, but was too busy to do it. he was full of shit. you had to be really motivated in ways few \"coders\" are to get a 256K program to run in 48K. (which is what the app turned into when we ported it from the apple ii to the ibm pc) Not to mention invent a new freaking category of software. (To his credit the CEO did think of doing outliners before he met me, though his idea of an outliner didn't amount to much more than a start down the path.)",
            "created": "Sat, 04 Feb 2023 18:19:28 GMT",
            "flInCalendar": true
        },
        {
            "text": "you can't make things better by giving into the bullshit money people and marketing people and people who took a few college classes in comp sci impose on our craft. ",
            "created": "Sat, 04 Feb 2023 18:25:06 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}