{
    "text": "Facebook really is dying",
    "created": "Wed, 02 Jan 2019 14:41:16 GMT",
    "type": "outline",
    "description": "It's good that Facebook is dying. I do believe in the death penalty for corporations. They have behaved obscenely, without regard for the natural resources that made their company possible.",
    "subs": [
        {
            "text": "You know I hate the word \"dead\" applied to things that were never alive, but in this case I can't think of a better way to say it. Facebook is turning into a ghost town. Here's how I know. ",
            "created": "Wed, 02 Jan 2019 14:41:20 GMT",
            "image": "http://scripting.com/2016/01/30/strongman.png"
        },
        {
            "text": "One of my favorite features on Facebook is when they show you every day what you posted there on the same day 1, 2, 3 etc years ago. Through that lens you can see what you were doing on their platform in the past. And these days it's been by far the most interesting thing on Facebook, because for me at least it used to be a vibrant interesting place. Not no more.     ",
            "created": "Wed, 02 Jan 2019 14:41:56 GMT"
        },
        {
            "text": "Caveat: Your mileage may vary.",
            "created": "Wed, 02 Jan 2019 14:42:50 GMT"
        },
        {
            "text": "One factor in my perception is they shut off my ability to post via their API. My <a href=\"http://scripting.com/?tab=links\">linkblogging</a> used to flow through Facebook as it does now through Twitter and RSS. And from that, conversations would grow, leading to other ideas, that led to more posts. But now that that channel is closed off, the activity has moved elsewhere. I understand why they did it, fake news, but it had a cost. ",
            "created": "Wed, 02 Jan 2019 14:43:00 GMT"
        },
        {
            "text": "For example in 2017 on this day I posted a comment about a <a href=\"http://scripting.com/images/2019/01/02/smugPilots.png\">cartoon</a> that I cribbed from somewhere, with an appeal to understand why people might have voted for Trump, and why it's tragic that we couldn't work together as citizens instead of crashing the country, which is what Trump was going to do and clearly is doing. ",
            "created": "Wed, 02 Jan 2019 14:44:39 GMT",
            "collapse": "true",
            "subs": [
                {
                    "text": "<img src=\"http://scripting.com/images/2019/01/02/smugPilots.png\">",
                    "created": "Wed, 02 Jan 2019 14:50:33 GMT"
                }
            ]
        },
        {
            "text": "Today I keep posting everywhere I can to please tell Trump that we're tired of winning as he predicted we would be. Maybe he should retire to Mar-a-lago or Moscow or where ever they'll have him. A low-security Federal prison perhaps? It could be just like <a href=\"https://www.youtube.com/watch?v=rQV6CijIzrc\">Goodfellas</a>. ",
            "created": "Wed, 02 Jan 2019 14:45:53 GMT",
            "urlvideo": "https://www.youtube.com/watch?v=rQV6CijIzrc"
        },
        {
            "text": "It's good that Facebook is dying. I do believe in the death penalty for corporations. They have behaved obscenely, without regard for the <a href=\"https://en.wikipedia.org/wiki/World_Wide_Web\">natural resources</a> that made their company possible. It's as if Exxon could rape the planet without any environmental controls. Not just Facebook -- Google too, and every other tech company, because they're all staffed by the people drawn from the same talent pool. Profits before everything. This is what you get. I don't think the press have fully grokked this yet. They're just nibbling at the edges. Maybe that's all they'll ever do? ",
            "created": "Wed, 02 Jan 2019 14:46:55 GMT"
        }
    ]
}