{
    "text": "The topology of social networks",
    "created": "Tue, 08 Jul 2025 12:42:10 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I wrote <a href=\"https://bsky.app/profile/did:plc:oety7qbfx7x6exn2ytrwikmr/post/3lth2enjxls2d\">this</a> on Bluesky this morning.",
            "created": "Tue, 08 Jul 2025 12:42:17 GMT",
            "subs": [
                {
                    "text": "Most of what passes for discourse on platforms like Bluesky amounts to spam and abuse. Makes expensive moderation necessary and who’s going to pay for that on an open system. It’s why this approach can’t lead anywhere but to yet another Twitter or Threads, a place for billionaires to control us.",
                    "created": "Tue, 08 Jul 2025 12:42:49 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Hardly the first time I've said this, but this time I got a <a href=\"https://bsky.app/profile/johngpettus.bsky.social/post/3lth2oar4bk24\">response</a>.",
            "created": "Tue, 08 Jul 2025 12:42:34 GMT",
            "subs": [
                {
                    "text": "Yep. I've said for years—your platform's experience will be determined by its mechanics, not whatever culture you think you want to foster. ",
                    "created": "Tue, 08 Jul 2025 12:43:09 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Mechanics > culture in the medium term.",
                    "created": "Tue, 08 Jul 2025 12:43:14 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "All systems are adversarial systems now.",
                    "created": "Tue, 08 Jul 2025 12:47:44 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "That was from <a href=\"https://bsky.app/profile/johngpettus.bsky.social\">John Pettus</a>. I could tell right off that we're thinking the same way. This morning I started to write a reply but quickly ran out of space because of Bluesky's stupid character limit. So I just pasted it into this blog post. ",
            "created": "Tue, 08 Jul 2025 12:43:45 GMT",
            "subs": [
                {
                    "text": "I've been saying that for years myself. ",
                    "created": "Tue, 08 Jul 2025 12:44:45 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I ran a BBS in the early 80s, and was on Compuserve CB Simulator (my handle was Mastodon), and started blogging in 1994, and on and on. Mail lists always flame out. Same thing we're seeing in the tweetersphere. ",
                    "created": "Tue, 08 Jul 2025 12:44:54 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Blogging has the inverse problem. Spam abuse is impossible, but then it's hard for people to find your brilliance. But at least you get to finish a thought before the trolls attack. ;-)",
                    "flInCalendar": true
                },
                {
                    "text": "I was also a math major, studied combinatorics and graph theory. The connections between nodes determines a lot, as you pointed out. Most people don't even begin to get this.",
                    "created": "Tue, 08 Jul 2025 12:44:50 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I'm working on a new structure for a social web without these problems. It's very simple, a derivative of something I had on my blog in the early days <a href=\"https://daytona.scripting.com/search?q=%22mail%20page%22\">called</a> the <a href=\"http://scripting.com/mail/default.html\">Mail Pages</a>. ",
                    "created": "Tue, 08 Jul 2025 12:58:31 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I sent my blog posts out via email to groups of 8 people chosen randomly each time (or maybe it was 11, I forget). Sometimes great discussions would break out in the groups. I was always cc'd. ",
                    "created": "Tue, 08 Jul 2025 12:45:50 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Sometimes people would just respond to me personally.",
                    "flInCalendar": true
                },
                {
                    "text": "If I saw something I thought everyone should read I would put it on the current Mail Page. Thus there was a way for discourse to have more distribution, but only if I thought it was worthwhile. Spam was not possible, and there was a little bit of abuse here and there, but it would never get any further than my email inbox. ",
                    "created": "Tue, 08 Jul 2025 12:46:14 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "That's how sensible moderation works. And it doesn't cost anything, because the spam motive is gone. ",
                    "created": "Tue, 08 Jul 2025 13:15:06 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I wrote this in a Bluesky message, but had to move it to my blog because of their stupid character limit. ",
                    "flInCalendar": true
                },
                {
                    "text": "BTW, we should communicate and perhaps collaborate. ",
                    "created": "Tue, 08 Jul 2025 12:42:35 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}