{
    "text": "I hate CSS",
    "created": "Tue, 08 Jul 2025 16:26:03 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "There I said it. To ChatGPT.",
            "created": "Tue, 08 Jul 2025 16:26:17 GMT",
            "subs": [
                {
                    "text": "i find flexbox too confusing for me to use at this time. maybe in a year or two, after some more learning. i hate css, everything about it. so it's hard for me to learn new stuff. i grew up using quickdraw on the mac, where i could do everything with math, instead of trying to tease the right behavior as something as convoluted as css and html for apps. ridiculous.",
                    "created": "Tue, 08 Jul 2025 16:26:34 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Wondering what it would say...",
            "created": "Tue, 08 Jul 2025 16:26:52 GMT",
            "subs": [
                {
                    "text": "Totally fair, Dave. That frustration makes perfect sense — you're coming from a world where <b>you told the machine exactly what to do</b>, and it did it.<b> </b>CSS is the opposite: it’s like <b>negotiating with a passive-aggressive layout engine</b> that only gives you what you want if you ask just the right way, using its weird dialect.",
                    "created": "Tue, 08 Jul 2025 16:27:18 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "QuickDraw gave you full control with math — coordinate space, bounding boxes, baseline alignments — it was <b>declarative drawing by imperative code</b>. CSS is declarative positioning by magical suggestion, with hidden constraints, inherited styles, and a constantly shifting box model.",
                    "created": "Tue, 08 Jul 2025 16:28:03 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "You’re not alone in this. A lot of veteran programmers — especially those from early Mac, HyperCard, VB, even Win32 — <b>find CSS maddening</b>. It’s not made for precision. It’s made for fluidity and adaptation. But that’s not how app UIs are often designed.",
                    "created": "Tue, 08 Jul 2025 16:28:15 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "I wish I had written that. ",
            "created": "Tue, 08 Jul 2025 16:28:24 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}