{
    "text": "The Irishman, with spoilers",
    "created": "Thu, 28 Nov 2019 13:26:35 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "My mini <a href=\"https://www.metacritic.com/movie/the-irishman\">Irishman</a> review.",
            "created": "Thu, 28 Nov 2019 13:23:00 GMT",
            "image": "http://scripting.com/images/2019/11/28/theIrishman.png"
        },
        {
            "text": "<a href=\"https://en.wikipedia.org/wiki/Martin_Scorsese\">Scorsese</a> has a style, you can see it in the first scene of <a href=\"http://scripting.com/2019/11/27.html#a195050\">The Irishman</a>, and you smile, not knowing what's coming next, but knowing it's going to be good. The camera snakes through a nursing home and finds our narrator, an ancient Robert De Niro, and the story begins.",
            "created": "Thu, 28 Nov 2019 13:26:51 GMT"
        },
        {
            "text": "They do some fancy CGI stuff to show the characters much younger than the actors are today, but it doesn't work. I was thinking about that all through the movie. How old they are now, the staples of a Scorsese gangland movie, De Niro (76), Pesci (76) and one who's not a staple but also ancient, Pacino (79). And how old are they supposed to be in the scene I'm watching now. It was never clear. And the young CGI version of De Niro looks really old and doesn't look like De Niro. ",
            "created": "Thu, 28 Nov 2019 13:27:14 GMT"
        },
        {
            "text": "It could have been more emotional, gripping and surprising, as good as any of his films, if he had used new actors. The CGI tricks stole the show and not in a good way, imho. I think that's why The Departed really clicked. None of the usual Scorsese ensemble, the stars were Matt Damon, Leonardo DiCaprio, Jack Nicholson, Vera Farmiga, Martin Sheen, Alec Baldwin. They played characters their own age. The story and storytelling took over, I never once thought about the movie-making, was completely captivated by the story. ",
            "created": "Thu, 28 Nov 2019 13:34:38 GMT"
        },
        {
            "text": "However, you <i>must</i> watch The Irishman. Even a not-so-great Scorsese movie is epic and historic, especially with this cast, and especially at this point in all their careers.  ",
            "created": "Thu, 28 Nov 2019 13:37:10 GMT"
        }
    ]
}