{
    "text": "We're still dealing with slavery",
    "created": "Fri, 07 Jul 2017 16:07:34 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "The legal reason that rural voters have exaggerated power in the US is a <a href=\"http://www.crf-usa.org/black-history-month/the-constitution-and-slavery\">compromise</a> that allowed the union to be formed in the first place. The southern slave states had low population agrarian economies, unlike the more urban northern states. If representation in Congress were proportional to population, slavery would have been outlawed at founding, even though (I learned later, after going through the NYC public school system) northern states participated in and profited from the slave trade. ",
            "created": "Fri, 07 Jul 2017 16:07:41 GMT",
            "image": "http://scripting.com/images/2017/07/07/cowboy.png",
            "permalink": "http://scripting.com/2017/07/07.html#a120741"
        },
        {
            "text": "The compromise was that every state, no matter how small its population, got two votes in the Senate. Today that means states like <a href=\"https://en.wikipedia.org/wiki/Wyoming\">Wyoming</a>, with a population that's a <a href=\"http://scripting.com/2017/07/07.html#a120754\">fraction</a> of a NYC <a href=\"https://en.wikipedia.org/wiki/Queens\">borough</a>, gets two votes. Compared with California, the most populous state, which has 66 times the population of Wyoming. California also gets two votes.",
            "created": "Fri, 07 Jul 2017 16:13:28 GMT",
            "permalink": "http://scripting.com/2017/07/07.html#a120728"
        },
        {
            "text": "Add up enough small states and voila, you have Trump in the White House even though he lost the popular vote. And a new right-to-lifer on the Supreme Court (and likely one or two more). Goodbye Planned Parenthood, Medicaid, health care, the climate, voting rights, probably democracy itself, to make permanent the rule of the country by the rural minority. ",
            "created": "Fri, 07 Jul 2017 16:13:52 GMT",
            "permalink": "http://scripting.com/2017/07/07.html#a120752"
        }
    ],
    "permalink": "http://scripting.com/2017/07/07.html#a120734"
}