{
    "text": "The Democratic Party must change",
    "created": "Fri, 24 Jun 2022 13:41:42 GMT",
    "type": "outline",
    "description": "When the Repubs have gone Russian, the Democratic Party as it was previously conceived no longer works.",
    "metaImage": "http://scripting.com/images/2022/06/24/supremeCourt.png",
    "subs": [
        {
            "text": "The <i>world</i> has changed, not just the Supreme Court. If you haven't seen it yet, now's the time. The last minute.  This is what the majority said: Basically the right to an abortion is nowhere in the Constitution. If you want a right to an abortion, get Congress to pass a law. Or, I suppose it could have been more extreme, that the reason it isn't in the Constitution is the same reason murder isn't. ",
            "created": "Fri, 24 Jun 2022 13:41:49 GMT",
            "image": "http://scripting.com/images/2017/10/20/itchyscratchy2.png",
            "flInCalendar": true
        },
        {
            "text": "I don't know, I'm the furthest thing from a legal scholar. But we have entered a new reality, leaving one where almost everyone alive today came of age in a world where abortion was safe and legal, trying to deal with the consequences of that no longer being true. ",
            "created": "Fri, 24 Jun 2022 16:49:07 GMT",
            "flInCalendar": true
        },
        {
            "text": "Also, how do we respond to the idea that anyone in NYC could be carrying a concealed weapon. Someone might bump into you on the street and draw a handgun and someone else could draw one too, and there would be a shootout on 5th Ave in broad daylight and there wouldn't be a law you could pass that would prevent it, that wouldn't ultimately be struck down by the courts.",
            "created": "Fri, 24 Jun 2022 13:45:31 GMT",
            "flInCalendar": true
        },
        {
            "text": "And on and on.",
            "created": "Fri, 24 Jun 2022 13:46:59 GMT",
            "flInCalendar": true
        },
        {
            "text": "Here's what hasn't changed and must, first, before anything else can really. ",
            "created": "Fri, 24 Jun 2022 13:47:05 GMT",
            "flInCalendar": true
        },
        {
            "text": "The Democratic Party.",
            "created": "Fri, 24 Jun 2022 13:47:20 GMT",
            "flInCalendar": true
        },
        {
            "text": "I've written about this at length. It should be the people's party, and that means organizing the people every minute of every day of every year. Our political parties used to be machines for getting people elected, and that worked when both parties agreed the role of government was to govern, but that hasn't been the case since 2009.",
            "created": "Fri, 24 Jun 2022 13:47:25 GMT",
            "flInCalendar": true
        },
        {
            "text": "We need a party that spans all political ideaologies. We're already seeing this happen, it was predicted on this blog years ago. <a href=\"https://en.wikipedia.org/wiki/Liz_Cheney\">Liz Cheney</a>, everyone agrees, is a gift from god. A possible savior of our sanity. And she's probably okay with people carrying guns in Manhattan or not having sex so they don't need an <a href=\"https://twitter.com/RepLizCheney/status/1540361645159055360\">abortion</a>. Yeah she's crazy all right. But she's our kind of crazy, <i>American</i> Crazy. Not Putin Crazy (which is what the Republican Party is now).",
            "created": "Fri, 24 Jun 2022 13:48:26 GMT",
            "flInCalendar": true
        },
        {
            "text": "In other words, when the Repubs have gone Russian, the Democratic Party as it was previously conceived no longer works. ",
            "created": "Fri, 24 Jun 2022 13:50:25 GMT",
            "flInCalendar": true
        },
        {
            "text": "I wrote about this at some length in <a href=\"http://scripting.com/2016/05/04/1237.html\">The Getting-Shit-Done Party</a>, May 4, 2016.",
            "created": "Fri, 24 Jun 2022 13:50:52 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}