{
    "text": "My brain is definitely getting older",
    "created": "Wed, 30 Aug 2017 12:46:54 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "A couple of years ago a younger reporter asked if age was making me less able to imagine the future. That isn't my problem. I still figure stuff out long before younger people. Memory -- that's the problem. Here's a little story. ",
            "created": "Wed, 30 Aug 2017 12:53:23 GMT",
            "image": "http://scripting.com/2016/08/02/stayPuftMarshmallowGuy.png"
        },
        {
            "text": "For some reason I've gotten in the habit of drinking ice coffee instead of hot coffee. Maybe I'll switch back when the weather cools off, maybe not. I remember a colleague telling me many years ago that he always drinks ice coffee even in the winter. That's saying a lot cause he lives in Boston where it gets wicked cold in the winter. Anyway, maybe I will stick with ice coffee, so i decided to stock up on ice cube trays. I only have two. I decide what the hell let's get four more. They're super cheap. Let's always have enough ice. ",
            "created": "Wed, 30 Aug 2017 12:54:41 GMT"
        },
        {
            "text": "Then I remembered that I wanted to be able to make a pot of coffee and cool it off without using the carafe that it's made in. Maybe make two pots of coffee instead of one. And that's where I had the memory glitch. What the fuck are those things called! I could totally picture it, but I could not, in my memory, find the name of it. I entered a description into Google. Drinks server. Close. Add a few extra words, it calls up images of things that are not what I'm looking for. I relax and do something else and then it hits me. Pitcher! That's what it's called. ",
            "created": "Wed, 30 Aug 2017 12:55:22 GMT"
        },
        {
            "text": "Was there ever a time when my young brain would have this kind of trouble? This is new. It happens a lot. Sometimes it's funny. I'm waiting for the day when it's not. ",
            "created": "Wed, 30 Aug 2017 12:56:20 GMT"
        }
    ]
}