{
    "text": "This <a href=\"http://scripting.com/images/2021/10/12/quote.png\">quote</a>, which is part of what I wrote for The Future of Text, kind of says it all, everything I've discovered and built on in my career. I guess it's the answer to the question: \"What's possible with computers that most people don't know about.\" They posted this in a <a href=\"https://twitter.com/TheFutureofText/status/1447969903571505161/photo/3\">tweet</a> at the same time I was <a href=\"https://twitter.com/davewiner/status/1447971032053293066\">posting one</a> about how we fixed the big problem with JavaScript in \"Drummer\". I love JavaScript because it's the closest thing we have to a universal language. We have <a href=\"https://en.wikipedia.org/wiki/Marc_Andreessen\">Marc Andreessen</a> to thank for that (no sarcasm!). But there's no reason JS has to be hobbled by <a href=\"http://callbackhell.com/\">callback hell</a>, <a href=\"https://jsmanifest.com/promises-in-javascript/\">promises</a>, <a href=\"https://javascript.info/async-await\">async/await</a>, or whatever new hack they think up next. It's not hard to factor all that out. Every other language does it. There is absolutely no reason JavaScript has to leave all that mess visible to the programmer who wants it hidden. We proved that in [[Drummer]]. Now our implementation may not be fully baked, and at least one JS guru thinks it may be too slow, all that can be fixed. I want to write straight-line code and let the runtime handle the synchronization. That's worth trading off some speed for, but I don't see why it should require that. And it's the way comptuers are <i>supposed</i> to work, imho. If I didn't say anything most devs probably wouldn't even notice it's there, they still might not, that's how <a href=\"http://scripting.com/2021/03/24/161331.html?title=drummersKeyInnovation\">natural</a> it feels. :rocket:",
    "created": "Tue, 12 Oct 2021 17:06:01 GMT",
    "type": "outline",
    "image": "http://scripting.com/images/2021/01/11/klaesAshford.png",
    "flInCalendar": true
}