{
    "text": "Musk roots the world economy",
    "created": "Mon, 10 Feb 2025 16:03:21 GMT",
    "type": "outline",
    "description": "Run that SQL command on the debt of the United States, and voila, the greatest depression ever.",
    "metaImage": "https://imgs.scripting.com/2025/02/10/metaImage.png",
    "subs": [
        {
            "text": "First, that's just a theory, but I need to get your attention. ",
            "created": "Mon, 10 Feb 2025 16:25:55 GMT",
            "flInCalendar": true
        },
        {
            "text": "Rooting a computer means you own it. You have superuser powers. You can do anything, install or uninstall anything.",
            "created": "Mon, 10 Feb 2025 16:04:50 GMT",
            "flInCalendar": true
        },
        {
            "text": "Mostly journalism has been reporting \"He has our social security numbers.\" Sigh. That's not nearly the problem folks.",
            "created": "Mon, 10 Feb 2025 16:04:58 GMT",
            "flInCalendar": true
        },
        {
            "text": "With root access on the financial computers of the US, you can delete debt. Trump <a href=\"https://www.foxbusiness.com/politics/trump-suggests-us-may-have-less-debt-than-thought-because-fraud\">threatened</a> to do that last night, in a really menacing way. They are smart fellows those guys. ",
            "created": "Mon, 10 Feb 2025 16:05:12 GMT",
            "flInCalendar": true
        },
        {
            "text": "You want to destroy the world economy? Start deleting records of debt to the US treasury. Ask an economist if you don't believe me.",
            "created": "Mon, 10 Feb 2025 16:11:41 GMT",
            "flInCalendar": true
        },
        {
            "text": "More likely is they want to hold the world economy hostage, and then they will take their demands of Gaza and Canada more seriously. It's clever because it doesn't require soldiers, not one shot will be fired. My guess is that they already have this power. ",
            "created": "Mon, 10 Feb 2025 16:05:45 GMT",
            "flInCalendar": true
        },
        {
            "text": "BTW, here's SQL code that randomly deletes 1 in 5 records in a table named inventory. ",
            "created": "Mon, 10 Feb 2025 16:06:03 GMT",
            "subs": [
                {
                    "text": "<code>delete from inventory where rand () < 0.2;</code>",
                    "created": "Mon, 10 Feb 2025 16:06:08 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Run that command on the debt of the United States, and voila, the greatest depression ever.",
            "created": "Mon, 10 Feb 2025 16:06:28 GMT",
            "flInCalendar": true
        },
        {
            "text": "You don't have to be a math wiz to come up with that, btw. You can <a href=\"https://chatgpt.com/share/67aa0be8-91f0-8012-987f-89d8b8edba21\">ask ChatGPT</a>. And before you blame ChatGPT this would be an early exercise in a textbook on SQL programming.",
            "created": "Mon, 10 Feb 2025 16:06:28 GMT",
            "flInCalendar": true
        },
        {
            "text": "Deleting the debt would be like trying to withdraw money from your account at a bank and them saying they have no record of you having an account. The US treasury is basically the root bank of the entire world economy. It's where people store their money.  ",
            "created": "Mon, 10 Feb 2025 16:18:13 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}