{
    "text": "Paycasts?",
    "created": "Mon, 28 Jun 2021 13:57:11 GMT",
    "type": "outline",
    "description": "It's kind of a shame Apple didn't do something creative with their pricing for podcasts.",
    "metaImage": "http://scripting.com/images/2021/06/28/parisStreetScene.png",
    "subs": [
        {
            "text": "It's kind of a shame Apple didn't do something creative with their pricing for podcasts.   ",
            "created": "Mon, 28 Jun 2021 13:57:24 GMT",
            "flInCalendar": true
        },
        {
            "text": "First, pricing for podcasts, as they have implemented it, is awkward and confusing, as evidenced by the way NPR did it. The pricing is voluntary, according to their <a href=\"https://www.npr.org/sections/npr-extra/2021/06/15/1006687574/support-your-favorite-npr-podcasts-with-apple-podcasts-subscriptions\">press release</a>. You can still listen if you don't subscribe (for money). Not sure how it could work otherwise. Would NPR want to transition Fresh Air, one of the founding podcasts? It's kind of like the Meet The Press of podcasting. ",
            "created": "Mon, 28 Jun 2021 13:57:34 GMT",
            "image": "http://scripting.com/images/2021/06/28/flower.png",
            "flInCalendar": true
        },
        {
            "text": "But, what if there were something new, call it a <i>paycast</i> perhaps, where you pay per episode. Maybe $1 per. Flat price, everything costs the same, at least at first. Keep it simple and easy to understand. ",
            "created": "Mon, 28 Jun 2021 13:58:22 GMT",
            "flInCalendar": true
        },
        {
            "text": "You need a special app so there's no confusion about what's what. ",
            "flInCalendar": true
        },
        {
            "text": "It's tied to your credit card. Every time you listen to at least 5 minutes of a podcast, you pay. Put a warning beep at 4 minutes 45 seconds.",
            "created": "Mon, 28 Jun 2021 13:58:37 GMT",
            "flInCalendar": true
        },
        {
            "text": "I would love to try this out because I'm pretty sure this is the way web news will ultimately work, and there is no pricing model for podcasts, therefore nothing to displace, unless you consider ads a model, see below. As long as we're trying something new, might as well try something better than what's already out there, from the point of view of users (we're the ones with your money in our pockets).",
            "created": "Mon, 28 Jun 2021 13:58:37 GMT",
            "flInCalendar": true
        },
        {
            "text": "And btw, no ads please. Ads in podcasts really suck, esp the ones at the beginning. I almost never make it through the ads. ",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}