{
    "text": "Me and FSD",
    "created": "Wed, 10 Apr 2024 23:03:03 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Check out my <a href=\"http://scripting.com/2024/04/09/160339.html\">political preamble</a> on Tesla, X and Musk. ",
            "created": "Wed, 10 Apr 2024 23:03:11 GMT",
            "flInCalendar": true
        },
        {
            "text": "One more disclaimer: I love my Tesla Model Y. Best car ever. I've been driving a Tesla since late 2021, and I still feel privileged to drive the car every time I do. It's the Macintosh of cars.",
            "created": "Wed, 10 Apr 2024 23:03:44 GMT",
            "flInCalendar": true
        },
        {
            "text": "I don't generally use <a href=\"https://www.tesla.com/ownersmanual/modely/en_us/GUID-2CB60804-9CEA-4F4B-8B04-09B991368DC5.html\">FSD</a>, even though I paid for it and have had it available all the time I've driven a Tesla.",
            "created": "Wed, 10 Apr 2024 23:04:28 GMT",
            "flInCalendar": true
        },
        {
            "text": "They say you should always be fully attentive when using FSD. I am always <i>soooo</i> ready to take over for it. I don't trust it. And I also don't feel that when I'm in <a href=\"https://en.wikipedia.org/wiki/White-knuckle\">white-knuckle</a> mode when it's driving, that my reflexes are anywhere near as good as the reflexes I have when I'm driving, with fifty years of experience, and maybe a few hours of experience supervising a FSD car. I don't have a sense of how to work with it. So I err on the side of turning it off whenever I feel like even slightly scared. ",
            "created": "Wed, 10 Apr 2024 23:04:52 GMT",
            "flInCalendar": true
        },
        {
            "text": "I also don't like <a href=\"https://en.wikipedia.org/wiki/Roller_coaster\">roller coasters</a>, but if I did, I'd recognize that this is different. A roller coaster is designed to give the exact same experience to every user every time. It's designed to give the impression that your life is about to end, using gravity and eyesight and all that evolution trained you to be scared of. It fools you into being scared, when you're actually safe. Every so often you read about someone dying on a rollercoaster. That probably improves the fun for thrill-seekers, and gives people like me justification for staying away. People also <a href=\"https://en.wikipedia.org/wiki/Bungee_jumping\">bungee jump</a> knowing there's a chance the chord could break, but they know it's not going to. ",
            "created": "Wed, 10 Apr 2024 23:06:12 GMT",
            "image": "https://imgs.scripting.com/2023/04/10/trumpBeingCarriedAway.png",
            "flInCalendar": true
        },
        {
            "text": "None of that is true for the Tesla. It's making it up as it goes along. And it definitely encounters situations it can't handle, or it misinterprets a set of obvious facts, or even worse it hallucinates just like ChatGPT.",
            "created": "Wed, 10 Apr 2024 23:08:45 GMT",
            "flInCalendar": true
        },
        {
            "text": "Yesterday, I was <a href=\"https://www.google.com/maps/dir/Lake+Katrine,+New+York/Woodstock,+NY/@41.9949908,-74.0943946,13z/data=!4m19!4m18!1m10!1m1!1s0x89dd05c97bfa4075:0xbf2d119b7e29d940!2m2!1d-73.9881934!2d41.9856476!3m4!1m2!1d-74.0796429!2d41.972964!3s0x89dd042d11d4346d:0xbe2f0b18a2064238!1m5!1m1!1s0x89dd0733c0cf4c2b:0xb85cbeef880771fc!2m2!1d-74.1181971!2d42.0409247!3e0?entry=ttu\">driving</a> from Lake Katrine to Woodstock with FSD, and it was doing really well, up to a point. First I was on <a href=\"https://en.wikipedia.org/wiki/New_York_State_Route_28\">Route 28</a>, a four-lane road, for about five miles, it <a href=\"https://www.google.com/maps/@41.9972259,-74.1046808,3a,75y,343.4h,68.85t/data=!3m6!1e1!3m4!1srkTm7bYH3qW0CqLfUyT18w!2e0!7i16384!8i8192?entry=ttu\">turned</a> onto <a href=\"https://en.wikipedia.org/wiki/New_York_State_Route_375\">375</a> which is a curvy two-lane road. I was starting to feel slightly comfortable. Then we come up to <a href=\"https://en.wikipedia.org/wiki/New_York_State_Route_212\">212</a>, where 375 ends. A busy <a href=\"https://www.google.com/maps/@42.0369198,-74.1109242,3a,75y,19.14h,83.49t/data=!3m6!1e1!3m4!1sJbEh3c4hgugNZsCx4uUtZw!2e0!7i16384!8i8192?entry=ttu\">intersection</a>. Traffic coming from the left and right, and many are turning onto the road I'm on. I watched in awe as FSD tried to find a way to make a left turn in this complicated situation, starting, stopping, it tried, found itself out in traffic, and got stuck there. I had enough and took over. Luckily the car waiting behind us had left a little room. I've dealt with this intersection probably a few hundred times in the last few years. I know the crazy things the other drivers do here, and I know to watch out for them. The Tesla didn't know.  ",
            "created": "Wed, 10 Apr 2024 23:11:19 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}