{
    "text": "Rebooting our societal intellect",
    "created": "Fri, 15 Sep 2017 13:59:58 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "At first I was ambivalent about Chelsea Manning as a fellow at <a href=\"https://www.hks.harvard.edu/\">HKS</a>. But seeing all that it has stirred up, I think she would be good. You <i>want</i> lightning rods to help identify issues and boundaries. I understand the objections, let's get those people at HKS too, and discuss the issues, like scholars. That's what universities are for. ",
            "created": "Fri, 15 Sep 2017 14:00:07 GMT"
        },
        {
            "text": "I know so many influential people in academia, many who were early participants in the web and blogosphere. We were there in the early days when online discourse held great promise for bringing the differences of the world together, to be accepted, de-weaponized. It turned out the opposite. We brought the differences together and enhanced them, and the rage spilled out into the real world. ",
            "created": "Fri, 15 Sep 2017 14:00:53 GMT"
        },
        {
            "text": "<a href=\"https://www.hks.harvard.edu/announcements/statement-dean-elmendorf-regarding-invitation-chelsea-manning-be-visiting-fellow\">Firing</a> Chelsea Manning was a <a href=\"http://talkingpointsmemo.com/livewire/harvard-revokes-chelsea-manning-visiting-fellow-title\">mistake</a>, but an understandable one. Let's get the <a href=\"http://nypost.com/2017/09/14/ex-cia-director-resigns-from-harvard-over-manning-fellowship/\">guy who quit</a> to come back and spend more time at HKS, and get more people on either side of this divide, study it, civil discourse it to death, and see what we're left with.",
            "created": "Fri, 15 Sep 2017 14:02:11 GMT"
        },
        {
            "text": "I think the university is our way out of the intelletual logjam we're in. We have to use all the tools at our disposal, including academic discourse. ",
            "created": "Fri, 15 Sep 2017 14:03:16 GMT"
        }
    ]
}