{
    "text": "Dale Bumpers' speech",
    "created": "Thu, 23 Jan 2020 17:59:36 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Have you ever seen the closing argument in the Clinton impeachment by former Senator Dale Bumpers? If not it's a treat, you deserve it, it gives an idea of how trials bring out amazing things in people. ",
            "created": "Thu, 23 Jan 2020 17:59:45 GMT"
        },
        {
            "text": "<center><iframe width=512 height=330 src='https://www.c-span.org/video/standalone/?c4717619/dale-bumpers-clinton-impeachment-part-2' allowfullscreen='allowfullscreen' frameborder=0></iframe></center>",
            "created": "Thu, 23 Jan 2020 18:00:49 GMT"
        },
        {
            "text": "Having served jury duty twice, once through deliberations to a verdict, I was really impressed at how deep random people from all walks of life can go, given an opportunity to get immersed in understanding other humans. I sense a bit of that starting to happen here. It's not imho in any way a foregone conclusion what will come out of this.",
            "created": "Thu, 23 Jan 2020 18:00:50 GMT"
        },
        {
            "text": "It's also interesting, listening to the Bumpers speech, I hadn't listened to it in a a long time, how much this impeachment must hurt for Hillary Clinton. No one gave a shit about her in the Clinton impeachment, yet Bumpers does touch on it. And now she's a subject of controversy again because she dared to say what she actually thinks about Bernie Sanders.",
            "created": "Thu, 23 Jan 2020 18:01:33 GMT"
        },
        {
            "text": "A longtime friend Dan Conover isn't watching the impeachment, arguing basically there's no new information, but I think he's making a mistake. You could say the same about going to see a historic play like Hamilton. You know the outcome, so why pay the huge price in money and time to go see it. Because something other than information is transmitted.",
            "created": "Thu, 23 Jan 2020 18:01:54 GMT"
        }
    ]
}