{
    "text": "McNeil, the Jeremy Lin of the NYT",
    "created": "Mon, 15 Feb 2021 17:24:51 GMT",
    "type": "outline",
    "metaImage": "http://static.scripting.com/larryKing/images/2014/02/25/meloLin.gif",
    "description": "The combo of McNeil and the Daily podcast was gold. Why did they break up the team? ",
    "subs": [
        {
            "text": "I hoped that when Ben Smith <a href=\"https://www.nytimes.com/2021/02/14/business/media/new-york-times-donald-mcneil.html\">wrote</a> <a href=\"https://mediagazer.com/210214/p5#a210214p5\">about</a> the Donald McNeil firing at the NYT, he'd look at the media angle, not the internal chaos at the NYT. I guess maybe in a sense that is media? It's an old story, honestly I think only journalism insiders care. I don't.",
            "created": "Mon, 15 Feb 2021 17:24:59 GMT",
            "flInCalendar": true
        },
        {
            "text": "McNeil was like [%search: Jeremy Lin%] in 2012 and the NYT was the Knicks. Right person at the right place at the right time. And (oddly) the NYT did the same thing with McNeil that the Knicks did with Lin. Weird how that works. Someone should write a book. ;-)",
            "created": "Mon, 15 Feb 2021 17:25:16 GMT",
            "flInCalendar": true
        },
        {
            "text": "What mattered with Lin and what matters with McNeil is that the users love them. You should check that out. I could go into great detail, but honestly that's not my job. I'm a user and actually a longtime fan of both the Knicks and the NYT. ",
            "created": "Mon, 15 Feb 2021 17:25:21 GMT",
            "flInCalendar": true
        },
        {
            "text": "Ask the NYT reporter who covers the Knicks now. They're doing great. They have a bunch of Jeremy Lins now. Somehow they figured out their business. The NYT imho is drifting further and further away from it.  ",
            "created": "Mon, 15 Feb 2021 17:25:27 GMT",
            "flInCalendar": true
        },
        {
            "text": "The combo of McNeil and the Daily podcast was gold. Why did they break up the team? Ben, that would be a story worthy of you. Again imho. A fan. Dave",
            "created": "Mon, 15 Feb 2021 17:25:39 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}