{
    "text": "I like radio buttons",
    "created": "Sat, 01 Jul 2017 15:52:13 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "On Facebook, Scott Knaster says he's amazed that people still use the term <a href=\"https://en.wikipedia.org/wiki/Radio_button\">radio button</a> for mutually exclusive buttons. He asks \"How many people programming these have any idea what that means?\" (Sorry I don't link to Facebook posts.)",
            "created": "Sat, 01 Jul 2017 15:52:22 GMT",
            "image": "http://scripting.com/images/2017/07/01/radio.png",
            "permalink": "http://scripting.com/2017/07/01.html#a030722"
        },
        {
            "text": "Does it really matter if people know the derivation? Think of all the non-English speakers who learn the names for concepts that came from English-speaking countries. The words are just words, they have no meaning beyond their functionality.   ",
            "created": "Sat, 01 Jul 2017 15:52:39 GMT",
            "permalink": "http://scripting.com/2017/07/01.html#a030739"
        },
        {
            "text": "It's not as if hamburgers are made of ham. :hamburger:",
            "created": "Sat, 01 Jul 2017 22:54:05 GMT",
            "permalink": "http://scripting.com/2017/07/01.html#a100705"
        },
        {
            "text": "Further, when something has a name that everyone knows why not keep using it? Why are the foot controls in cars the same today as they were when I learned to drive in the seventies? Look at all the change that's happened in cars since then. ",
            "created": "Sat, 01 Jul 2017 15:55:53 GMT",
            "permalink": "http://scripting.com/2017/07/01.html#a030753"
        },
        {
            "text": "Why do many of the streets in Manhattan have the same names they had in colonial times? There's no wall on Wall St. <a href=\"https://en.wikipedia.org/wiki/Broadway_(Manhattan)\">Broadway</a> is an anglicized version of a Dutch name believe it or not, not descriptive. ",
            "created": "Sat, 01 Jul 2017 15:56:27 GMT",
            "permalink": "http://scripting.com/2017/07/01.html#a030727"
        },
        {
            "text": "When you have a spirit of continuity you can make design decisions you intend to have last for generation after generation.",
            "created": "Sat, 01 Jul 2017 15:53:26 GMT",
            "permalink": "http://scripting.com/2017/07/01.html#a030726"
        },
        {
            "text": "So much change in tech is just coming up with new names for well-understood concepts. I have friends I use to help translate. It's a job security thing. Full employment for programmers. But on the whole it's not a good idea. Keeps us from building.",
            "created": "Sat, 01 Jul 2017 15:53:39 GMT",
            "permalink": "http://scripting.com/2017/07/01.html#a030739"
        }
    ],
    "permalink": "http://scripting.com/2017/07/01.html#a030713"
}