{
    "text": "No, and...",
    "created": "Sat, 26 Apr 2025 13:11:41 GMT",
    "type": "outline",
    "description": "If I was president of Harvard University, I'd be thinking about how to take advantage of the spotlight the Trump Administration had focused on us. ",
    "metaImage": "https://imgs.scripting.com/2025/04/26/harvardSquareMashup.png",
    "subs": [
        {
            "text": "If I was president of Harvard, I'd be thinking about what's next after the Trump government has tried to destroy the university and we said no. If we have to do without the government money, that's okay because we wouldn't be Harvard if we allowed the government to run the university. That goes for any government, but especially for this one.  ",
            "created": "Sat, 26 Apr 2025 13:04:03 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "It goes beyond saying No. ",
            "created": "Sat, 26 Apr 2025 19:11:22 GMT",
            "flInCalendar": true
        },
        {
            "text": "It's no and..",
            "created": "Sat, 26 Apr 2025 19:13:33 GMT",
            "flInCalendar": true
        },
        {
            "text": "No and we're going to get by with less money and in the process do better work, provide more of a service to our students, community and our country. ",
            "created": "Sat, 26 Apr 2025 19:13:38 GMT",
            "flInCalendar": true
        },
        {
            "text": "We're going to bring the country into Harvard and bring Harvard into the country. How did we get so far apart? ",
            "created": "Sat, 26 Apr 2025 19:24:19 GMT",
            "flInCalendar": true
        },
        {
            "text": "Let's get by with less money, and in the process do better work.",
            "created": "Sat, 26 Apr 2025 13:18:51 GMT",
            "flInCalendar": true
        },
        {
            "text": "It seems that Harvard, along with all the universities in the US, has been tasked with re-establishing the First Amendment, and what it means to all of us. Let's trust that the people of our country know why the First Amendment is so important, regardless of who we voted for. Some of it leaked out when they interviewed random people in real time at the Trump assassination rally last summer. They all sounded like people who could be neighbors of mine, and they largely said what I would have said. It's okay if you don't agree with someone, but for crying out loud, don't shoot them for it. Yeah. That was a real eye-opener for me, when TV didn't have a chance to choose only the most extreme ugly Trump supporters, we found out that they are Americans, like us. A lot of the news <i>is</i> fake, designed to make us angry and depressed, because that's what gets us to come back every night. ",
            "created": "Sat, 26 Apr 2025 13:13:49 GMT",
            "flInCalendar": true
        },
        {
            "text": "So Harvard, the ultimate elite institution, if it can connect with that, maybe the everyday non-elite American will listen now that the Trumps have done such an outlandish thing in trying to destroy Harvard, maybe we can change the role that Harvard and its peers play in the American politics and culture, and we can get a bit more science into our world, with the approval of the people. ",
            "created": "Sat, 26 Apr 2025 13:14:38 GMT",
            "flInCalendar": true
        },
        {
            "text": "Maybe this was the way Harvard contributed to the problem, by feeling above the average person. This is very real and inescapable. But many of us came from middle-class or even refugee families (like my own) and we haven't forgotten where we came from. If there's a disconnect, it's not fair to blame one or the other. Each has the power to reconnect. Let's take this chance to get together and help each other, across all the divides.",
            "created": "Sat, 26 Apr 2025 13:15:25 GMT",
            "flInCalendar": true
        },
        {
            "text": "The Trump focus on Harvard may be the greatest gift, if Harvard chooses to view it that way.",
            "created": "Sat, 26 Apr 2025 13:15:45 GMT",
            "flInCalendar": true
        },
        {
            "text": "PS: I was a research fellow at Harvard for two years in the early 00s. I found the university was very receptive and supportive of these ideas then, esp in regard to the web, where we pioneered many of the things people take for granted now. ",
            "created": "Sat, 26 Apr 2025 13:16:20 GMT",
            "flInCalendar": true
        },
        {
            "text": "PPS: This is a bit like the <a href=\"https://en.wikipedia.org/wiki/Streisand_effect\">Streisand Effect</a>. Let the Trumps pick their fights more carefully.",
            "created": "Sat, 26 Apr 2025 13:25:55 GMT",
            "flInCalendar": true
        },
        {
            "text": "PPPS: Think about where Apple was in 1997, the bottom had dropped out. Ten years later they shipped the iPhone. That kind of transition could happen for Harvard and the intellect of America, which seems to (hopefully) be at a bottom.",
            "created": "Sat, 26 Apr 2025 18:53:47 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}