{
    "text": "I'm spending a couple of days <a href=\"https://github.com/scripting/drummerRFC/issues/7\">baking</a> GitHub into \"Drummer\" via scripting. We used to call this a \"scriptable app\" on the Mac, when apps were <a href=\"https://en.wikipedia.org/wiki/FileMaker\">Filemaker</a> and <a href=\"https://en.wikipedia.org/wiki/QuarkXPress\">Quark Xpress</a>, the <a href=\"https://en.wikipedia.org/wiki/Finder_(software)\">Finder</a>, stuff like that. Then when \"Frontier\" moved to the web, the apps were <a href=\"https://en.wikipedia.org/wiki/Eudora_(email_client)\">Eudora</a>, <a href=\"https://en.wikipedia.org/wiki/Netscape\">Netscape</a>, <a href=\"https://en.wikipedia.org/wiki/Internet_Explorer\">MSIE</a> and <a href=\"https://en.wikipedia.org/wiki/MacHTTP\">MacHTTP</a>, then Google and \"Manila\", then WordPress and Twitter. Along the way came new protocols -- \"XML-RPC\", \"RSS\", \"OPML\". Drummer already has excellent scripting support for <a href=\"http://docserver.scripting.com/?verb=twitter.addGroupToList\">Twitter</a>. I made this a priority to have one really good scriptable app when Drummer came out. Now I'm working on the second biggie. I wrote <a href=\"http://scripting.com/2021/11/08.html#a143815\">yesterday</a> that GitHub could be <a href=\"https://en.wikipedia.org/wiki/MS-DOS\">MS-DOS</a>. What I meant is that it's basic low-cost storage for everyone with a GitHub account that's about as easy to work with as MS-DOS was. For early adopters, what we used to call power users. It's an amazing resource. And that made me think of MS-DOS because both are owned by Microsoft and storage is basically what MS-DOS did, and btw, MS-DOS is the one product they didn't use as a weapon when they were trying to usurp the web, so it has a nice taste to it, still. I have <a href=\"https://github.com/scripting/drummerRFC/issues/7\">started a thread</a>, on GitHub of course, narrating what I've got working. Watch this space.",
    "created": "Tue, 09 Nov 2021 16:43:16 GMT",
    "type": "outline",
    "image": "http://scripting.com/images/2021/11/09/2001.png",
    "flInCalendar": true
}