{
    "text": "Using GitHub in a feed system",
    "created": "Wed, 29 Nov 2017 15:02:40 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I'm working with <a href=\"https://twitter.com/dabeard\">David Beard</a> on an experiment. We want to teach editorial organizations how to run their own news \"superfeeds,\" so they can invest in news resources for their editorial people and for their readers. But first we had to do it ourselves, with David in the editorial role and me as his system developer.",
            "created": "Wed, 29 Nov 2017 15:02:59 GMT"
        },
        {
            "text": "In this setup, I'm running \"River5\" on my one of my AWS servers. It's generating my news sites, the <a href=\"http://nytimesriver.com/\">NYT river</a>, <a href=\"http://podcatch.com/\">podcasts</a>, <a href=\"http://mlbriver.com/\">MLB</a>, <a href=\"http://nbariver.com/\">NBA</a>, <a href=\"http://politics.newsriver.org/\">politics</a>, <a href=\"http://bloggers.scripting.com/\">bloggers</a>, and the <a href=\"http://scripting.com/river.html\">one</a> I do for the readers of my blog, and more. We're going to set it up so it generates David's river along with mine. ",
            "created": "Wed, 29 Nov 2017 15:04:39 GMT"
        },
        {
            "text": "David needs to create and update a list of feeds for his river. He's not a programmer. I decided to give GitHub a try.  ",
            "created": "Wed, 29 Nov 2017 15:06:55 GMT",
            "flNumberedSubs": "true",
            "subs": [
                {
                    "text": "I created a <a href=\"https://github.com/scripting/test2\">new repository</a> and invited him to be a collaborator.",
                    "created": "Wed, 29 Nov 2017 15:08:48 GMT"
                },
                {
                    "text": "I created a folder called lists, and a file called beard1.txt. I set it up <a href=\"https://github.com/scripting/test2/commit/fbf356a55a114e730e3076a69b6fdd48e9514923#diff-adaa18d5bfb99074a2656ce71c93dd32\">initially</a> with some of the example feeds included with River5. ",
                    "created": "Wed, 29 Nov 2017 15:09:02 GMT"
                },
                {
                    "text": "I told him where the list was, and said he should edit it, to add or remove feeds, and to let me know when it was ready. ",
                    "created": "Wed, 29 Nov 2017 15:09:30 GMT"
                },
                {
                    "text": "Then I created a script on the server that reads the <a href=\"https://github.com/scripting/test2/blob/master/lists/beard1.txt\">GitHub file</a> every five minutes and saves it into the <i>lists</i> folder on my River5 system. ",
                    "created": "Wed, 29 Nov 2017 15:10:07 GMT"
                },
                {
                    "text": "From there, \"River5\" does what it does with all lists. It creates a new river file, with the same name, and reads all the feeds in the list that it isn't already reading. When an item comes in from a feed he's subscribed to, it's added at the top of his river. ",
                    "created": "Wed, 29 Nov 2017 15:10:46 GMT"
                },
                {
                    "text": "Then I created a tiny <a href=\"http://scripting.com/misc/beardriver/\">HTML shell</a> that uses the <a href=\"https://github.com/scripting/riverBrowser\">RiverBrowser</a> module to display the river. I pointed it at his <a href=\"http://radio3.io/rivers/beard1.js\">river.js file</a>. It all worked! ",
                    "created": "Wed, 29 Nov 2017 15:11:49 GMT"
                }
            ]
        },
        {
            "text": "The most important thing is we have a workflow that allows him to change the contents of his river whenever he wants, without any tech support. That's the kind of system we all like. :boom:",
            "created": "Wed, 29 Nov 2017 15:12:38 GMT"
        }
    ]
}