{
    "created": "2024-03-02T05:00:00.000Z",
    "flInCalendar": true,
    "name": "02",
    "path": "2024/03/02",
    "text": "March 02",
    "type": "calendarDay",
    "subs": [
        {
            "text": "There's a rule in covering elections that they don't make projections or even analyze results on TV until all the polls are closed. We need an analogous rule that says there should be no reporting on polls until after the election, to allow the people to form their own opinions, for the same reason. Also, people are less likely to vote if they feel the outcome is a foregone conclusion. People even form their decision re who to vote for based on the polls. That's not a very healthy way for a country to govern itself. ",
            "created": "Sat, 02 Mar 2024 14:24:02 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2023/05/30/youAreBullshit.png",
            "flInCalendar": true
        },
        {
            "text": "The big deal with ChatGPT is that it's a huge improvement over search. Instead of hunting for clues to the info you need, you can ask the question you have and get an answer. It has encyclopedic knowledge of all the development environments I use. And it knows how to put the pieces together. I don't care how it does it, it's a much higher level tool than search. Like the difference between a calculator and a computer. ",
            "created": "Sun, 03 Mar 2024 03:13:18 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "When I was a grad student in Comp Sci, I was a teaching assistant for a class in <a href=\"https://ece252.ece.wisc.edu/ch07_inclass_01_assembly_language.pdf\">assembly language</a> programming for a couple of years. One of my responsibilities was to grade the work of the students. Later, I was the CEO and lead developer at a software company I founded, and there I had to review other people's source code. I was pretty fussy about writing understandable code, because it was my job in both places to understand their code, and I also knew, even when I was just a TA, how important it is that your code be human-readable, not just machine-readable. I just want to say if ChatGPT were a student of mine, its code would get an A+, with thanks from the teacher for making my life easier. ",
            "created": "Sat, 02 Mar 2024 14:38:15 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Actually it would get an A+ if it were a student, but not a very high grade for a member of my development team, because it can't seem to learn my coding style. I've pasted an awful lot of my code into its \"tiny little text box\". ",
            "created": "Sat, 02 Mar 2024 17:41:09 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Ben Werdmuller <a href=\"https://werd.io/2024/why-i-wont-have-a-blogroll\">explains</a> why he won't have a blogroll. This is the kind of thread we used to form in the old school blogosphere. I don't have an opinion about whether he will or won't have one, but for me, the process of putting this together in 2024 has been a really good thing. I'm better in touch with what other people are doing. My blogroll does more than it did 20 years ago. Actually it's a lot like his <a href=\"https://sources.werd.io/\">Sources page</a>, but more compact. I'm glad we're having this discussion. It's <i>exactly</i> what I hoped would happen. And of course my feed list is behind my blogroll. ",
            "created": "Sat, 02 Mar 2024 17:33:00 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}