{
    "created": "2024-03-03T05:00:00.000Z",
    "flInCalendar": true,
    "name": "03",
    "path": "2024/03/03",
    "text": "March 03",
    "type": "calendarDay",
    "subs": [
        {
            "text": "This is how <a href=\"https://imgs.scripting.com/2024/03/03/emailFromMom1968.png\">parents sent email</a> to their kids at summer camp in 1968.",
            "created": "Mon, 04 Mar 2024 03:31:07 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "If the Democrats had a sense of the moment they'd run the campaign on a plan to regain control of the House and keep the Senate and White House so we can pass a law that legalizes abortion in the whole country. Give people a positive reason to elect a governing majority. Think powerfully. ",
            "created": "Mon, 04 Mar 2024 03:25:19 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://en.wikipedia.org/wiki/Sarah_Sherman\">Sarah Sherman</a> is <a href=\"https://twitter.com/davewiner/status/1764285380713447902\">incredible</a>, like a <a href=\"https://en.wikipedia.org/wiki/Gilda_Radner\">Gilda Radner</a> or <a href=\"https://en.wikipedia.org/wiki/John_Belushi\">John Belushi</a>, she becomes the character she's playing, but she's still herself.  ",
            "created": "Sun, 03 Mar 2024 16:11:02 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Biden <i>is</i> a fine president",
            "created": "Sun, 03 Mar 2024 18:05:53 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I found myself responding at length to my longtime friend and proto-blogger <a href=\"https://www.threads.net/@jeffjarvis/post/C4Dyym1uc3c\">Jeff Jarvis</a>, so instead of posting a thread of chained messages, I just made it a blog post. ",
                    "created": "Sun, 03 Mar 2024 18:06:02 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The thing about Gaza is that there's the rest of the world, and they're watching to see how we deal with Israel, given that Netanyahu has been such an asshole to the US. He's a freaking MAGA. ",
                    "created": "Sun, 03 Mar 2024 18:06:41 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "So the president has to gradually increase the pressure on Israel, but he has to be mindful that there already is a shitload of pressure all around, more pressure is the last thing we need. A lot more people will die if it spirals out of control. But Biden is increasing the pressure. The images of the air food drops into Gaza from US planes is exactly the right way to proceed for the US. It shows that there's another path, compassion and help. ",
                    "created": "Sun, 03 Mar 2024 18:12:55 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Being president of the United States is a complicated thing IOW. But they're doing it the only way we can, given who we are.  ",
                    "created": "Sun, 03 Mar 2024 18:06:54 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Jeff, I know you know this. This would be the adult discussion, which we never have. Journos seem to think Americans can't understand the basics of world politics, but somehow we understand the rules and history of the NBA, NFL and MLB. The functioning of politics isn't really any more complicated. ",
                    "created": "Sun, 03 Mar 2024 18:06:55 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}