{
    "created": "2024-03-19T04:00:00.000Z",
    "flInCalendar": true,
    "name": "19",
    "path": "2024/03/19",
    "text": "March 19",
    "type": "calendarDay",
    "subs": [
        {
            "text": "<a href=\"https://www.threads.net/@pkedrosky/post/C4tOq4hPiBn\">Paul Kedrosky</a> is paying for feeds coming out of Twitter and subscribing to them in Feedly along with his other feeds. This is smart and futuristic. No reason to have two or more social webs, let's get them all working together.",
            "created": "Tue, 19 Mar 2024 21:36:19 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I was looking around the old social web circa 2003 and found the blogroll on my Radio UserLand <a href=\"https://web.archive.org/web/20031206074937/https://radio.weblogs.com/0001015/\">blog home page</a>. Screen shot to the right. It shows that the art was very much still being practiced then. It looks cared-for. All themes designed by Bryan Bell. I am going to set up a demo of the home page, because I want to look at it as \"live\" as I can get it, and see if there are ideas there I want to bring forward to 2024. ",
            "created": "Tue, 19 Mar 2024 14:48:01 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2024/03/19/blogroll2003.png",
            "flInCalendar": true
        },
        {
            "text": "Developing great products is something like the NBA which they always say is a business, esp when a player you love is traded. Happened recently with a point guard, Immanuel Quickley, traded from Knicks to Raptors. He wasn't the only heart of the Knicks, but he was one of them. He has a competitive grace you don't see very often. Quickley was one of those guys you knew would be the starting point guard on some NBA team, he was that good. But he was unlikely to get there on the Knicks, so we can be happy for him because he is the starting point guard on the Raptors, but we lost something important there. But the business side, if done well, opens the door for bigger love. I love watching the Knicks win they way they are winning now. That's what I want from developing software. I want to create a global team of truly independent developers, filling the void left by the <a href=\"https://en.wikipedia.org/wiki/Predation\">predation</a> of the silos. There won't even be a business model for much of what we do, but there will be lots of teamwork and lots of fun, because the best accomplishment is when we do it as a team. We're going to play a game we started to play in the mid-90s, and somewhere somehow forgot we could still play it. We can. I am old now, I feel it, I can't produce end-user software much longer, but I don't want to leave until we have this thing rebooted. ",
            "created": "Tue, 19 Mar 2024 13:14:01 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I got <a href=\"https://politics.newsriver.org/\">politics.newsriver.org</a> working again. Things got pretty shaky in news product land. I'm trying to figure out a general formula for getting things working again.  And as I update them, I'm switching them over to HTTPS. Once again I have to put in a plug for <a href=\"https://caddyserver.com/\">Caddy</a>. A real time-saver.",
            "created": "Tue, 19 Mar 2024 17:11:19 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Did the same for <a href=\"https://bloggers.scripting.com/\">bloggers.scripting.com</a>. I found what may be a bug in \"PagePark\" believe it or not. An ancient workhorse of Dave-Net.",
            "created": "Tue, 19 Mar 2024 17:23:49 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "And <a href=\"https://nbariver.com/\">nbariver.com</a> and <a href=\"https://mlbriver.com/\">mlbriver.com</a>.",
            "created": "Tue, 19 Mar 2024 21:16:55 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "When they report on Trump’s financial situation they don’t take into account that the property, golf courses, buildings, etc are all mortgaged beyond the max, that’s what the NY trial was about, him lying about values for the purpose of getting loans on the property. So his equity in these investments is probably 0 or even negative (because of the fraud). No one is going to loan him anything on the properties, because he has no equity, and the story they tell about New York state liquidating his assets, there almost certainly is nothing to liquidate. Anyone who owns a home and has a mortgage can understand this, it works the same way even if the property is much more valuable than a family home. I asked jokingly what his credit rating must be, but it's a good question to ask, would help regular people relate to the situation. ",
            "created": "Tue, 19 Mar 2024 13:30:30 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}