{
    "created": "2024-03-23T04:00:00.000Z",
    "flInCalendar": true,
    "name": "23",
    "path": "2024/03/23",
    "text": "March 23",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I've had my <a href=\"https://blogroll.social/\">blogroll</a> for a couple of weeks now, and I've got it on-screen a lot, as I'm developing another user interface that has the blogroll in it. This blogroll is much like the one I had in the 00s, but it's in motion, and it's a source of news and ideas. It's also doing the thing that Twitter used to do, it lets me have a way to see what specific people are interested in. I expect more of that as new people get this kind of blogroll. Right now I'm pretty much the only one. The next step is getting the blogroll running in WordPress. And then getting it running on <a href=\"https://om.co/\">Om's blog</a> and <a href=\"https://doc.searls.com/\">Doc's blog</a>, both of whom have real experience with the art of blogrolling. From that, I expect to have a better idea of what the editorial UI should look like for people creating and managing these blogrolls. We'll iterate until it's pretty easy to set up and manage one. Also to be clear, I want it to run in other platforms, this is not exclusive to WordPress. It's just the place where the people are right now, the ones I really want to work with. But I wouldn't mind it running in <a href=\"https://substack.com/\">Substack</a> for example, if there are any writers there who find this compelling. That would require cooperation from the company though, their platform as far as I know, does not support other-party plugins. ",
            "created": "Sat, 23 Mar 2024 16:00:12 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2024/03/23/blogrollMan.png",
            "flInCalendar": true
        },
        {
            "text": "I saw someone get upset that ChatGPT can beat humans at debate, but we humans, esp here in the US for the last few decades, haven't been taking good care of ourselves intellectually. It would be one thing if we placed a high value on being informed and thoughtful, but we're going the other way. However, if we <i>were</i> aiming to be as smart and knowledgable as possible, we'd be losing to them anyway. The machines have infinitely expandable memory, and we don't and we lose stuff, and we hallucinate a lot more than they do. But why is it a problem if a machine does something better than we do, even something we (foolishly) think we're the best at. That's why we make machines. I have a great car, and live in a house that's heated in the winter and cooled in the summer. If I want to travel to the other side of the world, no problem. These are all things that machines do for me. One thing a machine might not be good at is inspiration. I asked ChatGPT to give me a good idea for something to write today. The idea it <a href=\"https://chat.openai.com/share/194f509d-b494-4277-9cd4-5278e83f98ec\">came up with</a>: \"The Day the World Forgot How to Yawn.\" I rest my case.  ",
            "created": "Sat, 23 Mar 2024 23:04:02 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}