{
    "created": "2024-03-26T04:00:00.000Z",
    "flInCalendar": true,
    "name": "26",
    "path": "2024/03/26",
    "text": "March 26",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I dream of a day when I can subscribe to a podcast on my desktop and have my mobile podcast app know about it automatically. (To be clear, using open formats and protocols, so that this convenience does not lock me into using one podcast client, obviously.)",
            "created": "Tue, 26 Mar 2024 17:26:35 GMT",
            "type": "outline",
            "image": "https:/imgs.scripting.com/2017/12/06/bizarroSuperman.png",
            "flInCalendar": true
        },
        {
            "text": "Experiments. I pasted the URL of a Mastodon post into a <a href=\"https://www.threads.net/@davew/post/C4_DVOQrJ58\">Threads post</a>. I was kind of expecting it would use the power of federation to just get the post and put it in Threads. I asked a similar question on Mastodon, pasting the URL of a Threads post into a Mastodon <a href=\"https://mastodon.social/@davew/112162971603703956\">post</a>. As in the other direction it did nothing with it. ",
            "created": "Tue, 26 Mar 2024 17:05:18 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "YouTube TV lets you <a href=\"https://www.youtube.com/watch?v=rN2SOnGL--M\">watch</a> Fox, CNN, MSNBC, and BBC on one screen.",
            "created": "Wed, 27 Mar 2024 01:19:09 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=rN2SOnGL--M",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://www.threads.net/@davew/post/C4--v-DLgKO\">On Threads</a>: My goal for the next few years is to get the feed world and the social web world to merge, and I'm pretty sure the style of reading of the social web will prevail because it is the rational most news-like way to read news.",
            "created": "Tue, 26 Mar 2024 16:25:50 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Maddow didn't go far enough",
            "created": "Tue, 26 Mar 2024 12:31:10 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I don't usually watch Maddow on Monday nights. I lost my faith in her when she went after Facebook a few years ago, not that Facebook didn't deserve her attention, but her arguments while condemning them were exaggerated. I knew the facts, she left out important details. ",
                    "created": "Tue, 26 Mar 2024 12:15:44 GMT",
                    "image": "https://imgs.scripting.com/2024/03/26/maddow.png",
                    "flInCalendar": true
                },
                {
                    "text": "She steered viewers into believing things that weren't true. Didn't exactly lie, but pretty close. I figured if she does that for stories I know, then she's probably doing it other times when I wasn't so well informed. ",
                    "created": "Tue, 26 Mar 2024 12:41:55 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "But the <a href=\"https://www.nydailynews.com/2024/03/25/knicks-donte-divincenzo-franchise-record-pistons-nba/\">Knicks</a> were blowing out the Pistons on the next channel over, and I had tuned in Jen Psaki, who as luck would have it, at the exact moment I switched, was explaining how the fact that she served in the Biden Administration before joining MSNBC was very different from the controversy over Ronna McDaniel, who Maddow went on to explain was basically a terrorist and traitor and Trump co-conspirator (not just an enabler), and not in a war that was over, but one that was still being fought, and not insignificant because this fascist movement has control of one of the two major parties in the US and McDaniel was instrumental in that. There are good arguments that she should be in a prisoner of war camp, not employed by one of America's major news networks.",
                    "created": "Tue, 26 Mar 2024 12:32:19 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "That NBC hired McDaniel as a contributor says something awful about Maddow's employer. And Maddow, if she has any details on that, isn't saying what they are. ",
                    "created": "Tue, 26 Mar 2024 12:32:59 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I've had this problem with other reporters in the past whose owners were caught up in some controversy that made them newsworthy. The reporters refused to cover it, or even be a source for others who were. This is where journalism goes wrong imho. Maddow <i>should</i> know the details, and if she does, she is obligated to share them, because they are significant, and go to how much trust any of us should give to any news coming to us from NBC. Maybe she has to quit to do that, and if so, go ahead and quit. Because the shadow it casts over everything touched by NBC, which includes MSNBC and Maddow is just too freaking long. It's similar to the \"news\" she reported on Facebook, except now instead of steering us to believe lies, she's holding it back, and instead of it being about one very powerful social media company, it's about the future of the government of the US. And maybe she doesn't know, as <a href=\"https://www.goodreads.com/quotes/21810-it-is-difficult-to-get-a-man-to-understand-something\">Upton Sinclair</a> once said: “It is difficult to get a [person] to understand something, when [their] salary depends on [them] not understanding it.” ",
                    "created": "Tue, 26 Mar 2024 12:33:10 GMT",
                    "image": "https://imgs.scripting.com/2024/01/26/cartoonChicken.png",
                    "flInCalendar": true
                },
                {
                    "text": "I don't blame Maddow for liking her job. But as a reporter, there are more and more reasons not to trust her and esp to not trust the company that employs her. When it was obvious she wasn't going to tell us the story behind McDaniel's hiring, or even name the people responsible for it, I switched back to the Knicks, where at least I think I understand who they are and what they're trying to do. \n",
                    "created": "Tue, 26 Mar 2024 12:34:30 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "<a href=\"https://www.memeorandum.com/240326/p49#a240326p49\">Update</a>: MSNBC <a href=\"https://www.axios.com/2024/03/26/nbc-news-ronna-mcdaniel-commentator\">backed down</a> on hiring McDaniel. ",
                    "created": "Tue, 26 Mar 2024 20:11:34 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}