{
    "text": "The mother of all bank runs",
    "created": "Sat, 06 May 2023 12:59:30 GMT",
    "type": "outline",
    "metaImage": "http://scripting.com/images/2023/05/06/bankrun.png",
    "description": "The US is a huge bank. Crashing the bank will start the mother of all bank runs.",
    "subs": [
        {
            "text": "Defaulting on the national debt will be like the crash of Lehman Brothers in 2008, only a lot worse, because we were able to use the <a href=\"http://scripting.com/publicfolder/chatgpt/2023/05/06/prowess-definition.html\">prowess</a> of the US dollar to prop up the banking system when Lehman fell. There's nothing that can prop up the dollar that way.",
            "created": "Sat, 06 May 2023 12:59:45 GMT",
            "flInCalendar": true
        },
        {
            "text": "This is not about the economy being strong or weak. It's about whether we have an economy at all. Not just the US but the whole world.",
            "flInCalendar": true
        },
        {
            "text": "Emphatically: There is no economy without the dollar playing that role. it's not a matter of weak or strong, it's about the <i>existence</i> of an economy. ",
            "created": "Sat, 06 May 2023 13:00:24 GMT",
            "flInCalendar": true
        },
        {
            "text": "This is the kind of economics that's more like physics.",
            "created": "Sat, 06 May 2023 14:37:49 GMT",
            "flInCalendar": true
        },
        {
            "text": "Let me put a different way. If it weren't for the US government bailout that barely worked little old Lehman Brothers would have crashed us into a new global dark ages. That's what they meant by \"too big to fail.\"",
            "created": "Sat, 06 May 2023 14:37:49 GMT",
            "flInCalendar": true
        },
        {
            "text": "The US is a big fucking bank. If it crashes there's no one to bail it out. Welcome to your future, no health care, transport, food, electricity, no TV or internet. Everyone for themself. Not a recession. A collapse. ",
            "created": "Sat, 06 May 2023 14:38:10 GMT",
            "flInCalendar": true
        },
        {
            "text": "The problem isn't <i>really</i> that the Repubs are hellbent to crash us into a new dark age, it's that the people are so uneducated, and that includes journalists, that they don't get that this is what's at stake or they don't want to say it. ",
            "created": "Sat, 06 May 2023 14:40:27 GMT",
            "flInCalendar": true
        },
        {
            "text": "It would be the mother of all bank runs.",
            "created": "Sat, 06 May 2023 14:40:51 GMT",
            "flInCalendar": true
        },
        {
            "text": "PS: I asked ChatGPT to <a href=\"http://scripting.com/publicfolder/chatgpt/2023/05/06/us-gov-default-impact.html\">write about this</a>. I agree with what it said. \"It is estimated that about two-thirds of the US national debt is held by US citizens and institutions.\" So if we default, I guess, that's who we're ripping off, though the Repubs never talk about that.  ",
            "created": "Sun, 07 May 2023 03:26:28 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}