{
    "text": "Ideas for Twitter",
    "created": "Sat, 06 May 2023 14:11:35 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "If I were in trying-to-work-with-Twitter mode, I would suggest...",
            "created": "Sat, 06 May 2023 14:11:40 GMT",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "Along with the monthly fee, add a certain number of API calls to every user who pays. Then devs could make products for them, without having to pay Twitter. Make the thing self-funding so individuals could play not just corporations. Twitter is more of an end-user thing than a corporate thing.",
                    "created": "Sat, 06 May 2023 14:11:54 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "For  $1 more per month, include some JSON storage for the user, accessible to the apps they grant access to, thus moving into an area AWS should be in but refuses to go. Storage that goes with identity for people not just techies. A retail-ized version of Amazon S3. It will be an <i>enormous</i> business. ",
                    "created": "Sat, 06 May 2023 14:12:05 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I'd comp devs who make software, and give them a special icon so people know to ask them for features. Incentives. Think like a businessperson not a school marm. ",
                    "created": "Sat, 06 May 2023 14:11:55 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "You want to really clean up?  Co-promote the developer products and share revenue. It doesn't cost much to buy developer love.  ",
                    "created": "Sat, 06 May 2023 14:12:17 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PS: As a free addon for users, give each paying user an RSS feed, a good one. I will help you do this really well, no charge.",
                    "created": "Sat, 06 May 2023 14:44:28 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}