{
    "text": "Federation vs Small Pieces Loosely Joined",
    "created": "Sat, 09 Sep 2023 20:45:38 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "As you know, I went to a conference this week with lots of web thinkers, people I worked with 20 years ago. And after listening to them about the state of social networks, this is what I've come up with.",
            "created": "Sat, 09 Sep 2023 20:45:49 GMT",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "It's federation vs small pieces loosely joined. ",
                    "created": "Sat, 09 Sep 2023 20:46:15 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I'll go with the latter. The former is too complicated to work or deliver a benefit worth anything to anyone except chaos lovers.",
                    "created": "Sat, 09 Sep 2023 20:46:29 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "SPLJ delivers all the benefits, but is more fragile, probably slower, but easier to understand. ",
                    "created": "Sat, 09 Sep 2023 20:46:22 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Everyone has a radio station that broadcasts to the universe to which anyone can opt into listening to or not. ",
                    "created": "Sat, 09 Sep 2023 20:47:09 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It's nowhere near as efficient as Twitter, but that's a good thing my friends. ",
                    "created": "Sat, 09 Sep 2023 20:47:21 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The problem with Twitter is it makes everyone an easy target. This approach, well understood from the old days of blogging has the opposite challenge, getting anyone to hear you, but at least you can tune everyone else out, because that's the default. ",
                    "created": "Sat, 09 Sep 2023 20:48:52 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The default on federated nets is the other way, everyone is on by default. This has been proven to be an awful approach, over and over. ",
                    "created": "Sat, 09 Sep 2023 20:49:05 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Just because you don't know the lessons of the past doesn't somehow make you immune to them. ;-)",
                    "created": "Sat, 09 Sep 2023 20:49:17 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}