{
    "text": "Blaming Mr Fubar",
    "created": "Fri, 09 Jun 2023 13:39:06 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "A follow-up on <a href=\"http://scripting.com/2023/06/08.html\">yesterday's posts</a>, I wasn't really as depressed as it might have seemed because I have a way of dealing with everything seeming to be totally <a href=\"http://ai.scripting.com/2023/06/09/fubar.html\">fubar</a>. I have at least three approaches. ",
            "created": "Fri, 09 Jun 2023 13:31:36 GMT",
            "type": "outline",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "First, if there's nothing I can do about something I give myself the choice of not worrying about it. I'm just one person in a world of billions, and I basically have no power over any of the messes I was writing about yesterday. ",
                    "created": "Fri, 09 Jun 2023 13:39:35 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Second, I remind myself that it always feels like everything is about to unravel. I was born in 1955, ten years after the <a href=\"https://en.wikipedia.org/wiki/Little_Boy\">first nuclear weapon</a> was used in war. When I was a draft-age teen, the Vietnam War threatened to become the first world wide nuclear war. We're still here, proving that maybe it wasn't as bad as it appeared at the time. (If you think that was bad, my parents' generation had to run for their lives from the Nazis and their Holocaust.)",
                    "created": "Fri, 09 Jun 2023 13:39:41 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "And a third reason -- the young folk blame my generation, which is stupid, there are all kinds of boomers, people who marched for peace and to save the earth (I was one of them) and people who thought abortion was evil and there is no climate change, and we're all in it for ourselves so let it be. Blaming something as abstract as a generation is a way of shifting responsibility from yourself. Young people of today -- you're the ones who have to live with the world we're <i>all</i> creating now, why aren't you doing something about it? When you find the answer, you'll then understand why we didn't either. The human species appears to have been willfully driving off a cliff for my whole life, and as far as I can tell nothing will stop it. If you know what we can do, speak up and let's do it. ",
                    "created": "Fri, 09 Jun 2023 13:40:18 GMT",
                    "image": "http://scripting.com/images/2017/12/20/shrek.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "So with all that in mind, today I'm going to drink some coffee, roll up my sleeves and write some software that helps dig us out of a hole I do understand and feel I might have some impact on. ",
            "created": "Fri, 09 Jun 2023 13:42:13 GMT",
            "flInCalendar": true
        },
        {
            "text": "Namaste y'all! :heart:",
            "created": "Fri, 09 Jun 2023 13:46:18 GMT",
            "flInCalendar": true
        },
        {
            "text": "\"curly\"",
            "created": "Sat, 10 Jun 2023 03:28:49 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}