{
    "text": "Who is privileged?",
    "created": "Fri, 09 Jun 2023 13:57:38 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "The last time I took a trip by airplane was right after I moved to the mountains in <a href=\"http://scripting.com/2019/04/\">April 2019</a>. I went from Albany to Austin to speak at a <a href=\"https://isoj.org/\">journalism conference</a> at the University of Texas. I resisted the invite, telling the <a href=\"https://isoj.org/rosental-alves/\">genial professor</a> who organized the conference that the audience would hate me, but he didn't accept that. He wanted me to come because it was the 25th anniversary of my blog, and by some counts the 25th anniversary of blogging. He wanted to celebrate, and after a while I couldn't resist, so I went. ",
            "created": "Fri, 09 Jun 2023 13:57:46 GMT",
            "image": "http://scripting.com/images/2023/03/20/mrSmith.png",
            "flInCalendar": true
        },
        {
            "text": "This was in the last days of #metoo when being a white male was something to be ashamed of, but I am not a person who takes that on. I am confident and sure of myself, that's the way I am. I asked my friend <a href=\"https://en.wikipedia.org/wiki/Rebecca_MacKinnon\">Rebecca MacKinnon</a>, an ex-reporter at CNN and former colleague at Harvard to interview me, figuring that she knew me well and it would be a good interview, and by showing we had a good relationship maybe the criticism would be somewhat restrained.  ",
            "created": "Fri, 09 Jun 2023 14:06:38 GMT",
            "flInCalendar": true
        },
        {
            "text": "As I expected a few people in the audience tried to invalidate everything I said as if I was boasting -- saying basically of course you accomplished some good stuff because you had all the advantages. What I wanted to tell them and didn't manage to get across is that all the advantages couldn't make what I did easy, because when you do something outside of a big company, the people who work in big companies and other institutions resent it, and try to stop you, and they usually do stop it. But every once in a while, if you persist and think and listen and learn you can sneak one in, as we did with the new media (blogs, feeds, podcasting, social media) that came from our work. I felt it would be good if they heard the story because people should know how new things actually happen, rather than the <a href=\"http://scripting.com/2023/06/07/121413.html\">bullshit stories</a> reporters tell. But this room of reporters wasn't having it.",
            "created": "Fri, 09 Jun 2023 14:10:46 GMT",
            "flInCalendar": true
        },
        {
            "text": "If I had it to do over, I would have asked that we have a breakout session later where we could talk about all our privilege. Every person in that room slept in a comfortable clean bedroom the night before, was nicely dressed and clean. The vast majority had excellent educations and made good salaries with benefits, far above the standard of living of most people around the world. In other words before you point the finger, make sure you're not deflecting. And anyway, what's the point. You can learn from anyone, even people with much <a href=\"http://scripting.com/davenet/1996/10/24/QueSeraSera.html\">more power</a> than you have and even if you don't like them. ",
            "created": "Fri, 09 Jun 2023 14:03:15 GMT",
            "flInCalendar": true
        },
        {
            "text": "But you don't get do-overs, except in your imagination. Here we are over four years later and I'm still wishing I had thought it through better before-hand, because I expected what I got, and was left without much to say that convinced anyone. ",
            "created": "Fri, 09 Jun 2023 14:05:14 GMT",
            "flInCalendar": true
        },
        {
            "text": "Live and learn. ;-)",
            "created": "Fri, 09 Jun 2023 14:09:56 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}