{
    "text": "\"You're not an average user\"",
    "created": "Wed, 08 Nov 2017 16:07:32 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "This came up in the first session at NewsGeist. I told a short story about something not important and one of the participants said \"But you're not an average user.\" Hmmmm.",
            "created": "Wed, 08 Nov 2017 16:07:42 GMT"
        },
        {
            "text": "This comes up a lot in product discussions. I have never said it myself, I find the idea pretty useless. Because <i>no one</i> is the average person, and you could use that line to shoot down any idea, so why bother? It doesn't add anything to discourse.",
            "created": "Wed, 08 Nov 2017 16:08:18 GMT"
        },
        {
            "text": "I remember the first time I heard it, when I asked the CEO of the tech company I worked for if he had tried a product, and what did he think of it. It was one of his own products, a big moneymaker. He said \"I'm a market of one.\" Same idea as not being an average user.",
            "created": "Wed, 08 Nov 2017 16:09:20 GMT"
        },
        {
            "text": "Should you be the CEO of a company whose product you don't use? Maybe if you're making a drug to treat cancer I could understand it. This was a product designed to make execs in companies more effective at their work. He was most definitely in the market the product was aimed at. ",
            "created": "Wed, 08 Nov 2017 16:17:06 GMT"
        },
        {
            "text": "So that's correct, I'm not an average user, but if you have an idea for a product that no one is currently using because it doesn't exist, then there is no such thing as an average user. And if someone says this to you in a brainstorming meeting, remember I told you to just ignore it, it doesn't mean anything. :heart:",
            "created": "Wed, 08 Nov 2017 16:11:25 GMT"
        },
        {
            "text": "One more thing, if you're going to develop products for a living, you have to learn how your users think. Do support work. Read their emails. Do searches on the web and social media. When you meet a user of your product, ask what they think, and listen. ;-)",
            "created": "Wed, 08 Nov 2017 16:17:51 GMT"
        }
    ]
}