{
    "text": "One thing Twitter is good for",
    "created": "Fri, 05 Apr 2024 13:30:38 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "One thing Twitter is good for — getting support from your cable ISP. Spectrum’s other ways of providing support are designed to get you to give up without using too much of their employees' time. On Twitter, they pretty much always stay with it to resolution. And on Twitter, they have real people who have access to network tools, so they can see the problem from their end, and can give you a clue of what if anything you can do to fix it. ",
            "created": "Fri, 05 Apr 2024 13:34:12 GMT",
            "image": "https://imgs.scripting.com/2023/07/30/twitterBirdOnGunTarget.png",
            "flInCalendar": true
        },
        {
            "text": "I'm pretty good at bug reports, and that appears to work with the online support people they have on Twitter. If you try to chat with them or call them on the phone they read from a script which has you completely tear down and rebuild your system before they'll consider thinking about the data you have. And all this after keeping you on hold listening to their insidious advertising for 15 or more minutes. ",
            "created": "Fri, 05 Apr 2024 13:38:46 GMT",
            "flInCalendar": true
        },
        {
            "text": "I don't think the other twitter-like systems have any critical mass with support people from ISPs. Not like Twitter.",
            "created": "Fri, 05 Apr 2024 13:36:06 GMT",
            "flInCalendar": true
        },
        {
            "text": "BTW, support is one place ChatGPT would excel, btw. All kinds. And I don't think too many people will lose their jobs, because their support systems are so bad because they don't hire enough people, or give them enough time with customers, or training, to actually help them very much. I know how to completely tear down the network without them instructing me how to do it. ",
            "created": "Fri, 05 Apr 2024 13:35:26 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}