{
    "text": "Memorable TV-watching moments",
    "created": "Thu, 10 Oct 2024 19:09:04 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "A <a href=\"https://x.com/natalia_barbour/status/1806331423814484272\">tweet</a> that says something that's obviously true until you realize it's not. \"No kid remembers their best day in front of the TV.\" In fact I have four memories from my youth, watching TV. ",
            "created": "Thu, 10 Oct 2024 19:08:46 GMT",
            "type": "outline",
            "flNumberedSubs": "true",
            "subs": [
                {
                    "text": "I remember my father rolling around on the floor when the ball went through <a href=\"https://www.youtube.com/watch?v=18caPNisP2U\">Buckner's legs</a>. My father <i>never</i> rolled around on the floor, before or since. But I liked seeing him let go just that once. ",
                    "created": "Thu, 10 Oct 2024 19:09:55 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Another with my father. When the <a href=\"https://www.youtube.com/watch?v=jenWdylTtzs\">Beatles were on Ed Sullivan</a> he said they were wearing wigs. He knew that because no man would actually have hair like that. I was 8 or 9 years old and remember telling him I didn't think he got that right.",
                    "created": "Thu, 10 Oct 2024 19:10:36 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I remember exactly where I was when <a href=\"https://www.youtube.com/watch?v=cwZb2mqId0A\">Neil Armstrong walked on the moon</a>. At the <a href=\"https://en.wikipedia.org/wiki/Newport_Folk_Festival\">Newport Folk Festival</a> and about 500 people were watching a tiny TV on top of a VW bus. Somehow everyone could see. It was outdoors and it was silent, everyone was in awe.",
                    "created": "Thu, 10 Oct 2024 19:11:30 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "One that's only peripherally about TV. I remember every time I went to see a game at Shea Stadium as a kid I was blown away by the color, because most of the Mets games I saw were on TV, in <a href=\"https://youtu.be/JM0Q-czWSRk?si=vQjJd13u480XleVX&t=36\">black and white</a>. ",
                    "created": "Thu, 10 Oct 2024 19:12:17 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Here's one from adulthood. Watching young Barack Obama give his <a href=\"https://www.youtube.com/watch?v=LEo7lzfpdCU\">victory speech</a> on election night in 2008 in my house in Berkeley with a group of friends, with tears running down all our faces.",
                    "created": "Thu, 10 Oct 2024 19:12:58 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}