{
    "text": "Trump is not only a Nazi, he's in way over his head, and panicking",
    "created": "Mon, 25 Jun 2018 19:00:52 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Everyone is focused on the optics of what's happening in the immigration system, but underneath the awful images there's a real problem with no easy answers. The problem he's dealing with is far from new, and is horrible, and has been mishandled by every president since Clinton, leading to an escalating problem, and because he is so inept at communicating, Trump has turned into a huge crisis.",
            "created": "Mon, 25 Jun 2018 19:00:58 GMT"
        },
        {
            "text": "Looked at another way, remember how everyone has been positing what would happen when Trump had to deal with a crisis not of his own making? This is it. But he can't seem to get our sympathy and support, when any other president would have been able to do so easily.",
            "created": "Mon, 25 Jun 2018 19:02:29 GMT"
        },
        {
            "text": "Just listen to <a href=\"https://www.nytimes.com/2018/06/25/podcasts/the-daily/migrants-central-america-violence-gangs.html?rref=collection%2Fcolumn%2Fthe-daily&action=click&contentCollection=podcasts&region=stream&module=stream_unit&version=latest&contentPlacement=1&pgtype=collection\">today's Daily podcast</a>, and find out how when we had to deal with the El Salvadoran gangs in LA in the 90s, we exported them back to El Salvador where they <a href=\"https://www.npr.org/sections/goatsandsoda/2015/10/05/445382231/how-el-salvador-fell-into-a-web-of-gang-violence\">grew</a>, and now the next generation is coming of age, and the country is unlivable so they're coming north, and in fact <i>Trump has a good point</i> (if he could only communicate it) that we're going to deal with an even bigger problem next time around, as it echoes in a decades-long feedback loop.",
            "created": "Mon, 25 Jun 2018 19:03:28 GMT"
        },
        {
            "text": "Part of what we're seeing here is not only Adolf Hitler 2.0, but also a man who is in totally over his head, unable to understand how the US government functions. He's panicking. And folks, this is only one of a dozen major ongoing crises a president has to deal with. ",
            "created": "Mon, 25 Jun 2018 19:09:05 GMT"
        },
        {
            "text": "It's a real problem. If only our president had the means to communicate it in a rational, non-hysterical way. This one only knows one way of communicating -- he attacks. And that puts him at odds with how our form of government works.",
            "created": "Mon, 25 Jun 2018 19:05:11 GMT"
        }
    ]
}