{
    "text": "Being a conservative in 2018",
    "created": "Sat, 21 Jul 2018 16:38:09 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I'm a conservative. Something former-Republican conservatives can probably relate to. I think the vast majority of Americans who are freaked out about the Trump presidency could legitimately be described as conservative. However I've been voting solid Democratic since 2004.",
            "created": "Sat, 21 Jul 2018 16:38:13 GMT"
        },
        {
            "text": "For me, a bridge too far was the Iraq war. By 2004 we knew there were no WMDs, that the government had lied to us. This was huge. On such a serious matter as war or peace, you can't do what they did and keep the support of good Americans. At the moment they're talking about <a href=\"https://foreignpolicyblogs.com/2017/07/19/dont-want-smoking-gun-mushroom-cloud/\">mushroom clouds</a> you need to suck it up and trust the government has seen something unthinkable that you can't see. Not lying out of their ass, as the Bushies were. ",
            "created": "Sat, 21 Jul 2018 16:38:29 GMT"
        },
        {
            "text": "It was the realization that <a href=\"http://scripting.com/images/2018/07/21/colinPowelUn.png\">this moment</a> was based on a lie, that meant I would never vote Republican again.",
            "created": "Sat, 21 Jul 2018 16:38:40 GMT",
            "urltweet": "https://twitter.com/davewiner/status/1020705432527155202"
        },
        {
            "text": "Yes, I firmly believe in Choice, am in favor of radical gun control, I have a serious pre-existing condition, so I get how important health insurance is. But you could actually vote Republican before 2000 and still have these positions.",
            "created": "Sat, 21 Jul 2018 16:40:23 GMT"
        },
        {
            "text": "Or so I thought. ;-)",
            "created": "Sat, 21 Jul 2018 16:40:40 GMT"
        },
        {
            "text": "And voting Democratic is no panacea."
        },
        {
            "text": "Think Snowden."
        },
        {
            "text": "But the United States is what it is. No generation gets to radically change direction. I say that as a baby boomer who marched for peace in the 60s and 70s."
        },
        {
            "text": "This is the lesson of America.",
            "created": "Sat, 21 Jul 2018 16:40:50 GMT"
        },
        {
            "text": "Change is continuous. A country that still hasn't shaken off the legacy of slavery isn't going to transform into a European socialist country in a generation. Not after what we've been through in the last 20 years.",
            "created": "Sat, 21 Jul 2018 16:40:55 GMT"
        },
        {
            "text": "We made a lot of changes in the last ten years. And our chain has been yanked back. Hopefully that's all it is. But it's a mistake to try to yank it again. It's time to compromise. We need to elect a president we'd all like to have a cup of coffee with. Not someone who wags his finger and talks over us. Who doesn't listen. Who is as much a narcissist as the current asshole in the White House.",
            "created": "Sat, 21 Jul 2018 16:41:04 GMT"
        },
        {
            "text": "My slogan, if you've made it this far is this -- Make Politics Boring Again.",
            "created": "Sat, 21 Jul 2018 16:41:15 GMT"
        },
        {
            "text": "I felt, once Obama was elected, that that was as good as it was going to get. We are the United States. That means we're fucked up. But at least let's think a bit before we start pushing people around.",
            "created": "Sat, 21 Jul 2018 16:41:27 GMT"
        },
        {
            "text": "Toby Ziegler nails it in <a href=\"https://www.youtube.com/watch?v=S4vU1ygmq-s\">this scene</a> in The West Wing. \"They'll like us when we win.\" This could be the motto of America right up there with <a href=\"https://en.wikipedia.org/wiki/E_pluribus_unum\">E Pluribus Unum</a>. :rocket:",
            "created": "Sat, 21 Jul 2018 16:41:28 GMT",
            "urlvideo": "https://www.youtube.com/watch?v=S4vU1ygmq-s"
        }
    ]
}