{
    "text": "Journalism has to take chances",
    "created": "Thu, 28 May 2020 13:22:00 GMT",
    "type": "outline",
    "description": "No risk, no reward.",
    "metaImage": "http://scripting.com/images/2020/05/28/earthrise.png",
    "subs": [
        {
            "text": "I was an entrepreneur in my youth.  ",
            "created": "Thu, 28 May 2020 13:32:10 GMT"
        },
        {
            "text": "I've never stopped thinking like one. ",
            "created": "Thu, 28 May 2020 13:36:25 GMT"
        },
        {
            "text": "Journalism needs to be entrepreneurial. And that means taking risks. And challenging your assumptions. ",
            "created": "Thu, 28 May 2020 20:22:52 GMT"
        },
        {
            "text": "There seems to be a resolution that \"micropayments\" don't work.",
            "created": "Thu, 28 May 2020 20:23:27 GMT"
        },
        {
            "text": "I don't like the term either, because I was thinking of giving them large amounts of money. I like to splurge. I like making impulse purchases. I like voting with dollars, but...",
            "created": "Thu, 28 May 2020 13:22:59 GMT"
        },
        {
            "text": "As a user, I don't trust subscriptions. It's incredibly hard to change your mind. How many times have you found out that you have to jump through endless hoops to cancel a subscription. ",
            "created": "Thu, 28 May 2020 13:23:16 GMT"
        },
        {
            "text": "A subscription is a commitment. ",
            "created": "Thu, 28 May 2020 20:26:44 GMT"
        },
        {
            "text": "I want to date before we get married. ",
            "created": "Thu, 28 May 2020 20:27:33 GMT"
        },
        {
            "text": "Anyway, every time I try to start a discussion about this, the users agree, and the journalists that show up tell me why they don't have to to listen to scum like me. It really feels like that. ",
            "created": "Thu, 28 May 2020 13:23:51 GMT"
        },
        {
            "text": "They have to take chances. That's the way of business. And money and business are kind of the same thing. ",
            "created": "Thu, 28 May 2020 13:24:06 GMT"
        },
        {
            "text": "The biggest chance they have to take is recognizing that their users are sentient and smart and are good people who they are not treating very well. ",
            "created": "Thu, 28 May 2020 13:22:32 GMT"
        },
        {
            "text": "PS: This started as an email to my friend <a href=\"https://twitter.com/jeffjarvis\">Jeff Jarvis</a>, but I could hear myself saying -- why are you saying this just to him, say it to the world. ",
            "created": "Thu, 28 May 2020 13:25:17 GMT"
        }
    ]
}