{
    "text": "June 5",
    "created": "Wed, 05 Jun 2019 14:28:56 GMT",
    "name": "05",
    "subs": [
        {
            "text": "Seriously, a guy who ignores the Constitution and gets away with it is going to have a real election? Is that what you think?",
            "created": "Wed, 05 Jun 2019 20:12:04 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1136363795113226240"
        },
        {
            "text": "Weird. Same logic that says impeachment is futile because Senate would never convict also seems to apply to passing <a href=\"https://politicalwire.com/2019/06/04/house-passes-bill-to-protect-dreamers/\">symbolic bills</a> that also have no chance in Senate. ",
            "created": "Wed, 05 Jun 2019 16:25:12 GMT",
            "type": "outline"
        },
        {
            "text": "HBO has taught us what happened at <a href=\"https://en.wikipedia.org/wiki/Chernobyl_(miniseries)\">Chernobyl</a>. Couldn't they do the same for the Mueller report?",
            "created": "Wed, 05 Jun 2019 16:17:08 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"http://scripting.com/images/2019/06/05/rusticCountryRoad.png\">New</a> header graphic, a rustic country road. <a href=\"http://scripting.com/images/2019/03/26/eveAndPeterWalkingToSchoolIn1964.png\">Previous</a>, my brother and mother walking to desegregated school in Corona, Queens in 1964.",
            "created": "Wed, 05 Jun 2019 20:17:39 GMT",
            "type": "outline"
        },
        {
            "text": "Why Elizabeth Warren should be on the open web",
            "created": "Wed, 05 Jun 2019 14:28:57 GMT",
            "type": "outline",
            "description": "Why the open web is a better choice for a thoughtful and futuristic campaign like Warren's.",
            "subs": [
                {
                    "text": "It bothers me, of course, that Elizabeth Warren, <a href=\"https://elizabethwarren.com/\">candidate</a> for president, is posting her position papers on Medium. I wrote a tweet yesterday, and cross-posted it <a href=\"http://scripting.com/2019/06/04.html#a174639\">here</a>, saying as much. ",
                    "created": "Wed, 05 Jun 2019 14:29:37 GMT"
                },
                {
                    "text": "<a href=\"https://twitter.com/cbasturea\">Constantin Basturea</a>, a longtime reader of this blog, did a bit of research and found the Twitter accounts of the people who run the Warren web presence, suggesting I contact them. At first I thought, they won't know who I am, and they might not care about the open web. But then I thought, why wouldn't they care?",
                    "created": "Wed, 05 Jun 2019 15:19:36 GMT",
                    "image": "http://scripting.com/images/2019/06/05/elizabethWarren.png"
                },
                {
                    "text": "There are a lot of parallels in the ways big tech companies and banks regard their customers, and Warren has been such a pioneer in the reform of banks. It's a bad environmental decision, imho, for Warren to go with Medium, when the open web is just as easy, the results are as good, and the writing more likely to persist. It's worth a careful explanation of why the open web is a better choice for a thoughtful and futuristic campaign like Warren's. ",
                    "created": "Wed, 05 Jun 2019 15:21:25 GMT",
                    "flNumberedSubs": "true"
                },
                {
                    "text": "<b>Writing for the record</b>",
                    "created": "Wed, 05 Jun 2019 15:02:26 GMT"
                },
                {
                    "text": "When Senator Warren posts a position paper, it's a matter of public record. It's important that it be accessible for the indefinite future. ",
                    "created": "Wed, 05 Jun 2019 15:02:35 GMT"
                },
                {
                    "text": "If she was elected, her consituents would want to see what she promised during the campaign, in her own words, to see how it matches up with her policies as an elected official.",
                    "created": "Wed, 05 Jun 2019 15:56:39 GMT"
                },
                {
                    "text": "And if she isn't elected, it's still good to keep the ideas accessible. The problems probably won't go away, and her proposals might be useful to a future candidate.",
                    "created": "Wed, 05 Jun 2019 15:03:36 GMT"
                },
                {
                    "text": "Preserving ideas is something the web can be good at, but we have to make the right choices.",
                    "created": "Wed, 05 Jun 2019 15:57:34 GMT"
                },
                {
                    "text": "Medium is not a good choice for creating a public record.",
                    "created": "Wed, 05 Jun 2019 15:40:27 GMT"
                },
                {
                    "text": "<b>Medium could go out of business</b>",
                    "created": "Wed, 05 Jun 2019 15:05:37 GMT"
                },
                {
                    "text": "If Medium went out of business everything published there would go away. This has happened many times in tech, it's the norm. Even successful companies, such as Google, sometimes walk away from existing sites because they weren't profitable.",
                    "created": "Wed, 05 Jun 2019 15:08:56 GMT"
                },
                {
                    "text": "<b>Medium does not have a stable business model</b>",
                    "created": "Wed, 05 Jun 2019 15:12:06 GMT"
                },
                {
                    "text": "Their software is good, easy to use, and the resulting pages are easy to read. But this is the only thing that has been stable about Medium since its inception in 2012, as they <a href=\"https://www.niemanlab.org/2019/03/the-long-complicated-and-extremely-frustrating-history-of-medium-2012-present/\">repeatedly</a> <a href=\"https://www.google.com/search?safe=off&source=hp&ei=0Ob3XLOzO5Hr_QbByIaQBQ&q=medium+pivots+ev+williams&oq=medium+pivots+ev+williams&gs_l=psy-ab.12..35i39.1587.1587..5947...0.0..0.125.206.1j1......0....2j1..gws-wiz.....0.rK_ZPDUKiEA\">pivot</a> trying to find a profitable business model.",
                    "created": "Wed, 05 Jun 2019 15:12:14 GMT"
                },
                {
                    "text": "<b>Medium has a paywall</b>",
                    "created": "Wed, 05 Jun 2019 15:10:46 GMT"
                },
                {
                    "text": "It's not clear whether Warren's posts are behind the <a href=\"https://en.wikipedia.org/wiki/Paywall\">paywall</a>, because their policies are not clear, and they change. Sometimes I hit a wall reading a random friend's post on Medium. The paywall is not only an irritant, but it limits access to people who have a credit card and are able to pay Medium for access. ",
                    "created": "Wed, 05 Jun 2019 15:10:50 GMT"
                },
                {
                    "text": "<b>Set an example for others</b>",
                    "created": "Wed, 05 Jun 2019 15:08:20 GMT"
                },
                {
                    "text": "People look at Medium and if they've been around a while, the questions above all come up, but then they see that a great progressive like Senator Warren is using Medium, so it must be okay. This is not good leadership, especially when setting up and running a blog in 2019 is so inexpensive and easy.",
                    "created": "Wed, 05 Jun 2019 15:15:07 GMT"
                },
                {
                    "text": "<b>We'll help</b>",
                    "created": "Wed, 05 Jun 2019 15:17:15 GMT"
                },
                {
                    "text": "My politics happen to align pretty well with Warren's, but even if I were a conservative Republican, I'd want to help get Senator Warren on the open web, because it's that important to have a serious presidential campaign take a leadership position on the independence of people who write on the open web. ",
                    "created": "Wed, 05 Jun 2019 15:17:18 GMT"
                }
            ]
        }
    ]
}