{
    "text": "June 11",
    "created": "Tue, 11 Jun 2019 14:01:34 GMT",
    "name": "11",
    "subs": [
        {
            "text": "Update: They added me to the beta group for <a href=\"https://github.com/features/package-registry\">GitHub Package Registry</a>. Now I have to figure out what it is and how it might fit into my work. Have questions or suggestions? Post them <a href=\"https://github.com/scripting/Scripting-News/issues/119\">here</a>.",
            "created": "Tue, 11 Jun 2019 15:37:05 GMT",
            "type": "outline"
        },
        {
            "text": "Idea for a Serial-style <a href=\"https://serialpodcast.org/\">podcast</a>. Actors play various roles in the Mueller Report. Need screen writers. I'd definitely listen to it all. ",
            "created": "Tue, 11 Jun 2019 17:56:06 GMT",
            "type": "tweet",
            "tweetId": "1138505668225314816",
            "tweetUserName": "davewiner"
        },
        {
            "text": "I have to admit it's <a href=\"https://www.youtube.com/watch?v=EGlo9LzmOME\">getting better</a>. ",
            "created": "Tue, 11 Jun 2019 14:41:25 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=EGlo9LzmOME"
        },
        {
            "text": "One thing I learned from being an entrepreneur and software developer is that you have to listen. Put aside any anger or fear coming from the person with the idea, sometimes the best ideas come with angst. Journalism circles the wagons, listens only to ideas of the sort \"Oh woe is me, we have been unfairly treated by tech, give us your money, or else.\" I've been hearing this since shortly after the web came about. Oddly the people who turned me on to the web were journalists They were excited about this great news distribution technology. That's the right way imho to look at it. The money is there. Look at all the money Facebook and Google make. A big secret of business is so obvious people sometimes miss it. If you are being hurt by a competitor, think about doing what they do. It's hard to listen to them, but then no one is entitled to tune out while their livelihood is undermined. ",
            "created": "Tue, 11 Jun 2019 14:21:50 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/06/11/pizza.png"
        },
        {
            "text": "The <a href=\"https://www.vulture.com/2019/06/gentleman-jack-season-1-finale-recap-episode-8.html\">season finale</a> of Gentleman Jack was just lovely. Not too perfect, because there are big clouds on the horizon, but a sweet ending. Most people I know didn't see it, but it and <a href=\"https://en.wikipedia.org/wiki/Chernobyl_(miniseries)\">Chernobyl</a>, both from HBO are the highlights of the year. And of course I'm going to binge season 2 of <a href=\"https://www.hbo.com/big-little-lies/season-2-everything-you-need-to-know-cast\">Big Little Lies</a>, when it's done, no matter what. Adding Meryl Streep to the already estimable ensemble is too much to miss. ",
            "created": "Tue, 11 Jun 2019 14:17:15 GMT",
            "type": "outline"
        },
        {
            "text": "It’s about time journalism started <a href=\"https://www.politico.com/magazine/story/2019/06/10/newspapers-embarrassing-lobbying-campaign-227100\">covering itself</a> without the dishonest hype. \"The industry doesn’t need—and shouldn’t ask for—a special law to help it compete with Google and Facebook.\" ",
            "created": "Tue, 11 Jun 2019 14:11:58 GMT",
            "type": "outline"
        },
        {
            "text": "Yet <a href=\"https://twitter.com/Sulliview/status/1138427478022742016\">journalists</a> have lots of opinions about tech, and have no grounding with experience, nor do they listen to those who do.",
            "created": "Tue, 11 Jun 2019 14:11:01 GMT",
            "type": "outline"
        },
        {
            "text": "I signed up for the <a href=\"https://github.com/features/package-registry\">GitHub Package Registry</a> beta, but wasn't selected as one of the lucky few. I do most of my server development these days in Node, and am of course using NPM. Sometimes it gets flaky, and I keep thinking there's more it can do. Am intrigued with the idea of an integrated package manager and GIT repository. If you have any experience wiht the new GHPR beta, write a post <a href=\"https://github.com/scripting/Scripting-News/issues/119\">somewhere</a> and send me a link. I'm really curious.  ",
            "created": "Tue, 11 Jun 2019 14:01:35 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/06/11/strongman.png"
        }
    ]
}