{
    "text": "June 12",
    "created": "Wed, 12 Jun 2019 14:55:09 GMT",
    "name": "12",
    "subs": [
        {
            "text": "I started watching <a href=\"https://en.wikipedia.org/wiki/When_They_See_Us\">When They See Us</a> three times. I'll get through it. But it is so anger-making to watch how the cops treated the kids and their parents. If you believe we can depend on the basic goodness of people, well, clearly we can't.",
            "created": "Wed, 12 Jun 2019 18:49:07 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://youtu.be/meI6f258RKY?t=148\">How do you know</a> you're God? \"It's simple, when I pray to Him, I find I'm talking to myself.\" ",
            "created": "Wed, 12 Jun 2019 17:35:42 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=meI6f258RKY"
        },
        {
            "text": "The news should reflect what's obvious about what the next steps are for our increasingly authoritarian government. Project out from here. When do the loyalty oaths start for government employees? Members of Congress.? The courts? Teachers? You and me. When do the concentration camps for American citizens start? We need a thread that isn't looking backward as the news mostly is, but is focused on the present and near-future. That would help people see why impeachment is so important. Didn't they see it coming? Answer: They <a href=\"https://en.wikipedia.org/wiki/Three_wise_monkeys\">didn't want</a> to look. ",
            "created": "Wed, 12 Jun 2019 15:00:37 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/06/12/seeNoEvil.png"
        },
        {
            "text": "You know the old idea of visualizing the audience as naked to overcome stage fright, analogously consider that every bit of hate you get on Twitter comes from an algorithm, a few lines of code and records in a database, not from your mommy or daddy, or even the police. You are not actually being threatened, even though it may feel that you are. ",
            "created": "Wed, 12 Jun 2019 14:55:10 GMT",
            "type": "outline"
        }
    ]
}