{
    "text": "June 16",
    "created": "Sun, 16 Jun 2019 15:01:15 GMT",
    "name": "16",
    "subs": [
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1140271146539110401\">Do you do online check-writing</a>? I've been using a major bank checking account for many years. It's ok, it works, but they only keep records of transactions for six months. I want a bank that will keep records for decades. Can you recommend a bank that keeps good records?",
            "created": "Sun, 16 Jun 2019 15:01:16 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1140271146539110401"
        },
        {
            "text": "<a href=\"https://twitter.com/tonyharper502/status/1140275593906458626\">Tony Harper writes</a>: \"I worked in a similar industry for years. There was a lack of willingness to invest in more modern technology for cases where the ROI was difficult to quantify. Only when another company did it better did we see investment in stuff like this.\" To which I said: \"I think you're right. The proper attitude is to have people running the place who love the business they're in and are thrilled by the possibility of doing it much better thanks to some new tech. ROI is so boring and dull. Esp from a user standpoint. I'd happily pay more.\"",
            "created": "Sun, 16 Jun 2019 15:35:40 GMT",
            "type": "outline"
        },
        {
            "text": "Here's a free idea for Twitter. Invent linking inside Twitter. So if I want to point to Kawhi Leonard, I could type his name, highlight it, enter his screenname, click OK. It would make Twitter more readable. Only steal from the best. :boom:",
            "created": "Sun, 16 Jun 2019 15:47:09 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/06/16/tbl.png"
        },
        {
            "text": "The <a href=\"https://nypost.com/2019/06/15/anthony-davis-decision-highlights-knicks-grim-reality/\">grim reality</a> of the Knicks is they make <a href=\"https://www.ajc.com/sports/nba-fans-stunned-tim-hardaway-million-deal/3BDBrrw0u6gqnboyT23wBP/\">huge mistakes</a> and try to fix them with <a href=\"https://nypost.com/2019/01/31/knicks-finalizing-trade-kristaps-porzingis-hardaway-lee-to-mavericks-in-stunner/\">more huge mistakes</a>.",
            "created": "Mon, 17 Jun 2019 00:23:50 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://twitter.com/NBA_UKfans/status/1140278892705538048\">Interesting concept</a>. Kyrie wants his own team. Of course LeBron has his team. And Kawhi wants one too, he just rented the Raptors for a season (and got paid handsomely for it). ",
            "created": "Sun, 16 Jun 2019 15:30:44 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/NBA_UKfans/status/1140278892705538048"
        },
        {
            "text": "If Kyrie goes to the Nets, the Knicks should make an offer to <a href=\"https://sports.yahoo.com/report-brooklyn-signs-kyrie-irving-190047153.html\">D'Angelo Russell</a>. NYC likes him. Get him playing the Garden. ;-)",
            "created": "Sun, 16 Jun 2019 15:57:55 GMT",
            "type": "outline"
        }
    ]
}