{
    "text": "June 19",
    "created": "Wed, 19 Jun 2019 14:05:51 GMT",
    "name": "19",
    "subs": [
        {
            "text": "I'm glad to see a few #indieweb <a href=\"https://twitter.com/ChrisAldrich/status/1141216395545305088\">people</a> building on OPML. There's a lot you can do with it. For example, the native file format of \"LO2\" is OPML. So it's really good for editing subscription lists for feed readers. And editing blogrolls. My <a href=\"http://storage.littleoutliner.com/users/davewiner/listicles/listicle1.html\">listicle</a> tool takes OPML files as input. And <a href=\"http://scripting.com/2019/06/18.html#a164307\">River6</a>, coming soon, does a bunch with OPML. There's also \"feedbase\" which will blow your mind if you love sharing subscription lists. Yes there's a lot to discover in OPML-land and more on the way. :boom:",
            "created": "Wed, 19 Jun 2019 15:31:06 GMT",
            "type": "outline"
        },
        {
            "text": "I should write a howto to explain editing subscription lists in \"LO2\". I wrote <a href=\"http://scripting.com/opmlHowto/dave/editorOpmlOrg/editSubscriptionLists.html\">one</a> for the OPML Editor in 2008. It still runs btw, I use it, sometimes even to <a href=\"http://scripting.com/images/2019/06/19/nbalistinopmleditor.png\">edit</a> subscription lists. Two key bits for LO2: 1. You can make outlines public. Look in the File menu. 2. And you can edit the attributes of a headline, click the suitcase icon in the left margin. ",
            "created": "Wed, 19 Jun 2019 15:57:55 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://twitter.com/nowthisnews/status/1141114113789054976\">AOC</a>: \"'Never again' means something.\" She is what we want politicians to be. Not calculating about how to get re-elected, rather guiding our country and preserving our values. Being smart. Not being scared to say what's obvious.",
            "created": "Wed, 19 Jun 2019 15:23:42 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/nowthisnews/status/1141114113789054976"
        },
        {
            "text": "Tomorrow is the NBA Draft and the deals are flying. It should be amazing. After yet another Knickless playoff season, it's interesting to see them back in the conversation somewhat. There were a lot of stupid dreams about the Knicks buying a contending team with their cap space. That's off the table because even Kawhi couldn't turn this team into a contender. The Knicks are in a rebuild, have been for many seasons, and no amount of dealing is going to make them a contender. Even the 76ers and Celtics who played it smart aren't contending yet. But at least they give their fans something to root for. The Celtics should be glad to be rid of Kyrie. Last year's team was much more interesting. Re-sign Horford and trade <a href=\"https://en.wikipedia.org/wiki/Gordon_Hayward\">Hayward</a> for draft picks. The most intriguing idea I heard for the Knicks is to pick up <a href=\"https://www.nydailynews.com/sports/basketball/knicks/ny-knicks-chris-paul-kevin-durant-dennis-smith-jr-20190618-bwla5ckvffe5zehjyrmse3iqfq-story.html\">Chris Paul</a> on waivers (haha not going to happen) or take on his awful 3-year deal, and get them to throw in <a href=\"https://en.wikipedia.org/wiki/Clint_Capela\">Capela</a>, say. In return they get a few mediocre young players that didn't work out (pretty much anyone on the current roster). And then what the hell, sign <a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+%22carmelo+anthony%22&t=hj&ia=web\">Melo</a> and let him play out his career in the Garden. It's not like anything else is going to happen here for the forseeable future. Sign <a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+%22jeremy+lin%22&t=hj&ia=web\">Jeremy Lin</a> (he can bring his new trophy) and <a href=\"http://scripting.com/2019/06/16.html#a155755\">D'Angelo Russell</a>, and we might even make the postseason. It'll certainly be entertaining basketball. :basketball:",
            "created": "Wed, 19 Jun 2019 14:53:47 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/11/15/kristaps.png"
        },
        {
            "text": "I posted <a href=\"http://scripting.com/images/2019/06/19/zinger.png\">this</a> on Facebook last year on this day. It's a zinger. ",
            "created": "Wed, 19 Jun 2019 14:12:14 GMT",
            "type": "outline"
        },
        {
            "text": "The best movie ever, one that I always forget to put on my <a href=\"http://scripting.com/2014/07/16/moviesForMeAt20.html\">list</a>, is <a href=\"https://en.wikipedia.org/wiki/Groundhog_Day_(film)\">Groundhog Day</a>. So entertaining, well-done, a love story, a <a href=\"https://www.youtube.com/watch?v=uw63_YyNsF4\">story</a> of redemption, a prequel for <a href=\"https://en.wikipedia.org/wiki/Bill_Murray\">Bill Murray's</a> <a href=\"https://www.youtube.com/watch?v=X-PnPrjqkv8\">long</a> <a href=\"https://www.youtube.com/watch?v=sU0oZsqeG_s\">career</a>, and a wonderful <a href=\"https://en.wikipedia.org/wiki/Frank_Capra\">Frank Capra</a>-like ending. A perfect movie. ",
            "created": "Wed, 19 Jun 2019 14:13:54 GMT",
            "type": "outline"
        },
        {
            "text": "I love smoothies. Frozen berries, a half a banana and a tiny bit of yogurt, cover with tap water. Zap in a blender. Voila, deliciousness, a cool summer drink, a happy tummy. ",
            "created": "Wed, 19 Jun 2019 14:06:58 GMT",
            "type": "tweet",
            "tweetId": "1141347002271313926",
            "tweetUserName": "davewiner"
        },
        {
            "text": "There is an dimension other than electability and policy for a Democratic presidential candidate -- will the candidate further division in the country, or help bring the country together. ",
            "created": "Wed, 19 Jun 2019 14:05:52 GMT",
            "type": "tweet",
            "tweetId": "1141346478121725953",
            "tweetUserName": "davewiner"
        }
    ]
}