{
    "text": "June 20",
    "created": "Thu, 20 Jun 2019 14:43:04 GMT",
    "name": "20",
    "subs": [
        {
            "text": "I'd like to watch a cable news station that had a rule to always refer to Trump in the past tense.",
            "created": "Thu, 20 Jun 2019 17:12:37 GMT",
            "type": "outline"
        },
        {
            "text": "When you buy something online that there is no Consumer Reports or Wirecutter review of, how do you decide what to get? There are a lot of what appear to be review sites on the web, but I guess they're all ads for what they recommend. I don't think the search engines have gotten around to this yet. Here's a <a href=\"https://www.google.com/search?q=best+bike+cover&rlz=1C5CHFA_enUS743US747&oq=best+bike+cover&aqs=chrome..69i57j0l5.2868j0j4&sourceid=chrome&ie=UTF-8\">search</a> for \"best bike cover.\" Which if any of them are serious criticism by people who know the area. ",
            "created": "Thu, 20 Jun 2019 15:35:09 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://twitter.com/mathewi/status/1141712628928176128\">Mathew Ingram reminds us</a> that two years ago Twitter said they would revamp their verification program, but they're still doing it on an ad hoc basis. Maybe they should do what the <a href=\"https://moversguide.usps.com/mgo/disclaimer\">US Post Office</a> does when you register a change of address. They charge $1 on your credit card. That in turn gets them your real name and address. That's the information they needed, and it's verified to the extent that the credit card company can verify it, and it seems that's also the information that Twitter needs, at least for people. Not so sure about companies. ",
            "created": "Thu, 20 Jun 2019 14:43:05 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/06/20/mailman.png"
        },
        {
            "text": "If I were in charge of a search engine, I'd notice if someone does a lot of searches on a specific site, and increase the rank for that site in subsequent searches by that person. It's 2019. It seems search should be at least that smart by now. ",
            "created": "Thu, 20 Jun 2019 14:59:32 GMT",
            "type": "outline"
        },
        {
            "text": "Sometimes I unfollow people on Twitter if I feel there's no chance of me being heard if I respond to what they said, esp if I often want to respond, not in the negative (that's another reason to unfollow) but to add a perspective or offer additional info. It's hard to explain, perhaps, without giving an example, and I don't want to do that because I have nothing against the person I'm unfollowing, it's just that their Twitter presence has gotten so big, or perhaps they've muted me, for whatever reason they don't seem to be able to hear me. I seem to only do this with people who I at one time considered a friend. I guess there is a state of friendship that could be described as \"on pause\" or \"in waiting.\" That's why I unfollow.  Until today I couldn't put into words why I was unfollowing, but now I can so here they are. :heh:",
            "created": "Thu, 20 Jun 2019 14:53:41 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/06/20/bouquet.png"
        }
    ]
}