{
    "text": "June 21",
    "created": "Fri, 21 Jun 2019 13:26:35 GMT",
    "name": "21",
    "subs": [
        {
            "text": "Here's a <a href=\"http://podcatch.com/0.5/\">test version</a> of podcatch.com that runs off River6. ",
            "created": "Fri, 21 Jun 2019 20:20:21 GMT",
            "type": "outline"
        },
        {
            "text": "An idea for a destination resort. Buy some land in the mountains, build an old-style summer camp but for adults. Sleep on bunks, but they’re nice bunks. Everyone eats together. Arts and Crafts, you go on canoeing trips, softball, hikes, campfires, you can smoke weed and have sex, but you have to keep it wholesome, no orgies, this is summer camp (or maybe you had orgies in summer camp). You get to take a kitten home. And of course the lanyard and pottery you make. ",
            "created": "Fri, 21 Jun 2019 20:23:39 GMT",
            "type": "outline"
        },
        {
            "text": "Banning <a href=\"https://thehill.com/homenews/campaign/449679-warren-pledges-to-ban-private-prisons\">private prisons</a> is good. Also, related -- no tax cuts when we're at war. And reinstate the draft, and make it illegal to ever, in time of war, not have a draft.",
            "created": "Fri, 21 Jun 2019 15:15:40 GMT",
            "type": "outline"
        },
        {
            "text": "If you're thinking about doing another format for web syndication, don't. There already are <a href=\"https://xkcd.com/927/\">too many</a>. In fact if you can think of a way to have <i>fewer</i> web syndication formats, you'd be doing a <a href=\"https://en.wikipedia.org/wiki/Mitzvah\">mitzvah</a>. One of the fallacies of tech is that anyone is waiting for you to revinvent something that works, no matter how much people appear to be clamoring for it. I've learned over the years that asking, even begging for a feature or product or incompatible format is not an indication that once available people will actually use it. But developers will have to decide whether to support it, and making developers lives more complicated, esp ones who are working for free, is greedy, selfish and not appreciated. :boom:",
            "created": "Fri, 21 Jun 2019 14:54:54 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/06/21/xkcdGuy.png"
        },
        {
            "text": "It's been raining for weeks, but I've been getting bike rides in, between the storms. Everything is a lush verdant green and the sky is full of fog and mist, and the pictures are often stunning, <a href=\"http://scripting.com/images/2019/06/21/meadow.png\">like this one</a>, of a meadow near where I live. No filters, no editing, taken with an <a href=\"https://www.cnet.com/reviews/apple-iphone-xs-max-review/\">iPhone XS Max</a>. I might make this a header image after a while. ",
            "created": "Fri, 21 Jun 2019 14:38:23 GMT",
            "type": "outline"
        },
        {
            "text": "If blacks are African-American aren't whites European-Americans? I am definitely a Euro-Am. My mother was born in <a href=\"https://en.wikipedia.org/wiki/Prague\">Prague</a> and my father in <a href=\"https://en.wikipedia.org/wiki/Bucharest\">Bucharest</a>. I was born in Brooklyn, raised in Queens (<a href=\"https://en.wikipedia.org/wiki/Jackson_Heights,_Queens\">Jackson Heights</a> and <a href=\"https://en.wikipedia.org/wiki/Flushing,_Queens\">Flushing</a>). I heard on the radio the other day that <a href=\"https://en.wikipedia.org/wiki/Queens\">Queens</a> has a larger population than 15 of the <a href=\"https://en.wikipedia.org/wiki/List_of_states_and_territories_of_the_United_States_by_population\">US states</a>. That puts things in perspective. They sure make a lot of noise for such a bunch of punkasses. ",
            "created": "Fri, 21 Jun 2019 13:26:36 GMT",
            "type": "outline"
        }
    ]
}