{
    "text": "June 23",
    "created": "Sun, 23 Jun 2019 14:57:44 GMT",
    "name": "23",
    "subs": [
        {
            "text": "Bill Gates' <a href=\"https://www.youtube.com/watch?time_continue=716&v=W5g4sPi1wd4\">biggest failure</a> in his words is that Microsoft didn't make Android. Hat's off to him. Most great men when looking back on their careers tend to be less specific in their regrets. But imho he's thinking too small. I think his biggest failure was to miss that at the point Windows became the default platform, the role of Microsoft fundamentally changed, and he fought that and that crippled his company and the market. He couldn't make Android at Microsoft any more than GM could make a Tesla. So imho his biggest mistake was not buying a big stake in Google when they were in the garage. And anything else that looked promising. Also it wouldn't surprise me if he read this. One of his strengths as a leader in the PC business was that he engaged with criticism, and learned from it. Most people in his position failed at that, and that's why he won so big, imho.",
            "created": "Sun, 23 Jun 2019 16:14:58 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/06/23/android.png"
        },
        {
            "text": "Dr John's <a href=\"https://twitter.com/wwoz_neworleans/status/1142610027347349504\">memorial</a> procession in New Orleans. ",
            "created": "Sun, 23 Jun 2019 15:43:03 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/wwoz_neworleans/status/1142610027347349504"
        },
        {
            "text": "I am a subscriber of the NY Times. I am reading an article and a dialog pops up telling me it thinks I'm a subscriber and recommending that I log in. I log in. First thing they do is pop up an ad trying to upsell me. Thanks for the respect. ",
            "created": "Sun, 23 Jun 2019 15:26:03 GMT",
            "type": "outline"
        },
        {
            "text": "What would you think if in Nazi Germany they had polled Germans on whether they approved of concentration camps? Pause for a moment and realize they are almost certainly doing that now in the US. ",
            "created": "Sun, 23 Jun 2019 15:21:52 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1142814521523879936"
        },
        {
            "text": "My friend Phil Windley posted a stunning <a href=\"http://scripting.com/images/2019/06/23/utah.png\">picture</a> of the mountains in Utah on <a href=\"https://www.instagram.com/p/BzB8AIjh_0E/\">Instagram</a>. Breath-taking. My first reaction was \"America is beautiful.\" Not Utah. i thought about that for a bit. Phil had been traveling in Italy and Switzerland, posting pictures of stunningly beautiful places, most of which could not exist in America. because their civilization is older. Of course Utah is a Republican state. Then I thought why doesn't America market itself to Americans. The whole thing, not just pro-this or anti-that. The things that are indivisible. Like the Wasatch Mountains of Utah. That's America, not Republican. ",
            "created": "Sun, 23 Jun 2019 15:08:05 GMT",
            "type": "outline"
        },
        {
            "text": "The Salt Lake Tribune on why <a href=\"https://www.sltrib.com/opinion/editorial/2019/06/22/tribune-editorial-yes-we/\">concentration camp</a> is the right word. We are going down a path that leads to what my grandparents warned me about. They barely survived the Nazis and they were smart people and told their grandchildren what to watch out for. ",
            "created": "Sun, 23 Jun 2019 14:58:00 GMT",
            "type": "outline"
        },
        {
            "text": "The <a href=\"https://www.berkshireeagle.com/stories/pot-shop-planned-for-flying-church-says-it-could-handle-swell-of-cars-shoppers,577525\">issues</a> of opening a new recreational cannabis store in Great Barrington, MA, the closest location in Massachusetts to NY.",
            "created": "Sun, 23 Jun 2019 14:57:45 GMT",
            "type": "outline"
        }
    ]
}