{
    "text": "June 25",
    "created": "Tue, 25 Jun 2019 14:04:44 GMT",
    "name": "25",
    "subs": [
        {
            "text": "Maybe the city should offer the Nets use of Madison Square Garden until the Knicks get it together. Maybe we could even call the Nets the Knicks, why not, it's not as if the actual Knicks are doing anything with the name. Let Brooklyn have Dolan.",
            "created": "Tue, 25 Jun 2019 17:24:08 GMT",
            "type": "tweet",
            "tweetId": "1143570703645458432",
            "tweetUserName": "davewiner"
        },
        {
            "text": "A serial radio play",
            "created": "Tue, 25 Jun 2019 14:16:06 GMT",
            "type": "outline",
            "description": "Last night's radio play was just another verbatim reading of the Mueller report. Instead what we need is real story-telling with suspension of disbelief.",
            "subs": [
                {
                    "text": "I watched a bit of <a href=\"http://scripting.com/2019/06/24.html#a213149\">last night's show</a> starring John Lithgow as Trump. It was sold as a play. I thought that meant it was going to be dialog between characters, pure story-telling creating suspension of disbelief, but it was just another reading of the Mueller report, a good one. I would have thought that great actors would want to do a play, but it wasn't a play. It was actors reading a report written by lawyers.  ",
                    "created": "Tue, 25 Jun 2019 14:04:45 GMT",
                    "image": "http://scripting.com/images/2019/06/25/chaplin.png"
                },
                {
                    "text": "In the rest of this post I'll outline how the project, if it were to really have impact, would get started. It will be more of a commitment than last night's performance. But our world is worth it, don't you think??",
                    "created": "Tue, 25 Jun 2019 14:29:16 GMT"
                },
                {
                    "text": "So here's the concept... ",
                    "created": "Tue, 25 Jun 2019 14:23:31 GMT"
                },
                {
                    "text": "A serial radio play, distributed as a weekly podcast. ",
                    "created": "Tue, 25 Jun 2019 14:07:27 GMT"
                },
                {
                    "text": "Opening scene, a congressional hearing. A select committee of senators and representatives question (actors playing) Manafort, Flynn, Hicks, Comey, etc, who answer questions fully as they did for Mueller. The answers derive from the report, but they are not verbatim. The actors strive to present their characters in a good light. The congresspeople are all interested in getting the truth. Even the Repubs. This part of course is fiction. Artistic license. And the Democrats have the guts to ask probing, hard questions.",
                    "created": "Tue, 25 Jun 2019 14:30:05 GMT"
                },
                {
                    "text": "Dramatic interludes in the Oval Office, on Air Force One, golf courses and watching TV (executive time) where the president, played by Lithgow (an excellent choice to play Trump) gives soliloquies in the form of phone conversations with various celebs such as Hannity, Carl Icahn and a few <a href=\"https://en.wikipedia.org/wiki/Russian_oligarch\">surprises</a>. We keep coming back to the hearing room, that's where the story is really being told. ",
                    "created": "Tue, 25 Jun 2019 14:29:59 GMT"
                },
                {
                    "text": "The resulting radio show, a riveting drama, is released one episode a week as a podcast. ",
                    "created": "Tue, 25 Jun 2019 17:08:19 GMT"
                },
                {
                    "text": "PS: Perfect person to <a href=\"https://www.youtube.com/watch?v=DG0ch202prY\">write</a> it <a href=\"https://www.youtube.com/watch?v=BKdSGSZfbnA\">imho</a> -- <a href=\"https://www.youtube.com/watch?v=ZQJ6yqQRAQs\">Aaron</a> <a href=\"https://www.youtube.com/watch?v=QOSxwFtBNww\">Sorkin</a>. ",
                    "created": "Tue, 25 Jun 2019 14:37:26 GMT"
                }
            ]
        }
    ]
}