{
    "text": "June 29",
    "created": "Sat, 29 Jun 2019 14:23:34 GMT",
    "name": "29",
    "subs": [
        {
            "text": "If we want impeachment, we can have it. Here's how. Occupy Washington DC until it happens. 100K people always present at the US Capitol on a rotating basis until impeachment. Sign up for one day. Your life goes on mostly uninterrupted. Wear comfy clothes. Bring lunch. Hydrate. Circulate. Yell, talk, cajole. Whatever, but be present. ",
            "created": "Sat, 29 Jun 2019 18:45:30 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/06/29/peace.png"
        },
        {
            "text": "I love that <a href=\"https://www.theatlantic.com/ideas/archive/2019/06/glorious-idealism-us-womens-national-team/593023/\">she's</a> having a public feud with El Orange. We need a few more non-presidential candidates to suck Trump into the great void of celebrity-bashing. That's how we get rid of the mofo.",
            "created": "Sat, 29 Jun 2019 14:23:35 GMT",
            "type": "outline"
        },
        {
            "text": "Are there silent Republicans?",
            "created": "Sat, 29 Jun 2019 21:02:36 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "One of the arguments in favor of Biden and other moderates is that they will get Republican votes and that would of course (imho) be good. If I thought of myself as a Repub, I'd be looking for a way to not vote for Trump, and still have self-respect.",
                    "created": "Sat, 29 Jun 2019 21:02:45 GMT"
                },
                {
                    "text": "I'd be susceptible to the argument that they're all socialists (I don't mind, I think <a href=\"http://scripting.com/stories/2011/01/01/theWorldIsSocialist.html\">we're all socialists</a> anyway, that's the way our economy works in the areas that matter). Bernie Sanders would press my buttons. I might not vote, instead of voting for either.",
                    "created": "Sat, 29 Jun 2019 21:03:15 GMT"
                },
                {
                    "text": "Nixon called these people <a href=\"https://en.wikipedia.org/wiki/Silent_majority\">The Silent Majority</a>.",
                    "created": "Sat, 29 Jun 2019 21:03:25 GMT"
                },
                {
                    "text": "However, if they want to be served, they have to find a way to let us all know that they really are out there. Repubs who would vote for a Democrat if a moderate were nominated. Maybe start giving money to Klobuchar or Hickenlooper, for example.",
                    "created": "Sat, 29 Jun 2019 21:03:35 GMT"
                }
            ]
        },
        {
            "text": "River5 ➜ River6",
            "created": "Sat, 29 Jun 2019 15:43:53 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "<i>On the River5 mail list Hanan Cohen <a href=\"https://groups.google.com/forum/?utm_medium=email&utm_source=footer#!msg/river5/Pb9IM4Ooj1Y/vCFp3ncECgAJ\">asks</a> if he should wait for \"River6\", what about the browser, and how to mirror rivers on Twitter feeds. I answered in an email, which I'll include below so it gets into search engines. </i>",
                    "created": "Sat, 29 Jun 2019 15:44:06 GMT"
                },
                {
                    "text": "First, I'm glad to hear you're building a public aggregator for Israeli blogs. Let me know when you're ready for people to come and I'll post a note on my blog.",
                    "created": "Sat, 29 Jun 2019 15:45:12 GMT"
                },
                {
                    "text": "Okay -- now to advice re River6.",
                    "created": "Sat, 29 Jun 2019 15:45:16 GMT",
                    "flNumberedSubs": "true",
                    "subs": [
                        {
                            "text": "I never recommend waiting, and I also place a strong emphasis on moving forward with compatibility. A River5 installation can be converted to River6 quickly. It's just a matter of setting up MySQL, and then copying the <i>lists</i> folder from the river5 folder to the river6 folder. Then there's a variable amount of waiting for the river to fill up, but that's something the software does on its own. ",
                            "created": "Sat, 29 Jun 2019 15:45:18 GMT"
                        },
                        {
                            "text": "All the changes are visible in the front end in <a href=\"http://river6.scripting.com/\">river6.scripting.com</a> and \"podcatch.com\", both of which use the new river browser. However it could just as easily be displaying rivers produced by River5. As far as I know there are no changes to that format between 5 and 6 (any that are present are bugs).",
                            "created": "Sat, 29 Jun 2019 15:46:16 GMT"
                        },
                        {
                            "text": "I have several rivers that are mirrored to Twitter feeds, for example <a href=\"http://nbariver.com/\">nbariver.com</a> is mirrored to <a href=\"https://twitter.com/nbariver\">@nbariver</a>, using a Node-based utility that I wrote called <a href=\"https://github.com/scripting/riverToTweets\">riverToTweets</a>. It's been running smoothly for years. I recommend it. ",
                            "created": "Sat, 29 Jun 2019 15:46:56 GMT"
                        }
                    ]
                }
            ]
        }
    ]
}