{
    "text": "June 30",
    "created": "Sun, 30 Jun 2019 16:24:21 GMT",
    "name": "30",
    "subs": [
        {
            "text": "Journalism took down Moses",
            "created": "Sun, 30 Jun 2019 16:39:10 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I'm getting to the end of <a href=\"https://www.amazon.com/Power-Broker-Robert-Moses-Fall/dp/0394720245\">The Power Broker</a>, it's finally getting good. The book is such a drag, it goes through every project Moses did over thirty years of re-making New York. He was as corrupt as they come. He started out brilliant, with an idea, and was driven to do it almost in an a Jobsian way (<a href=\"https://ny.curbed.com/2017/6/21/15838436/robert-moses-jones-beach-history-new-york-city\">Jones Beach</a> was his Mac). ",
                    "created": "Sun, 30 Jun 2019 16:39:21 GMT",
                    "image": "http://scripting.com/images/2019/06/27/thePowerBroker.png"
                },
                {
                    "text": "To him cars were an adventure, a way to go from the city to the country to enjoy nature. But he somehow missed that between the 20s and the 50s cars had changed, had become drudgery. Anything but fun.",
                    "created": "Sun, 30 Jun 2019 16:40:05 GMT",
                    "collapse": "true",
                    "subs": [
                        {
                            "text": "Fun fact. Even though Moses built only around the car, to the detriment of mass transit, he himself could not drive. He was always chaufeurred in limosines. As if Steve Jobs never used a Mac. ",
                            "created": "Sun, 30 Jun 2019 16:43:41 GMT"
                        }
                    ]
                },
                {
                    "text": "Long Island, which more than any other area designed by Moses, was a livability horror. You had to drive everywhere. All the money that could have been spent on efficient mass transit was spent on making roads and bridges that were jammed the day they opened. Classic example the <a href=\"https://en.wikipedia.org/wiki/Interstate_495_(New_York)\">Long Island Expressway</a>. It's often bumper to bumper at 2 in the morning. And the <a href=\"https://en.wikipedia.org/wiki/Bruckner_Interchange\">Bruckner Interchange</a> in the Bronx. Once I calculated that I spent three whole months of my life there, stuck in gridlock on the <a href=\"https://www.google.com/maps/dir/Union+St+%26+32nd+Ave,+Queens,+NY+11354/W+Farms+Square+Plaza,+The+Bronx,+NY+10460/@40.8058515,-73.8866668,13z/data=!3m1!4b1!4m14!4m13!1m5!1m1!1s0x89c2601c5b98533d:0x93bbc40a40f8ae74!2m2!1d-73.8266883!2d40.7689568!1m5!1m1!1s0x89c2f48cf9f76715:0xeb931b7aca2177eb!2m2!1d-73.880808!2d40.8414408!3e3\">Q44</a> bus.",
                    "created": "Sun, 30 Jun 2019 16:40:35 GMT"
                },
                {
                    "text": "Chicago, when they built freeways, left room for mass transit. NYC had that idea too, but Moses, who had total control over highway construction in NY, would never do it. ",
                    "created": "Sun, 30 Jun 2019 16:46:59 GMT"
                },
                {
                    "text": "Anyway, the book gets good when journalists take on Moses after decades of puff pieces. Someone should write an abridged version of that book, with a chapter up front saying what a miserly asshole Moses was. Then really dive into the story with the parking lot at Tavern on the Green aka the <a href=\"https://www.nydailynews.com/new-york/master-builder-robert-moses-lost-grip-new-york-city-article-1.813426\">Battle of Central Park</a>. I'd guess about 200 pages max. And it could be turned into a <a href=\"https://en.wikipedia.org/wiki/All_the_President%27s_Men_(film)\">ATPM</a>-like HBO series. Journalists would love the story, it's big story like Watergate, that most people don't know. ",
                    "created": "Sun, 30 Jun 2019 16:41:38 GMT"
                }
            ]
        },
        {
            "text": "I have <a href=\"http://nbariver.com/\">nbariver.com</a> ported to \"River6\". I'm going to pause here for a bit and factor it so it's a prototype for standalone rivers meant for public use. I want to make this as easy as possible, requre the fewest files, and show through as much power as possible. ",
            "created": "Sun, 30 Jun 2019 16:27:40 GMT",
            "type": "outline"
        },
        {
            "text": "Trump's running mate",
            "created": "Sun, 30 Jun 2019 16:24:22 GMT",
            "type": "outline",
            "description": "Democrats, stop being so fair to El Orange the Dictator in Chief.",
            "subs": [
                {
                    "text": "If Trump were a Democrat making love with Kim Jong Un so openly, that might be a cause for celebration for the Repubs. Trump's running mate in 2020. I doubt if KJU would do anything to jeopardize Trump's re-election. And you know they have hackers too. Hmm. :boom: ",
                    "created": "Sun, 30 Jun 2019 16:24:26 GMT",
                    "image": "http://scripting.com/images/2019/06/30/kimJongUnHead.png"
                },
                {
                    "text": "And for the Democrats the more you push Trump into the little dictator's crotch, the better the chances for Medicare For All. This is all connected. You want to win? Stop being so fair to El Orange the Dictator in Chief.",
                    "created": "Sun, 30 Jun 2019 16:25:05 GMT"
                }
            ]
        }
    ]
}