{
    "created": "2024-06-02T04:00:00.000Z",
    "flInCalendar": true,
    "name": "02",
    "path": "2024/06/02",
    "text": "June 02",
    "type": "calendarDay",
    "subs": [
        {
            "text": "To people who say you get wrong answers from ChatGPT, if I wanted my car to kill me I could drive into oncoming traffic. If I wanted my calculator to give me incorrect results I could press the wrong keys. In other words, ChatGPT is a very new tool. It can be hard to control, you have to check what it says, and try different questions. But the result, if you pay attention and don't drive it under the wheels of a bus, is that you can do things you never could do before. ",
            "created": "Mon, 03 Jun 2024 02:30:44 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2024/06/02/librarian.png",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://www.threads.net/@mossbergwalt/post/C7rli4JJ3St\">Walt Mossberg shows</a> why ChatGPT is such a conversation-starter, and thus is incredible art. He asked it to draw a picture of himself with Kara Swisher. Of course everyone did that, and posted the result to the thread. The variety of responses is amazing, revealing of what I'm not sure. Here's <a href=\"https://www.threads.net/@davew/post/C7uYdAcJpTQ\">the one</a> it came up with for me. ",
            "created": "Sun, 02 Jun 2024 19:18:13 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I bet you could do a beautifully readable blog by just dynamically rendering its RSS feed.  Why bother statically rendering the home page, month page, day page or pages for each individual post. Dynamic servers are so cheap these days. ",
            "created": "Sun, 02 Jun 2024 15:18:08 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The worst part about having a felon in the White House is that he's probably committing felonies while he's in the freaking White House. ",
            "created": "Sun, 02 Jun 2024 14:31:28 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "There's a lot of stuff in Friday's piece. Ken Smith pointed out the story in the <a href=\"http://scripting.com/2024/05/31/123255.html#a125308\">very last postscript</a>. Before that, I hadn't put it together that podcasting worked because for a while Adam did my job, and for a while I did his. That guaranteed two things -- that the technology would be maximally simple, and that anyone with a computer could do the whole recording and production job without help from an expensive studio. In both cases the result was nowhere near commercial standards, but that didn't matter, in fact it helped that there were so many glitches in my early podcasts, that said that hey if this guy can do it, so can I. ",
            "created": "Sun, 02 Jun 2024 14:36:42 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2024/06/02/siliconValley.png",
            "flInCalendar": true
        }
    ]
}