{
    "created": "2024-06-03T04:00:00.000Z",
    "flInCalendar": true,
    "name": "03",
    "path": "2024/06/03",
    "text": "June 03",
    "type": "calendarDay",
    "subs": [
        {
            "text": "It's been almost nine years since I did the <a href=\"http://scripting.com/2015/09/30/aPodcastAboutPodcasting.html\">podcast about podcasting</a>. Today I was asked how I feel about podcasting now. Here's what I said. It's still working -- people expect to have choice in where they listen to their podcasts, and as long as that's true they will imho continue to have choice. But even if Google took it over tomorrow, I'd be happy with the outcome. It's been over 20 years since we rolled it out, and it's still delivering huge value to lots of people, and isn't controlled by anyone, as far as I can tell there are no gatekeepers. If only we had been able to keep blogging free of that kind of control, but I have hope there too.",
            "created": "Mon, 03 Jun 2024 17:52:49 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2024/06/03/wewon.png",
            "flInCalendar": true
        },
        {
            "text": "One of the flaws in the design of Teslas is they are really difficult to operate safely for people who are farsighted, such as myself. A lot of the <a href=\"https://imgs.scripting.com/2024/06/03/teslascreen.png\">status messages</a> are too small for me to read without reading glasses, and in the time it takes to put them on the message is gone. Esp frustrating for the messages that tell you to do this or that to keep using FSD. And when I'm flipping the glasses down, my eyes are not on the road Mr or Ms Tesla. This is a design problem. Maybe you should use voice prompts for this kind of stuff. Or use a camera to see if my hands are on the wheel.",
            "created": "Mon, 03 Jun 2024 15:20:49 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "We should apply mathematics to language design. The goal of the language should be maximum simplicity for the human developer. As much of the complexity as possible should be handled by software, either at compile-time or runtime. It should strive to read like <a href=\"https://en.wikipedia.org/wiki/Pseudocode\">pseudocode</a>. We started out writing code by toggling switches on the front panel of the computer, and for a few decades we were factoring and making it simpler with every iteration, but then we turned around in the other direction. I am from the church of factoring. I do it in my designs of products at all levels, and I treat languages with the same care. It turns out all the rules of working on open systems also apply to language design. I plan to write more about this. ",
            "created": "Mon, 03 Jun 2024 14:31:27 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Another great application for ChatGPT. Try to find a blog post or article about the design of a language that gets to what you want to know without wading through a lot of stuff you don't care about. I got it to explain Swift, Go and Rust quickly. Okay now I know what they're doing. It would have taken me days to assemble this, and I never have that kind of time for such execursions.",
            "created": "Mon, 03 Jun 2024 14:35:32 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I keep coming back to this -- ChatGPT is a vast library that comes with its own librarian. And the librarian has read and digested all of it, and can give you useful and usually exactly right summaries (despite what the critics say) in an instant. I've been using libraries my whole life, going back to when I was a child. I worked with card catalogs and non-virtual book collections. Archives of news on film. View ChatGPT on that timeline and you'll see its significance. You didn't write it, I didn't. Each of us may have contributed a little, and <i>isn't that what we want?</i> To help build the base of human knowledge? It gives our lives meaning. Sometimes I wonder how much value people place on themselves and so little on progress. I think we all want our lives to have meaning. Well here you go, it doesn't get more meaningful than this. ",
            "created": "Mon, 03 Jun 2024 14:41:13 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2024/06/02/librarian.png",
            "flInCalendar": true
        },
        {
            "text": "If you make a podcast client, I'd like to have an <a href=\"https://opml.org/spec2.opml#subscriptionLists\">OPML list</a> of all the feeds I'm subscribed to in my client so I can follow it in my feed reader. I'd really like it to go the other way, actually, so I could maintain the list on my desktop computer, and have it automatically reflected in the mobile podcast client. It's very important that it use OPML, that's the standard for this stuff. I couldn't possibly get excited by another format. Podcasting thrives on these standards. The client I use is <a href=\"https://pocketcasts.com/\">Pocket Casts</a> which is part of Automattic. BTW, you can <a href=\"https://editsubscriptionlists.opml.org/\">use Drummer to edit</a> a subscription list. Its native format is OPML.",
            "created": "Mon, 03 Jun 2024 18:01:54 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}