{
    "created": "2024-06-11T04:00:00.000Z",
    "flInCalendar": true,
    "name": "11",
    "path": "2024/06/11",
    "text": "June 11",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Meanwhile the Repubs are getting ahead of themselves. Bannon said <a href=\"https://politicalwire.com/2024/06/11/bannon-tells-ex-fbi-directors-to-leave-the-country/\">something</a> that he should be arrested for. I'm sure it's horribly illegal to threaten people the way he did, and he did it in public. ",
            "created": "Tue, 11 Jun 2024 14:30:23 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2024/06/11/nakedJenToday.png",
            "flInCalendar": true
        },
        {
            "text": "I caught a bit of the last <a href=\"https://ew.com/tv/vanna-white-loses-celebrity-wheel-of-fortune-to-jeopardy-hosts-mayim-bialik-ken-jennings/\">Wheel of Fortune</a>. The three players were celebs: Vanna White, Ken Jennings and Mayim Bialik. What was remarkable was how super-human Jennings is. He could solve the puzzle with almost no information. I have no clue how he saw the patterns. He has freakish intelligence. ",
            "created": "Tue, 11 Jun 2024 14:27:00 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Someone should tell the kids the Repubs will come for their weed. Just sayin. There probably are a number of voting age youngsters who have never lived in a time and place when cannabis was illegal.",
            "created": "Tue, 11 Jun 2024 14:21:34 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "By popular demand -- my blogroll now makes it more clear that the permalink to each item is the date of the item. <a href=\"https://imgs.scripting.com/2024/06/11/blogrollScreenShot.png\">Screen shot</a>. This is a convention in blogs and social media apps that the timestamp doubles as a permalink. And I think this is more distracting, and cluttered, but let's give it a try. It's possible that people missed that they could go to the website from the blogroll. Now it should be more obvious.",
            "created": "Tue, 11 Jun 2024 14:10:07 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The Repubs are coming uncloaked. Their slogan might as well be Revenge. It's the one thing everyone who votes for Trump wants more than anything. They hate their lives, and are looking for someone to release their rage on. They don't know how else to do it. It doesn't have much to do with inflation or unemployment, material wealth. It's deeper than that. We're all living a lie, that if we had money we'd be happy. The sad truth is no one is happy with this arrangement. Ask a billionaire if you don't believe me. They have huge grievances which you would have thought all that wealth would have cured them of. The new Nazis have a selling proposition that works every few generations, after the memory of the previous societal explosion are gone. My parents, the last people I knew who lived through the Nazis are gone. I just have the memory of the aftermath, and it wasn't pretty. “All of this has happened before, and it will all happen again.” We're at the beginning of the \"happen again\" moment. My grandfather told me what to do, but I won't do it, pretty sure of that. ",
            "created": "Tue, 11 Jun 2024 13:47:13 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2021/05/13/knicksFan.png",
            "flInCalendar": true
        },
        {
            "text": "Right-margin images",
            "created": "Tue, 11 Jun 2024 18:52:09 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "It's been driving me <a href=\"https://www.facebook.com/dave.winer.12/posts/pfbid024FDKvbd25XG3C2JQmfXBuvXGZuyw7btYnXRKZtVWmLbABdyH8ke93rqfTnK6EkUjl\">crazy</a> watching Stan Krute doing all these weird and often beautifully bizarre ChatGPT images, and realizing they are only being seen by people on Facebook when there's this huge world of creative people that don't or won't use FB.",
                    "created": "Tue, 11 Jun 2024 18:52:15 GMT",
                    "image": "https://imgs.scripting.com/2024/06/11/nakedJenToday.png",
                    "flInCalendar": true
                },
                {
                    "text": "Then it occurred to me, I have the perfect place for these images, outside the facebookiverse, that would showcase them, and be easy to produce (I don't want to take on responsibility for big production overhead myself).",
                    "flInCalendar": true
                },
                {
                    "text": "I have images I put in the right margin of blog posts on \"Scripting News\". Small little bits of creative color, that may or may not be connected to the story they are next to. And sometimes connected in non-obvious ways, intended to make you think.",
                    "created": "Tue, 11 Jun 2024 18:52:31 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Then NakedJen sent me a recent picture of herself that's perfect for the right margin. Seen in the right margin of this post.",
                    "created": "Tue, 11 Jun 2024 18:52:47 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Here's a <a href=\"http://scripting.com/images/manyImages.html\">page</a> where you can scroll through the collection of images I can choose from. I'd love to add more creative stuff here. And I'd love to get some of Stan Krute's genius or Brad Pettit or whoever else might be so inspired. ",
                    "created": "Tue, 11 Jun 2024 18:53:01 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "No promises about when or if they'd be used. You can post them here, as comments on this message if you like. ",
                    "created": "Tue, 11 Jun 2024 18:53:13 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I may have to restrict this to people I follow, just letting you know, based on past experience. ",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}