{
    "created": "2024-06-14T04:00:00.000Z",
    "flInCalendar": true,
    "name": "14",
    "path": "2024/06/14",
    "text": "June 14",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Thanks Mr President. <a href=\"https://www.youtube.com/watch?v=VC2SshZ373M\">This</a> needed to be said. ",
            "created": "Fri, 14 Jun 2024 12:44:37 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=VC2SshZ373M",
            "flInCalendar": true
        },
        {
            "text": "I'd like YouTube TV to let me block Fox News. It shows up on their home screen as the default channel and it starts playing automatically. For some reason they've decided need to watch Fox News. Please stop doing that. Not just for me, for everyone. If there has to be a default make it something easy like Seinfeld perhaps. Or Law & Order. I haven't switched from Spectrum, I'm trying YouTube TV while I think about switching. This is a small thing, but might be a deal-stopper. I don't want my nose rubbed in how evil they are. I know. I want to turn on TV to escape. A Julie Andrews movie perhaps. ",
            "created": "Fri, 14 Jun 2024 13:02:54 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2024/06/14/julieAndrews.png",
            "flInCalendar": true
        },
        {
            "text": "I hate sticky keyboards. Very low tolerance.",
            "created": "Fri, 14 Jun 2024 13:02:41 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://www.google.com/search?q=site%3Ascripting.com+matt+terenzio\">Matt Terenzio</a>, who has been a friend for many years, <a href=\"https://mastodon.social/@librenews/112615016271629839\">threw a fat pitch</a> about people like me who think the NY Times has a lot of explaining to do. I don't think anyone is listening, but my issue with the Times is when they embrace and promote conspiracy theories that damage our political system. Matt says we have many truths, and I think that's where we differ, there has to be one truth when it comes to accusations of the kind that the Repubs throw at Democratic candidates and minorities. When they take a side against the people, that's when I have a problem. ",
            "created": "Fri, 14 Jun 2024 12:56:46 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "A great political ad",
            "created": "Fri, 14 Jun 2024 17:52:00 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Okay it's not the best political ad ever but it's pretty freaking good.",
                    "created": "Fri, 14 Jun 2024 17:52:19 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "We love America and the flag stands for the good in us, in all of us. And our president not only gets that, he is doing what presidents are supposed to do, unite us. To the extent that we can at this time be united. But even a MAGA, viewing this ad, is going to have to swell up with pride for what this country means. ",
                    "created": "Fri, 14 Jun 2024 17:52:37 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/VC2SshZ373M?si=CV1-O9liPDmIhQRN\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe><br>But I have a question for my campaign friend and politics rabbi -- <a href=\"https://podcasts.apple.com/us/podcast/that-trippi-show/id1523896927\">Joe Trippi</a>. Joe, why don't they ask for a contribution at the end? I'd pay money specifically to have that ad run everywhere, even in states we have no chance of winning. Because there are people in every state that deserve encouragement, and if we want to really win we need them to feel part of our great country as much as anyone in a swing state. And there's always value in forcing the opposition to campaign in states they otherwise feel are safe. ",
                    "created": "Fri, 14 Jun 2024 17:53:56 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "So let me -- a regular citizen -- earmark a contribution for <i>this</i> message. It gives me another way to vote, a sense I'm participating. ",
                    "created": "Fri, 14 Jun 2024 17:55:23 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}