{
    "created": "2024-06-16T04:00:00.000Z",
    "flInCalendar": true,
    "name": "16",
    "path": "2024/06/16",
    "text": "June 16",
    "type": "calendarDay",
    "subs": [
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=P6zaCV4niKk\">Cat Stevens</a>: \"Look at me, I am old, but I'm happy.\"",
            "created": "Sun, 16 Jun 2024 13:01:50 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=P6zaCV4niKk",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=7wzEBuC_NtQ\">Buffalo Springfield</a>: \"You make the rules, you say what's fair.\"",
            "created": "Sun, 16 Jun 2024 13:05:36 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=7wzEBuC_NtQ",
            "flInCalendar": true
        },
        {
            "text": "I've written a crawler for the network of blogrolls via <a href=\"https://opml.org/blogroll.opml\">connective links</a> in HTML and/or RSS feeds. When I started the project, I had no idea what I'd find. How many blogrolls of what quality. I still don't know the extent of it, but there's a non-trivial number of blogrolls out there. I'm thinking about ways to get a handle on all the feeds in all the blogrolls, and see what we get from that. And I'm beginning to see the utility of \"FeedLand\" as a feed operating system, which is what I wanted it to be. It's not just a feed reader. It's able to do things most feed readers don't do, maybe none do. We don't have a good grasp of the depth of the feed products either. I will of course share the results when they are shareable. ",
            "created": "Sun, 16 Jun 2024 11:22:07 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2024/06/16/rssCover.png",
            "flInCalendar": true
        },
        {
            "text": "Three movies I've watched in the last few days: 1. Fight Club. 2. The Matrix. 3. The Devil's Advocate. I had seen all of them before. But they go together. And they're all about the same thing, about choosing to live in a dream, or to live the life you're actually living. All three are excellent movies that I watched straight through from beginning to end, which is really unusual for me these days. ",
            "created": "Sun, 16 Jun 2024 11:20:14 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=zicGxU5MfwE\">This would make a great campaign ad</a>. Remember how lost we were. Understand what you're voting for when you go MAGA and what you could get if you sit this one out or cast a protest vote of some kind.",
            "created": "Sun, 16 Jun 2024 11:02:32 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=zicGxU5MfwE",
            "flInCalendar": true
        },
        {
            "text": "Imagine RSS as a cover story",
            "created": "Sun, 16 Jun 2024 11:27:55 GMT",
            "type": "outline",
            "metaImage": "https://imgs.scripting.com/2024/06/16/imagineTheyPutRSSOnACover.png",
            "description": "I don't owe a news org anything because I read the news on their site. The news doesn't belong to them.",
            "subs": [
                {
                    "text": "\"RSS\" has never been on the cover of a magazine, so you can't say ChatGPT is stealing this from anyone. In fact I'm offended on behalf of ChatGPT that the press has chosen to focus on the idea that it's plagiarizing journalists. The ideas journalists write about do not belong to them. If they're doing their jobs, they're reporting facts that exist whether or not they wrote a story about it. A simple example. I may have read in a local paper that the Mets swept the Dodgers in the <a href=\"https://en.wikipedia.org/wiki/National_League_Championship_Series\">NLCS</a>. I don't owe a news org anything if I wrote that the Mets won, because I read the news on their site. The news doesn't belong to them. ",
                    "created": "Sun, 16 Jun 2024 11:28:02 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The idea that RSS could be on the cover of a magazine isn't so far-fetched, but no one ran a press release and there were no billionaires involved, so they didn't consider it newsworthy I guess. Some day we're going to have to accept that we have to make our own news, in the sense of Scoop Nisker's famous line -- \"If you don't like the news go out and make some of your own.\" So here we go. I asked ChatGPT to imagine a magazine with RSS as the cover story. ",
                    "created": "Sun, 16 Jun 2024 11:31:07 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Imagine RSS as the cover story.",
                    "created": "Sun, 16 Jun 2024 11:33:11 GMT",
                    "inlineImage": "https://imgs.scripting.com/2024/06/16/imagineTheyPutRSSOnACover.png",
                    "flInCalendar": true
                },
                {
                    "text": "PS: Does the concept of a cover story even exist now that we rarely read printed magazines?",
                    "created": "Sun, 16 Jun 2024 12:02:57 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}