{
    "text": "The tweeting president is here to stay",
    "created": "Tue, 20 Mar 2018 13:50:15 GMT",
    "type": "outline",
    "description": "Many people today expect that the next president will go back to using social media in a hands-off way, but I think they're totally wrong about that. ",
    "subs": [
        {
            "text": "Imagine if you were alive during World War I and witnessed the first use of <a href=\"https://en.wikipedia.org/wiki/Aerial_warfare#History\">airplanes</a> in war. You might have thought it was unfair, or novel, or a temporary thing, because airplanes were so new, they had never before been used in war. You might have imagined that things would go back to normal after the war, but of course that would have been wrong. Air power was used in World War II, and nowadays the country with air superiority has a huge advantage over ones that don't.",
            "created": "Tue, 20 Mar 2018 13:50:27 GMT",
            "image": "http://scripting.com/images/2017/12/20/shrek.png"
        },
        {
            "text": "Same thing with the <a href=\"https://duckduckgo.com/?q=%22tweeting+president%22&t=hy&ia=web\">tweeting president</a>. Repubs say they don't pay attention. In the 2016 campaign the Democrats made fun of tweeting Trump. Many people today expect that the next president will go back to using social media in a hands-off way, but I think they're wrong about that.",
            "created": "Tue, 20 Mar 2018 13:52:36 GMT"
        },
        {
            "text": "After Obama used social media so effectively in the 2008 campaign, I fully expected he would continue after taking office, using it as his bully pulpit, using the power to spread the gospel of democratic media all around the world. Instead he backed off, governed from the White House and Air Force One, and the presidential Twitter account was used for simple public relations, like the weekly radio broadcast. Nothing controversial or even informative appeared in the presidential feed. ",
            "created": "Tue, 20 Mar 2018 13:53:50 GMT"
        },
        {
            "text": "Right now the press is making an issue of how social media was used in the campaign and beyond. It seems some decisions will now be made. It's essential that the coverage become better and more informed about what's really going on. The things they're calling Facebook on, what they call <a href=\"https://twitter.com/davewiner/status/976092268942843904\">breaches</a> are actually contractual, built into their terms of service and their business model. ",
            "created": "Tue, 20 Mar 2018 13:55:29 GMT"
        },
        {
            "text": "We have to put some controls on Facebook and Google, that's for sure. But the controls should be very different from what's being contemplated by journalism. They should be prevented from taking effective ownership of publicly owned protocols. It's as if Exxon or JP Morgan decided to build <a href=\"https://twitter.com/HistoryInPix/status/976104596396486656\">in</a> <a href=\"http://scripting.com/liveblog/users/davewiner/2015/12/27/0724.html\">Central Park</a>, to the exclusion of everyone else. We would of course see that as a violation. But beacuse it's happening <i>right now</i> in cyberspace, it can be hard to visualize. If things proceed as they have been, the press will tune into the hijacking of the open Internet five years after it is a fait accompli, long after any intervention can do any good. ",
            "created": "Tue, 20 Mar 2018 13:56:51 GMT"
        },
        {
            "text": "You don't have to take my word for it. This is what Tim Berners-Lee was <a href=\"https://motherboard.vice.com/en_us/article/qve74v/world-wide-web-29-tim-berners-lee-letter\">saying</a> in his open letter on the anniversary of the web earlier this month.",
            "created": "Tue, 20 Mar 2018 14:04:40 GMT"
        },
        {
            "text": "<i>Let's work together. </i>Programmers aren't just coders. Some of us have had full careers in the public sphere, and have encountered the problems you're covering now, years ago. We know what comes next, because we're living it now. ",
            "created": "Tue, 20 Mar 2018 13:59:00 GMT"
        },
        {
            "text": "Like air power in warfare, the power of networking is here to stay. We're at a formative moment. Let's break with tradition and do something thoughtful, so we can all benefit from the technology, not just the richest and most powerful among us, but everyone, as the technology has the potential to do.",
            "created": "Tue, 20 Mar 2018 14:05:38 GMT"
        }
    ]
}