{
    "text": "The Mets came to play",
    "created": "Mon, 21 Oct 2024 12:50:35 GMT",
    "type": "outline",
    "description": "The good news is we don't have to tear down Citi Field.",
    "subs": [
        {
            "text": "Last night the Mets were eliminated by the Dodgers playing in Los Angeles.",
            "created": "Mon, 21 Oct 2024 12:50:49 GMT",
            "image": "https://imgs.scripting.com/2024/10/18/grimace.png",
            "flInCalendar": true
        },
        {
            "text": "And I don't know about you but I'm really happy with how the season turned out. I didn't think the Mets would make it through any of the hurdles, making the playoffs, and beating the Brewers and Phillies. That was amazing. And the energy of this team, their humor and inventiveness, professionalism and perseverance. The Mets of 2024 were a great team, and they give us something to look forward to in 2025. ",
            "created": "Mon, 21 Oct 2024 12:50:50 GMT",
            "flInCalendar": true
        },
        {
            "text": "People say Mets pitchers walked too many Dodgers, but the walks were a result of discipline on the part of the Dodgers hitters. Most pitchers throw a lot of crap, and the hitters swing at it. The Dodgers are more discerning. If the Mets pitchers had thrown strikes they would have hit home runs. It's another way of saying that the Dodgers, no matter how much we despise them, this year at least, were the better team.",
            "created": "Mon, 21 Oct 2024 12:53:08 GMT",
            "flInCalendar": true
        },
        {
            "text": "And there is a silver lining. I wasn't sure I wanted the Mets to beat the Dodgers once we knew the team from the \"other\" league was going to be the Jankees. Last time the Mets played them in the World Series, they beat us in Shea Stadium and as a result we had to tear it down and start over. I don't think any of us wanted that, or even to risk having to tear down Citi Field. I don't like to be reminded that the Jankees even exist, much less be forced to watch them play. And honestly between the Dodgers and the other NY team, I want them <i>both</i> to lose. Is there any way to arrange that? I don't even want to know. ",
            "created": "Mon, 21 Oct 2024 12:53:59 GMT",
            "flInCalendar": true
        },
        {
            "text": "Anyway thanks to the Mets for being such a wonderful team, a constant inspiration. So onward. Next year. And now..",
            "created": "Mon, 21 Oct 2024 13:02:02 GMT",
            "flInCalendar": true
        },
        {
            "text": "The Knicks begin their season <a href=\"https://www.scmp.com/sport/basketball/article/3283231/nba-season-opens-boston-celtics-eyeing-dynasty-and-knicks-chasing-first-title-1973\">tomorrow night</a> in Boston against the Celtics.",
            "created": "Mon, 21 Oct 2024 12:55:25 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}