{
    "text": "I'm sticking with WordPress",
    "created": "Mon, 21 Oct 2024 15:52:59 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I'm continuing to develop on WordPress. I see the opportunity regardless of what else is going on. ",
            "created": "Mon, 21 Oct 2024 15:45:26 GMT",
            "flInCalendar": true
        },
        {
            "text": "I could be wrong, I have been before. I kept using Twitter for identity after Musk took over, even though as time went by it was increasingly obvious that developers weren't part of his plan. I've been there before, with Apple, after Jobs came back. We had a great developer community for the web on the Mac, better than anything on Windows or Unix, and the management before Jobs, Heidi Roizen advising Gil Amelio, seemed to value our contribution, even if we weren't prospering. But there was a moment when Jobs introduced the open source equivalent of some of our products -- and that basically spelled the end of our little adventure, since Apple was putting the spotlight on them and not us.",
            "created": "Mon, 21 Oct 2024 15:53:37 GMT",
            "flInCalendar": true
        },
        {
            "text": "But it doesn't always go that way. I kept investing in the Mac in 1985, a very bad year for Apple, and in 1986 we had a huge hit, and because we were almost alone in sticking it out, we were rewarded with booming sales. Of course it mattered that MORE was a lovely product. But if no one looks, it doesn't matter how lovely it is! ",
            "created": "Mon, 21 Oct 2024 15:54:18 GMT",
            "flInCalendar": true
        },
        {
            "text": "Anyway, the WordPress world is huge. Far bigger than the blogosphere in the 90s and 00s. Maybe somehow the trouble with WordPress will mean that people who see WordPress as a writing platform will all leave now, or stop considering new ways of writing. But honestly I don't think that's very likely. I have a few sites at wordpress.com that are archives, that I pay for, that I will continue to pay for. My father's memorial site, for example. Things would have to get incomprehensibly bad for me to consider moving it and where exactly would I move it?",
            "created": "Mon, 21 Oct 2024 15:55:33 GMT",
            "flInCalendar": true
        },
        {
            "text": "But on the other hand, there isn't anything else out there that's offering something new for the writers. I think I'm pretty much alone working in this area. And maybe people need some good news? ",
            "created": "Mon, 21 Oct 2024 15:55:57 GMT",
            "flInCalendar": true
        },
        {
            "text": "My new product is a medium size writing tool. Less than a full word processor and more than a <a href=\"http://scripting.com/2024/01/14/031201.html\">tiny little text box</a>. I think there are a lot of WordPress users who will like it. And I think there's a chance they might notice it. So I'm going all the way with this one. I may lose the bet, but wtf, let's give it a try.",
            "created": "Mon, 21 Oct 2024 15:56:17 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}