{
    "text": "The Post",
    "created": "Sun, 24 Dec 2017 18:24:31 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I snuck out to see <a href=\"https://en.wikipedia.org/wiki/The_Post_(film)\">The Post</a> this morning, early show. Awful movie. I gave it a turd on <a href=\"http://bingeworthy.io/movies/?id=00094\">bingeworthy</a>. No suspension of disbelief. Lots of famous TV actors, and Tom Hanks and Meryl Streep. Of course Streep was great, but the plot was ugh and the movie was filled with cliché, nothing to chew on, nothing to think about. A few moments where you cheered, but always aware how manipulated you had been to get there. ",
            "created": "Sun, 24 Dec 2017 18:24:36 GMT",
            "image": "http://scripting.com/images/2017/12/24/thePost.png"
        },
        {
            "text": "The bad guys are super bad, every last one of them, except for a POC woman clerk who works for the Justice Dept who tells Streep how much she admires her, and then gets chewed out by her boss, a skinny white man. There were some funny casting decisions. Like <a href=\"https://en.wikipedia.org/wiki/Bob_Odenkirk\">Saul Goodman</a> plays a heroic role, but he's still in character (and inexplicably has a different name). The tall skinny <a href=\"https://en.wikipedia.org/wiki/Zach_Woods\">lawyer</a> from Silicon Valley plays a tall skinny lawyer who works at The Post. And Daniel Ellsberg is played by the <a href=\"https://en.wikipedia.org/wiki/Matthew_Rhys\">male lead</a> in The Americans. There were many many more, all the leading TV actors of the day seem to have a role in this movie. ",
            "created": "Sun, 24 Dec 2017 18:36:14 GMT"
        },
        {
            "text": "Hanks was right not to want to show this at the White House. The president would not like it. And as much as I hate the president, I also hate the arrogance of Hollywood and journalism. This movie basically says \"Thank god for journalists, we can always depend on them to save our ass.\" I'd love to see a movie that for once takes a contrary position to that idea. ",
            "created": "Sun, 24 Dec 2017 18:30:14 GMT"
        }
    ]
}