{
    "text": "What podcasting is",
    "created": "Wed, 20 Aug 2025 14:19:57 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "<i>Note: Posted on Facebook eleven years ago. Still relevant today.</i>",
            "created": "Wed, 20 Aug 2025 14:20:06 GMT",
            "flInCalendar": true
        },
        {
            "text": "You couldn't have had podcasting without a lot of things coming together. They all had to be there.",
            "created": "Wed, 20 Aug 2025 14:21:47 GMT",
            "flNumberedSubs": "true",
            "subs": [
                {
                    "text": "Networks of writers who shared links. Blogging.",
                    "created": "Wed, 20 Aug 2025 14:20:31 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "A protocol for moving links around a network. HTTP.",
                    "created": "Wed, 20 Aug 2025 14:21:59 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Something to attach links and recordings to. RSS.",
                    "created": "Wed, 20 Aug 2025 14:22:00 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "A standard format for recording. MP3.",
                    "created": "Wed, 20 Aug 2025 14:22:02 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Inexpensive, easy to use playback devices, that could hook up to all this. iPod.",
                    "created": "Wed, 20 Aug 2025 14:20:32 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "You might argue that we still haven't gotten all the pieces needed for it to really work. But one thing is for sure, none of the pieces existed when the famous patent troll claims to have invented podcasting. ",
            "flInCalendar": true
        },
        {
            "text": "Maybe we should reach not for a victory but for understanding. The patent system is making decisions about technological processes it doesn't understand. No wonder it gets it so wrong.",
            "flInCalendar": true
        },
        {
            "text": "Postscript: The EFF filed suit against the patent troll, but didn't listen to what I said here, which is really fucked up because they didn't create podcasting, I did. There's a tremendous lack of respect for generosity in tech, yet without generosity there's no interop, only silos. Either you made billions from something, or you don't exist. That's why I stopped supporting EFF long ago, even though I gave them what was to me a significant amount of money when they started up, and why they get involved in so many wrong-headed ideas.  They don't respect tech, they respect money.",
            "created": "Wed, 20 Aug 2025 14:22:36 GMT",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://bsky.app/profile/dermotcasey.bsky.social/post/3lwtrlfyo6s23\">Dermot Casey</a>: \"I'd add Dave to this list. Things that are obvious in retrospect are never obvious before people like Dave put them together.\"",
            "created": "Wed, 20 Aug 2025 22:01:52 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}