{
    "text": "This is heavy",
    "created": "Sun, 09 Feb 2025 22:06:37 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "We need a word for this, like a spoiler alert, this is heavy, and if you're not in the mood, hit the Back button. ",
            "created": "Sun, 09 Feb 2025 22:06:42 GMT",
            "flInCalendar": true
        },
        {
            "text": "I listened to this week's <a href=\"https://podcasts.apple.com/us/podcast/how-wired-magazine-is-scooping-the-competition-plus/id73330715\">On The Media podcast</a>, and there's a segment (at [12:51]) you should listen to as background. It says that no one in the DoJ as we go forward are going to be willing to prosecute people who do what the January 6 people did. That is a very clear statement, there is no rule of law when it comes to punishing Trump's enemies. And there's no Constitution to tell us what is and isn't an act that could get you on the enemies list. How can you live in a society like that after being raised in the US, where we really do have free speech. So..",
            "created": "Sun, 09 Feb 2025 22:07:14 GMT",
            "image": "https://imgs.scripting.com/2020/11/15/fatladysinging.png",
            "flInCalendar": true
        },
        {
            "text": "Then we hear that new hires at the FBI have to swear a loyalty oath to Donald Trump or they don't get hired. You could rationalize that, you were never planning on working for the FBI, but you could be investigated by them, and anyone who is willing to take that oath is someone you probably don't want to be investigated by. But it gets worse.",
            "created": "Sun, 09 Feb 2025 22:09:52 GMT",
            "flInCalendar": true
        },
        {
            "text": "Why should loyalty oaths stop with people who work at the FBI? Maybe to get a job <i>anywhere</i> you need to do that. Or to get a credit card, to drive a car, take a train, own a gun, or get health care, leave the country, or for that matter stay in the country, or keep your citizenship. Would you trust anyone who you knew said that the 2020 election was stolen just so they could keep their jobs? We you'll have to do it, if you want to eat. ",
            "created": "Sun, 09 Feb 2025 22:11:11 GMT",
            "flInCalendar": true
        },
        {
            "text": "About the only thing left to us, probably for a very short period of time, if at all, would be to run ads on TV, that clearly say what the upshot of this is, on a personal level, and forget about what you can prove -- use common sense, Occam's Razor -- we know where this is going -- now let's say it call very clearly before it happens. And then rally and protest, and be creative and think and stop being so flexible, stop playing it so safe because there is no way to play it safe, there never really was, but now we've run out of time. ",
            "created": "Sun, 09 Feb 2025 22:12:01 GMT",
            "flInCalendar": true
        },
        {
            "text": "I'll be watching the SuperBowl, in a few minutes, hoping to see some courage among the advertisers, but not expecting it.",
            "created": "Sun, 09 Feb 2025 22:21:48 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}