{
    "text": "What if writers had choice",
    "created": "Tue, 12 Apr 2022 12:21:39 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I'm looking for one or two service providers who are ready to offer users a choice of writing tools. To not force them to use <i>their</i> writing tools, their storage, and at best, offer a way to back up their writing. As a writer I want to use the tools I like best, and perhaps send them out through more than one channel. I don't want to be locked in, and forced to transcribe my writing for every possible service I might use.",
            "created": "Tue, 12 Apr 2022 12:21:41 GMT",
            "flInCalendar": true
        },
        {
            "text": "I'd like to see someone like Substack or Medium, for example, who says \"Write your stuff in your favorite writing tool, export it in Markdown, and give us the link. We'll take it from there.\"",
            "created": "Tue, 12 Apr 2022 12:22:04 GMT",
            "flInCalendar": true
        },
        {
            "text": "That way you could:",
            "created": "Tue, 12 Apr 2022 12:22:27 GMT",
            "flNumberedSubs": "true",
            "subs": [
                {
                    "text": "Use a tool that fits your writing style perfectly.",
                    "created": "Tue, 12 Apr 2022 12:22:23 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Developers would be incentivized to create such tools.",
                    "created": "Tue, 12 Apr 2022 12:22:40 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "You could use more than one service, say use Substack to manage your mail list, and Medium to manage your web presence, and Facebook for discussion among your friends, Slack to discuss among your work colleagues. (BTW, Slack has a good enough API to do this already.)",
                    "created": "Tue, 12 Apr 2022 12:22:41 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Great archival services could come about because they could be one of the services you cc on your writing.",
                    "created": "Tue, 12 Apr 2022 12:22:24 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Service providers could make custom toolkits to make it easy for tools to adapt to this interface. No need to master their whole API when all your users want is to shoot a story over for publication, indexing, rendering or storage.",
                    "created": "Tue, 12 Apr 2022 12:23:44 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Who knows what else will come about. ",
                    "created": "Tue, 12 Apr 2022 12:22:46 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "It takes two vendors to define a standard, and then there would be reason enough for all to do it. ",
            "created": "Tue, 12 Apr 2022 12:24:44 GMT",
            "flInCalendar": true
        },
        {
            "text": "It's amazing that we have this incredibly powerful network, but the business models of service providers protect their services by not allowing writers a choice in writing tools.  ",
            "created": "Tue, 12 Apr 2022 12:25:12 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}