{
    "text": "Librarians",
    "created": "Mon, 23 Jul 2018 12:56:35 GMT",
    "type": "outline",
    "description": "Librarians will always be special to me. Their ethos, their role, is so essential to a functional community. They don't get enough credit elsewhere, but with me, they are American heroes.",
    "subs": [
        {
            "text": "I wanted to say what I said <a href=\"http://scripting.com/2018/07/23.html#a124343\">above</a> about libraries and librarians for many years, but as long as my parents were alive, I didn't want to write about it. I still don't want to write about it in any great detail, because I understand why it was like it was.  ",
            "created": "Mon, 23 Jul 2018 12:56:39 GMT"
        },
        {
            "text": "Anger, pain and fear are passed down through generations. I knew their parents, and I knew what they all went through to get to America. I came to believe later in life that the responsibility of a parent is to do better than was done to them as a child, and both my parents achieved that. ",
            "created": "Mon, 23 Jul 2018 13:07:41 GMT"
        },
        {
            "text": "Back in the 60s, when I was growing up, things were different. Now, I think a kid could walk into a police station and tell the story of his house, and there might be some help. But not then. People stayed out of the internal life of families. ",
            "created": "Mon, 23 Jul 2018 13:09:24 GMT"
        },
        {
            "text": "The library really was a sanctuary for me. The librarians at the <a href=\"https://www.yelp.com/biz/queens-borough-public-library-auburndale-flushing\">Auburndale branch</a> of the Queens Borough Public Library knew me, they knew what I was interested in, what books I liked, what stories I liked to hear, and tell. The most important thing was they treated me as a real person. For kids, even today, that's rare.",
            "created": "Mon, 23 Jul 2018 12:58:14 GMT"
        },
        {
            "text": "That's why librarians will always be special to me. Their ethos, their role, is so essential to a functional community. They don't get enough credit elsewhere, but with me, they are American heroes.",
            "created": "Mon, 23 Jul 2018 13:03:40 GMT"
        }
    ]
}