{
    "created": "2023-10-01T04:00:00.000Z",
    "flInCalendar": true,
    "name": "01",
    "path": "2023/10/01",
    "text": "October 01",
    "type": "calendarDay",
    "subs": [
        {
            "text": "<b>Google kicked RSS's ass</b>. I'm wondering if when that happened, I shouldn't have stepped up and tried to raise a great \"RSS\" reader from OpenSourceLand. But I don't think it could have happened. It's funny how people processed that event, I didn't see any anger at Google, which if my little old \"UserLand\" had done something like that, there would have been a huge shitstorm. I think they manage their PR well because there's no one identifiable as the personality of Google, neither of the founders are visible. They don't tweet, you never hear anything about them outside of the business press. Same with the two people they've hired as CEO. Anyway, they treated RSS like an unwanted litter of kittens, put in a shopping bag and dropped from a bridge over a river. No thought to cleaning up the mess they created. They treated their users and the standard they took over like crap. But people need a <i>person</i> to be angry with. I'm much less consequential from a business standpoint, or user-control for that matter, my products get ignored mostly, but I am outspoken. And this makes me easy to be angry with. Anyway, I didn't step up because 1. I didn't think anything would come of it and 2. I didn't want to get embroiled in all the anger again. The last time it had nearly killed me. ",
            "created": "Sun, 01 Oct 2023 15:34:52 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2021/01/07/batman.png",
            "flInCalendar": true
        },
        {
            "text": "Today would have been my uncle's 78th birthday. Happy birthday Uncle Vava, where ever you are. ",
            "created": "Sun, 01 Oct 2023 13:45:57 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "September's outline is <a href=\"https://github.com/scripting/Scripting-News/blob/master/blog/opml/2023/09.opml\">archived</a>. High hopes for Oct. Let's begin! :smile:",
            "created": "Sun, 01 Oct 2023 13:40:33 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "An old time MORE ad",
            "created": "Mon, 02 Oct 2023 00:29:51 GMT",
            "type": "outline",
            "description": "\"He's got three questions. You have two answers. You need MORE.\"",
            "subs": [
                {
                    "text": "Steve Algernon found this MORE ad from the 80s and sent it along.",
                    "created": "Mon, 02 Oct 2023 00:30:00 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I had been looking for it a few years ago, now I want to be sure next time, it'll be easy to find. Steve used to work at Living Videotext, <a href=\"https://www.google.com/maps/place/117+Easy+St,+Mountain+View,+CA+94043/@37.3924404,-122.067555,122m/data=!3m1!1e3!4m6!3m5!1s0x808fb73b44beac6f:0x75582b6a9e573bd9!8m2!3d37.3923338!4d-122.0674987!16s%2Fg%2F11b8v422sp?entry=ttu\">where</a> this product was made. He went on to Apple, where he did system software. He was the one who got XML-RPC and RSS into the Mac OS in the early web days. <i>Thanks Steve</i> for all of it. :smile:",
                    "created": "Mon, 02 Oct 2023 00:34:29 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "\"He's got three questions. You have two answers. You need MORE.\"",
                    "created": "Mon, 02 Oct 2023 00:31:07 GMT",
                    "inlineImage": "https://imgs.scripting.com/2023/10/01/moreAdThreeQuestionsTwoAnswers.png",
                    "flInCalendar": true
                },
                {
                    "text": "PS: Steve also sent along an <a href=\"https://archive.org/details/microtimesvolume00bamp_17/page/n49/mode/2up?view=theater\">article from 1985</a> about me with my standard schpiel back in those days about how outliners came to be. The picture is funny, I was much younger of course, and my expression in the photo was as bewildered as often is. Oh yeah and I was wearing a suit and tie as people often did in business in those days. These days, it looks really funny. ",
                    "created": "Mon, 02 Oct 2023 00:44:12 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}