{
    "created": "2023-10-05T04:00:00.000Z",
    "flInCalendar": true,
    "name": "05",
    "path": "2023/10/05",
    "text": "October 05",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Name one person, living or dead, you wish read your blog.",
            "created": "Thu, 05 Oct 2023 13:32:34 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://music.amazon.com/\">Amazon Music</a> and <a href=\"https://en.wikipedia.org/wiki/Peloton\">Peloton</a> go so well together. I'm surprised one of the music companies doesn't buy Peloton which I hear is struggling. I'm always looking for music with a strong steady beat. For the beginning of the workout I go with songs that are steady but relatively slow, to warm up to -- like Eric Clapton's <a href=\"https://www.youtube.com/watch?v=qYS732zyYfU&t=76s\">Cocaine</a>. It's perfect. But as I rev up I go for music with a faster strong steady beat. For that nothing like <a href=\"https://en.wikipedia.org/wiki/Elvis_Costello\">Elvis Costello</a>. For example <a href=\"https://www.youtube.com/watch?v=3Y71iDvCYXA\">Pump It Up</a>, which is <i>sooo</i> perfect for Peloton. Oh my god. I'm listening to it now, and I'm moving, even though I just started work for the day. Really gets you going. If you don't believe me try playing it <a href=\"https://genius.com/Elvis-costello-pump-it-up-lyrics\">now</a>. \"Down in the pleasure center, hell-bent or heaven sent. Listen to the propaganda, listen to the latest slander. There's nothing underhand that she wouldn't understand.\" <i>Oh mama mia.</i>",
            "created": "Thu, 05 Oct 2023 13:28:21 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2023/10/05/elvis.png",
            "flInCalendar": true
        },
        {
            "text": "BTW, if you want to break up Google, start by making Chrome an independent company that is not allowed to work with Google. They are controlling the the open internet, the same way <a href=\"https://www.theverge.com/23778253/google-reader-death-2013-rss-social\">they controlled RSS</a>, turning our open network into a corporate asset. It'll have the same disastrous <a href=\"http://scripting.com/2023/10/01.html#a153452\">end</a>. ",
            "created": "Fri, 06 Oct 2023 02:09:55 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I have to buy a <a href=\"https://feedcorps.org/\">certain number</a> of domains every month, rain or shine.",
            "created": "Thu, 05 Oct 2023 16:28:35 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}