{
    "created": "2023-10-11T04:00:00.000Z",
    "flInCalendar": true,
    "name": "11",
    "path": "2023/10/11",
    "text": "October 11",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Much of the story of <a href=\"https://en.wikipedia.org/wiki/The_Matrix\">The Matrix</a> is the question of whether <a href=\"https://en.wikipedia.org/wiki/Neo_(The_Matrix)\">Neo</a> is <a href=\"https://chat.openai.com/share/2e24d0bf-f77f-4b17-9a14-1b4ca0ae2df2\">The One</a>. Much of the <a href=\"https://www.youtube.com/watch?v=EUN1ClT9i9w\">best dialog</a> in the movie is about that. In the world I live in today we're looking for The One for social media, the open platform that can replace the silos. The feeling is there is now a chance to do that, it wasn't there before and it may not be there again. ",
            "created": "Wed, 11 Oct 2023 13:19:45 GMT",
            "flInCalendar": true
        },
        {
            "text": "Why Mastodon isn't The One",
            "created": "Wed, 11 Oct 2023 13:13:37 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Take a break from your busy day and <a href=\"https://imgs.scripting.com/2023/10/11/subToProPublica.png\">study this picture</a>. It's why Mastodon as a federated system is not going to work. ",
                    "created": "Wed, 11 Oct 2023 13:19:18 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Here's what happened.",
                    "created": "Wed, 11 Oct 2023 13:14:09 GMT",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "I decided to follow ProPublica.",
                            "created": "Wed, 11 Oct 2023 13:14:14 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "I clicked on the <i>Follow</i> button.",
                            "created": "Wed, 11 Oct 2023 13:14:42 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "The <a href=\"https://imgs.scripting.com/2023/10/11/subToProPublica.png\">picture</a> showed up with a very complicated set of instructions. It requires me to remember an address that I do not remember. ",
                            "created": "Wed, 11 Oct 2023 13:14:49 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Instead of following, I wrote this blog post, because it was simpler to do this and I'm tired of people ignoring this because I care about us getting this right. ",
                            "created": "Wed, 11 Oct 2023 13:15:21 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "Why will it never work? Why is Mastodon <i>not</i> The One? I know, because I thought \"RSS\" should do what Twitter ended up doing and the main reason that happened is that to follow someone in Twitter is one click, and you're done, and I don't even want to write down the process for feeds because it's even worse than what it is in Mastodon today.",
                    "created": "Wed, 11 Oct 2023 13:15:58 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Not that we didn't know this at the time, we did, or how to solve it at a technical level. I tried to get everyone to work with us on making subscription simple, but it didn't happen. Later I came to believe it couldn't. We <i>could</i> force everyone to use the same <a href=\"http://opml.org/spec2.opml#subscriptionLists\">export format</a>, that worked incredibly well. But every RSS reader developer acted as if they were the only product that did what they did and didn't want to do anything they didn't have to to make it easy for people to subscribe in other reader software. It's so convoluted and stupid, you have to figure the people making the actual decisions had never used an RSS reader and never wanted to subscribe to a feed. This, btw, is pretty common in the tech industry, product ignorance among key decision-makers. I even heard a CEO once boast that he didn't need to use the product because he's a 'market of one' as if all his customers were frankfurter <a href=\"https://en.wikipedia.org/wiki/Reconstituted_meat\">meat</a>? ",
                    "created": "Wed, 11 Oct 2023 13:16:59 GMT",
                    "image": "https://imgs.scripting.com/2023/10/11/frankfurter.png",
                    "flInCalendar": true
                },
                {
                    "text": "Here's the bottom line. If subscription isn't one-click in your federated social media system, go back to the drawing board and re-do your architecture, because it won't work. ",
                    "created": "Wed, 11 Oct 2023 13:18:21 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PS: After writing the post I was calmer and remembered where my account was, and it was two steps from there to follow <a href=\"https://newsie.social/@ProPublica\">ProPublica</a> on Mastodon.",
                    "created": "Wed, 11 Oct 2023 13:29:56 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}