{
    "created": "2023-10-29T04:00:00.000Z",
    "flInCalendar": true,
    "name": "29",
    "path": "2023/10/29",
    "text": "October 29",
    "type": "calendarDay",
    "subs": [
        {
            "text": "We can do better than Threads",
            "created": "Sun, 29 Oct 2023 15:12:19 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I am so ticked off that my Twitter friends seem to be embracing <a href=\"https://www.threads.net/\">Zuckerberg's attempt</a> to take over from Twitter.",
                    "created": "Sun, 29 Oct 2023 15:12:21 GMT",
                    "image": "https://imgs.scripting.com/2023/02/28/presidentCarter.png",
                    "flInCalendar": true
                },
                {
                    "text": "Musk is the second worst thing that happened to social media, but Facebook is much worse, because they're so much more competent, but lack any vision other than sucking up as much of the world into their silo as possible and never doing anything that could possibly benefit anyone else.",
                    "created": "Sun, 29 Oct 2023 15:13:26 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The only way this ever works is if there is no human being that controls the whole thing. And Mastodon and ActivityPub with the hack of the Fediverse is not the answer. It's obvious the users want what Zuck is offering, and I don't blame them, I do too, I just want what Zuck is <i>not</i> offering, a system where I get to use the writing tools I like and you get to use the ones you like.",
                    "flInCalendar": true
                },
                {
                    "text": "We suffered 16 years of stagnation with Twitter, no movement anywhere, stuck with the character limits, and missing the simple and basic text features of the web, and the best we can do is find another tech owner who offers us more of the same. Yet another <a href=\"https://www.google.com/search?q=site%3Ascripting.com+hamster+cage\">hamster cage</a> to capture and destroy our dreams.",
                    "created": "Sun, 29 Oct 2023 15:20:55 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "<i>This was cross-posted on <a href=\"https://twitter.com/davewiner/status/1718631256701747473\">Twitter</a> and <a href=\"https://www.threads.net/@davew/post/Cy_Fjr2rOq7\">Threads</a> this morning. </i>",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}