{
    "text": "Now <a href=\"https://www.techmeme.com/230723/p2#a230723p2\">Elon Musk wants to kill</a> one of the best known brands there is, in favor of X. In hindsight, how foolish was it for Facebook to change its name to Meta. Google is still Google now whatever they changed their name to (yeah I remember, but it takes some effort to pull it up, and as I'm doing it, I'm reminded how much I don't care) Alphabet. These geniuses should study <a href=\"https://en.wikipedia.org/wiki/Positioning_(marketing)\">positioning</a>. Yes, their brands got tarnished, trampled, humiliated, charged and convicted. But the smart money is on <i>responding</i> to the problem, not running away from it, which 99 out of 100 people recognize this as. Classic example: <a href=\"https://www.nytimes.com/2002/03/23/your-money/IHT-tylenol-made-a-hero-of-johnson-johnson-the-recall-that-started.html?unlocked_article_code=gWK-iA9wveiOjplePMkV9rusl42zxaU_Pvryh4Q-pWSVTiHcVIRZl0j9Gs1alyhNC6S17ugB-KdmrhO0hiIK5ekDKtatn8CTsf9f8_xknxRHGL-bmxPht7I83CBkyyD4jwhJVtQSdkZtRSLgGwHlAwh5JCcVcSFwiGTWK7OEu9ttcqdxuYahRef57njo0bPLYNn1c6-viHLu-lbo3lpRIokcpOh4jmTCQ1FMMLIOKK8LkR4bR3Hl9bkziIx2UvDAD69rBc4ctSPeNNUbs64VaWO2fN1MF4DdoXDi09ckve3Tn-16svkRa4XJJfQUQGf6uDVFM6K59jzVlKY6ieeaPj3tNzAnJWlvnCWPVywmGjitQ_VDtaFRu12N4ygQjXcqx__bzFS6J5T0Nzqy3jQ&smid=url-share\">Johnson & Johnson</a> and Tylenol. My grandfather taught the basics of business with a motto, \"pay for your sins.\" It means if you fuck up you give the customer their money back and apologize, because business is built on your rep. And you can't run away from your sins. Once you put a name in everyone's minds, it stays there until they die. Think of another brand that sinned -- <a href=\"https://en.wikipedia.org/wiki/New_Coke\">Coca Cola</a> with New Coke. They admitted they were wrong, and got rid of the mistake, not the brand, and they're still #1. ",
    "created": "Sun, 23 Jul 2023 20:05:06 GMT",
    "type": "outline",
    "image": "https://imgs.scripting.com/2023/07/23/newcoke.png",
    "flInCalendar": true
}