{
    "text": "Shake yourself up",
    "created": "Sat, 26 Sep 2020 17:05:39 GMT",
    "type": "outline",
    "description": "A friend asked what could he do to combat fascism. This is it.",
    "metaImage": "http://scripting.com/images/2020/09/26/airplaneJump.png",
    "subs": [
        {
            "text": "Here's something.",
            "created": "Sat, 26 Sep 2020 17:05:53 GMT"
        },
        {
            "text": "I think a lot of people are trying to get past Covid and Trump without making radical changes to their lives."
        },
        {
            "text": "This is a mistake. ",
            "created": "Sat, 26 Sep 2020 17:15:19 GMT"
        },
        {
            "text": "A friend asked what could he do to combat fascism. This is it. Do something to radically shake up your life, by choice.",
            "created": "Sat, 26 Sep 2020 17:06:05 GMT"
        },
        {
            "text": "Each of us are trying to reboot as if taking a box, without changing its shape, and moving it across the world. ",
            "created": "Sat, 26 Sep 2020 17:06:05 GMT"
        },
        {
            "text": "It's <i>all</i> going to change. If we emerge from these days, the world will be very different. We have to be different too. We have to be prepared for it.",
            "created": "Sat, 26 Sep 2020 17:06:21 GMT"
        },
        {
            "text": "At some point you have to ask was the shape really the right shape, and what would I give up by changing. ",
            "created": "Sat, 26 Sep 2020 17:06:21 GMT"
        },
        {
            "text": "Radical change. Quit your job. Give your car away. Jump out of a plane. Get a sex change. Destroy your business model. Say something unthinkable. Whatever it takes.",
            "created": "Sat, 26 Sep 2020 17:06:37 GMT"
        },
        {
            "text": "I'm reminded of a <a href=\"http://scripting.com/stories/2009/10/21/bruceSterlingAtReboot.html\">talk</a> by Bruce Sterling that I keep coming back to. When something radical changes in your life, that's a good time to make other big changes. Death of a parent or spouse. Stock market crash. Major illness. Divorce. A time when you start over. When you have to start over. No choice. ",
            "created": "Sat, 26 Sep 2020 17:07:04 GMT"
        },
        {
            "text": "Now, we <i>all</i> have been through that. We've had a major change not just on an individual basis, but on a <i>global</i> scale. Global. Everyone changed. So we can do it. We can change our lives radically. Trump demands it. Covid demands it. The climate crisis demands it.",
            "created": "Sat, 26 Sep 2020 17:07:41 GMT"
        },
        {
            "text": "Your sense of what's normal is worth $0.24. You might find that much money on a sidewalk. I know this because I buried both my parents, and I know how much they thought their opinion mattered, and I know the truth. In the end, what they thought was worth about $0.24, approx.",
            "created": "Sat, 26 Sep 2020 17:08:23 GMT"
        },
        {
            "text": "So fuck it. Destroy your business model. Start over. ",
            "created": "Sat, 26 Sep 2020 17:08:49 GMT"
        },
        {
            "text": "Once you've made such a change, you'll find you want to make others.",
            "created": "Sat, 26 Sep 2020 17:08:55 GMT"
        }
    ]
}