{
    "text": "Biden: Why isn't Trump in jail?",
    "created": "Thu, 30 May 2024 13:49:35 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Biden would be a fine president if our problems were limited to the virus, the economy and climate change. ",
            "created": "Thu, 30 May 2024 16:34:43 GMT",
            "flInCalendar": true
        },
        {
            "text": "He's like Obama, but with much more experience at getting things done in Washington. ",
            "flInCalendar": true
        },
        {
            "text": "His failure is that the fascist movement in the country is much stronger now than it was when he took office. ",
            "flInCalendar": true
        },
        {
            "text": "Are we better off than we were four years ago? No, sadly we are worse off. Trump is a much bigger threat now.",
            "created": "Thu, 30 May 2024 16:38:22 GMT",
            "flInCalendar": true
        },
        {
            "text": "Biden is a fine LBJ-like president. And like LBJ, he has his Vietnam. Biden's war he can't end is called Trump. Trump isn't in jail. That's the failure right there. ",
            "flInCalendar": true
        },
        {
            "text": "The problem could be fixed if we had this discussion out in the open, so that the press raises it every day and in every press event. They shouldn't be trying to embarrass him about his age, that's rude and deceptive, instead they should ask why isn't Trump in jail?",
            "created": "Thu, 30 May 2024 16:34:47 GMT",
            "flInCalendar": true
        },
        {
            "text": "If Biden wanted to address this, and it would certainly help his chances of winning, he would:",
            "created": "Thu, 30 May 2024 13:57:07 GMT",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "Fire Garland immediately.",
                    "created": "Thu, 30 May 2024 13:57:38 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Apologize for not firing him sooner. It was a mistake. My mistake. I own it. I am sorry.",
                    "created": "Thu, 30 May 2024 13:57:26 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Nominate <a href=\"https://en.wikipedia.org/wiki/Jamie_Raskin\">Jamie Raskin</a>, <a href=\"https://en.wikipedia.org/wiki/Liz_Cheney\">Liz Cheney</a> or <a href=\"https://en.wikipedia.org/wiki/Ruben_Gallego\">Ruben Gallego</a> as the new AG.   ",
                    "created": "Thu, 30 May 2024 13:57:40 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Biden's number one promise is that he will <i>fully</i> prosecute Trump and all insurrectionists in his second term, starting now. This would also serve as a warning to any Trump supporters that tried to overthrow the government (again, sigh) before or during the election. ",
                    "created": "Thu, 30 May 2024 13:57:31 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Trump is making a fool of Biden by saying openly that he will be a dictator on Day 1.",
            "created": "Thu, 30 May 2024 13:58:47 GMT",
            "flInCalendar": true
        },
        {
            "text": "People who think Trump is losing don't get it. People are rightly fed up with Biden. But not for the economy. That's bullshit. And not because he's old. Rather because he's selling us out, just hoping against hope that the voters will save us. It's kind of unreasonable to expect that when you, the person we elected president to get us out of this hole, didn't fire the biggest obstacle to our starting to dig. ",
            "created": "Thu, 30 May 2024 13:59:26 GMT",
            "flInCalendar": true
        },
        {
            "text": "Depend on Congress, the press, the courts, now the voters. ",
            "created": "Thu, 30 May 2024 14:01:19 GMT",
            "flInCalendar": true
        },
        {
            "text": "No Biden, you're the president. This is <i>your</i> job. ",
            "created": "Thu, 30 May 2024 14:01:29 GMT",
            "flInCalendar": true
        },
        {
            "text": "<img src=\"https://imgs.scripting.com/2019/10/29/lockHimUp.png\">",
            "created": "Fri, 31 May 2024 01:54:48 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}