{
    "text": "The current-events-osphere",
    "created": "Sun, 18 Apr 2021 14:56:43 GMT",
    "type": "outline",
    "metaImage": "http://scripting.com/images/2021/04/18/knuckleBiting.png",
    "subs": [
        {
            "text": "I'd love to see an exercise bike that's tuned up for podcasts. Not sure exactly what that means. But I don't like competing on my bike rides. I more prefer to learn stuff. In a somewhat organized way. ",
            "created": "Sun, 18 Apr 2021 14:56:50 GMT",
            "flInCalendar": true
        },
        {
            "text": "Most of the podcasts I listen to are suffering from the same problem CNN and MSNBC are. They had a great knuckle-biter story to cover for the last five years, amped up by another knuckle-biter, and now the first one is gone, and the second is waning. Leaving them without anything to talk about. ",
            "created": "Mon, 19 Apr 2021 01:12:46 GMT",
            "flInCalendar": true
        },
        {
            "text": "I'm really not worried about Trump anymore, and I'm vaccinated, and I have mask-wearing and social distancing down. I don't travel and I'm fine with that. I enjoy my work, and summer is coming!",
            "created": "Mon, 19 Apr 2021 01:10:40 GMT",
            "flInCalendar": true
        },
        {
            "text": "I found for example that the <a href=\"https://www.google.com/search?q=%22that+trippi+show%22\">Trippi podcast</a> was fascinating in the run-up to the election, but now, I don't care so much about what's on the mind of a classical campaign runner (with apologies to Joe, who is a great guy).  It's a very specific thing he does, and only vitally interesting to me in-season. ",
            "created": "Mon, 19 Apr 2021 01:10:49 GMT",
            "flInCalendar": true
        },
        {
            "text": "The whole current-events-osphere could use a re-think. ",
            "created": "Mon, 19 Apr 2021 01:11:41 GMT",
            "flInCalendar": true
        },
        {
            "text": "Knuckle-biting, demonstrated by <a href=\"https://en.wikipedia.org/wiki/Leonardo_DiCaprio\">Leonardo DiCaprio</a>.",
            "created": "Mon, 19 Apr 2021 01:12:51 GMT",
            "inlineImage": "http://scripting.com/images/2021/04/18/knuckleBiting.png",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}