{
    "text": "America's greatness",
    "created": "Sun, 18 Feb 2018 13:16:39 GMT",
    "type": "outline",
    "description": "Finally someone in charge in my country was fighting back against the Russians. The president wouldn't do it, the Republican-dominated Congress wouldn't. So a Republican Deputy Attorney General did.",
    "subs": [
        {
            "text": "I was riding the Long Island Railroad into Manhattan on Friday night listening to a quick podcast from NPR about the indictments announced earlier in the day, and I had a goosebumps feeling. It was easy to figure where it came from. Finally someone in charge in my country was fighting back against the Russians. The president wouldn't do it, the Republican-dominated Congress wouldn't. So a Republican Deputy Attorney General did. What Russia did was an act of war. We have their names. Now the government of the United States is going to fight back. I was proud of America in a way I had thought was gone. A few hours later Rachel Maddow described the same feeling. She was on her way out of town for the weekend, but turned around because she had something to say. Pride in America is what she wanted to say. Me too! ",
            "created": "Sun, 18 Feb 2018 13:17:00 GMT",
            "image": "http://scripting.com/images/2018/02/18/uncleSamBig.png"
        },
        {
            "text": "It happened again yesterday, watching the <a href=\"https://twitter.com/CBSNews/status/964984929263243264\">speeches</a> of the high school students in Florida declaring war on the weapons that had killed their classmates and teachers earlier in the week. Such power and determination. They weren't saving anyone's pride. The adults are full of shit. We're not going to take it. We will be famous, not a footnote. This will be the last mass-killing in a school in the United States. Well it may not be, but what an idea. We <i>can</i> get there. Eventually there will be a last mass-killing, but first we have to get rid of the NRA. They are an infestation. Vermin. A disease. They must be eradicated. ",
            "created": "Sun, 18 Feb 2018 13:19:08 GMT",
            "urltweet": "https://twitter.com/CBSNews/status/964984929263243264"
        },
        {
            "text": "We don't deserve <a href=\"https://twitter.com/axios/status/965262175433641985\">these kids</a>, but there they are anyway. The spirit of the USA is alive, though some of them had to die. This is where our greatness lives. Not too far under the surface. When enough is enough, out it comes.",
            "created": "Sun, 18 Feb 2018 13:33:45 GMT"
        },
        {
            "text": "So twice in one weekend the enraged spirit of America re-emerged and is kicking ass, from suprising places. Surprisingly, it ain't over yet! :boom:",
            "created": "Sun, 18 Feb 2018 13:21:52 GMT"
        }
    ]
}