{
    "text": "Right-margin images",
    "created": "Tue, 11 Jun 2024 18:52:09 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "It's been driving me <a href=\"https://www.facebook.com/dave.winer.12/posts/pfbid024FDKvbd25XG3C2JQmfXBuvXGZuyw7btYnXRKZtVWmLbABdyH8ke93rqfTnK6EkUjl\">crazy</a> watching Stan Krute doing all these weird and often beautifully bizarre ChatGPT images, and realizing they are only being seen by people on Facebook when there's this huge world of creative people that don't or won't use FB.",
            "created": "Tue, 11 Jun 2024 18:52:15 GMT",
            "image": "https://imgs.scripting.com/2024/06/11/nakedJenToday.png",
            "flInCalendar": true
        },
        {
            "text": "Then it occurred to me, I have the perfect place for these images, outside the facebookiverse, that would showcase them, and be easy to produce (I don't want to take on responsibility for big production overhead myself).",
            "flInCalendar": true
        },
        {
            "text": "I have images I put in the right margin of blog posts on \"Scripting News\". Small little bits of creative color, that may or may not be connected to the story they are next to. And sometimes connected in non-obvious ways, intended to make you think.",
            "created": "Tue, 11 Jun 2024 18:52:31 GMT",
            "flInCalendar": true
        },
        {
            "text": "Then NakedJen sent me a recent picture of herself that's perfect for the right margin. Seen in the right margin of this post.",
            "created": "Tue, 11 Jun 2024 18:52:47 GMT",
            "flInCalendar": true
        },
        {
            "text": "Here's a <a href=\"http://scripting.com/images/manyImages.html\">page</a> where you can scroll through the collection of images I can choose from. I'd love to add more creative stuff here. And I'd love to get some of Stan Krute's genius or Brad Pettit or whoever else might be so inspired. ",
            "created": "Tue, 11 Jun 2024 18:53:01 GMT",
            "flInCalendar": true
        },
        {
            "text": "No promises about when or if they'd be used. You can post them here, as comments on this message if you like. ",
            "created": "Tue, 11 Jun 2024 18:53:13 GMT",
            "flInCalendar": true
        },
        {
            "text": "I may have to restrict this to people I follow, just letting you know, based on past experience. ",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}