{
    "text": "June 2",
    "created": "Wed, 02 Jun 2021 12:41:50 GMT",
    "type": "calendarDay",
    "name": "02",
    "subs": [
        {
            "text": "Well <a href=\"https://nypost.com/2021/06/02/knicks-season-ends-with-blowout-playoff-loss-to-hawks/\">this was</a> a great Knicks season. Lots of good stuff to build on.",
            "created": "Thu, 03 Jun 2021 02:20:47 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "This is kind of important. Logseq now exports OPML. If you <a href=\"http://littleoutliner.com/?url=http://instantoutliner.com/pg\">click this link</a>, their outline will open in LO2. Seeing their outline open in my world is revealing to say the least. This is like joining two cultures. The Mac outlining culture with the \"other\" culture (to me) which derives from <a href=\"https://en.wikipedia.org/wiki/Org-mode\">Org-mode</a> (i am told) and wikis. I can see some interesting cross-fertilization happening.",
            "created": "Wed, 02 Jun 2021 17:09:55 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/05/26/cherries.png",
            "flInCalendar": true
        },
        {
            "text": "About Logseq: I love their energy, how quickly they got on board with OPML. There are lots of things I want to show that we can do <a href=\"http://this.how/opmlChecklist/\">with OPML</a>. Most important it's all about the open web, connecting people's virtual minds, not just everyone on their own island.",
            "created": "Thu, 03 Jun 2021 02:52:32 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1400277400882135041",
            "flInCalendar": true
        },
        {
            "text": "I'm watching <a href=\"https://en.wikipedia.org/wiki/In_Treatment\">In Treatment</a>. It's kind of appalling how people trod all over the therapist's boundaries. They project wildly on him. He should get combat pay. ",
            "created": "Wed, 02 Jun 2021 17:18:49 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The Brooklyn Nets are not a real basketball team. They are just a shell that Kevin Durant pwned by signing with them. Kind of the way Apple didn't really buy NeXT, it was the other way around. Anyway, the Durant's \"Nets\" might win a title, or try a couple of times, but either way the train will move on and leave the Nets as wrecked as the Cleveland Cavaliers. This is a trend, it's no longer innovative, curious, fun or even good basketball. Durant was bored in Golden State. He'll get bored in Brooklyn too. Imho, they're boring right now. :boom:",
            "created": "Thu, 03 Jun 2021 02:41:35 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "And btw, what kind of lame name is \"Nets\" anyway?",
            "created": "Thu, 03 Jun 2021 02:47:57 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "It's fresh cherry season! Next up: fresh peaches. ",
            "created": "Wed, 02 Jun 2021 16:28:56 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://www.radcliffe.harvard.edu/news-and-ideas/ruth-bader-ginsburg-tells-young-women-fight-for-the-things-you-care-about\">Ruth Bader Ginsburg</a>: \"Fight for the things that you care about, but do it in a way that will lead others to join you.\" I'm guessing she didn't know, but she was promoting a very powerful idea for technology.",
            "created": "Wed, 02 Jun 2021 14:33:31 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Yesterday I wrote <a href=\"http://scripting.com/2021/06/01/141749.html?title=naomiOsakaDerrickRose\">about Derrick Rose</a> as a 32-year-old star athlete, and as if to prove my point, he was quoted in today's <a href=\"https://nypost.com/2021/06/01/knicks-can-keep-magical-season-going-just-a-little-longer/\">NY Post</a> saying: “I’m 32 years old. I never talked shit like that in my whole life. I’m not going to start now once <a href=\"https://nypost.com/2021/06/01/clint-capela-goes-scorched-earth-on-dirty-knicks-in-epic-taunt/\">Clint Capela</a> starts talking crazy. I’m too old for that shit, bro.” I love this guy. If any Knick could boast, it's DR, but he's cool. He likes playing for the Knicks, and we like him. ",
            "created": "Wed, 02 Jun 2021 12:41:51 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I don't think the Biden Administration should be negotiating with Republicans about anything.",
            "created": "Wed, 02 Jun 2021 13:00:27 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}