{
    "text": "June 17",
    "created": "Thu, 17 Jun 2021 13:53:18 GMT",
    "type": "calendarDay",
    "name": "17",
    "subs": [
        {
            "text": "We need something like the Lincoln Project — pointed, simple, hard-hitting advertising, with the aim of removing the insurrectionists from Congress, now, or at least in 2022. It’d  be fine if the LP people are involved, but they need Democrats and independents, not just Repubs.",
            "created": "Thu, 17 Jun 2021 22:08:47 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Thanks to <a href=\"https://memex.naughtons.org/thursday-17-june-2021/33980/\">John Naughton</a> for the link to this <a href=\"https://aeon.co/ideas/coding-is-not-fun-it-s-technically-and-ethically-complex\">piece</a> by <a href=\"https://twitter.com/waltervannini?lang=en\">Walter Vannini</a> that explains how coding is not \"fun.\" It's a good read.  One way to experience how much there is to \"coding\" (a terrible word for what devs do) have a look at a <a href=\"https://github.com/scripting/instantOutlines/blob/main/demo/code.js\">completed piece of code</a>, and see if you can make sense of it. Even someone who knows the language it's written in will have a hard time, unless it's written with readability in mind, and even then, not without a lot of head-scratching. It's not like anything else you've done, and if someone tells you it's fun and easy and interactive, please ask them if they have done it. The answer is no, because no one who has ever completed a piece of software that other people use would say it's anything other than a slog. The rewards can be great, don't get me wrong, but you have to invest a lot of yourself before you get them.  ",
            "created": "Thu, 17 Jun 2021 13:53:19 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/09/04/peterRojas.png",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}