{
    "text": "June 20",
    "created": "Sun, 20 Jun 2021 14:36:55 GMT",
    "type": "calendarDay",
    "name": "20",
    "subs": [
        {
            "text": "<a href=\"https://github.com/scripting/Scripting-News/issues/210\">Brandon Toner</a> is setting up a \"PagePark\" server on <a href=\"https://glitch.com/\">Glitch</a>. He wants to do a blog styled after the outline format of <a href=\"http://davewiner.com/\">davewiner.com</a>. ",
            "created": "Sun, 20 Jun 2021 21:28:38 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Nice <a href=\"http://scripting.com/images/2021/06/20/daveAndAdam.png\">picture</a> of Adam Curry and myself, <a href=\"https://twitter.com/Podchaser/status/1406708042847096836\">from</a> <a href=\"https://www.google.com/search?q=gnomedex+winer+curry&safe=off&rlz=1C5CHFA_enUS743US747&sxsrf=ALeKk01HA3hOkTvzs1HC7MCLbImy-ec8lg:1624224861194&tbm=isch&source=iu&ictx=1&fir=fo8uvkOJAMQSfM%252CqhUFOONB3MiRpM%252C_&vet=1&usg=AI4_-kRdUXSnyu8nuXMLtl-71m5Kl96f_g&sa=X&ved=2ahUKEwi1x4uPlafxAhWGTt8KHSJ2B08Q9QF6BAgQEAE#imgrc=fo8uvkOJAMQSfM\">Gnomedex</a> in <a href=\"https://en.wikipedia.org/wiki/Gnomedex#2005\">2005</a>?",
            "created": "Sun, 20 Jun 2021 21:31:59 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1406694522105565186\">Why</a> [[wikilinks]] work better than #hashtags.",
            "created": "Sun, 20 Jun 2021 19:29:09 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "What's important is to know what's important.",
            "created": "Sun, 20 Jun 2021 16:30:01 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I believe that my socket server will pick up this change. Let's see if it does. (Indeed it did.) ",
            "created": "Sun, 20 Jun 2021 17:35:42 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Father's Day",
            "created": "Sun, 20 Jun 2021 16:04:15 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I dislike all the <a href=\"https://www.urbandictionary.com/define.php?term=Hoopla\">hoopla</a> about Father's Day since I don't have one. ",
                    "created": "Sun, 20 Jun 2021 16:04:22 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "My father died in 2009. As they say \"after a long illness.\" Cancer.",
                    "created": "Sun, 20 Jun 2021 16:04:37 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I called the day he died <a href=\"http://scripting.com/stories/2009/10/03/fathersDay.html\">Father's Day</a>. From that moment on I could remember my father the way I wanted to, and try to remember that the things I didn't like were given to him by his father and his father's father, all the way back to the beginning, which in our case was probably a <a href=\"https://en.wikipedia.org/wiki/Shtetl\">shtetl</a> somewhere in the Ukraine or Belarus or Russia. ",
                    "created": "Sun, 20 Jun 2021 16:04:57 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The one thing we bonded on was outliners. My father loved [[ThinkTank]]. He was a huge evangelist for it, as a college professor in NY, and a consultant to large businesses on marketing and management, he preached the gospel of seeing what you think. I now realize he wanted me to do, then, what I see now that I need to do. I wish he was alive today to use the tools we're creating now. ",
                    "created": "Sun, 20 Jun 2021 16:06:31 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "He didn't understand what I was doing when I was developing it, but he loved it after it was done. This might give tech adventurers some hope. Your parents might not understand what you're doing today, but when it's ready to go, they might become believers. ",
                    "created": "Sun, 20 Jun 2021 16:10:11 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Sports philosophy",
            "created": "Sun, 20 Jun 2021 15:58:12 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I say the difference between the Mets and other baseball teams is that the [[Mets]] have philosophy. Their philosophy is to have a philosophy, which is this: it ain't about winning. The Yankees, the other NYC baseball team, expect to win every year, which doesn't work most years, because despite how good the Yankees are, there are 29 other teams and in most seasons the Yankees, like all but one team, are losers. Their philosophy is not adaptable. The Mets philosophy only has upside. In the infrequent years they win, well, that's a bonus, an extra goodie. Like some rice to go with your red beans. Like a pack of rolling papers to go with your ounce of weed. Winning for the Mets is a nice thing, soon forgotten, when you revert back to the long-term philosophy of playing baseball, not winning at playing baseball.",
                    "created": "Sun, 20 Jun 2021 15:02:02 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "The Nets lose, and that's just fine",
            "created": "Sun, 20 Jun 2021 14:36:56 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2021/06/20/quickley.png",
            "description": "This Nets team was founded to win. Having lost, do they have any reason to exist?",
            "subs": [
                {
                    "text": "People who think sports are trivial haven't really thought it through, imho. Sports teach you how to think about things that are confusing in everyday life in clear terms with almost immediate outcomes. Sports is a training ground for strategic and philosophical intelligence.   ",
                    "created": "Sun, 20 Jun 2021 14:39:00 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The latest version of the basketballl Nets were formed by players who cared not a whit about anything other than winning. They probably need to be reminded what team they're playing for (i.e. the [[Brooklyn Nets]]). Kyrie is playing for Team Durant, as is Harden and the others. Durant, who has already won championships, was bored, is a sour person, who on coming to NYC thought it was <a href=\"https://www.nyknicksnews.com/kevin-durant-the-cool-thing-right-now-is-not-the-knicks/\">okay</a> to <a href=\"https://bleacherreport.com/articles/2857179-nets-kevin-durant-says-the-cool-thing-right-now-is-not-the-knicks\">dis the team</a> that everyone in NYC knows sucks horribly, epicly, a self-sabotaging monster of a basketball team that despite everything NY basketball fans love. Love. We love them KD. But we don't like it when players from Seattle, Oklahoma and \"Golden State\" (where ever that is) come to NY and tell us our team sucks. <i>You</i> suck you asshole, and the only NYers who are going to root for your Nets are the ones who root for the [[Yankees]]. This Nets team was founded to win. Having lost, do they have any reason to exist? So today Knicks fans breathe a sigh of relief. There is a basketball god after all, and the Knicks still rule NY. When the Nets show some hubris, when they commit to a long-term relationship with NY basketball fans, then and only then will the deserve real NY fans, not the fake fairweather fans. ",
                    "created": "Sun, 20 Jun 2021 14:41:15 GMT",
                    "image": "http://scripting.com/images/2019/07/02/knicks.png",
                    "flInCalendar": true
                },
                {
                    "text": "This outcome, losing in the second round, was perfectly predictable. Maybe there should be a rule, once you win two championships you should retire, because from that point on there are no more thrills available to you, and like [[LeBron]], destroyer of humble franchises in Miami and Cleveland (twice!) would do less damage if he just invested in VC-backed tech companies and forgot about bringing his sourness to basketball. ",
                    "created": "Sun, 20 Jun 2021 14:43:58 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Sports teaches those of us who will never achieve the height of a [[Kevin Durant]] to appreciate what we have. This year the Knicks rose off the energy KD fed the team and <a href=\"http://scripting.com/2021/05/13/124739.html?title=knicksClinchImEcstatic\">exceeded all expectations</a>. Next year and the year after I'll root for the Knicks, god willing. But if they ever mortgage their future, as the Nets did, to get three vagabond superstars to try to win a title in one year, I'll be shaking my head and  will look for another hopeless cause to identify with until the Knicks come back to earth. ",
                    "created": "Sun, 20 Jun 2021 14:45:36 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}