{
    "text": "June 24",
    "created": "Thu, 24 Jun 2021 14:16:49 GMT",
    "type": "calendarDay",
    "name": "24",
    "subs": [
        {
            "text": "\"threadviewer.com\" bug fix. We now freeze threads after 12 hours. So you have to finish your writing before then.  ",
            "created": "Thu, 24 Jun 2021 15:30:08 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Finally MSNBC is <a href=\"https://twitter.com/freddyatton/status/1407918830693670914\">coming clean</a> on the fact that the Repubs and Fox News et al work for Putin. <i>Let's keep that in mind</i> when we think about insurrectionists invading our Capitol. And btw the guilty parties so far aren't doing any jail time. Not much of a deterrent. ",
            "created": "Thu, 24 Jun 2021 20:06:26 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/freddyatton/status/1407918830693670914",
            "flInCalendar": true
        },
        {
            "text": "I hate doing business with robots over the telephone. Can't you just fucking send a fucking email UPS.",
            "created": "Thu, 24 Jun 2021 19:55:56 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Speaking of which the other day the phone rings, I pick up, it's a robot from the gas company, something is very wrong, I need to call this number, which she recites, and goes on, never repeating the number. At the end they threaten that they're going to cut off my supply (which I know legally is hard to do, and btw I'm current with my bill). So I call. I get put on hold. We appreciate your pateince, another robot says. Your call is important. I'm sure. When an actual human comes on the line I am accused of being rude for telling her what her stinking company just did in the middle of my freaking work day. They want to know where the check is. I don't know. My credit is good. Maybe the check got delayed. I hear there are problems with the post office. God bless the robots. And by the way, email is much more efficient! Please.",
            "created": "Thu, 24 Jun 2021 19:56:08 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The glossary in Little Outliner",
            "created": "Thu, 24 Jun 2021 15:02:34 GMT",
            "type": "outline",
            "description": "The glossary is a substitution table. When a term appears in text being rendered, the term is replaced with its value. ",
            "metaImage": "http://scripting.com/images/2021/06/24/cezanne.png",
            "subs": [
                {
                    "text": "If you're new to \"LO2\", the glossary is a pretty unique feature that goes back to \"Clay Basket\" in 1995, and was <a href=\"http://scripting.com/downloads/Website%20Tutorial/GlossariesandFilters.html\">documented</a> as part of Frontier's website framework. It's a permanent fixture, very useful, and easy once you know what it does and how it works.  ",
                    "created": "Thu, 24 Jun 2021 15:02:44 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "<b>What it is</b>",
                    "created": "Thu, 24 Jun 2021 15:14:56 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The glossary is a substitution table. When a term appears in text being rendered, the term is replaced with its value. So you could define an entry called \"my blog\" (the quotes are part of the definition) and its value would be a link to your blog. At some time in the future if your blog moves, just change the value of \"my blog\" and links to the blog will change too, when the text is rendered. ",
                    "created": "Thu, 24 Jun 2021 15:07:03 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Here's the <a href=\"http://drummer.scripting.com/davewiner/glossary.opml\">glossary</a> I use in all my pages. It's a public outline. It has to be public for it to work, so you shouldn't put private information into the glossary. ",
                    "created": "Thu, 24 Jun 2021 15:04:09 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "In LO2 a glossary is a two-level outline. At the top level are a set of terms the renderer will look for, and its subordinate text is what it will be replaced with.   ",
                    "created": "Thu, 24 Jun 2021 15:06:39 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Here's a <a href=\"http://scripting.com/images/2021/06/24/glossaryScreen.png\">screen shot</a> of part of my glossary, being edited in my outliner.",
                    "created": "Thu, 24 Jun 2021 15:20:30 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "<b>How to</b>",
                    "created": "Thu, 24 Jun 2021 15:15:08 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "To use your glossary outline, here's what you do:",
                    "created": "Thu, 24 Jun 2021 15:09:26 GMT",
                    "flNumberedSubs": "true",
                    "subs": [
                        {
                            "text": "Make the outline public. ",
                            "created": "Thu, 24 Jun 2021 15:09:42 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Choose the View OPML command in the File menu to get a link to the glossary outline. ",
                            "created": "Thu, 24 Jun 2021 15:09:51 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Put the URL on the clipboard.",
                            "created": "Thu, 24 Jun 2021 15:11:23 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "In an outline where you want to use the glossary, choose Edit OPML Head from the file menu, and add an attribute to the table. Its name is urlGlossary, and the value is the URL you have on the clipboard. ",
                            "created": "Thu, 24 Jun 2021 15:10:25 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "Now you should be able to use the glossary in your outline. ",
                    "created": "Thu, 24 Jun 2021 15:12:44 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "GitHub as app storage, cont'd",
            "created": "Thu, 24 Jun 2021 14:16:50 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Yesterday I wrote <a href=\"http://scripting.com/2021/06/23.html#a221440\">two</a> <a href=\"http://scripting.com/2021/06/23/174309.html?title=isGithubRawStorageReliable\">bits</a> about using GitHub as a storage system for a community of apps.  ",
                    "created": "Thu, 24 Jun 2021 14:17:00 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The idea matches the as-yet unachieved ideal of using the web as an operating system, that for me goes back to 1994. It's the potential I saw when I first understood how HTTP works. Now in 2021, the one thing the web OS doesn't have is reliable storage for users that multiple apps can access to edit and render on the user's behalf. The same way you might have a text file on your desktop, that you write in a word processor (of your choosing, this is important) and send it over email, put it in a tweet, or a Facebook post, or print it. Or any of a million other uses. The key thing is the text file is yours. Not just for Mac or Windows, for everyone, anywhere. It's the wedge we need to be able to build a new world that's been technically possible for a couple of decades now. :-)",
                    "created": "Thu, 24 Jun 2021 14:18:21 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It's important that we're using GIT which is an open and often-cloned data structure. You could move your data to another GIT provider if GitHub proved too expensive, or their service was failing, or really any reason at all. ",
                    "created": "Thu, 24 Jun 2021 14:21:03 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Dropbox was getting close to this idea, but they pulled back. That's why I did \"Fargo\", which used Dropbox for storage. But no other app could access Fargo's outline files. They couldn't even access public files, that's the feature they withdrew. They had reasons to change course, not faulting the company. ",
                    "created": "Thu, 24 Jun 2021 14:21:46 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "<b>LogSeq</b>",
                    "created": "Thu, 24 Jun 2021 14:24:11 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The main reason I picked up using GitHub as storage, again (I had experimented in 2017 with a GitHub-backed <a href=\"http://this.how/english/\">text editor</a>) is that another app developer, \"LogSeq\" is going down this path: using GitHub as a place for users to store their data. Even better LogSeq is an outliner! And even better, they're supporting \"OPML\". So now it gets interesting. I can imagine a user opening an outline in \"Drummer\" because it has a feature they need, and then opening the same file in \"LogSeq\" because it has features that Drummer doesn't. This is the nirvana we've been waiting so long for. And we're close to having it. ",
                    "created": "Thu, 24 Jun 2021 14:24:14 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "GitHub is tempting, but there appear to be problems when accessed through their API, as I am doing. For example, if I saved a file to a user's repo, it might take 20 minutes before the changed version showed up to other apps. There must be a cache somewhere in there. I don't have a clear statement of how GitHub works here, maybe it's out there, but I wanted to do a reality check. ",
                    "created": "Thu, 24 Jun 2021 14:29:58 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "LogSeq says they use a Node package called <a href=\"https://github.com/isomorphic-git/isomorphic-git\">Isomorphic-Git</a>. It has been reliable. But there are other problems. ",
                    "created": "Thu, 24 Jun 2021 14:31:10 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I've <a href=\"https://github.com/scripting/Scripting-News/issues/213\">started a thread</a> on this. Maybe we can figure this out. Or maybe it's something we come back to periodically until it works. We'd love to hook up with people at GitHub, after we've explored all other options. ",
                    "created": "Thu, 24 Jun 2021 14:31:35 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Pissaro",
            "created": "Fri, 25 Jun 2021 00:55:57 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "<a href=\"https://www.wikiart.org/en/camille-pissarro/kew-the-path-to-the-main-conservatoryhttps://www.wikiart.org/en/camille-pissarro/kew-the-path-to-the-main-conservatoryhttps://www.wikiart.org/en/camille-pissarro/kew-the-path-to-the-main-conservatory\">Kew</a>, the Path to the Main Conservatory.",
                    "created": "Fri, 25 Jun 2021 00:56:04 GMT",
                    "inlineImage": "http://scripting.com/images/2021/06/24/pissaro.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}