{
    "text": "June 25",
    "created": "Fri, 25 Jun 2021 13:48:43 GMT",
    "type": "calendarDay",
    "name": "25",
    "subs": [
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1408443453432909824\">Poll</a>: In your opinion, which website is more likely to be online, with accurate archives of news published today, in 30 years?",
            "created": "Fri, 25 Jun 2021 15:19:42 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"http://scripting.com/2021/06/25/theTreeInTheOutdoorAustinBar.m4a\">Podcast</a>: How much of what's happening around you now can you perceive with your senses?",
            "created": "Fri, 25 Jun 2021 16:26:31 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2021/06/25/theTreeInTheOutdoorAustinBar.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "3388231",
            "flInCalendar": true
        },
        {
            "text": "After writing the stuff about the GitHub API earlier, a solution was <a href=\"https://github.com/scripting/Scripting-News/issues/213#issuecomment-868277650\">suggested</a>, and it turns out there may be a way to use GH now as a user-controlled storage system. I find this hard to think about, as I imagine it's hard to grasp reading about it, but I'm going to keep plodding along. The goal is basically do we get to have an open app ecosystem on the web, ever -- or is it a lost cause. Seems we're pretty close now? ",
            "created": "Fri, 25 Jun 2021 16:07:40 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I can’t believe <a href=\"https://open.nytimes.com/a-new-way-to-share-new-york-times-stories-3e66e8d7e620\">the NY Times uses Medium</a> for stories about their development process. I was literally fooled, as a NYT member, when the site asked me to sign on, I thought it would be a NYT login. The Times has one of the most skillfully produced websites in the world, and these are the people who run it, they can't figure out how to set up a section to explain their own innovations? Something is wrong. In any case, we ought to have a place for these kinds of papers that has some plan to survive time. Medium could shut down any day and take its archive with it. The NYT has a responsibility here too, to set an example. When they lean on Medium for archival storage, what are they thinking?",
            "created": "Fri, 25 Jun 2021 14:37:30 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Okay following up on yesterday's bit about <a href=\"http://scripting.com/2021/06/24/141650.html?title=githubAsAppStorageContd\">using GitHub</a> as an app storage system, even though I know it's possible, [[LogSeq]] has it working, but I'm not good enough with GIT as an API to figure out how to make it work. I have to table this idea for now and move on. I'm going to use S3 in its place. I know how it behaves, I have simple code to write to it that works. Unfortunately S3 does not come in a user-friendly package, so it doesn't get us anywhere as far as user control of their data. I think this is an ethical mission for devs, akin to the \"First do no harm\" <a href=\"https://en.wikipedia.org/wiki/Primum_non_nocere\">edict</a> for doctors. Don't lock your users in. I want to establish a norm here, for [[Tools For Thought]], that users expect to be able to move their data around where ever they want. Not giving up on this. We've done it before, with [[RSS]], for example. And podcasting still hasn't been siloized, amazingly. :boom:",
            "created": "Fri, 25 Jun 2021 13:48:46 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/09/01/mrFrog.png",
            "flInCalendar": true
        },
        {
            "text": "On the other hand, <a href=\"https://github.com/scripting/Scripting-News/issues/213#issuecomment-868277650\">here's a tip</a> about how it might be possible to get the current GitHub approach to work, via the API. It involves another bit of software. Not sure it's worth it. But I'm going to do a test to try to prove the tipster's theory. ",
            "created": "Fri, 25 Jun 2021 14:00:49 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The Dems only look good in comparison to the Repubs.",
            "created": "Fri, 25 Jun 2021 13:48:44 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}