{
    "text": "June 26",
    "created": "Sat, 26 Jun 2021 17:02:43 GMT",
    "type": "calendarDay",
    "name": "26",
    "subs": [
        {
            "text": "I'm watching the new season of <a href=\"https://www.google.com/search?q=site%3Ascripting.com+%22in+treatment%22\">In Treatment</a>. I love it even more than the first three seasons, which ended ten years ago. The star of the fourth season is <a href=\"https://en.wikipedia.org/wiki/Uzo_Aduba\">Uzo Aduba</a>, who was one of the stars of <a href=\"https://en.wikipedia.org/wiki/Orange_Is_the_New_Black\">Orange is the New Black</a>. She played a <a href=\"https://en.wikipedia.org/wiki/Crazy_Eyes_(Orange_Is_the_New_Black)\">nutcase</a> in OITNB. Now she plays a shrink!",
            "created": "Sat, 26 Jun 2021 22:10:22 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"http://river6.scripting.com/feedviewer?url=http://feeds.wnyc.org/radiolab\">RadioLab</a>: \"A chicken is an egg's way of making another egg.\"",
            "created": "Sat, 26 Jun 2021 17:45:06 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Over the years I've had lots of friends, people I otherwise respect, who won't listen to sports stories. But sports is good thing to talk about, for the same reason they dismiss it -- sports is of no consequence. It isn't real. It's a human-created pseudo-reality. It doesn't matter. Basketball, to me, is like watching a great chess tournament, with athletic performance and chance playing a bigger role. If you see any meaning in a random event, you've found god. I loved talking with my uncle about this. His Church of the Non-Functional Probabilities. Like an <a href=\"http://scripting.com/davenet/1995/04/24/thebaseballgod.html#3\">earthquake</a> during a World Series game in in 1989. \"The gods made a deal. the Baseball God said to the Earthquake God: 'we gotta stop this!'\" These gods aren't gods of war, or punishment of individuals, they are charged with keeping things mostly in balance. There are rules to baseball and earthquakes. When chance seems to be making a moral statement, that's god. Just a choice of terminology. You could call it anything really. God is the box we put all our imagined reasons for the weirdest coincidences.  ",
            "created": "Sat, 26 Jun 2021 17:02:44 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/06/26/baseballScene.png",
            "flInCalendar": true
        },
        {
            "text": "This <a href=\"https://www.nytimes.com/2021/06/26/sports/basketball/trae-young-hawks-bucks.html?unlocked_article_code=AAAAAAAAAAAAAAAACEIPuonUktbfqohkTlUZBSbORd89sgbBj_HUw7EgjHb6KG-JUz9PivUSHo6PvkfEeql4ItEu1DeAAt9dNbtlDNpD8thiBW0_AQ-5vsnD350fPyQ-rY_0BG4_05-TUeh9_WG3Nyzkeep2ge2z5xvDbGm6Xa3e0nIhdg01soIlIQ_xoQEAxK_DFuB13sAvnqtyQ8AnGkpTIXWCrPLqCB1hOdqZbR666gc-WetRWj-7jsfLovtbM10UUQSaOSs5tWUs69pcOMcVOrL8LnMjfsn_g7YRDA94PaUCOQCAZqGnhKdSiSpsZ2k&smid=url-share\">NYT article</a> about last night's game between the Bucks and the Hawks is an excellent example. And it's also a demo of the NYT's new sharing technology. The link is a gift, which means I am giving it to you, as a NYT subscriber, I can make 10 articles a month free this way. I love that they had the guts to try this. Trae Young, the devil that beat the Knicks in round 1, got his ass kicked last night. And I love that he's taking it the right way. He has heart. “That’s all on me,” Young said. “I’ve got to be better at taking care of the ball and just do a better job of at least getting us a shot. Nine turnovers. I’ve got to do better, and I will do better next game.”",
            "created": "Sat, 26 Jun 2021 17:33:34 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I have another idea for the NYT if they like the way this turns out. Let readers pay to move an article outside the paywall permanently. Something like an NFT. For example we collectively give the Times $1 million, to make this article available to everyone for free forever. I wrote this idea up a few years ago, have to find a link.",
            "created": "Sat, 26 Jun 2021 17:37:07 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"http://scripting.com/images/2021/06/26/uiTimesGift.png\">Screen shot</a> of the user interface for gifting a NYT article.",
            "created": "Sat, 26 Jun 2021 17:58:39 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "This is a test.",
            "created": "Sat, 26 Jun 2021 17:57:39 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2021/06/26/helloWorld.png",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}