{
    "text": "White hat journalism, superfeeds and courage to change",
    "created": "Mon, 04 Dec 2017 14:49:48 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I got an invite this morning to attend a panel discussion in NYC about how to combat fake news with technology. The panelists all have excellent job titles. No one could be fired for choosing them. The solution is obvious, imho, but it requires them to change. First you have to commit to competing with Facebook and Twitter in news distribution. Which means joining feeds into one superfeed (a term I just coined for what FB/TW do), and only including news orgs that try to write accurately and informatively and respond to feedback that they got it wrong. ",
            "created": "Mon, 04 Dec 2017 14:50:16 GMT",
            "image": "http://scripting.com/images/2017/12/04/whiteHat.png"
        },
        {
            "text": "Think of that as white hat journalism, a <a href=\"https://en.wikipedia.org/wiki/White_hat_(computer_security)\">term</a> borrowed from tech. I proposed this at one of the first sessions at <a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+newsgeist&t=hf&ia=web\">Newsgeist</a> in November. All kinds of well-titled people there. I was asked if Breitbart would be included the superfeed. No, of course not, I said. But, there would be no single superfeed. There would be competiton, so no one has the power to exclude. <i>There was no discussion. </i>I brought it up a couple more times at this future-of-news conference and no one was willing to discuss. ",
            "created": "Mon, 04 Dec 2017 14:56:43 GMT"
        },
        {
            "text": "The news industry solution is for Facebook to give them money. I see these two approaches as diametrically opposed. Either compete, or be subservient. ",
            "created": "Mon, 04 Dec 2017 14:51:41 GMT"
        },
        {
            "text": "Anyway, that's why I'm pretty sure there will be no attempt to solve the problem at this panel. How could I go and support this, when they don't have the courage to change? ",
            "created": "Mon, 04 Dec 2017 14:52:19 GMT"
        }
    ]
}