{
    "text": "I'm tired of all the bashing",
    "created": "Sat, 09 Dec 2017 13:48:43 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Last year's election was a real drain. I remember as we were coming up to Election Day thinking maybe this will all be over soon. In my heart I kind of knew that it wouldn't. Though I wished it would. I'm a programmer, so I'm pretty fatalistic about <a href=\"http://scripting.com/2016/07/28/dontFeedDjTrump.html\">bugs</a> like Trump. You can't wish them away. You have to roll up your sleeves, address the problem, fix it. That's the school of <a href=\"http://scripting.com/davenet/1997/05/07/Programmers.html#5\">programming</a> I belong to. There is no moving forward until you fully understand the problem. ",
            "created": "Sat, 09 Dec 2017 13:49:47 GMT",
            "image": "http://scripting.com/images/2017/12/09/mlk.png"
        },
        {
            "text": "The biggest drain was the utter stupidity of all the anger on the social nets, when people should have been pulling together, to avoid the catastrophe that is Trump. People bashing Hillary or Bernie, or each other. So much hate. Even bashing Trump is pointless. We need to see each other as real people just like ourselves. The media was pushing us apart, not bringing us together.",
            "created": "Sat, 09 Dec 2017 13:50:43 GMT"
        },
        {
            "text": "Well it didn't get better. My Facebook world gets smaller and smaller because I have a rule to not engage with people practicing hate. I don't try to talk them out of it. I have a simple gentle way of dealing with it. Instead of objecting I silently unfriend and unfollow the person. It keeps conflict to a minimum, and I get to preserve my self-respect. Watching friends rant about how this group or that group is responsible, often a group I belong to, takes its toll. People I couldn't stand to say goodbye to got second and third chances. But ultimately once we lost them to hate they really are gone. They don't seem to come back.",
            "created": "Sat, 09 Dec 2017 13:51:36 GMT"
        },
        {
            "text": "So rather than fight I withdraw. The circle gets smaller. Eventually Facebook might just disappear, at least my version of it. I think about where I can move to withdraw from all of it. I dream of somewhere in the Rockies. Where the mornings are cold and the air is clear. Maybe start skiing again. But then I realize there really is no escape. That's America too. The hate follows you everywhere.",
            "created": "Sat, 09 Dec 2017 13:53:51 GMT"
        },
        {
            "text": "Last year when the music stars were dying, Prince and Bowie, and this year -- Tom Petty and Walter Becker, I would joke, well at least they don't have to live through Trump. Like all jokes it was funny because it was true. I keep wondering when the suicides will start, as people give up hope. I think that is the logical conclusion of my thought process. The way to make the world disappear is to make <i>yourself</i> disappear.",
            "created": "Sat, 09 Dec 2017 13:54:52 GMT"
        },
        {
            "text": "Don't worry dear reader, I have no intention of doing away with myself. That'll happen soon enough through the natural progression of things. But if I were a young person today I'd be angry and in the streets, shaking every person saying what the fuck are you doing to put a stop to this lunacy?",
            "created": "Sat, 09 Dec 2017 13:56:26 GMT"
        }
    ]
}