{
    "text": "People who show up",
    "created": "Sat, 09 Dec 2017 14:47:22 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "There's a nice <a href=\"https://twitter.com/anildash/status/939137973240696832\">thread</a> on Twitter, started by @anildash. He asks you to name people who opened doors for you and made new things possible. I got a few very sweet testimonials from old <a href=\"https://twitter.com/om/status/939204436961792001\">friends</a>. It's nice to have your good work appreciated. Opening doors for other people is a big deal for me. ",
            "created": "Sat, 09 Dec 2017 14:47:26 GMT"
        },
        {
            "text": "Brent Simmons <a href=\"https://twitter.com/brentsimmons/status/939215623023759360\">said</a> it was simple. I gave him a chance as a programmer working with me, on projects in the 90s that had pretty great results. So obviously I made the right call. I want to say why I chose Brent over more experienced educated people. It's simple. He showed up. ",
            "created": "Sat, 09 Dec 2017 14:48:31 GMT"
        },
        {
            "text": "You can learn how to program, and your help might be very helpful, but if you aren't there, you aren't willing to take a chance, don't have the innate skills, the foundation, the whatever-it-is that made you show up, if you aren't all those things which amount to showing up, then well I'm going to go with the person who showed up. It's a decent algorithm. Empirically, it works. (Not a joke, though it might sound like it is.)",
            "created": "Sat, 09 Dec 2017 14:49:34 GMT"
        },
        {
            "text": "Same with Chris Lydon. Many if not most things about Chris infuriate me. I have to get that out of the way. I love him, but most of the time, in the ways I care about, he does not show up. But I worked with him, and the work, like the projects I did with Brent, proved to be significant. It produced results that could be built on. I know this because things <i>were</i> built on it. Because in the end, for whatever reason, he showed up.",
            "created": "Sat, 09 Dec 2017 14:51:31 GMT"
        },
        {
            "text": "When I made my <a href=\"https://twitter.com/davewiner/status/939236760055410690\">list</a> of people who opened doors for me, that's the criteria I used. People who worked with me, trusted me, took a chance on me, because flipped around that's exactly what Brent and Chris did. There are <s>probably</s> certainly things about me that infuriate them. But I showed up, they showed up, and something happened.",
            "created": "Sat, 09 Dec 2017 14:55:35 GMT"
        }
    ]
}