{
    "text": "I won't add new Spectrum services",
    "created": "Mon, 28 Dec 2020 20:30:54 GMT",
    "type": "outline",
    "metaImage": "http://scripting.com/images/2020/12/28/iWontAddNewSpectrumServices.png",
    "description": "I'm still looking for a way to stream the Knicks, without spending too much, but Spectrum ain't the answer.",
    "subs": [
        {
            "text": "I was determined a few nights ago to find a way to watch the Knicks, but I didn't want to pay a ridiculous amount of money for it. I saw that <a href=\"https://www.spectrum.net/\">Spectrum</a> now has a streaming option, with no set top box. I remember before I cut the cable, they had <a href=\"https://www.msgnetworks.com/\">MSG</a>, which is the broadcast network for the Knicks. So I thought there was a decent chance they had it on their streaming app. ",
            "created": "Mon, 28 Dec 2020 20:31:05 GMT",
            "flInCalendar": true
        },
        {
            "text": "Of course they make you sign up to find out what the channels are. I was stupidly impulsive. I clicked the button. A minute later I was looking through their channel guide. MSG is not included. So now I figured I'd just go click another button to kill the 7-day free trial. Nowhere to be found. Typical. ",
            "created": "Mon, 28 Dec 2020 20:31:51 GMT",
            "flInCalendar": true
        },
        {
            "text": "I ended up on hold for an hour, <a href=\"https://twitter.com/davewiner/status/1343601622975475712\">documented</a> on Twitter, where they were polite but couldn't help. There was no other way to cancel the trial without calling. The operator was a jerk, raised her voice, tried to upsell, asked me to explain myself, I said I just don't want it, which is a legal reason for cancelling a free trial imho. All of it, the wait, the bad manners must be scientifically proven to drive people to keeping their subscription and even buying more, when they called to cancel. But I wouldn't discuss it. I called to cancel and that's it.",
            "created": "Mon, 28 Dec 2020 20:32:04 GMT",
            "flInCalendar": true
        },
        {
            "text": "This approach is no longer competitive. Hulu, Disney, HBO, YouTube -- they all make it one click to unsub. Maybe with a confirmation, but that's all. They get that if it's not easy to unsub no one is going to sign up because we understand how this bullshit works. ",
            "created": "Mon, 28 Dec 2020 20:33:10 GMT",
            "flInCalendar": true
        },
        {
            "text": "I will remember hopefully never to sign up for anything with Spectrum again. Let me <a href=\"http://www.ranzey.com/generators/bart/index.html\">say</a> it a few times to let it sink in. ",
            "created": "Mon, 28 Dec 2020 20:34:04 GMT",
            "flInCalendar": true
        },
        {
            "text": "I won't add new Spectrum services.",
            "created": "Mon, 28 Dec 2020 20:34:07 GMT",
            "inlineImage": "http://scripting.com/images/2020/12/28/iWontAddNewSpectrumServices.png",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}