{
    "text": "We get the big things wrong",
    "created": "Tue, 19 Sep 2017 14:25:44 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "During the campaign last year, I pleaded with the press to listen about at least two things. ",
            "created": "Tue, 19 Sep 2017 14:25:49 GMT",
            "flNumberedSubs": "true",
            "subs": [
                {
                    "text": "Email is inherently insecure. You're spreading your ideas all over the place when you send an email. Just because the person-to-person channel is guarded, it doesn't prevent the email from being forwarded, saved to disk and transmitted other ways, or through phishing, being stolen as part of a whole mailbox. When you secure email transmission, you're locking a window but all the doors are wide open. It's really just security theater. In other words, someone is taking advantage of your ignorance, and there's one way to fix that -- to stop being ignorant. ",
                    "created": "Tue, 19 Sep 2017 14:31:53 GMT"
                },
                {
                    "text": "Trolls. We're being trolled. There's nothing new or novel about this. I know it's hard to not be fascinated, I could tell you stories of years I wasted dealing with trolls, thinking I could win by engaging. You can't. The only way to win is to just turn your back. ",
                    "created": "Tue, 19 Sep 2017 14:31:58 GMT"
                }
            ]
        },
        {
            "text": "But we get the big things wrong. The frustration I feel about us always being late at figuring this stuff out, and digging the hole deeper and deeper, is one that other people who care about science and technology share. ",
            "created": "Tue, 19 Sep 2017 14:28:38 GMT"
        },
        {
            "text": "Meanwhile Google is wiping out the history of the web, the few sites that remain from the early days, by doing it in a slow almost invisible way. I guess I have to give up on trying to stop this. I'm going to let them delete my sites over the coming years. I have done make-work for BigCo's in the past, countless times, thinking if I just do what the big company is forcing me to do, it'll all work out. Now I know that isn't true. It doesn't work that way. ",
            "created": "Tue, 19 Sep 2017 14:29:44 GMT"
        },
        {
            "text": "We get the big things wrong. Accept it. We take the low road every chance we get. Assume it's being fucked up and be surprised when it's not. ",
            "created": "Tue, 19 Sep 2017 14:31:17 GMT"
        }
    ]
}