{
    "text": "Afternoon impeachment notes",
    "created": "Sat, 13 Feb 2021 18:37:57 GMT",
    "type": "outline",
    "metaImage": "http://scripting.com/images/2021/02/13/congress.png",
    "description": "You have to use your imagination to see that there once was a co-equal branch of government here. ",
    "subs": [
        {
            "text": "We have bigger fish to fry with the pandemic, and it's not just good enough to defeat it, people have to feel the government defeating it. Maybe we don't have a Congress anymore. Maybe it's Biden and a fig leaf for a Congress. Clearly they can't deal with the problem of Trump.",
            "created": "Sat, 13 Feb 2021 18:38:09 GMT",
            "flInCalendar": true
        },
        {
            "text": "For right now, treat Congress as a museum. This is a shell of what it used to be. You have to use your imagination to see that there once was a co-equal branch of government here. Now they're a PR appendage for the executive branch. They give the MSNBC and CNN journos something to fuss over. Keeps them busy when they aren't reporting on President Biden's latest heroic battle against the virus. ",
            "created": "Sat, 13 Feb 2021 18:38:19 GMT",
            "flInCalendar": true
        },
        {
            "text": "If the Repubs win Congress in 2022, who cares. It’s a powerless former coequal branch of government. ",
            "created": "Sat, 13 Feb 2021 21:13:38 GMT",
            "flInCalendar": true
        },
        {
            "text": "President Biden will do as he pleases. ",
            "created": "Sat, 13 Feb 2021 21:19:37 GMT",
            "flInCalendar": true
        },
        {
            "text": "Next up, as with the filibuster there will soon be a virtual insurrection. ",
            "created": "Sat, 13 Feb 2021 21:19:05 GMT",
            "flInCalendar": true
        },
        {
            "text": "<b>A fantasy presidency</b>",
            "created": "Sun, 14 Feb 2021 00:07:49 GMT",
            "flInCalendar": true
        },
        {
            "text": "And then Biden renames Air Force One The Rocinante.",
            "created": "Sat, 13 Feb 2021 18:38:47 GMT",
            "flInCalendar": true
        },
        {
            "text": "Biden and his wily clever sidekick -- Fauci Man! ;-)",
            "created": "Sat, 13 Feb 2021 18:38:39 GMT",
            "flInCalendar": true
        },
        {
            "text": "Biden and Fauci and Super Veep roam the country, fighting the MAGAs and The Virus, making America safe for whatever comes next. Have to figure that part out. ",
            "created": "Sat, 13 Feb 2021 18:38:52 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}