{
    "text": "<a href=\"https://en.wikipedia.org/wiki/Taylor_Lorenz\">Taylor Lorenz</a> gets a lot of shit, what else is new, that's what happens when you speak from a terrific pulpit, as she does -- she's a Washington Post columnist, before that was a reporter for the NY Times. If you go back far enough she was a blogger on Tumblr, so we feel pride, a local girl did good. And she adds a bit of open web, user-centric thought to everything. As a software developer, I see things the same way. I don't care how much money Zuck or Bezos or Musk have, like most journalists seem to, I care how empowered the users are, because that's how we will solve the problems of our world, by smart people who see things from important perspectives, who say what they see. Her <a href=\"https://wapo.st/3sBrFLS\">recent piece</a> in the WP is about a group of startups who want the big silos to make it easier for their users to migrate to other platforms. This is a hard problem both economically and technically, and I'm not sure the startups are sincere, it could be they only want the publicity. There are no details <a href=\"https://myfriendsmydata.org/\">on the website</a>, and a project like this is all about the details. Also VC-backed startups are the last devs I expect to go this route and I don't imagine if one of them is successful that they're going to rush to share their user lists with the others. The only way something like this can work is if they share a membership system from the start. And if they do that, and want credibility, there should be some non-VC open source devs in their group. One more thing, why not just use Twitter's identity system. It's got a great API, scales really well, and other devs (such as me) are using it that way. Instead of building my own identity system, I just use theirs. I have no interest in controlling my users, so it's a no-brainer. Sure the day could come when Twitter shuts off the API, but I could also get hit by a car riding my bike on a country road, or any number of other calamities.",
    "created": "Sat, 14 May 2022 17:52:10 GMT",
    "type": "outline",
    "image": "http://scripting.com/images/2012/04/12/web.gif",
    "flInCalendar": true
}