{
    "text": "<a href=\"https://bsky.app/profile/andrewhickey.bsky.social\">Andrew Hickey</a> is this year's <a href=\"https://www.google.com/search?q=site%3Ascripting.com+Blogger+of+the+Year\">Blogger of the Year</a>. He's a prototypical blogger, exactly the kind of person I hoped would <a href=\"http://scripting.com/2022/04/13/165056.html?title=sourcesGoDirectExplained\">create</a> their own media having profound positive impact on people's lives. People like me. His <a href=\"https://500songs.com/podcast/\">500 Songs</a> podcast, which I've written about <a href=\"https://www.google.com/search?q=site%3Ascripting.com+500+songs\">many times</a>, focuses on a song in every episode and tells you how the pieces came together to create it. When a new episode comes out I greedily savor it, like a great <a href=\"https://www.google.com/search?q=site%3Ascripting.com+bagel\">bagel</a> from Zabar's or a new <a href=\"https://en.wikipedia.org/wiki/Quentin_Tarantino#Filmography\">Tarantino</a> movie. Two recent episodes, one about the <a href=\"https://500songs.com/podcast/episode-165-dark-star-by-the-grateful-dead/\">Grateful Dead</a> and the other about <a href=\"https://500songs.com/podcast/episode-171-hey-jude-by-the-beatles/\">Hey Jude</a>, changed my views of each of the groups, in the first case confirming an intuition, and in the other showing me how naive my idea of how a song comes together. I am envious of how the musicians work together, it may be a cuthroat industry, but it seems incredibly collaborative compared to how tech works, where we all pretty much ignore each other. Hickey isn't just a podcaster, he's also a blogger, and he does it in an unusual place, <a href=\"https://bsky.app/profile/andrewhickey.bsky.social\">on Bluesky</a>. He has things to say and that's of course what <a href=\"http://scripting.com/stories/2009/11/24/naturalbornBlogger.html\">NBB's</a> are all about. You may not care for their opinions, but you will know what they are. Anyway, if you like the Beatles, I highly recommend the <a href=\"https://500songs.com/podcast/episode-171-hey-jude-by-the-beatles/\">latest episode</a>, and if you like popular music, <a href=\"https://500songs.com/feed/podcast/\">subscribe</a> to <a href=\"https://feedland.com/?river=https%3A%2F%2F500songs.com%2Ffeed%2Fpodcast%2F\">500 Songs</a>. And if you know of any podcasts like this, please let me know. I always want to add to my podcast reading list. ",
    "created": "Sun, 31 Dec 2023 18:22:19 GMT",
    "type": "outline",
    "image": "https://imgs.scripting.com/2022/04/15/theEggman.png",
    "flInCalendar": true
}