{
    "text": "Politics and sport",
    "created": "Tue, 15 Jun 2021 12:08:18 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "<i>Posted on <a href=\"https://www.facebook.com/dave.winer.12/posts/967755680098504\">Facebook</a> two years ago.</i>",
            "created": "Tue, 15 Jun 2021 12:08:23 GMT",
            "flInCalendar": true
        },
        {
            "text": "Quite out the blue I notice that longtime friend Scott Knaster enthusiastically agrees with virtually everything I write about the Trump mess. Of course I wonder what the common thread is, and I've come to believe it is that we are both avid sports fans, even though they're not all the same sports. ",
            "created": "Tue, 15 Jun 2021 12:08:24 GMT",
            "flInCalendar": true
        },
        {
            "text": "Lots of strategy in sports requires compromise. You take one player out and replace with another who is better at defense because that's what you need right now. It comes at a cost. A sports fan knows there's randomness to it, or is it spirituality? God sees what you're doing and perhaps (as my uncle would say) goofs on you. Or you put in the best defensive squad and they score more points than your offensive-strong team. Go figure. ",
            "created": "Tue, 15 Jun 2021 12:09:24 GMT",
            "flInCalendar": true
        },
        {
            "text": "You have to be prepared for whatever comes your way and let it guide your thinking. And always think how fate could deal you a cruel blow, because <i>that</i> happens all the time in sport, and of course in life too. And especially in politics.",
            "created": "Tue, 15 Jun 2021 12:10:25 GMT",
            "flInCalendar": true
        },
        {
            "text": "Linear thinking doesn't work. If I do X the other guy always does Y is not a good bet. Because the other person is sentient too, and knows you're expecting Y and one time, when it really makes a difference will do exactly what you don't expect because it's what you don't expect.",
            "flInCalendar": true
        },
        {
            "text": "But one thing's for sure. If there are two seconds on the clock, and you're in field goal range, and you're down two points, you go for the field goal. Even though a touchdown is more fun. ",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}