{
    "text": "Do it for the users",
    "created": "Tue, 15 Jun 2021 21:40:57 GMT",
    "type": "outline",
    "description": "Let's build this layer of the internet right, based on what we learned from the mistakes of the past. ",
    "metaImage": "http://scripting.com/images/2021/06/15/therRehearsal.png",
    "subs": [
        {
            "text": "Back in the 00s we had a series of conferences called [[BloggerCon]].  ",
            "created": "Tue, 15 Jun 2021 21:41:01 GMT",
            "flInCalendar": true
        },
        {
            "text": "There were a lot of new things about this series, one of them was they were user conferences. ",
            "flInCalendar": true
        },
        {
            "text": "Tech companies could sponsor if they wanted, but they didn't get anything in return other than thanks. ",
            "flInCalendar": true
        },
        {
            "text": "We didn't get any sponsors for the first one, but after that, sponsors saw that the thanks was worth enough to want to help.",
            "created": "Tue, 15 Jun 2021 21:41:23 GMT",
            "flInCalendar": true
        },
        {
            "text": "So what does it mean to be a [[user conference]]? ",
            "created": "Tue, 15 Jun 2021 21:46:29 GMT",
            "flInCalendar": true
        },
        {
            "text": "It means that the interests we rep are those of the users.",
            "flInCalendar": true
        },
        {
            "text": "So if you had a users conference for journalism, the journalists could come, and they could speak, but only as users of news. They couldn't talk about problems they have being journalists, which is 100 percent of what happens at journalism conferences. ",
            "created": "Tue, 15 Jun 2021 21:41:55 GMT",
            "flInCalendar": true
        },
        {
            "text": "There needs to be room for the users, somewhere, to get together and decide what they want from the tech. Not to be told what they want by an industry that is a bit short on vision, esp positive visions for users.",
            "created": "Wed, 16 Jun 2021 02:30:57 GMT",
            "flInCalendar": true
        },
        {
            "text": "Today opportunity is opening up that I hoped would happen in the 90s when I tried to push the idea of using outliners to build web structures, starting with blogs. Something that smart users understand, techies aren't impressed, but people who think really are turned on by the idea. ",
            "created": "Tue, 15 Jun 2021 21:42:15 GMT",
            "flInCalendar": true
        },
        {
            "text": "We called the company UserLand, the one that made the outliner that could build websites. When we had a decision to make about products, the first people we thought of were the users. How could a company called UserLand do otherwise? :-)",
            "created": "Tue, 15 Jun 2021 21:42:50 GMT",
            "flInCalendar": true
        },
        {
            "text": "What I want to say to the users, now, is this -- don't let yourself be locked in to one vendor. Let's not repeat the mistakes of Facebook, Twitter, Medium, Substack, etc. These companies provide a free service, and in return you get to be the product. Let's hold out for something better.",
            "created": "Tue, 15 Jun 2021 21:43:33 GMT",
            "flInCalendar": true
        },
        {
            "text": "The economics of software today are such that you can get a lot of value for virtually no money. The cost of production is zero, and servers cost virtually nothing to run (you can find services that give you free servers, not sure why, but it's a good deal, because you're free to move to other services). I pay for my servers, I use [[Digital Ocean]], they provide a good service, and the prices are amazing. For less than I pay for cable TV, I get seven really good Unix servers that run all my stuff. I would have killed for that kind of deal just a few years ago.",
            "created": "Tue, 15 Jun 2021 21:44:08 GMT",
            "flInCalendar": true
        },
        {
            "text": "Today we're in technology heaven, made into a hellish place by bad ideas from tech. You should always be able to move to another service. If you find that's not possible get out before it's too late.",
            "created": "Tue, 15 Jun 2021 21:50:58 GMT",
            "flInCalendar": true
        },
        {
            "text": "Let's build this layer of the internet right, based on what we learned from the mistakes of the past. ",
            "created": "Tue, 15 Jun 2021 21:45:50 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}