{
    "text": "I'm re-thinking RSS now",
    "created": "Sun, 19 Jan 2020 14:58:34 GMT",
    "type": "outline",
    "description": "I wanted journalism and blogging to share a common format. That may not have been a good idea. ",
    "subs": [
        {
            "text": "I've been having a big change of <a href=\"http://scripting.com/2020/01/18.html#a153502\">thinking</a> re RSS.",
            "created": "Sun, 19 Jan 2020 14:58:46 GMT",
            "image": "http://scripting.com/images/2020/01/18/anythingGoes.png"
        },
        {
            "text": "In 1999, I compromised. I wanted journalism and blogging to share a common format. So I ditched the format I designed and accepted Netscape's adaptation in its place, to create unity. And it worked, it was the level playing field I had hoped for. Blogging and journalism both thrived in RSS. But at a price. ",
            "created": "Sun, 19 Jan 2020 14:59:06 GMT"
        },
        {
            "text": "The price was forcing blogs into the same format that news orgs used. Problem is, as we can see clearly with Twitter, that format isn't the only one. As Twitter discovered, its style of writing doesn't fit into the model of RSS. People were disappointed when they stopped publishing tweets via RSS. But this was the right thing to do, in hindsight. It wasn't working.",
            "created": "Sun, 19 Jan 2020 15:10:49 GMT"
        },
        {
            "text": "I turned a corner <a href=\"http://scripting.com/2017/05/05/iWantMyOldBlogBack.html\">in 2017</a> with my blog. I realized then, though I wouldn't have put it this way, the price I paid by merging formats with Netscape was too great. It forced blogging into the title-description-body model of journalism. But blog posts are more free-form, they don't all fit into that structure. ",
            "created": "Sun, 19 Jan 2020 15:00:09 GMT"
        },
        {
            "text": "So now I'm thinking about what I could have done differently in 1999, if I had evolved my syndication format the way my blog wanted to go, not the way RSS pushed us. ",
            "created": "Sun, 19 Jan 2020 15:00:42 GMT"
        }
    ]
}