{
    "text": "March 3",
    "created": "Sun, 03 Mar 2019 23:20:48 GMT",
    "name": "03",
    "subs": [
        {
            "text": "This is how parents <a href=\"http://scripting.com/images/2019/03/03/postcard.png\">sent email</a> to their kids in 1968.",
            "created": "Mon, 04 Mar 2019 02:58:10 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://24houradventure.blog/quotes/\">Mohammed Ali</a>: \"Looking at life from a different perspective makes you realize that it’s not the deer crossing the road, rather it’s the road that is crossing the forest.\"",
            "created": "Mon, 04 Mar 2019 03:34:09 GMT",
            "type": "outline"
        },
        {
            "text": "The Boston Celtics were so good last year, even though their two biggest stars were out for the playoffs, and this year they're struggling, even though they're both playing. More proof that teams are not arithmetic. There is such a thing as chemistry.",
            "created": "Mon, 04 Mar 2019 02:56:09 GMT",
            "type": "outline"
        },
        {
            "text": "I was asked how I feel about my new <a href=\"https://www.subaru.com/vehicles/forester/index.html\">Subaru Forester</a>. I love it. It's a sweet car all around, but the <i>best</i> thing about it is it fits me. For my whole life I've been driving cars that were too small. I'd have to <a href=\"http://thesaurus.land/?word=contort\">contort</a> myself to get in and out. Not the Forester.",
            "created": "Sun, 03 Mar 2019 23:20:49 GMT",
            "type": "outline"
        },
        {
            "text": "Does podcasting need a Netflix?",
            "created": "Mon, 04 Mar 2019 03:24:00 GMT",
            "type": "outline",
            "description": "The infrastructure for movies is super expensive and the infrastructure for MP3s is not. ",
            "subs": [
                {
                    "text": "Maybe it's time to do some work on \"podcatch.com\", to make it possible for anyone to turn a list of podcast feeds into a reverse chronologic river of new shows. Help the open network push back against the VC-backed silos.",
                    "created": "Mon, 04 Mar 2019 03:24:08 GMT"
                },
                {
                    "text": "The diff betw podcasts and Netflix, btw is this. Movies and TV shows are almost all licensed, because they are very expensive to produce. Podcasts are not expensive, yes I know some orgs spend a lot of money but I don't think that makes them better. And the infrastructure for movies is super expensive and the infrastructure for MP3s is not. ",
                    "created": "Mon, 04 Mar 2019 03:24:43 GMT"
                },
                {
                    "text": "There are all kinds of reasons why podcasts will never need the kind of service that Netflix provides for video. But if we don't put up any open services, the lock-in might happen anyway.",
                    "created": "Mon, 04 Mar 2019 03:25:50 GMT"
                }
            ]
        }
    ]
}