{
    "text": "March 9",
    "created": "Sat, 09 Mar 2019 18:13:42 GMT",
    "name": "09",
    "subs": [
        {
            "text": "Yesterday I bought a house to go with my new car. (Heh actually it's the other way around.) It's a beautiful house in upstate New York, in the Catskills. It's a place where old hippies go when they want to get an advance look at heaven. I was looking for six months, considered a lot of options, and went for a place that's a bit daring, not conservative, that's what I always seem to do. As you might imagine, I'll have much more to share in the coming weeks and months. :boom:",
            "created": "Sat, 09 Mar 2019 18:13:43 GMT",
            "type": "outline"
        },
        {
            "text": "Warren asks the right question",
            "created": "Sat, 09 Mar 2019 18:16:01 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I appreciate what Elizabeth Warren is proposing re tech companies. But we need to do more, and do it very soon. They are destroying natural resources the way oil giants did before the government stepped in. However our political leaders, like most users, don’t understand.",
                    "created": "Sat, 09 Mar 2019 18:16:28 GMT"
                },
                {
                    "text": "The natural resource they are destroying is the World Wide Web, an open, unowned resource that has fostered the innovative environment that gave birth to Google and Facebook.",
                    "created": "Sat, 09 Mar 2019 18:16:47 GMT"
                },
                {
                    "text": "Google is acting as if it were the government, without any checks and balances, no oversight, no redress of grievances. They say they’re doing it for the good of the net, but we know they’re a huge corporation, and that’s not how it works.",
                    "created": "Sat, 09 Mar 2019 18:16:57 GMT"
                },
                {
                    "text": "Facebook is sucking the life out of the web, along with Medium (where Warren published her manifesto!). Some simple rules, if followed, would restore balance to the web ecosystem. But there are no rules here, so they run wild, and take whatever isn’t nailed down.",
                    "created": "Sat, 09 Mar 2019 18:17:08 GMT"
                },
                {
                    "text": "They’ve had a fantastic run, but it’s long past time for some rules, and consequences for not respecting that we all have ownership of the resource they are foreclosing on.",
                    "created": "Sat, 09 Mar 2019 18:17:22 GMT"
                }
            ]
        }
    ]
}