{
    "text": "March 15",
    "created": "Fri, 15 Mar 2019 17:08:11 GMT",
    "name": "15",
    "subs": [
        {
            "text": "Yes, it's almost certainly a coincidence that <a href=\"https://www.thedailybeast.com/trump-warns-it-would-be-very-bad-if-my-police-biker-gang-fans-decided-to-get-tough-on-my-opponents\">Trump threatened</a> his opposition (which includes a lot more than Democrats) with the force of the military, police and bike gangs the same day a <a href=\"https://www.aljazeera.com/news/2019/03/zealand-mosques-attack-suspect-praised-trump-manifesto-190315100143150.html\">massacre of Muslims</a> was carried out in New Zealand, by a white terrorist, in Trump's name. Don't brush this aside. Trump's talk is more than a dog whistle. It's certain that fascists are present in the military and police. <i>That's</i> who he's talking to. ",
            "created": "Fri, 15 Mar 2019 17:35:52 GMT",
            "type": "outline"
        },
        {
            "text": "It's just sinking in that <a href=\"http://scripting.com/2019/01/02/144116.html\">Facebook</a> announced a radical shift in what their product does, reorganized around their chat apps. Are they shutting down the discussion group functionality? What does this mean for the ability to post messages on your timeline and to follow other users? What about private groups? Is Facebook going to shut down those functions? If so, we're facing a hole in the net far bigger than what Google created when they withdrew <a href=\"https://en.wikipedia.org/wiki/Google_Reader\">Reader</a>. I'd like some idea from Facebook what this means for the public writing function of Facebook? And if that's going to be phased out, will they work with open web developers to replace the functionality off Facebook's servers. Let's try to put back some of the life FB drew from the web. ",
            "created": "Fri, 15 Mar 2019 17:08:12 GMT",
            "type": "outline",
            "image": "http://scripting.com/2016/01/30/strongman.png"
        }
    ]
}