{
    "text": "March 17",
    "created": "Sun, 17 Mar 2019 13:53:33 GMT",
    "name": "17",
    "subs": [
        {
            "text": "My new <a href=\"https://www.subaru.com/vehicles/forester/models.html\">Subaru Forester</a> has a passive self-driving feature -- it sees the lines on the road, if you steer outside the lines, it nudges you back inside the lines through a gentle force it applies to the steering wheel. If you ease up on the grip, the car steers itself, even on winding mountain roads.",
            "created": "Mon, 18 Mar 2019 03:52:13 GMT",
            "type": "tweet",
            "tweetId": "1107490178883559426",
            "tweetUserName": "davewiner"
        },
        {
            "text": "I have some ideas for new architectures the RSS feed reader market, to better empower users and to create new opportunities for reading and writing tool developers.",
            "created": "Sun, 17 Mar 2019 16:12:27 GMT",
            "type": "outline"
        },
        {
            "text": "Political tiersmanship",
            "created": "Sun, 17 Mar 2019 13:53:34 GMT",
            "type": "outline",
            "description": "Think about the poor campaigners Democrats have nominated recently and you'll see a list of losers. The winners, Clinton and Obama, were great at owning a crowd. ",
            "subs": [
                {
                    "text": "Tom Watson, who I have <a href=\"https://twitter.com/tomwatson/status/1107297515320283136\">never met</a>, is a fellow New Yorker whose political opinions, until recently, track my own pretty closely. ",
                    "created": "Sun, 17 Mar 2019 13:53:45 GMT"
                },
                {
                    "text": "Tom just <a href=\"https://twitter.com/tomwatson/status/1107273866370523138\">posted his list</a> of tiers of presidential candidates for 2020. I find it very provocative. Here are my comments on his list.",
                    "created": "Sun, 17 Mar 2019 13:58:07 GMT",
                    "subs": [
                        {
                            "text": "Please, just go away Bernie",
                            "created": "Sun, 17 Mar 2019 14:11:12 GMT",
                            "subs": [
                                {
                                    "text": "First, there's one thing we agree on. Bernie should retire. ",
                                    "created": "Sun, 17 Mar 2019 19:46:15 GMT"
                                },
                                {
                                    "text": "We're saying goodbye to Hillary, even those of us who enthusiastically supported her in 2016. Sanders should step aside, following her example, as we want DJ Trump to retire, hopefully to <a href=\"https://en.wikipedia.org/wiki/Solitary_confinement\">solitary confinement</a> at a <a href=\"https://en.wikipedia.org/wiki/Supermax_prison\">max security</a> prison. ",
                                    "created": "Sun, 17 Mar 2019 13:56:20 GMT"
                                },
                                {
                                    "text": "Bernie is a vestige of the 2016 election, which we never will forget, but would really like to.  ",
                                    "created": "Sun, 17 Mar 2019 19:44:08 GMT"
                                }
                            ]
                        },
                        {
                            "text": "Tom's A-tier",
                            "created": "Sun, 17 Mar 2019 14:02:30 GMT",
                            "subs": [
                                {
                                    "text": "I don't think much of any of Tom's A-tier candidates. Harris doesn't speak well, I don't have a clear idea of what she stands for. The most convincing appeal I've heard for her came from California governor Gavin Newsom on Maddow. Now <i>there's</i> a politico who should run. He spoke highly of Harris, who he (surprisingly to Maddow) has endorsed. ",
                                    "created": "Sun, 17 Mar 2019 13:58:53 GMT"
                                },
                                {
                                    "text": "Gillibrand? Don't make me laugh. She flips positions so quickly, she's just a suit, running for something, without any reason I can discern. And she was the force that drove Al Franken from the Senate, and for that, I would love to vote for anyone other than her when she runs for re-election to the Senate. ",
                                    "created": "Sun, 17 Mar 2019 14:00:43 GMT"
                                },
                                {
                                    "text": "Booker? A solid meh. Like Harris and Gillibrand he says nothing other than I want to be famous. ",
                                    "created": "Sun, 17 Mar 2019 14:01:44 GMT"
                                },
                                {
                                    "text": "Warren? She'd be the best president of this bunch, but she's not the purist people think she is. I believed in her before she supported Israel in their killing of innocent Gazans. At that point I realized okay she's just a Democrat who has a specialized schtick. Not a good leader. Perfect for Massachusetts, not for America. ",
                                    "created": "Sun, 17 Mar 2019 14:03:41 GMT"
                                },
                                {
                                    "text": "Summary: If we elect any of these candidates, somehow (I think Trump will beat any of them) we will have wasted the election. And we'll get another Trump only worse next time. And Congress? Nothing will get done there. ",
                                    "created": "Sun, 17 Mar 2019 14:02:40 GMT"
                                }
                            ]
                        },
                        {
                            "text": "My A-tier",
                            "created": "Sun, 17 Mar 2019 14:03:33 GMT",
                            "subs": [
                                {
                                    "text": "First, a note about criteria. A candidate, if you want them to win, has to be a great campaigner. Think about the poor campaigners Democrats have nominated recently and you'll see a list of losers. The winners, Bill Clinton and Barack Obama, were great at owning a crowd. Think about the moments they inspired you. So Corey Booker and Kamala Harris might have great ideas, and the support of other politicians, but both are stiff and not good at thinking on their feet. And then think about the guy they're running against, he lies shamelessly and he'll say anything for a laugh. So you have to exclude otherwise good candidates who would shrivel under Trump's abuse. Think of Jeb Bush as an example. Do you really think Gillibrand would do better than Jeb?",
                                    "created": "Sun, 17 Mar 2019 14:31:21 GMT"
                                },
                                {
                                    "text": "With that preamble, here's my A-tier: Klobuchar, Inslee, Buttigieg. They're very different candidates. I love Klobuchar because she would bring as much of the country together as is possible in 2020, and she has a strong spine, a calm demeanor and would be a good president. And she's lucky (thinking of the snowstorm in Minneapolis when she announced, who did she have to pay to make that happen). The fact that the press is gunning for her makes me like her even more. We have to think bigger picture than who best reps our personal policy preferences. Our form of government is built on compromise. You can't get everything you want, and neither can your most despised opponent. That's <i>good.</i> We have to think about the America the next president will govern if we manage to get Trump out of office. I think Klobuchar is our best choice for that. Not Biden. Not any of the others, except... ",
                                    "created": "Sun, 17 Mar 2019 14:05:14 GMT",
                                    "image": "http://scripting.com/images/2019/03/17/amyKlobuchar.png"
                                },
                                {
                                    "text": "Inslee, who I've only learned about recently, is actually the perfect candidate for our times. He has the guts to say what our top issue is, climate change, and is running on that as his only issue, and he pulls it off. A pragmatic and visionary politician who's great at leadership. Not often we get a chance to vote for such a candidate. His interview on Maddow was fantastic. Watch it if you can find it. (Their archives are awful.) He gets that politics is marketing, has ways of explaining all of it, in simple words that reach into your heart. And the great thing about it is, everything he advocates is right on, it's what we need to do. I would love to see a ticket with Inslee and Klobuchar, I don't really care who's #1 and #2. ",
                                    "created": "Sun, 17 Mar 2019 14:07:05 GMT"
                                },
                                {
                                    "text": "Buttigieg is smart and inspiring, thinks on his feet, has guts and also gets that politics requires positioning, memorable slogans that reach you at an emotional level, in other words, marketing. Like Klobuchar he comes from the middle of the country which is a big plus for 2020. ",
                                    "created": "Sun, 17 Mar 2019 14:08:16 GMT"
                                },
                                {
                                    "text": "I would pay money to see any of these three debate Trump (and btw, I think Biden would do pretty well there too). Tom's A-tier would deal with Trump's mischief about as well as HRC did, which is pretty good, but not good enough. ",
                                    "created": "Sun, 17 Mar 2019 14:09:14 GMT"
                                }
                            ]
                        },
                        {
                            "text": "The wild card",
                            "created": "Sun, 17 Mar 2019 14:19:00 GMT",
                            "subs": [
                                {
                                    "text": "Stacey Abrams. Wow would she shake things up. She could either be Al Sharpton 2.0 (he was actually a good <a href=\"https://www.npr.org/programs/specials/democrats2004/sharpton.html\">candidate</a>, but the press didn't take him seriously), or could come out on top. I'd pay <i>lots</i> of money to see her debate Trump. However there is a caveat. All the race hate that Obama inspired would re-double with a President Abrams. On the other hand, I guess this is a fight we're going to have, and I'm guessing she'd be the best to lead us. If she's running to raise her profile in advance of a Senate run in Georgia, then good for her. ",
                                    "created": "Sun, 17 Mar 2019 14:19:05 GMT",
                                    "image": "http://scripting.com/images/2019/03/17/staceyAbrams.png"
                                },
                                {
                                    "text": "It's too early to worry about disruption in the field. And for sure Abrams would shake out airheads like Beto, Booker and Gillibrand. I would also pay to see them on the same debate stage. She'd mop the floor with them. ",
                                    "created": "Sun, 17 Mar 2019 15:14:12 GMT"
                                }
                            ]
                        },
                        {
                            "text": "All I have to say about Beto",
                            "created": "Sun, 17 Mar 2019 15:14:23 GMT",
                            "subs": [
                                {
                                    "text": "Beto is the Democratic equivalent of Marco Rubio. A candidate designed by central casting, with no reason to be there.  ",
                                    "created": "Sun, 17 Mar 2019 15:13:43 GMT"
                                }
                            ]
                        },
                        {
                            "text": "No to Joe",
                            "created": "Sun, 17 Mar 2019 14:40:43 GMT",
                            "subs": [
                                {
                                    "text": "Joe Biden. I met him at the DNC in 2008. He's very charismatic, one of those politicians who make you feel like you're the only person who matters. He really is a good guy. But we have to win in 2020, and putting up someone who's even older than Trump loses us an advantage we need, the idea that we're looking to the future not to the past for our best. Biden's time has passed. It seems he is going to run. I think he'll add something to the field. And he deserves a chance to convince us we're wrong when we think he needs to join HRC, Bernie, Obama and <a href=\"https://www.themarshallproject.org/2016/01/08/my-life-in-the-supermax\">Trump</a> in retirement. ",
                                    "created": "Sun, 17 Mar 2019 14:40:46 GMT"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}