{
    "text": "March 20",
    "created": "Wed, 20 Mar 2019 14:21:17 GMT",
    "name": "20",
    "subs": [
        {
            "text": "Yesterday's <a href=\"https://www.nytimes.com/2019/03/19/podcasts/the-daily/boeing-737-max-ethiopia-crash.html\">Daily podcast</a> about Boeing's bug was interesting because bugs are starting to be mainstream life and death issues and the cost of lack of interop was frontmost in Boeing's decision to mask the difference in the two models of 737 using a compatibility bridge. Developer tool developers should be so concerned about the cost of re-training. Lots to process for techies. I listened to the podcast driving down the <a href=\"https://en.wikipedia.org/wiki/New_York_State_Thruway\">NYS Thruway</a> in my Forester that <a href=\"http://scripting.com/2019/03/17.html#a035213\">nudges</a> you to stay in your lane. I always think, what if there's a bug in this system, it might make my car do something like what the Boeing planes were doing. But I leave it on, because I like what it's doing, at least for now.",
            "created": "Wed, 20 Mar 2019 18:39:36 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/03/20/tryHarder.png"
        },
        {
            "text": "A friend who's known me for a long time said today that I am a special character. I like that. (Not sure which one though.)",
            "created": "Wed, 20 Mar 2019 18:15:15 GMT",
            "type": "outline"
        },
        {
            "text": "20 years ago, <a href=\"http://scripting.com/1999/03.html\">March 1999</a>, was a big month for \"RSS\".",
            "created": "Wed, 20 Mar 2019 14:39:26 GMT",
            "type": "outline"
        },
        {
            "text": "Noisy geothermal heating",
            "created": "Wed, 20 Mar 2019 14:21:18 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "This is a <a href=\"https://github.com/scripting/Scripting-News/issues/111\">braintrust query</a>. ",
                    "created": "Wed, 20 Mar 2019 14:24:38 GMT"
                },
                {
                    "text": "The new country house has <a href=\"https://en.wikipedia.org/wiki/Geothermal_heat_pump\">geothermal heating and cooling</a>, which is something I didn't know existed until I found this house. It's supposed to be a lot less expensive. It uses electricity to move water around to transfer heat from or to a pool of underground water that's at a constant temperature of 55 degrees. In the summer, it's used to cool, in the winter to heat. Genius.",
                    "created": "Wed, 20 Mar 2019 14:24:23 GMT"
                },
                {
                    "text": "But just before the heat comes on it makes a very loud jarring sound, like a garage door slamming shut. It rocks the whole house. Wakes me up when I'm sleeping. There's no preparation for it, it just happens. It's basically not acceptable. I don't want to get used to it.",
                    "created": "Wed, 20 Mar 2019 14:22:36 GMT"
                },
                {
                    "text": "I've tried searching on the net for ideas about how noisy these things are supposed to be, and no one talks about this loud sound."
                },
                {
                    "text": "I have to find someone to come out and take a look, but I don't know how to search for someone who does maintenance on geothermal heating."
                },
                {
                    "text": "I love the idea, but this is not an acceptable situation. I may have to switch to conventional heating and cooling."
                },
                {
                    "text": "PS: An AirBnB I rented the week before had the same problem. It was worse because the heat was going on and off all the time. So it was garage door slamming all night nonstop. Needless to say I didn't stay there the full time I had reserved it.",
                    "created": "Wed, 20 Mar 2019 14:23:30 GMT"
                }
            ]
        }
    ]
}