{
    "text": "March 23",
    "created": "Sat, 23 Mar 2019 15:38:20 GMT",
    "name": "23",
    "subs": [
        {
            "text": "BTW, re yesterday's <a href=\"http://scripting.com/2019/03/22.html#a130119\">braintrust query</a> -- thanks to the readers of this blog, my mid-2011 MacBook Air is now <a href=\"https://github.com/scripting/Scripting-News/issues/112#issuecomment-475743963\">running</a> High Sierra. ",
            "created": "Sat, 23 Mar 2019 17:21:15 GMT",
            "type": "outline"
        },
        {
            "text": "There was a moment that press coverage of the Vietnam War turned the corner, when Walter Cronkite stopped reporting on Defense Dept press releases and started telling the truth, that the war was <a href=\"https://www.youtube.com/watch?v=Dn2RjahTi3M\">unwinnable</a>.",
            "created": "Sat, 23 Mar 2019 16:48:59 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=Dn2RjahTi3M"
        },
        {
            "text": "Morning drive notes",
            "created": "Sat, 23 Mar 2019 15:38:21 GMT",
            "type": "outline",
            "description": "After so much repetitive drivel, finally someone who knows the subject, who's had some time to process, is laying it out, and they have to cut her off? ",
            "subs": [
                {
                    "text": "I just drove back upstate from the city, listened to two hours of NPR. They had a jerk talk nonsense about the Mueller report, about how it exonerates Trump. They just let him go on and on, never interrupting to say hey you're full of shit. Then an hour later they had <a href=\"https://en.wikipedia.org/wiki/Jill_Wine-Banks\">Jill Wine-Banks</a> and she was making so much sense, but they had to cut her off mid-sentence to go to an interview with a musician. This radio listener was pissed. After so much repetitive drivel, finally someone who knows the subject, who's had some time to process, is laying it out, and they have to cut her off?  ",
                    "created": "Sat, 23 Mar 2019 15:38:29 GMT",
                    "image": "http://scripting.com/images/2019/03/23/forester.png"
                },
                {
                    "text": "Meanwhile, whatever the Mueller report says or doesn't say, we all witnessed his obstruction of justice in the <a href=\"https://www.nbcnews.com/nightly-news/video/i-was-going-to-fire-comey-anyway-trump-tells-lester-holt-in-interview-941538371971\">interview</a> with Lester Holt, and if you saw his press conference in <a href=\"https://www.youtube.com/watch?v=cwxqOoIyWm0\">Helsinki</a>, you understand that Trump is controlled by Putin. We don't need a report to tell us any of that. If journalism is writing the first draft of history why aren't they writing that? ",
                    "created": "Sat, 23 Mar 2019 15:39:28 GMT"
                },
                {
                    "text": "PS: I tried listening to this morning's <a href=\"https://www.nytimes.com/2019/03/22/podcasts/the-daily/mueller-report-russia-investigation.html\">Daily podcast</a> about the Mueller announcement, and realized finally that <a href=\"https://www.nytimes.com/by/michael-s-schmidt\">their reporters</a> are really dull. They don't find this stuff interesting, they just namedrop and repeat bullshit they heard somewhere as gospel. ",
                    "created": "Sat, 23 Mar 2019 15:50:00 GMT"
                }
            ]
        }
    ]
}