{
    "text": "March 31",
    "created": "Sun, 31 Mar 2019 13:25:20 GMT",
    "name": "31",
    "subs": [
        {
            "text": "One final (hopefully) comment about <a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+%22the+correspondent%22&t=h_&ia=web\">TheC</a>. There’s too much insiderism in news about the future of news. It was not a “message discipline” issue, it was pure snake oil. Deceived a lot of fans of news who were hoping for more honesty. What they got was the opposite.",
            "created": "Sun, 31 Mar 2019 19:11:21 GMT",
            "type": "outline"
        },
        {
            "text": "I recently got a new <a href=\"https://www.amazon.com/gp/product/B0798B2L5H/ref=ppx_yo_dt_b_asin_title_o04_s00?ie=UTF8&psc=1\">65-inch TCL/Roku</a> TV. Love the picture except everything looks like a soap opera. Then I remembered there was a setting that makes it look this way. Tom Cruise did a <a href=\"https://twitter.com/TomCruise/status/1070071781757616128\">video</a> about it. It all comes back. I looked up <a href=\"https://www.pcmag.com/article/365402/how-to-turn-off-motion-smoothing-on-your-tv\">how to change</a> it back to normal, and now everything looks good and right.",
            "created": "Sun, 31 Mar 2019 19:00:48 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/TomCruise/status/1070071781757616128"
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1112350498106023936\">Poll for journalists</a>: If a friend of yours did something that wasn't good for your readers, would you call them out for it, or would you let it pass to preserve the friendship.",
            "created": "Sun, 31 Mar 2019 13:46:57 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1112350498106023936"
        },
        {
            "text": "Wi-Fi rules!",
            "created": "Sun, 31 Mar 2019 13:25:21 GMT",
            "type": "outline",
            "description": "Wi-Fi has resisted the power of BigCo's to usurp open standards and it's made a lot of fun things possible.",
            "subs": [
                {
                    "text": "It's not often that open standards resist the power of BigCo's to usurp them, but one of them has, and it's made a lot of fun things possible. It's the wonderful ubiquitous international <a href=\"https://en.wikipedia.org/wiki/Wi-Fi\">Wi-Fi</a>.",
                    "created": "Sun, 31 Mar 2019 13:25:29 GMT",
                    "image": "http://scripting.com/images/2019/03/31/rokuRemote.png"
                },
                {
                    "text": "I have a story to tell about that today. ",
                    "created": "Sun, 31 Mar 2019 13:26:06 GMT"
                },
                {
                    "text": "I'm setting up the entertainment system at the country house. It's fun to start over in 2019, because so much has changed for the better since the last time I did it in 2010. ",
                    "created": "Sun, 31 Mar 2019 13:26:15 GMT"
                },
                {
                    "text": "When I went to the Spectrum <a href=\"https://www.spectrum.com/locations/ny/kingston/142-schwenk-dr\">store</a> in Kingston, I realized I had a problem. The place that the cable entered the house was far from the TV room. I mentioned this to the guy behind the counter and he said no worries, don't use the cable set-top box. Use <a href=\"https://en.wikipedia.org/wiki/Roku\">Roku</a> over Wi-Fi. Ohhh. Of course I had Roku, and was coming to use it more and more over time. I said what about all the channels I'm paying Spectrum for. Use the Spectrum app on the Roku. I wondered if the quality would be as good as the hard wire coming straight from Spectrum. He said it would be better and said that's how he does it at home. ",
                    "created": "Sun, 31 Mar 2019 13:26:52 GMT"
                },
                {
                    "text": "Well I have it set up now, and the quality is great. And I also set up my Apple TV on the same wifi network as the Roku, and that's when it hit me. <i>They're compatible. </i>I'm sure the two companies wish they weren't but the power of Wi-Fi as a standard is impossible to resist.",
                    "created": "Sun, 31 Mar 2019 13:29:39 GMT"
                }
            ]
        }
    ]
}