{
    "text": "What we need from news orgs re fake news",
    "created": "Fri, 13 Jul 2018 17:52:14 GMT",
    "type": "outline",
    "description": "I have an idea of how we can collaborate to make news work in an open network environment. We need leadership from news orgs to make it work. And it won't happen quickly, it must be iterated and evolve. ",
    "subs": [
        {
            "text": "Here's a timeline.   ",
            "created": "Fri, 13 Jul 2018 17:57:36 GMT",
            "flNumberedSubs": "true",
            "subs": [
                {
                    "text": "Each news org should produce a list of news orgs they feel produce news that's not fake. Each should use whatever criteria they feel is right. Publish the list.",
                    "created": "Fri, 13 Jul 2018 17:52:25 GMT"
                },
                {
                    "text": "Evolve the lists over time. This problem is not going to be solved overnight. The process will take years to sort out. In the process we will learn a lot. If it works, it will transform news to make it much more useful because it's online and not print. ",
                    "created": "Fri, 13 Jul 2018 17:53:55 GMT"
                },
                {
                    "text": "Techies, both companies and individuals, will build news products based on the feeds. For example, Facebook might offer a choice of news selected by different news orgs. An open source group could create software that flows Twitter-like news feeds from the lists. ",
                    "created": "Fri, 13 Jul 2018 17:54:10 GMT"
                },
                {
                    "text": "This will become competitive. Some pubs lists will fall out, others will rise to the top. There will be surprises. ",
                    "created": "Fri, 13 Jul 2018 17:54:50 GMT"
                },
                {
                    "text": "Include blogs in the list, blogs that cover territory that you cover. For example, the NYT would include bloggers who cover neighborhoods. Tech pubs would include tech bloggers.",
                    "created": "Fri, 13 Jul 2018 17:53:06 GMT"
                },
                {
                    "text": "Include your entire news flow in your list. Amazingly some news orgs do not have a comprehensive list of every news article they publish in reverse-chronologic order. ",
                    "created": "Fri, 13 Jul 2018 17:55:13 GMT"
                },
                {
                    "text": "You may choose to make your list a feature of your news site. You may also use other organizations lists as a feature on your news site.  ",
                    "created": "Fri, 13 Jul 2018 17:55:56 GMT"
                },
                {
                    "text": "Let's discuss our experiences at a future-of-news conference. After a few months' experience we should be ready to learn from each other. ",
                    "created": "Fri, 13 Jul 2018 17:56:59 GMT"
                },
                {
                    "text": "This is not something tech companies can do for you. People whose work is producing news should come up with ideas for figuring out what is and isn't reliable news.",
                    "created": "Fri, 13 Jul 2018 17:58:04 GMT"
                },
                {
                    "text": "The canonical \"fake news\" site, Infowars, will of course produce their own list of reliable feeds. Totally valid. People who want to be informed by them may choose to do so. ",
                    "created": "Fri, 13 Jul 2018 17:58:36 GMT"
                }
            ]
        }
    ]
}