{
    "text": "I love this <a href=\"https://sports.yahoo.com/nba/article/timberwolves-thunder-anthony-edwards-is-dealing-with-the-superstars-dilemma-against-okc-how-will-he-respond-150142061.html\">piece</a> about Anthony Edwards and how the OKC's guard against him by double-teaming, so he can't have the ball, and that allows them to steal the ball more often from other Minnesotan ball-handlers, and also limits Edwards opportunities to shoot, but it does make it more <i>possible</i> for others on the team to shoot. If he does his job, the pundits and fans say he's slumping (low points). But he's just doing his job. Same thing, flipped around -- when they say Brunson is scoring so many points, he's doing great, like LeBron or Kobe, but actually it's a sign the team is fucked up. Too dependent on one offensive player, the others are just standing around in case he wants to pass it to them. I exaggerate, but it does work out that way. What you want is a team where there are always lots of options, and to the extent that they're hot, the team is impossible to defend. But a Brunson holding the ball all the time makes it easier to beat the Knicks? That was (as I've said a few times) the problem with Melo. Now we've <i>seen</i> the non-Brunsons on the Knicks kick ass. If the Knicks don't make it past this round, and it is it seems pretty likely -- next season they should focus on configurations that have to sink or swim based on whether they can win without Brunson. Then, next year, we'll have something, perhaps. But I'm just a fan, seriously, no sarcasm. Same way I'm a fan of AI, I have no idea how it works, and I'm happy with that. And don't tell me it's like auto-complete, try using it for a while for real stuff, and tell me how you know that from using it. You don't. Each system has quirks that you have to learn the same way you have to learn the quirks of team members, and help them do stuff they're good at, so they can handle the ball and take shots without you getting involved. That's how you start to get teamwork. See how that works kind of like basketball? :-)",
    "created": "Wed, 28 May 2025 15:44:41 GMT",
    "type": "outline",
    "image": "https://imgs.scripting.com/2024/02/13/commanderDataStarTrek.png",
    "flInCalendar": true
}