{
    "text": "And btw, that's why I <a href=\"http://scripting.com/2025/05/21.html#a135615\">wanted</a> Chris Lydon to do interviews with people in his <a href=\"https://radioopensource.org/\">audience</a> who are tripping out on all the new power they're getting from AI. How is it augmenting their work? I know Chris well enough that he probably thinks it's not for him, too technical -- but that's the point -- the excitement with AI is not technical. That's the story all the other reporters are missing. It's the light in the users' eyes when they struggle to make you understand why it's the most incredible thing ever and they're so glad to have lived to see this. <i>That's</i> the freaking story. Help them get the ideas through. BTW, we have no idea how AI will rock our boat, we never did for other similar inventions. Who knew what the Beatles would lead to when they <a href=\"https://en.wikipedia.org/wiki/The_Beatles%27_1964_North_American_tour\">came to America</a>. They said (the Beatles did, with ridiculous humility) that they expected their fame will last a few years at most. PCs a few years later were supposed to be for the kitchen. Apple actually <a href=\"https://imgs.scripting.com/2025/05/28/appleKitchenComputer.png\">ran ads</a> saying that in the late 70s. And the web? Well Chris was around near the beginning of that and knows how our eyes glazed over at the utopia we were envisioning, and we know, to some extent how all that <a href=\"https://en.wikipedia.org/wiki/Donald_Trump#First_presidency_(2017%E2%80%932021)\">turned</a> <a href=\"https://en.wikipedia.org/wiki/Acquisition_of_Twitter_by_Elon_Musk\">out</a>. The AI story is a great one, and as Chris had very little understanding of blogs when he did the series of podcasts in 2003 and 2004 that should win the Pulitzer Prize for being so presicent and courageous, he's the right guy to get this story, if he has the patience and stamina. This is the <a href=\"http://scripting.com/2025/05/22/214121.html\">story</a>. Sure you <i>have</i> to cover Harvard v Trump but AI is a story of love from the users and that story hasn't been told yet, and it's a big one, like what were the Beatles for and why, in <a href=\"https://en.wikipedia.org/wiki/The_Beatles%27_1964_North_American_tour\">1964</a>. ",
    "created": "Wed, 28 May 2025 15:55:46 GMT",
    "type": "outline",
    "image": "https://imgs.scripting.com/2024/02/08/woodstock.png",
    "flInCalendar": true
}