{
    "text": "Google's crawl-less index",
    "created": "Sat, 11 Jan 2020 16:00:34 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I got an email from <a href=\"https://seths.blog/\">Seth Godin</a> asking for clarification of <a href=\"http://scripting.com/2020/01/10.html#a154129\">one</a> of yesterday's mini-posts about how Google can index the web without crawling.",
            "created": "Sat, 11 Jan 2020 16:01:03 GMT"
        },
        {
            "text": "Doc said that Google and Bing are doing an increasingly bad job of archiving the history of the web. When he looks for something he wrote 20 years ago, the search engines can't reliably find it. He also said they're not indexing the current web like they used to. He experiences it thus: Google can't find one of his recent posts, but then after he visits it, presumably in Chrome, it can. ",
            "created": "Sat, 11 Jan 2020 16:02:48 GMT"
        },
        {
            "text": "From this I conclude:",
            "created": "Sat, 11 Jan 2020 16:03:39 GMT",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "Google isn't crawling his site. In the past it would check frequently updated pages, such as blogs, every few minutes, for new links. On discovering one, it would read it, add it to their index, and then it would be findable in Google. ",
                    "created": "Sat, 11 Jan 2020 16:04:27 GMT"
                },
                {
                    "text": "But when he visits one of those pages in Chrome, then, a few minutes later it can be found in the search engine. It appears to be using Doc's human behavior to find new pages to index. They can do this now because they have a popular web browser, so they can retire their old method of discovering links and let the users do their crawling. ",
                    "created": "Sat, 11 Jan 2020 16:05:22 GMT"
                }
            ]
        },
        {
            "text": "My own experience. For what it's worth, I've found that Google is still really good at finding my old stuff, as long as there are some good unique words I can search for. If I <a href=\"https://www.google.com/search?q=site%3Ascripting.com+%22future-safe+archives%22&rlz=1C5CHFA_enUS743US747&oq=site%3Ascripting.com+%22future-safe+archives%22&aqs=chrome..69i57j69i58.9495j0j3&sourceid=chrome&ie=UTF-8\">search</a> for \"future-safe archives\" for example, it gives me back a really good set of results. But the other day I was trying to find something I wrote about Obama and his online social net he let dwindle after the 2008 election, and although I believe I wrote about this a number of times, I could only find one piece, by going to the January 2009 archive page and scanning it with my eyes. ",
            "created": "Sat, 11 Jan 2020 16:07:07 GMT"
        },
        {
            "text": "Caveat: This is all based on tea-leave reading. Neither of us have any insight into what Google is actually doing to maintain its index. ",
            "created": "Sat, 11 Jan 2020 16:20:33 GMT"
        }
    ]
}