{
    "text": "Naughton on Facebook",
    "created": "Sat, 11 Jan 2020 18:07:43 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "<a href=\"https://memex.naughtons.org/archives/2020/01/10/28373\">John Naughton wrote</a> briefly about the difference between Facebook the company and Facebook the billion-user network. There aren't many people in journalism who see this dichotomy. He wrote to say he had a similar experience on the rail in the UK, viewing the backs of people's houses and wondering what their lives were like. ",
            "created": "Sat, 11 Jan 2020 18:07:53 GMT",
            "subs": [
                {
                    "text": "<i>I often do that when travelling by train in the UK in the dark, because British towns always turn their (unadorned, unguarded) backs to the railway while keeping their (brushed and spruced) fronts for the street or the road.</i>",
                    "created": "Sat, 11 Jan 2020 18:13:11 GMT"
                }
            ]
        },
        {
            "text": "It's hard for those of us who predate Facebook to not feel challenged by it and even to reject it. But it is what it is. The open web didn't organize the world, Facebook did. I wish it were otherwise, of course. ",
            "created": "Sat, 11 Jan 2020 18:09:36 GMT"
        },
        {
            "text": "Ignoring Facebook as a technology base that we'll build on in the future, would be like refusing to listen to the Beatles in the 60s. You could do it, but if you were a musician or any kind of artist really, you'd be missing a common language that all your users understand. You'd be ignoring an important tool."
        },
        {
            "text": "The real platform is the minds of all the people. ",
            "created": "Sat, 11 Jan 2020 18:14:06 GMT"
        },
        {
            "text": "There's a book I read 30 years ago that opened my eyes to this -- <a href=\"https://www.amazon.com/Marketing-Warfare-Military-Principles-Strategies/dp/0886840821\">Marketing Warfare</a> by Ries and Trout. ",
            "created": "Sat, 11 Jan 2020 18:14:15 GMT"
        },
        {
            "text": "People don't understand this \"battleground as the minds of the users\" idea is why people don't grok Bloomberg. He really gets it and has the resources to develop all this virgin territory that I'm sure he understands every bit as well as Trump or Murdoch. ",
            "created": "Sat, 11 Jan 2020 18:10:26 GMT"
        }
    ]
}