{
    "text": "Should tech run the world?",
    "created": "Fri, 03 Oct 2025 14:59:20 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "With all respect to the tech industry -- why is the traffic in the Bay Area so awful. Why haven't they done anything about it. ",
            "created": "Fri, 03 Oct 2025 14:59:31 GMT",
            "flInCalendar": true
        },
        {
            "text": "Wouldn't that be a good test before running the whole world? As programmer myself, I wouldn't trust the algorithm without a lot of <a href=\"https://en.wikipedia.org/wiki/Quality_assurance\">QA</a>. Seriously. Think about it",
            "created": "Sat, 04 Oct 2025 00:42:07 GMT",
            "flInCalendar": true
        },
        {
            "text": "It's the strangest configuration for a metropolitan area, the center of the city is in the middle of <a href=\"https://imgs.scripting.com/2025/10/03/bayAreaMap.png\">the bay</a>. (Same as Seattle, btw.)",
            "created": "Fri, 03 Oct 2025 15:00:57 GMT",
            "flInCalendar": true
        },
        {
            "text": "The best answer the tech industry came up with was Uber, as far as I know.",
            "flInCalendar": true
        },
        {
            "text": "I lived in Palo Alto, Mountain View, Menlo Park, Berkeley, Los Gatos and Woodside over 31 years and I did nothing to fix the problem either. My answer was to move to NYC where the transit system is pretty great. Then I moved to the mountains and got a <a href=\"https://daytona.scripting.com/search?q=tesla\">Tesla</a>. ",
            "created": "Fri, 03 Oct 2025 14:59:34 GMT",
            "flInCalendar": true
        },
        {
            "text": "BTW, the idea that the stars of Silicon Valley should run the world is not new. I first heard about it from Apple top level managers in the 1980s. They were not techno-fascists, but they did hugely overestimate what it takes to run the world, or even a small country in Africa. ",
            "created": "Fri, 03 Oct 2025 14:59:35 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}