{
    "created": "2023-07-02T04:00:00.000Z",
    "flInCalendar": true,
    "name": "02",
    "path": "2023/07/02",
    "text": "July 02",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I'm starting to think about writing a validator for the W3C's feed validator. A validator-validator. I'd submit my feed to it via a web service (not sure if they have an API), and if that feed doesn't validate with the W3C validator, and we believe it is valid per the RSS 2.0 spec, we would open an issue on their repo. Maybe if they want to be really cooperative, they could run the test feeds against their validator whenever they make an update as part of the validation process, and never release a version where those feeds didn't validate. This would <a href=\"https://en.wiktionary.org/wiki/allay\">allay</a> my concern about them breaking RSS because they don't respect or understand the <a href=\"https://cyber.harvard.edu/rss/rss.html#roadmap\">RSS 2.0 roadmap</a>. I'd start with the Scripting News RSS feed, which <a href=\"https://validator.w3.org/feed/check.cgi?url=http%3A%2F%2Fscripting.com%2Frss.xml\">does validate</a> at <a href=\"http://scripting.com/images/2023/07/02/validation.png\">this time</a>. BTW, their warnings are bogus imho. They should recognize the <a href=\"http://source.scripting.com/\">Source namespace</a> not warn me about it. A copyright statement can and should be able to have a &copy; character. Why not? The spec doesn't prohibit it, and it's part of the language we use for copyright. And this is not an Atom feed so that warning about Atom was a bad move. The authors of the original validator were promoting Atom at the expense of RSS. Why not put that to bed, it's not exactly an ethical thing for a validator to do imho. ",
            "created": "Sun, 02 Jul 2023 15:23:13 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2023/07/02/validRss.png",
            "flInCalendar": true
        },
        {
            "text": "Too. Much. Rain. ",
            "created": "Mon, 03 Jul 2023 02:51:09 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://github.com/scripting/feedlandSupport/issues/208\">New FeedLand gesture</a>. It was a complicated gesture to see all the text of a too-long-to-fit item in FeedLand. Then it hit me, just click on the freaking text to make it bigger and then click again to make it small again. Much easier to do, and what else would a click mean?? Here's a quick <a href=\"https://www.youtube.com/watch?v=qCLIuN9Rl8s\">video demo</a>. ;-)",
            "created": "Sun, 02 Jul 2023 16:03:37 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=qCLIuN9Rl8s",
            "image": "https://imgs.scripting.com/2020/05/25/strongman.png",
            "flInCalendar": true
        },
        {
            "text": "To say there will be no programmers in 5 years is as ludicrous as saying there will be no email users in 5 years, because an AI chatbot can write email.",
            "created": "Sun, 02 Jul 2023 16:21:44 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "There was no place to post comments or questions about the <a href=\"http://source.scripting.com/\">Source namespace</a>. So I <a href=\"https://github.com/scripting/sourceNamespaceComments/issues\">created a place</a> and linked to it <a href=\"http://source.scripting.com/#1688308949000\">from the spec</a>. ",
            "created": "Sun, 02 Jul 2023 14:44:19 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Over on Masto and Blueski you hear a lot of people rooting for Twitter's demise. I am not one of them.Twitter is deeply installed in our society. It would take a long time to rebuild something like Twitter, and I don't think it's even possible. I don't like Musk's politics, an understatement, but I see that problem as possible to overcome. ",
            "created": "Sun, 02 Jul 2023 14:38:07 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1675501431007203328",
            "flInCalendar": true
        },
        {
            "text": "This is a test. I realized something, ever since \"FeedLand\" moved to email identity and therefore had to use HTTPS to protect the passwords, any time I include an image in the right margin of a blog post, it has to also be served by HTTPS or else the browser will refuse to load it when the item is viewed in FeedLand. It has probably also meant that the right-margin images weren't showing up in other RSS systems for much longer. So anyway, if you see the delicious <a href=\"https://imgs.scripting.com/2010/11/12/loveRss.gif\">Love RSS icon</a> in the right margin of this post in FeedLand that means I've found a workaround that <a href=\"http://scripting.com/images/2023/07/02/itWorked.png\">works</a>. My writing life gets more complicated. I guess it's worth it?",
            "created": "Mon, 03 Jul 2023 03:09:07 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2010/11/12/loveRss.gif",
            "flInCalendar": true
        }
    ]
}