{
    "created": "2023-07-06T04:00:00.000Z",
    "flInCalendar": true,
    "name": "06",
    "path": "2023/07/06",
    "text": "July 06",
    "type": "calendarDay",
    "subs": [
        {
            "text": "<a href=\"http://scripting.com/2023/07/06/threadsRollout.m4a\">Podcast</a>: Thoughts re the Threads rollout. And respect for Elon Musk in a limited way, reminds me of Philippe Kahn. 20 minutes. ",
            "created": "Thu, 06 Jul 2023 15:34:23 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2023/07/06/threadsRollout.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "9943936",
            "flInCalendar": true
        },
        {
            "text": "Twitter isn't going away. What we should hope for is they start adding stuff to Twitter that users really like. And that'll force Facebook to do it too. As a result technology moves forward. One-party systems stagnate as we've seen.",
            "created": "Thu, 06 Jul 2023 19:07:04 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The discussion about Threads is happening on Twitter. In a sense nothing has happened until links to Threads posts show up here. It's an almost zero-interop system at this point.",
            "created": "Thu, 06 Jul 2023 15:46:39 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Actually you can embed posts in HTML pages (<a href=\"https://fruitsalad.lucky.wtf/embedfrombluesky.html\">example</a>), but that's about it. <s>You can't even link to individual posts or threads. Or if you can, I haven't seen any.</s> You can also link to individual posts, <a href=\"https://www.threads.net/t/CuVhc4xpYZS/\">example</a>. ",
            "created": "Thu, 06 Jul 2023 15:50:15 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Must have browser interface",
            "created": "Thu, 06 Jul 2023 14:22:46 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Chip Bayers, my editor in the good old days at Wired, <a href=\"https://twitter.com/chipbayers/status/1676794017244143617\">says</a> they shipped too soon. I've said the same. ",
                    "created": "Thu, 06 Jul 2023 13:07:01 GMT",
                    "type": "outline",
                    "flInCalendar": true
                },
                {
                    "text": "One thing they reallllly need is a browser interface, so it can exist on the same plane as the other social nets. I can't paste links back and forth between their network and others. even at that primitive level of interop, it doesn't exist. ",
                    "created": "Thu, 06 Jul 2023 14:23:36 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "On Twitter I'm able to write fluidly esp now that the character limit is just a speed bump. I've never felt in any way like writing on a phone was writing. ",
                    "created": "Thu, 06 Jul 2023 14:23:48 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The big picture is no one gets that these tools are writing environments. so they design them to have features writers can use.  ",
                    "created": "Thu, 06 Jul 2023 14:23:55 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Facebook is not attractive",
            "created": "Thu, 06 Jul 2023 14:06:46 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Earlier, I started to write about how boring, sad, depressing and unnecessary Threads is. How pathetic Zuck is. How I visualize the process that led to this product as being a combination of the TV series Succession and Silicon Valley. Facebook is desperately trying to become anything but Facebook. I like Facebook as a community. I have friends there who I would never talk with if it weren't for Facebook. I hope they keep running it. But I wish the company behind it would stop demanding attention because they are so completely unattractive. And btw, I can't get into writing on an iPhone. I write at a desk, or maybe occasionally a tablet. Everything about this product pushes me away. Maybe that'll change, maybe the people who are trying to get ahead on Threads will think up some new use for social networks that will justify using it. ",
                    "created": "Thu, 06 Jul 2023 12:52:50 GMT",
                    "type": "outline",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Will Threads prevail? If so, then?",
            "created": "Thu, 06 Jul 2023 13:41:51 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Some of my friends think that Threads is enough, and once they fill in some missing features it will suck the life out of Twitter.",
                    "created": "Thu, 06 Jul 2023 13:41:58 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "They might be right. Hard to argue.  ",
                    "created": "Fri, 07 Jul 2023 02:35:32 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "All I want is a playground with an open API and enough creative users to try out new ideas from developers.",
                    "created": "Fri, 07 Jul 2023 02:35:40 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I want to go back to the pace of innovation we had going in the 90s and 00s. The big platforms snuffed all that out, corralled it and kept it in some too-restrictive bounds. Did what BillG failed to, locked us in the trunk and cut off the air supply. ",
                    "created": "Fri, 07 Jul 2023 02:25:48 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "That some of these people were the most fervent advocates for open platforms says that maybe those beliefs ran pretty thin, and the opportunity to cash it out for billions made it worthwhile.",
                    "created": "Fri, 07 Jul 2023 02:35:58 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Maybe we'll just be hobbyists. I'm okay with that. Or maybe people are will to pay good money to sustain creative development.",
                    "created": "Fri, 07 Jul 2023 02:36:32 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I don't expect that to be possible on Facebook's new network. ",
                    "created": "Fri, 07 Jul 2023 02:36:42 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}