{
    "created": "2023-07-12T04:00:00.000Z",
    "flInCalendar": true,
    "name": "12",
    "path": "2023/07/12",
    "text": "July 12",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Braintrust query: <a href=\"https://github.com/scripting/Scripting-News/issues/263\">Do you use an external editor with WordPress?</a>",
            "created": "Wed, 12 Jul 2023 13:13:49 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Facebook hasn't done anything to support the open web. All they've done is put it in a press release and post an email to a mail list. It's a long road from there to being on the open web. More likely they're going to use the open web and leave it a <a href=\"https://en.wikipedia.org/wiki/List_of_Superfund_sites\">toxic</a> <a href=\"https://en.wikipedia.org/wiki/Google_Reader\">waste site</a> after they leave.",
            "created": "Wed, 12 Jul 2023 12:42:57 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "If Facebook really loved the open web they'd hook Facebook itself up to it. Support RSS feeds in and out. Let users have rich text and links. Basically support \"textcasting\" proposal.",
            "created": "Wed, 12 Jul 2023 21:19:01 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "When I was a grad student, in the <a href=\"https://en.wikipedia.org/wiki/1977\">middle</a> of the last century, there were two kinds of terminals in the computer lab, ones that could only display uppercase characters, and the coveted <a href=\"https://en.wikipedia.org/wiki/Hazeltine_1500\">Hazeltine</a> terminals that could do also do lowercase. A real luxury item. I feel the same way as we approach the middle of the next century when I get to use boldface text or a bit of italic in a tweet. I laughed out loud when some text I pasted from my blog went through with its boldness intact. We have a long way to go to <a href=\"http://textcasting.org/\">get back</a> where we were. ",
            "created": "Wed, 12 Jul 2023 12:33:00 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2020/12/27/wall-e.png",
            "flInCalendar": true
        },
        {
            "text": "I've seen people use the term \"social web\" where previously they'd say \"social media.\" I like this. Going in the right direction. Let's try to bring everything back to the web. I bet most people who use the web these days only have a vague idea of what it is. ",
            "created": "Wed, 12 Jul 2023 11:17:06 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I was just filling out a form that asked for my social media addresses and noticed how I don't remember how to specify the addresses for Bluesky, Mastodon and LinkedIn. I had no trouble with Twitter and Threads, though I have a lot of trouble remembering the name of Threads. I think Bluesky is headed in the right direction, by letting people specify a domain name. A service that made this a bit easier for non-technical users could help here. ",
            "created": "Wed, 12 Jul 2023 11:15:22 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}