{
    "created": "2023-07-19T04:00:00.000Z",
    "flInCalendar": true,
    "name": "19",
    "path": "2023/07/19",
    "text": "July 19",
    "type": "calendarDay",
    "subs": [
        {
            "text": "<a href=\"http://scripting.com/2023/07/19.html\">Today</a> is <i>Journalism is Stupid Day</i> here on \"Scripting News\".",
            "created": "Wed, 19 Jul 2023 13:51:15 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I was reading yet another article that says my contribution to podcasting was adding the enclosure element to RSS. These people are beyond stupid. Why don't they take a minute to think about how you develop a new medium. Is it done by adding a few sentences to a spec? I don't think so. You get an idea, in this case it came from Adam Curry (thanks) and start figuring out how it will work. Then you make the software for both publishing and listening, and then publish Grateful Dead music, thinking all the people will now figure it out but they don't. So you try something else and another thing, and you give up for a while. Then you meet an NPR guy and ask him if he wants to try this idea out. For some reason he says yes, when everyone else said no or didn't listen. So you get that going, and it's great and for sure you figure now everyone will get it, but they don't. So a year later in frustration you decide to put out your own show, and do it again and again, and leave the freaking mistakes in, and because of that people get the idea that Hey if that schmuck can do it, I bet I can too, and 20 or 30 people start doing it, and it's fun, and from there, it builds and after four years you have the start of a new medium. And no that idiot journalist did not give this new medium its name. Only a total idiot would think that, which is something I get to say out loud on <i>Journalism is Stupid Day. </i>:smile:",
            "created": "Wed, 19 Jul 2023 13:51:28 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2023/02/11/pullingHair.png",
            "flInCalendar": true
        },
        {
            "text": "But <i>everyone</i> already knows journalism is stupid, so why make a big deal about it today. Because the value of Bluesky has nothing to do with moderation. You can see how dull and lifeless and <a href=\"https://en.wikipedia.org/wiki/Disneyfication\">disneyfied</a> a perfectly moderated social network is. Look at that new bullshit thing Facebook just came out with. It's really Instagram, that's how they got all their users so fast by just getting them to <a href=\"http://scripting.com/images/2023/07/19/jumpThroughHoopDialog.png\">jump</a> through another hoop. You can stop reporting that it set records. They just came up with a new design and name for Instagram and said it was setting records, knowing that the reporters were bored of hating Zuckerberg, and now were ready to say he's cool again because he is trying to embarrass the <i>Asshole Du Jour</i> for journalists everywhere, Elon Musk. The thing you should say about Bluesky is that it's freaking nice that these people made a nice UI and backend for the social web and give it away for nothing. Yay Bluesky for believing in all of us. And come on if you think moderation is so great and you think it can be done for free, why don't you volunteer to do it. Yeah I didn't think so. ",
            "created": "Wed, 19 Jul 2023 14:09:24 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2023/01/13/maude.png",
            "flInCalendar": true
        }
    ]
}