{
    "created": "2023-07-20T04:00:00.000Z",
    "flInCalendar": true,
    "name": "20",
    "path": "2023/07/20",
    "text": "July 20",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I needed a nice little warmup project, maybe I'm finally getting productive away from my desktop. It's a little thing I call Sally's Reader. Not a big deal. Here's the <a href=\"https://github.com/scripting/Scripting-News/issues/264\">writeup</a>. And here's <a href=\"http://scripting.com/code/sallyreader/\">the app</a>. ",
            "created": "Thu, 20 Jul 2023 16:01:14 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "APIs of the 2020's",
            "created": "Thu, 20 Jul 2023 13:26:27 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Interesting <a href=\"https://prodromou.pub/@evan/110045336289311841\">thread</a> by <a href=\"https://en.wikipedia.org/wiki/Evan_Prodromou\">Evan Prodromou</a>, one of the originators of <a href=\"https://en.wikipedia.org/wiki/ActivityPub\">ActivityPub</a>. He says basically everyone should get behind it and stop inventing new formats and protocols for the federated social web. ",
                    "created": "Thu, 20 Jul 2023 11:06:08 GMT",
                    "image": "https://imgs.scripting.com/2022/03/02/roomFreshener.png",
                    "flInCalendar": true
                },
                {
                    "text": "Without any judgment, it seems to me that ActivityPub should have started with RSS 2.0, building whatever new features they needed on top of it. But they didn't. I don't know why. We were going down that path, but then one day I saw that all the people I was collaborating with were meeting with Google and out of that came a completely incompatible protocol, which I believe became ActivityPub. Not sure, because they seemed more interested in reinventing what already worked than trying to build as much <a href=\"http://scripting.com/2021/12/16/153331.html?title=myProductIsInterop\">interop</a> as possible. ",
                    "created": "Thu, 20 Jul 2023 13:27:03 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I really mean \"no judgment\" -- because this seems to happen in tech all the time. It's the knee-jerk reaction. People wanting to make a name for themselves, don't have a new idea, so they pretend that what already exists doesn't. Let the <a href=\"http://scripting.com/2023/07/19.html\">journalists</a> sort it out. ",
                    "created": "Thu, 20 Jul 2023 13:38:04 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Anyway, I think it's inevitable that there will be more protocols. There already are. So what will be needed is the <a href=\"http://scripting.com/2023/05/04/142200.html\">analog of the internet</a>, which bridged the differences between incompatible networks. I think at this point that's the best we can hope for. And in that spirit I offer the <a href=\"http://xmlrpc.com/metaweblog\">MetaWeblog API</a> which did that for blogs. Maybe for once we won't have to start over from scratch. I doubt it, but hope is still possible. ",
                    "created": "Thu, 20 Jul 2023 13:27:34 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "BTW, before you pat me on the head and thank me for \"fighting the good fight\" (which I hear as \"loser\") remember this one motto: You can fake caring but you can't fake showing up. Put some skin in the game. You've been sitting on the sidelines your whole life. If you think we can make the new network useful and fair and learn from our mistakes and experience, get in the middle. There's no point accumulating capital if you never spend it. Now is a good time to get involved. ",
                    "created": "Thu, 20 Jul 2023 11:15:07 GMT",
                    "type": "outline",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}