{
    "created": "2023-07-27T04:00:00.000Z",
    "flInCalendar": true,
    "name": "27",
    "path": "2023/07/27",
    "text": "July 27",
    "type": "calendarDay",
    "subs": [
        {
            "text": "My response to <a href=\"https://www.manton.org/2023/07/25/next-step-for.html\">Manton's response</a> to my open <a href=\"http://scripting.com/2023/07/24.html#a120846\">voicemail</a>. I agree with all you said, had discovered it on my own, quickly -- that I could build on Mastodon's docs (and did), but the ActivityPub maze of specs is not an API, and not something a busy developer can approach. It all has to be simplified. We're still far away from the dream. As I said in my open voicemail -- it's time for developers to do a <a href=\"http://scripting.com/davenet/2001/04/04/aBusyDevelopersGuideToSoap.html\">BDG</a> for the social web, with docs <i>and software, </i>that embraces not just Mastodon and other ActivityPub services, but also Bluesky, and WordPress, which has a very mature API, offers stability, a foundation with clear value.",
            "created": "Thu, 27 Jul 2023 13:19:57 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2021/11/06/poemsByYou.png",
            "flInCalendar": true
        },
        {
            "text": "In general, if there's a change in \"FeedLand\" or \"Drummer\", you want to be sure you're getting the latest client software. Normally the browser caches the code, but you can force it to get the latest versions. In Chrome/Mac with Cmd-Shift-R. Obviously it's different in different browsers. ",
            "created": "Thu, 27 Jul 2023 18:47:50 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I am now able to edit my blog on my desktop and my laptop in \"Electric Drummer\". My mind is now possibly on the path to sanity. One can hope. Four Drummers on two machines is at least two too many. ",
            "created": "Thu, 27 Jul 2023 16:31:05 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2023/07/27/colorfulBirdFromPixarMovie.png",
            "flInCalendar": true
        },
        {
            "text": "There was a problem in \"Sally's Reader\" that only showed up on some machines, having to do with <a href=\"https://en.wikipedia.org/wiki/Cross-origin_resource_sharing\">CORS</a> permissions. I think I've worked around it, so it should work everywhere, one hopes. ",
            "created": "Thu, 27 Jul 2023 16:58:27 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "As we are fond of saying in show business, this is a test. Had this been an actual emergency, well we would have found some other way of notifying you, because this is hardly the way to tell a fine person such as yourself about an emergency. I hope all is well with you and yours and have a nice day! :smile:",
            "created": "Thu, 27 Jul 2023 16:09:57 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Those are <a href=\"http://scripting.com/2023/07/26/124823.html\">Georgette Magritte's</a> beautiful eyes staring at you from the <a href=\"http://scripting.com/images/2023/07/27/georgetteMagritte.png\">header graphic</a> on \"Scripting News\".",
            "created": "Thu, 27 Jul 2023 13:23:14 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}