{
    "created": "2023-07-30T04:00:00.000Z",
    "flInCalendar": true,
    "name": "30",
    "path": "2023/07/30",
    "text": "July 30",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Today's margin images thanks to <a href=\"https://openai.com/research/dall-e\">DALL-E</a>. ",
            "created": "Sun, 30 Jul 2023 12:27:05 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://www.niemanlab.org/2023/07/if-other-media-companies-thought-about-brand-equity-the-way-elon-musk-thinks-about-twitters-er-xs/\">An interesting idea</a>, what if other companies changed their names to something as unbelievable as Twitter becoming X. I have a few things to say about that. First, I don't think that Twitter <i>has</i> changed its name, at least not yet. Reorienting all those memory cells in all those human brains isn't a matter of changing the logo on a home page or putting a big X on the roof of a San Francisco building. 17 years of repeated drill has burned the Twitter brand into our minds. Second, I don't think HBO changed its name to Max, in fact I think the new owners of HBO (and many other names) are preserving the value of the HBO name by taking it off the the streaming site, which is a hodgepodge of random content, some good, some not. HBO is a small part of that. Instead, they withdrew HBO from the set of popular streaming services, which are due for years of battle for dominance. Why drag the HBO name into that mess. It also may make it easier for them to spin HBO off, or sell it to another media conglomerate. I thought it was weird at first, but now it makes sense. ",
            "created": "Sun, 30 Jul 2023 11:14:08 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2023/07/30/birdAndHBO.png",
            "imageLink": "https://labs.openai.com/e/a7JxA183gjS8huwtywpolMUV/caQi7YPOqJGI7DY5TgNArEgn",
            "flInCalendar": true
        },
        {
            "text": "What Musk actually destroyed -- Twitter as the <a href=\"https://en.wikipedia.org/wiki/Vertex_(geometry)\">vertex</a> for a certain kind of news and discourse. Until late last year, almost everything I posted online would flow through Twitter. Today, very little does. Not by choice really, I'm not like other people who think that my not posting to a site has political meaning. It's more of a sense of \"does it belong there.\" It used to be that everything belonged there, that somehow it hadn't been said if it wasn't said on Twitter. That's a very recent and very fast change. It doesn't matter imho that Musk tries to change the name, what matters more is that he's given up on Twitter being <i>the</i> place of record. Kind of like what would happen if the US gave up on the dollar being the reserve currency. And of course people much like Musk are trying to make that happen. What if all this isn't a big mistake as people in the press seem to assume? What if more likely it's a plan being executed in front of our eyes. I think in general you should assume the latter, not that people you want to think are idiots actually are. ",
            "created": "Sun, 30 Jul 2023 11:33:48 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2023/07/30/twitterBirdOnGunTarget.png",
            "flInCalendar": true
        },
        {
            "text": "I drive a Tesla because it's a <a href=\"http://scripting.com/2023/01/11/182336.html\">great car</a>. No other reason. I have owned other great cars. I had an early 90s Miata. I've owned a bunch of BMWs of varying quality. My Model Y combines the feel and agility of the Miata with the intoxicating power of my 2007 BMW 535i. I've had the Tesla for 1.5 years and I still feel it's a privilege <i>every time I drive it. </i>That has never happened before, driving a great car usually becomes normal too fast. I pity people who are so one-dimensional that they think they understand everything about other people. I wouldn't want to be a relative of theirs, never would be a friend. ",
            "created": "Sun, 30 Jul 2023 11:39:23 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2023/07/30/tesla.png",
            "flInCalendar": true
        },
        {
            "text": "I used to be a fan of the <a href=\"https://www.google.com/search?q=site%3Ascripting.com+%22daily+podcast%22\">Daily podcast</a>, but something snapped, and now I see them as ignorant, lazy and overly self-important. I was disgusted by the premise of <a href=\"https://www.nytimes.com/2023/07/18/podcasts/the-daily/ai-scraping.html\">this bit</a>. I'm a writer too and I <i>want</i> the bots to index my work. It's how my ideas might get heard over their monopoly on the flow. Where did they get the idea that they speak for all writers? ",
            "created": "Sun, 30 Jul 2023 12:39:39 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Writing deserves its own app",
            "created": "Sun, 30 Jul 2023 12:32:35 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "BTW, for a few days I tried to do my blogging in \"Drummer\" as a web app, instead of as a standalone Mac app. Huge difference. I hated it. So I spent this last week reorganizing my file system so I could use my laptop to work and still use the app. In the last few days the difference is evident. I love writing again. I didn't like it if it had to fit in with all my other web stuff. Writing is different. It deserves its own app. For me it makes all the difference.",
                    "created": "Sun, 30 Jul 2023 12:30:21 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Buy em out! Shut em down!",
            "created": "Sun, 30 Jul 2023 10:51:29 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "At my first company, Living Videotext (aka LVT), we had a lot of slogans, some of which have become famous.",
                    "created": "Sun, 30 Jul 2023 10:51:33 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Others -- not so much.",
                    "flInCalendar": true
                },
                {
                    "text": "Like this: \"Buy em out, shut em down!\"",
                    "created": "Sun, 30 Jul 2023 10:51:41 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It's what we'd say to insult a competitor. ",
                    "created": "Sun, 30 Jul 2023 10:54:58 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It was pure bluster. But fun!?",
                    "created": "Sun, 30 Jul 2023 10:55:09 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The idea was we were so rich (we weren't) that we could buy our most offensive competitor just to get rid of them.",
                    "flInCalendar": true
                },
                {
                    "text": "We'd talk that way about IBM, Lotus, etc.",
                    "flInCalendar": true
                },
                {
                    "text": "Just before hopping on the <a href=\"https://en.wikipedia.org/wiki/Red-eye_flight\">red-eye</a> to <a href=\"https://en.wikipedia.org/wiki/Bucharest\">Bucharest</a>.",
                    "created": "Sun, 30 Jul 2023 10:52:10 GMT",
                    "collapse": "true",
                    "subs": [
                        {
                            "text": "A shortening of a LVT tall tale about either buying IBM's PC division to shut them down, or, if we failed, getting on the overnight <a href=\"https://www.kayak.com/flights/SJC-BUH/2023-08-07/2023-08-14?sort=bestflight_a&fs=stops=1\">flight to Bucharest</a>, the capital of <a href=\"https://en.wikipedia.org/wiki/Romania\">Romania</a>, at the time the most famously evil country in the world, or so we thought, and also where my father was born in 1929. Either we'd be taking the red-eye to Boca Raton (to take over the IBM division) or going into an awful exile in Bucharest. ",
                            "created": "Sun, 30 Jul 2023 10:52:26 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "You had to have been there. :smile:",
                    "created": "Sun, 30 Jul 2023 10:52:00 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "NakedJen",
            "created": "Sun, 30 Jul 2023 21:26:13 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "My friend for life.",
                    "created": "Sun, 30 Jul 2023 21:26:26 GMT",
                    "inlineImage": "https://imgs.scripting.com/2023/07/30/nakedJen.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Homer Simpson and the Mets",
            "created": "Sun, 30 Jul 2023 11:49:00 GMT",
            "type": "outline",
            "metaImage": "https://imgs.scripting.com/2023/07/30/homerSimpsonThrowingFirstPitch.png",
            "subs": [
                {
                    "text": "Homer Simpson throwing first pitch at Mets World Series game.",
                    "created": "Sun, 30 Jul 2023 11:50:12 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Via DALL-E.",
                    "created": "Sun, 30 Jul 2023 11:49:12 GMT",
                    "inlineImage": "https://imgs.scripting.com/2023/07/30/homerSimpsonThrowingFirstPitch.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}