{
    "created": "2023-07-31T04:00:00.000Z",
    "flInCalendar": true,
    "name": "31",
    "path": "2023/07/31",
    "text": "July 31",
    "type": "calendarDay",
    "subs": [
        {
            "text": "FeedLand changes: <a href=\"http://scripting.com/drummer/blog/2023/07/31/215337.html?title=welcome\">Welcome back my friends</a>. :rocket: ",
            "created": "Mon, 31 Jul 2023 22:25:14 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Something important about voting. Don't think of your vote as expressing yourself. It's not like First Amendment speech. Your vote is you governing us. We're like a fourth branch of government. We don't get to say who runs everything, just our part of everything. One vote is a small thing, but they add up to a decision. So when you vote for a third-party candidate, or you don't like any of the candidates and don't vote at all, you <i>are</i> expressing yourself, but you are not governing. You don't like Hillary Clinton, so you stay home. You are not motivated. Then a few years later you're holed-up in your appartment, quarantined, because the government couldn't get its shit together to stop transmission of Covid. Or you're stuck with paying back your student loan because the court is 6-3 instead of 5-4. Because you and a lot of other people didn't \"like\" Hillary Clinton. See how whether you like her or not is beside the point? Or you or a family member has to carry a pregnancy to completion, have a baby you didn't want, or maybe die because your doctor couldn't figure out what the legislators meant, and didn't want to lose their medical license. So maybe next time, show up to govern. Put your feelings aside. Say what you feel on social media but use your mind when you vote. ",
            "created": "Mon, 31 Jul 2023 13:47:31 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2020/11/26/uncleSam.png",
            "flInCalendar": true
        }
    ]
}