{
    "created": "2025-10-01T04:00:00.000Z",
    "flInCalendar": true,
    "name": "01",
    "path": "2025/10/01",
    "text": "October 01",
    "type": "calendarDay",
    "subs": [
        {
            "text": "A very small <a href=\"https://imgs.scripting.com/2025/10/01/bloggersRoomDean.png\">picture</a> of the blogger's room at Dean For America in <a href=\"http://scripting.com/2004/01.html\">January 2004</a>. A big chunk of political history happened in this room. I was there, in the runup to the Iowa caucus and on the night of the famous <a href=\"http://scripting.com/2004/01.html#theFamousDeanRant\">Dean Scream</a>. Here's a picture of my digital <a href=\"http://essaysfromexodus.scripting.com/myCamera\">camera</a> in 2004. It wasn't cheap and as we know it was futuristic. That was possibly one of the first digital selfies. ",
            "created": "Wed, 01 Oct 2025 13:35:45 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2020/12/15/deanForAmericaBumperSticker.png",
            "flInCalendar": true
        },
        {
            "text": "I started <a href=\"https://palfreylaw.wordpress.com/\">this site</a> to hold some of the essays <a href=\"https://en.wikipedia.org/wiki/John_Palfrey\">John Palfrey</a> posts on Facebook, where they are out of reach of the tools of the open web. John is a longtime friend, for over 20 years, and we did some <a href=\"https://daytona.scripting.com/search?q=palfrey\">great stuff</a> together in the early days of the blogosphere. I will happily turn the site over to JP any time he wants, and provide personal support if there are problems. I want him in my online web family, and Facebook simply does not make that possible. It's a silo, as we know and that means it's basically a world unto itself. If we want to solve the problems of the world, we have to step out into the open space where what we write is not so local or controlled. ",
            "created": "Wed, 01 Oct 2025 13:29:32 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "All the <a href=\"https://github.com/scripting/Scripting-News/blob/master/blog/opml/2025/09.opml\">September posts</a> in an OPML file.",
            "created": "Wed, 01 Oct 2025 13:52:50 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Frum's dilemma",
            "created": "Wed, 01 Oct 2025 21:11:01 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Listening to today's <a href=\"https://www.theatlantic.com/podcasts/archive/2025/10/the-david-frum-show-sam-harris/684424/\">David Frum podcast</a>, from a journalist who says he reps the facts-only brand of journalism. He says his guest invented podcasting in 2014, about 14 years after we started it. ",
                    "created": "Wed, 01 Oct 2025 21:15:38 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "He then says that anyone in tech in the late 1990s made hundreds of millions of dollars. I didn't make very much money on those terms in the 90s, but I did a lot of the creating in that period. ",
                    "flInCalendar": true
                },
                {
                    "text": "Both of which tell you more about who he pays attention to than anything resembling the truth.",
                    "flInCalendar": true
                },
                {
                    "text": "Maybe the first thing journalism can do is let up on the arrogance, they represent their own point of view and nothing more. Humility.",
                    "flInCalendar": true
                },
                {
                    "text": "Regardless I find that Frum is worth listening too, because he asks questions that are worth thinking about. ",
                    "flInCalendar": true
                },
                {
                    "text": "In today's podcast he asks if the Dems ever get control of government, should they use the new norms to punish the Repubs who so damaged our system. He says it's a tough question, I say he's made it unnecessarily complicated.",
                    "created": "Wed, 01 Oct 2025 21:21:49 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The same people are also breaking laws that are on the books. Let the reconstituted DoJ do their jobs. And if there's one thing I'd insist on, they get an AG who doesn't dream a lot about how everyone means well, and they kick off the prosecutions immediately on taking office. And if the courts have been corrupted, then you have to deal with Frum's Dilemma, but not until then.",
                    "flInCalendar": true
                },
                {
                    "text": "And of course I'm not one of the people he can hear, but if you're one of the people he does listen to could you send this his way. Thanks! :-)",
                    "created": "Wed, 01 Oct 2025 21:15:59 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "We like Twitter. So blogging must be dead.",
            "created": "Wed, 01 Oct 2025 15:12:33 GMT",
            "type": "outline",
            "metaImage": "https://imgs.scripting.com/2025/10/01/failwhale.png",
            "subs": [
                {
                    "text": "I was having a conversation with Dan Knauss from the WordCamp Canada team. He said that people in the WordPress world don't think of it as a blogging community. I can see why they resist that, blogging has gotten a lot of bad PR in the last 19 years. The same bad PR that RSS got, and I felt that was so wrong, as wrong as what people said about blogging. ",
                    "created": "Wed, 01 Oct 2025 15:12:37 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "We like Twitter. So blogging must be dead. I understand -- I get it. But that's marketing, and only necessary because Twitter wouldn't let blogging be part of what they did. I'd be happy to talk about that during my keynote if people want to hear why I think that. ",
                    "created": "Wed, 01 Oct 2025 15:16:57 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Anyway until 2017 I tried to fit in between the silos. 2017 is when I realized it was hopeless. I couldn't write for the web and for the silos at the same time, I had to choose, so I went with the web. Instant happiness. ",
                    "flInCalendar": true
                },
                {
                    "text": "Okay so you don't emphasize blogging in the WordPress community. This imho is a mistake. ",
                    "flInCalendar": true
                },
                {
                    "text": "Even if it was a community built around a style of sneakers or audio equipment I would say it's a mistake not to build a custom blogosphere just for the community. In the past we would have used Twitter for this, but I don't think anyone in their right mind wants to try to do that now. Esp a community, like WordPress, that has open web built into its bones. ",
                    "flInCalendar": true
                },
                {
                    "text": "I don't have a lot of time to write this morning, so let me leave you with this story. It took years to boot up blogging as a community. I thought everyone would want to do it as soon as they saw what it was, but there needed to be a critical mass before there could be a critical mass. Logically impossible, right, but somehow it happened anyway. But slowly, in fits and starts. ",
                    "created": "Wed, 01 Oct 2025 15:15:37 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "But podcasting, in contrast, happened much more quickly. The reason? We already had blogging to build on. We had a way to communicate without the press in the middle. That's the power of blogging. We build our own news system. Do things the journalists don't understand or are counter to conventional wisdom. ",
                    "created": "Wed, 01 Oct 2025 15:16:16 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "So imho it's only coincidence that WordPress happens to be a great blogging tool. It can be that and all the other things it is. It's going to be something else too, if I have my way -- it's going to define the basic software that powers the social web. Not peripheral, but central. That and RSS. Incredibly powerful combination, and I think ready to be a strong alternative to the silos. In order for that to work, we have to reboot the blogosphere, so we will do that. :-)",
                    "created": "Wed, 01 Oct 2025 15:12:48 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Cross-posted from <a href=\"https://canada.wordcamp.org/2025/we-like-twitter-so-blogging-must-be-dead/\">WordCamp Canada</a>. ",
                    "created": "Wed, 01 Oct 2025 15:12:49 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}