{
    "created": "2025-10-07T04:00:00.000Z",
    "flInCalendar": true,
    "name": "07",
    "path": "2025/10/07",
    "text": "October 07",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Why we <i>all</i> should love RSS. It makes the web higher level without taking anything away. ",
            "created": "Tue, 07 Oct 2025 16:41:25 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2024/08/17/dewey.png",
            "flInCalendar": true
        },
        {
            "text": "Thanks to <a href=\"https://bsky.app/profile/tanyaweiman.bsky.social/post/3m2mt5qvccs2b\">Tanya Weiman</a> for observing that this blog started <a href=\"http://scripting.com/davenet/1994/10/07/marccantersingsagain.html\">31 years ago</a>. Probably the longest-running blog on the internets. Still making trouble. And as they say, still diggin.  You can always tell how long it's been by <a href=\"https://imgs.scripting.com/2025/10/07/bottomOfPage.png\">looking</a> at the bottom of <a href=\"http://scripting.com/2025/08/28/140604.html\">any archive page</a>, where it's constantly calculating, down to the second, how long this blog has been running. ",
            "created": "Tue, 07 Oct 2025 19:38:47 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Try as hard as I can I still have distinct flows and more than one place where I edit. I think that's a consequence of working on WordLand. I have to use it for serious writing, otherwise how would I know if it works. Maybe I can find a way to merge flows, but not at the moment. I still have to do some copy/pasting. ",
            "created": "Tue, 07 Oct 2025 16:06:46 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The antidote to Bigco dominance",
            "created": "Tue, 07 Oct 2025 16:09:50 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Fascinating <a href=\"https://www.shellen.com/2025/10/07/layover-over/\">blog post</a> from Jason Shellen, tech entrepreneur, formerly with Blogger and Google. Here’s my perspective on part of the story he tells about RSS and Google Reader.",
                    "created": "Tue, 07 Oct 2025 16:10:09 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Netscape gave us RSS 0.91 and it was good enough to create a new powerful layer on the web. Then Netscape blew up and a bunch of repeated efforts to kill it from big companies. I’ll leave it to others to say why, but they tried over and over to extinguish the spark. Independent developers were stubborn, we kept using the original format, and in the end the independents prevailed. ",
                    "flInCalendar": true
                },
                {
                    "text": "Don’t ever think bigco’s are the answer. They almost always suck the life out of open systems. If you have something good going: <b>work together</b>. It’s the antidote to bigco dominance. ",
                    "created": "Tue, 07 Oct 2025 19:50:19 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "If you suck up to the bigco thinking they’ll let you in, maybe they will for a short while. But what you’ll be left with may not be worth the cost. ",
                    "created": "Tue, 07 Oct 2025 16:11:41 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "And just because you have a job at a bigco doesn’t make you hot shit. Maybe for a moment. ",
                    "created": "Tue, 07 Oct 2025 19:51:12 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "This theory has a name, it’s described in the <a href=\"https://en.m.wikipedia.org/wiki/Prisoner%27s_dilemma\">Prisoner’s Dilemma</a>, and its lesson applies in tech and in the political disaster the US has become.",
                    "created": "Tue, 07 Oct 2025 16:10:41 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}