{
    "created": "2025-10-08T04:00:00.000Z",
    "flInCalendar": true,
    "name": "08",
    "path": "2025/10/08",
    "text": "October 08",
    "type": "calendarDay",
    "subs": [
        {
            "text": "<a href=\"https://wordpress.feedland.org/\">WordPress news</a> via FeedLand. ",
            "created": "Wed, 08 Oct 2025 20:01:15 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The same energy that forced Biden off the ticket should get Schumer and Jeffries out of the top seats. Replace with people who can speak plainly about what's actually happening.",
            "created": "Wed, 08 Oct 2025 16:58:42 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2025/10/08/reallySimpleBooks.png",
            "imageLink": "http://scripting.com/2025/09/18/145808.html",
            "flInCalendar": true
        },
        {
            "text": "I stop reading every piece that begins by wondering if the Dems or Repubs are \"winning\" the shutdown. Anything the Dems can do that has anything to do with governing is a win for all of us, including the Repubs, but esp the Dems. This is a new world, the old one is gone. Every day is a new reality.",
            "created": "Wed, 08 Oct 2025 17:17:11 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Fellow humans. If we're competing with AI, and to some extent it seems we are, consider that they have much better writing tools than we do. If we are to put up some kind of resistance to our cyber-domination, shouldn't we invest in better writing tools for bodied-intellects like us?",
            "created": "Wed, 08 Oct 2025 14:16:46 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I try not to run away from controversy when conventional wisdom is in the way of progress.",
            "created": "Wed, 08 Oct 2025 13:44:52 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The big deal with WordPress, as outlined in the <a href=\"http://scripting.com/2025/08/28/140604.html\">Think Different piece</a> is that the strong API makes WP into something quite different from what most people think it is. I think of it as an OS for writing on the web. Very analogous to what we use(d) PCs and Macs for before networks were everywhere. This came up in a thread on Bluesky about MicroPub which appears to be a redo of Metaweblog, with better identity system. ",
            "created": "Wed, 08 Oct 2025 13:29:33 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The ActivityPub world, which MicroPub is part of (I guess), could benefit from reading Joel Spolsky's piece about <a href=\"https://www.joelonsoftware.com/2001/04/21/dont-let-architecture-astronauts-scare-you/\">Architecture Astronauts</a>. ",
            "created": "Wed, 08 Oct 2025 13:43:15 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}