{
    "created": "2025-10-14T04:00:00.000Z",
    "flInCalendar": true,
    "name": "14",
    "path": "2025/10/14",
    "text": "October 14",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Times I've been ambushed at conferences",
            "created": "Tue, 14 Oct 2025 15:42:58 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Well, I think I'm done. I've got the outline for the slides complete. I can't possibly talk about all the stuff that's in the slides. Once I leave tomorrow I think perhaps I'll post a link for the slides and maybe offer a place to comment. Maybe. ",
                    "created": "Tue, 14 Oct 2025 15:43:07 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I get very nervous about these things and then remember when I've prepared as much as I have for this, the talk goes quickly and people generally are nice, though I've been ambushed a few memorable times. Let's see -- Austin, Cambridge, San Francisco and Nashville come to mind. ;-)",
                    "flInCalendar": true
                },
                {
                    "text": "In Austin it was because I was privileged. I was being honored because it was the 25th year of my blog, and I was one of the keynoters. I told the promoter his people wouldn't like me, and then I forgot I said it when it happened. I was stuck, I didn't want to get into a public argument with anyone. (Had I wanted to rebut, I would have said everyone in this room is privileged, just look around at how well fed and educated everyone is. We all flew in here. We live in a rich country where we are the elite of the elite. Now STFU, in my dreams.) ",
                    "flInCalendar": true
                },
                {
                    "text": "There have been times when I welcomed an argument...",
                    "flInCalendar": true
                },
                {
                    "text": "In San Francisco, I was invited to lead a panel from the music industry about how great Napster was. This was probably in 2000 or 2001 when Napster was at its peak. It was an ambush. All the panelists made me the issue, and then they voted to kick me off the stage. I stayed there and waited until they exhausted their rage, and then asked them a question about music and Napster. Acted like nothing had happened. I had earned my place there, I was a very early industry adopter of Napster. I loved what it did for us. Imagine until then you either had to buy an album to listen to music, build a collection, or wait until it was played on the radio. (What is radio? Kind of an early form of podcasting.) People were talking about music in supermarkets and airports. This could not be stopped, I was sure of it, and they were acting like babies. I stood up and prevailed.",
                    "flInCalendar": true
                },
                {
                    "text": "In Nashville, I was invited to be a sort of keynoter for a conference that was patterned after BloggerCon. I did not organize it, but I led a session, which was attended by a famous right wing blogger who I had invited to the Harvard BloggerCon. He brought a bunch of his friends, and they each said no one was listening to them but we were listening to them. I eventually sat down and let them have a session dominated by a few people repeating themselves. It was boring. ",
                    "flInCalendar": true
                },
                {
                    "text": "Finally I was set up by the promoters of a CMS conference which Berkman hosted at Harvard. I was the master of ceremonies. No one told me that one of my most virulent trolls was there, and when he got up to rage at me I asked him to sit down, but Charlie Nesson who was the senior educator there, and kind of naive about internet trolls, said he should speak his mind. I should have walked out at that point. I knew what was coming. It really shook me. ",
                    "created": "Tue, 14 Oct 2025 15:45:05 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "In Nashville a columnist in a local paper who said I caused the riot, btw. I swear to god I always take my discussion leader role seriously. I gave them all a chance to talk and they all said the same thing, almost as if they had been told to say it. ",
                    "created": "Tue, 14 Oct 2025 15:44:28 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}