{
    "created": "2025-10-20T04:00:00.000Z",
    "flInCalendar": true,
    "name": "20",
    "path": "2025/10/20",
    "text": "October 20",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I wonder if any established open source projects are converting to having ChatGPT or other AI manage the process.",
            "created": "Tue, 21 Oct 2025 01:32:39 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2023/11/24/santaSecure.png",
            "flInCalendar": true
        },
        {
            "text": "On my drive to Ottawa and back, I never had to wait for a charger, and it never took more than 1/2 hour to fill the battery to 80%. The chargers are often in places with restaurants or supermarkets. And it's good for my legs to get out of the car and walk for a bit. ",
            "created": "Tue, 21 Oct 2025 01:34:46 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Frontier's <a href=\"http://scripting.com/98/04/stories/simpleCrossNetworkScript.html\">Simple Cross-Network Scripting</a> is one of my favorite features ever. It made procedure calls over the internet almost as simple as procedure calls inside Frontier. ",
            "created": "Mon, 20 Oct 2025 14:20:14 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I wish WordPress had a \"home\" social network. The community is all over the place, on Twitter, Slack, Masto, Bluesky, GitHub, and probably a few other places. I hope to have a social network that is built on WordPress and RSS. It would be open to the public, and anyone could start their own, by running an easy to install piece of software on a server. ",
            "created": "Mon, 20 Oct 2025 13:41:02 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Took yesterday off, aside from a little blogging, which isn't work for me -- now on Monday, I'm going to do a few warmup projects, and figuring out which big item I should focus on in my post-WordCamp experience. ",
            "created": "Mon, 20 Oct 2025 13:39:59 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}