{
    "created": "2025-10-22T04:00:00.000Z",
    "flInCalendar": true,
    "name": "22",
    "path": "2025/10/22",
    "text": "October 22",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Still <a href=\"https://github.com/scripting/Scripting-News/issues/332\">looking</a> for more great WordPress news sites.",
            "created": "Wed, 22 Oct 2025 17:39:01 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Question came up <a href=\"https://talkingpointsmemo.com/tpm-25/can-substack-recover-the-blogosphere-we-lost\">on TPM</a> as to whether the blogosphere might reboot in Substack. The author concluded it can't, and I agree. <a href=\"https://bsky.app/profile/scripting.com/post/3m3rq5wpk6e2u\">Here's why</a>. \"One thing the blogosphere had that Substack can’t have is all parts were replaceable. You could use any blogging tool, and any feed reader and still be part of the world. Substack is a single company that has raised VC money. Vastly different incentives.\" And this has been tested. You have to use their editor to publish in their enviroment. They're  unable to let you see their product as part of a toolset, it has to be the whole thing.",
            "created": "Wed, 22 Oct 2025 13:50:38 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2019/12/13/uncleSamAllYourBase.png",
            "flInCalendar": true
        },
        {
            "text": "You know how the AI companies are all doing browsers. Why don't they have a local url that I could put into an &lt;a> element that pops up the result of a question asked of the chatbot. Something <a href=\"ai://what_did_the_mets_do\">like this</a>. When you click on the link you find out what the Mets did. ",
            "created": "Wed, 22 Oct 2025 17:29:21 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I'm okay with Trump destroying the White House step by step. We're going to need a lot of new things once he's done. There's going to be a lot of broken stuff that needs fixing. Feces covered monuments. Probably a new cemetary somewhere for his victims. But you know how when the Mets were defeated by the determined Yankees in Shea Stadium in 2000, we tore down the old stadium and built a new one. Same thing. The old White House will have served its purpose. We shouldn't even build a <i>new White House</i> on that location, just like we shouldn't have built a skyscraper in place of the World Trade Center. I wanted to see a mosque and a synagogue, a new football stadium, perhaps. A nice park. A place for a camp fire. Anything but an indestructable office building. We have so many of them. But where are the spaces for kids to play and learn and be friends. No, in place of the White House, I want to see a gorgeous public library. A place of learning. And a softball field and a nice swimming pool. We can tell the kids that once a bad old man lived here, and we decided it'd be more fun to have a big playground instead. ",
            "created": "Wed, 22 Oct 2025 17:20:14 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2025/10/22/windex.png",
            "flInCalendar": true
        }
    ]
}