{
    "created": "2025-10-29T04:00:00.000Z",
    "flInCalendar": true,
    "name": "29",
    "path": "2025/10/29",
    "text": "October 29",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Before it’s too late there should be a rule that AI chatbots should not be allowed in any way to impersonate humans. We will come to see that as our biggest mistake, not stopping this before it got out of control.",
            "created": "Wed, 29 Oct 2025 14:25:29 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Apparently last night's email didn't go out, so I re-sent them. Hopefully people didn't receive two emails. ",
            "created": "Wed, 29 Oct 2025 14:44:14 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Honoring people who are alive",
            "created": "Wed, 29 Oct 2025 18:43:06 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Wouldn't it be great if there was a holiday once a year where each of us had a virtual awards show for people we know who have special qualities that make them excellent people or friends. We put all our focus on a few personalities who have obvious defects. And we don't express public gushing love until people die. How much better our lives would be if we focused on the good, generous and creative people among us who have made our lives better? ",
                    "created": "Wed, 29 Oct 2025 18:36:11 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I would honor people I love because they project strength and empathy, for me that would be AOC who I'd love to have as a niece or sister, or aunt, and no doubt she'd make a great mom. I don't like Schumer because he's sad and stupid. We need someone in that role who's more like JFK or even LBJ. Confident bordering on arrogance. Someone with the <a href=\"https://daytona.scripting.com/search?q=gravitas\">gravitas</a> Schumer doesn't project. ",
                    "created": "Wed, 29 Oct 2025 18:44:09 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I would give an award to <a href=\"https://daytona.scripting.com/search?q=%22Philippe%20Kahn%22\">Philippe Kahn</a> for practical brilliance. I've learned from everyone I've competed with, and he had a practical philosophy about software I had never seen before. A feature that he saw that made the product more brilliant. They weren't huge things, but they showed he was thinking about the user. Not surprising that a few years after our competiton between Sidekick and Ready he went on to prove that a mobile phone would make a great camera. He not only thought of it, he made it work. That's the kind of spirit I admire. ",
                    "created": "Wed, 29 Oct 2025 18:44:49 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I was on panels with him a few times, he always had funny things to say, irreverant, sarcastic, but one time he let Bill Gates have it (he was in the room) and called him out for \"hogging the fast lane\" -- and even though I don't remember what the issue was, I do remember that I knew he was totally right. ",
                    "created": "Wed, 29 Oct 2025 18:46:10 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "He's very much <a href=\"https://en.wikipedia.org/wiki/Philippe_Kahn\">alive</a> as far as I know. But I think it would be nice to write our epitaphs while the people we're praising are around to hear it! So going back to the original awards, that would be a requirement, the people you call out must be alive. ",
                    "created": "Wed, 29 Oct 2025 18:47:32 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}