{
    "text": "Apple + UPS + weather",
    "created": "Tue, 08 Feb 2022 15:03:27 GMT",
    "type": "outline",
    "description": "Apple products are too expensive for the amount of work they make you do when they screw up.",
    "subs": [
        {
            "text": "Apple, UPS and snow are a bad combo. ",
            "created": "Tue, 08 Feb 2022 15:03:32 GMT",
            "flInCalendar": true
        },
        {
            "text": "In good weather, I would have gotten my new phone on Jan 31. But the weather wasn't good, so it was delayed. On Feb 2 the case arrives. No phone, which just a guess, was stolen at UPS waiting for better weather. Apple said they were sending another phone but Apple's system lost my credit card number. That took a couple of days to sort out, and lots of time on the phone track down their system error -- somehow my credit card number was replaced on their server with someone else's number. Pretty disturbing considering Apple is a <i>computer</i> company. So that delayed them sending the replacement for the lost or stolen phone. Too bad for Dave because that was when we had good weather. It turned bad again, with power outages, and networks down, and now the second phone is caught in the <a href=\"http://scripting.com/images/2022/02/08/upsScreen.png\">UPS system</a>, and who knows when I'll actually get the phone. Thinking about asking for my money ($1300) back and buying the same phone at Amazon. Maybe their luck will be better. Both companies screwed up here, and neither of them has been willing to assign someone to fix the problem, and ignore what the computer tells them to do and get the phone to the customer already. I'm not at the North Pole. I have a car, the roads are clear, but it's looking like they lost this phone too. ",
            "created": "Tue, 08 Feb 2022 15:03:45 GMT",
            "flInCalendar": true
        },
        {
            "text": "Screen shot from Apple store gives a clear picture of where we're at.",
            "created": "Tue, 08 Feb 2022 15:10:39 GMT",
            "inlineImage": "http://scripting.com/images/2022/02/08/appleStoreScreen.png",
            "flInCalendar": true
        },
        {
            "text": "All the Apple people have been nice, mostly overworked but polite and considerate. At one point I noted that we're just cogs being run by the computer bosses, software that ate our world, and they are making mistakes, and humans still have to do what they say. I think this is why everyone wants change. It's not nice to think where this is going. ",
            "created": "Tue, 08 Feb 2022 15:11:15 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}