{
    "created": "2024-12-01T05:00:00.000Z",
    "flInCalendar": true,
    "name": "01",
    "path": "2024/12/01",
    "text": "December 01",
    "type": "calendarDay",
    "subs": [
        {
            "text": "<a href=\"https://en.wikipedia.org/wiki/The_Big_Interview_with_Dan_Rather\">The Big Interview with Dan Rather</a> podcast is gold. Just listened to his <a href=\"https://omny.fm/shows/the-big-interview-with-dan-rather/the-big-interview-with-steven-van-zandt\">interview</a> with <a href=\"https://en.wikipedia.org/wiki/Steven_Van_Zandt\">Steven Van Zandt</a> of the E Street Band and the Sopranos. There are <i>nine</i> seasons of this podcast between 2013 and 2021. Going to keep me busy for a while. The <a href=\"https://www.omnycontent.com/d/playlist/8e6d7e9c-00fb-4434-b699-b07a012cac5b/1c515561-6a90-4cfb-8f70-b07d0142b4bf/34077f42-ce99-472a-9884-b07d0149f32f/podcast.rss\">RSS feed</a> works. ",
            "created": "Sun, 01 Dec 2024 20:16:20 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "One way to help <i>RSS-based podcasts</i> is to promote individual episodes from the past. Sometimes shows are done, but the archive contains good stuff. Not everything is based on current events. Music, art, history for example. Also bring the feed out from hiding. At least the nerdy people should understand how this stuff works. One of the big crimes was when the browser makers tried to hide the feeds. I like to be able to lift the hood even if I don't understand what I'm looking at. \n",
            "created": "Sun, 01 Dec 2024 20:40:28 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2023/11/27/rssClub.png",
            "flInCalendar": true
        },
        {
            "text": "I'm using the term \"RSS-based podcasts\" in place of \"podcasts\" to make sure whoever reads it knows to ask the question of other \"podcasts,\" are you RSS-based? The best answer is to encourage YouTube et al to just connect their \"podcasts\" to RSS and everyone's happy. Like \"organic cheeseburgers.\" :-)",
            "created": "Sun, 01 Dec 2024 21:37:15 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "For the record, Bluesky has completely taken over from Threads. Threads is basically at zero, needs something to shake it up. Obviously this could be different for everyone. And engagement on Twitter is pretty close to zero. I still check there periodically because despite what people say a lot of people I follow still post there. And I do too, since cross-posting costs me nothing. And it has been pointed out that deleting your Twitter account comes with a fairly huge risk. And if you do it, I wouldn't announce it, because anyone apparently can claim your account once it is completely deactivated. And that could create some problems for you. Probably better to hold the account indefinitely.   ",
            "created": "Sun, 01 Dec 2024 15:48:38 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I've <a href=\"https://this.how/bingeworthy/#1733066142000\">exported the data</a> from Bingeworthy 2 in JSON and uploaded to a <a href=\"https://github.com/scripting/binge2Data\">new public repo</a>. It can be used to seed the <i>ratings</i> table for the updated instance. ",
            "created": "Sun, 01 Dec 2024 15:22:23 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Welcome to the last month of \"Scripting News\" in the year 2024. Each year goes by faster and faster. And as we move forward in time, there's less room in front of us on the runway of life, and more behind us. At some point in the next decade my plane will probably take off. I feel a sense of urgency about getting it done. Still a fair amount on my todo list, but I'm making progress. As someone once said many times: Still diggin! ",
            "created": "Sun, 01 Dec 2024 14:09:18 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "And welcome to the time of year you can't remember what the day of the week is. For what it's worth today is Sunday. Feels like Monday?  ",
            "created": "Sun, 01 Dec 2024 14:11:36 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "And here, for the record, is the <a href=\"https://github.com/scripting/Scripting-News/blob/master/blog/opml/2024/11.opml\">archive</a> for November.  A relatively lite month, only 87K worth of text. The <a href=\"https://imgs.scripting.com/2024/12/01/folder.png\">norm</a> is about 120K. ",
            "created": "Sun, 01 Dec 2024 14:10:59 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}