{
    "created": "2024-12-09T05:00:00.000Z",
    "flInCalendar": true,
    "name": "09",
    "path": "2024/12/09",
    "text": "December 09",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Podcast: <a href=\"https://shownotes.scripting.com/scripting/2024/12/09/weAllOwnAndNoOneOwnsPodcasting.html\">We all own and no one owns podcasting</a>. <i>11 minutes.</i> ",
            "created": "Mon, 09 Dec 2024 16:08:36 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Anyone can build on an open format. That's part of what it means for it to be open. Developers and users are free to use anyone's ideas, or not use them, even if they claim to be the Holy Church of Some Open Format. No one can form an organization that owns the future of the open format because then it wouldn't be open. ",
            "created": "Mon, 09 Dec 2024 14:49:47 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2023/03/20/mrSmith.png",
            "flInCalendar": true
        },
        {
            "text": "I've got the <a href=\"https://imgs.scripting.com/2024/12/09/bingeworthyScreenShot.png\">new version of Bingeworthy</a> running here. When I saw how the database code worked, I had to redo it from scratch. It was probably my first SQL project, and I barely knew what I was doing. It's too bad, because looking at it from that point of view I could see how SQL could have been much simpler by making some of the optional features automatic. A higher layer on top of SQL is possible, it seems to me. Having ChatGPT review my ideas has been invaluable in this project. I'm going to use it myself for a while, and see how I want to reorganize the user interface. There were opportunities for factoring I didn't take back then because I was in a rush to do something else. ",
            "created": "Mon, 09 Dec 2024 15:25:13 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "How I know Twitter was great. When something was going on anywhere, any kind of thing, I'd go to Twitter and it happened there 14 minutes ago. It was the pulse of the news. And somehow they couldn't figure out how to make a business of that! Amazing.",
            "created": "Mon, 09 Dec 2024 20:08:15 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I bet a lot of people who voted for Trump hoped they were voting for <a href=\"https://en.wikipedia.org/wiki/James_Stewart\">Jimmy Stewart</a> in <a href=\"https://en.wikipedia.org/wiki/Mr._Smith_Goes_to_Washington\">Mr Smith goes to Washington</a>, or <a href=\"https://en.wikipedia.org/wiki/It%27s_a_Wonderful_Life\">It's a Wonderful Life</a>. I think they may be surprised to find that they actually voted for <a href=\"https://en.wikipedia.org/wiki/Mr._Potter\">Mr Potter</a> or <a href=\"https://en.wikipedia.org/wiki/Ebenezer_Scrooge\">Ebeneezer Scrooge</a>. Look for a <a href=\"https://christmas.com/what-does-it-mean-to-get-a-lump-of-coal-in-your-christmas-stocking/\">lump of coal</a> in the stocking. ",
            "created": "Mon, 09 Dec 2024 16:54:48 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "If you want to get excited about the future, I highly recommend this week's <a href=\"https://www.youtube.com/watch?v=B4vtiiIo_Bc\">Jon Stewart podcast interview with Bernie Sanders</a>. I recognize these ideas, it sounds like what we're waiting for in the social web and in journalism. And working for and with each other.",
            "created": "Mon, 09 Dec 2024 17:07:55 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=B4vtiiIo_Bc",
            "flInCalendar": true
        }
    ]
}