{
    "created": "2024-12-14T05:00:00.000Z",
    "flInCalendar": true,
    "name": "14",
    "path": "2024/12/14",
    "text": "December 14",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Online communities can work",
            "created": "Sat, 14 Dec 2024 18:44:11 GMT",
            "type": "outline",
            "description": "If you give people good tools, and they use them well, you can make this work.",
            "subs": [
                {
                    "text": "A <a href=\"https://www.nytimes.com/2024/12/14/magazine/bluesky-social-media.html\">piece</a> in today's NYT said all networks flame out, but that's actually too crude a statement. ",
                    "created": "Sat, 14 Dec 2024 18:44:19 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "If you want your network not to flame out, give the users the tools to keep things moderated.",
                    "created": "Sat, 14 Dec 2024 19:11:07 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "One of the best features of Facebook is it gives the author of a post the power to decide who can respond to it. (I know they're not the only ones, but they're the first in my experience, so I give them credit.)",
                    "created": "Sat, 14 Dec 2024 18:47:29 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "If I write something that I know will attract trolls, I just restrict it to friends. If they flame me, or even try to provoke an argument, I just unfriend them, and I suspect they know that. The hotheads have been culled from the list over time, there's trust that people don't want and won't pick fights. ",
                    "created": "Sat, 14 Dec 2024 19:07:52 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Assume adults know when they're asking to argue, and not only don't accept the bait, but don't allow them to participate. ",
                    "created": "Sat, 14 Dec 2024 19:14:33 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Keeps things friendly. Not kidding. It doesn't flame out there.",
                    "created": "Sat, 14 Dec 2024 19:09:14 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It also helps that I've been using these networks since the 70s, and there have been times when I sought out the flames, because I could have shut them off at any time, but I let them keep going. Now I don't. I just don't argue online, and as a result the heat doesn't reach me. ",
                    "created": "Sat, 14 Dec 2024 19:09:26 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "In other words, if you give people good tools, and they use them well, you can make this work. ",
                    "created": "Sat, 14 Dec 2024 18:45:28 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PS: To be fair, the NYT piece focused on Bluesky, and they are for sure going down a path much like the one Twitter went down, but it will happen much faster because the trolls are already plentiful and well-organized. They're going for the billion-dollar cashout, for sure and they will very likely get it, and as users we will still be looking for an open system that we can use to get work done. ",
                    "created": "Sat, 14 Dec 2024 18:45:29 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}