{
    "created": "2024-12-15T05:00:00.000Z",
    "flInCalendar": true,
    "name": "15",
    "path": "2024/12/15",
    "text": "December 15",
    "type": "calendarDay",
    "subs": [
        {
            "text": "<a href=\"https://en.wikipedia.org/wiki/Martin_Luther_King_Jr._Day\">Martin Luther King Day</a> is January 20 in 2025, also is Inauguration Day. ",
            "created": "Sun, 15 Dec 2024 21:58:52 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "What if you had a twitter-like system that was embedded in a ChatGPT-like app. What would you do with that?",
            "created": "Sun, 15 Dec 2024 18:05:20 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The journalism I pay attention is labeling itself as <i>truth-based</i> -- but it most definitely is not. When it comes to topics I am expert in, they tell a mushed up version of extreme points of view, that (surprise!) favor the continued existence of their jobs. The choice of the <i>truth-based</i> label is kind of a clue. :smile:",
            "created": "Sun, 15 Dec 2024 17:47:26 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2023/07/28/marshmallowManFromGhostbusters.png",
            "flInCalendar": true
        },
        {
            "text": "This post spawned quite a <a href=\"https://bsky.app/profile/scripting.com/post/3ldc6fz4sfz2v\">thread</a> on Bluesky: \"The AI industry could give us easy tools to build our own models, from our own archived writing, for private use. This may be a blind spot. It's as if when personal computers started, instead of spreadsheet editors, we were offered great sets of tabulated recalc'ing data. Fun to watch, maybe useful for researchers, but nothing compared to the utility of playing 'what if' on our own models.\"",
            "created": "Sun, 15 Dec 2024 17:44:44 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://bsky.app/profile/did:plc:oety7qbfx7x6exn2ytrwikmr/post/3ldeeg74mdc25\">Deep in the thread</a>: \"I want to give a huge volume of writing to ChatGPT or something much like it, and then ask it to give me an outline of what I wrote, and allow me to massage the outline, churn out a synopsis. I'd like to see what's there, and there's far too much writing for me to do that.\"",
            "created": "Sun, 15 Dec 2024 18:18:57 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}