{
    "created": "2024-12-22T05:00:00.000Z",
    "flInCalendar": true,
    "name": "22",
    "path": "2024/12/22",
    "text": "December 22",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I love <a href=\"https://imgs.scripting.com/2024/12/22/writingInWordland.png\">writing</a> my morning <a href=\"https://mastodon.social/@daveverse.wordpress.com@daveverse.wordpress.com/113696639328781503\">missives</a> in \"WordLand\". It really fits. ",
            "created": "Sun, 22 Dec 2024 13:34:01 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "What we need, now, is a system to compete with Twitter. A system as capable as Twitter. It has to be privately held by a group that can be trusted not to interfere with democratic use of the system. This can't be guaranteed, it has to be based on trust. It needs to scale very quickly. Its vision is to represent democracy. And it has to be simple, clean and quickly understood as parallel to Twitter. Bluesky has a lot of what's needed, but its ownership is not clear. But it more like Twitter than Twitter is today and I expect that to continue. ",
            "created": "Sun, 22 Dec 2024 13:31:21 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2022/06/17/charlieTheTuna.png",
            "flInCalendar": true
        },
        {
            "text": "BTW Twitter is innovating in ways that it never has. People not staying on Twitter would have no way of knowing. Another reason why, for software developers, quitting Twitter is stupid. As quitting Facebook was ten years ago. Great, now you have no idea what features your users are learning how to use. Eventually your software will be in a dead end while a new <a href=\"https://en.wikipedia.org/wiki/Coral_reef\">coral reef</a> has been forming. Where are you going to get fresh ideas from. Not using these systems would be like not listening to the Beatles in the 60s,. You would have missed <a href=\"https://en.wikipedia.org/wiki/Cultural_impact_of_the_Beatles\">all that followed</a>. And not just popular music. Same with Twitter in the 2020s. That story is far from over. ",
            "created": "Sun, 22 Dec 2024 14:07:11 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}