{
    "created": "2024-12-27T05:00:00.000Z",
    "flInCalendar": true,
    "name": "27",
    "path": "2024/12/27",
    "text": "December 27",
    "type": "calendarDay",
    "subs": [
        {
            "text": "We should be thinking about a new SQL that's much higher level. Another layer. Get all the efficiencies of a <a href=\"https://en.wikipedia.org/wiki/SQL#History\">50+ year platform</a>, with all the understanding gained at the top level in all that time. Most of the learning I did in the last five years can be hidden behind a much simpler programming interface, imho. It's worth trying <a href=\"https://en.wikipedia.org/wiki/Code_refactoring\">factor</a>, again imho.",
            "created": "Fri, 27 Dec 2024 15:25:04 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2020/09/14/bucky.png",
            "flInCalendar": true
        },
        {
            "text": "BTW, as a longtime speaker of English <i>and</i> programmer, I think the term <a href=\"https://en.wikipedia.org/wiki/Code_refactoring\">refactoring</a> is re-dundant. The term comes from mathematics where you simplify a statement without altering its truth. Factoring is a repetitive process. You factor, and then factor some more if you can. ",
            "created": "Fri, 27 Dec 2024 15:36:48 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The problem with everyone who says you have to get off Twitter is that we're giving up the meeting place we had and spreading all the bits into the wind. Are you going to leave the United States now that Trump is going to be president again? Leaving Twitter is a lot like that. How do you know Musk isn't going to have to sell it? Might happen. How would you feel then about having quit Twitter in a huff as if it would always be the bastion of assholes. It's a mistake. He isn't making money with it. The more you use it the more it costs him, btw. By leaving you might actually be helping him survive. Nothing is so linear, first big point. Second big point, no one cares about your gestures. ",
            "created": "Fri, 27 Dec 2024 14:27:48 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "If you think <i>woke</i> is the problem, try reading the US Constitution and amendments. Really read them. Pretend you didn't know it was the Constitution. One woke idea after another. Basically if you don't believe in woke, you're in the wrong freaking country. ",
            "created": "Fri, 27 Dec 2024 14:21:40 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Last night's email had a <a href=\"https://www.youtube.com/watch?v=o1mXNfI1cbU\">YouTube video</a> in it. I had forgotten that they get lost somewhere in the email delivery supply chain, so the fire that I put in the email was <a href=\"https://imgs.scripting.com/2024/12/27/emailscreen.png\">not transmitted</a>. It's even worse than it appears. Here's a <a href=\"https://www.youtube.com/watch?v=o1mXNfI1cbU\">link to the video</a> of the fire, with any luck that will get through in tonight's email. Happy holidays everyone! ",
            "created": "Fri, 27 Dec 2024 13:40:44 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}