{
    "created": "2024-12-29T05:00:00.000Z",
    "flInCalendar": true,
    "name": "29",
    "path": "2024/12/29",
    "text": "December 29",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Here's a list of <a href=\"https://viewfeedlist.opml.org/?url=https%3A%2F%2Ffeedland.social%2Fopml%3Fscreenname%3Ddavewiner%26catname%3Dblogroll\">all the feeds in my blogroll</a>, with links to the XML version. I've wanted to have a nice non-XML way of viewing the feeds in an OPML subscription list. I took the time today to put one together. I had all the pieces, it was just a matter of putting them all in one place. You can use it if you want, if you want to show someone what feeds are in an OPML subscription list. <a href=\"https://imgs.scripting.com/2024/12/29/screenshotopmllistviewer.png\">Screen shot</a>.",
            "created": "Sun, 29 Dec 2024 21:07:04 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I can't get it out of my head that today is Monday. That's how it computes in my brain. This time of year is very confusing that way. ",
            "created": "Sun, 29 Dec 2024 20:56:11 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "It took me a long time to figure out that when people respond to you on twitter-like systems they aren't actually speaking to <i>you,</i> they're talking over your shoulder to the masses they imagine are reading what you posted. Three comments. 1. There are no masses. You can see this by looking at the stats for each tweet, available on most platforms. 2. Most users on the social web are trying to get attention for themselves, the only reason they read the posts is to see if there's a place for them to attach their message. 3. A simple tweak to the software would make it so that only the author of the post being responded to could see the replies. Then they could RT a reply if they thought everyone should see it. This would make the \"social web\" a lot more useful imho.",
            "created": "Sun, 29 Dec 2024 14:16:42 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2024/12/19/arguingWithZombies.png",
            "flInCalendar": true
        }
    ]
}