{
    "created": "2023-03-01T05:00:00.000Z",
    "flInCalendar": true,
    "name": "01",
    "path": "2023/03/01",
    "text": "March 01",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Tonight's Knicks game was pure delight. Haven't enjoyed basketball this much since <a href=\"https://www.google.com/search?q=site%3Ascripting.com+linsanity\">Linsanity</a>. I still don't buy that there's a Knicks-Nets rivalry. There aren't any Nets fans. They are a backup team so if the Knicks are out of town you can still go to a game. Now that the <a href=\"https://nypost.com/2023/03/01/kevin-durant-hasnt-talked-to-kyrie-irving-since-nets-trade/\">carpetbaggers</a> have left, everything is back to normal. Dallas and Phoenix can have them. Good riddance. ",
            "created": "Thu, 02 Mar 2023 03:34:49 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "This <a href=\"http://scripting.com/2022/12/28/133527.html#a134126\">piece</a> I wrote on 12/28 is what I think should happen next, turn the web we use into a fantastic place for writers. Right now it's a freaking disaster. ",
            "created": "Wed, 01 Mar 2023 15:09:34 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I continue to take a break after much michegas converting to email identity and HTTPS. I've got Electric Drummer more or less working, and I think I'm going to stop short of getting all of it working, given that I want to keep taking this break and am not up for more grinding away. Something changed over here, and I'm more inclined to let you all take care of yourselves for a while. Mastodon is fine, even though I can't write for it using the tools I like to use. So far only my blog qualifies, and my docs and this.how stuff. I'm enjoying the winter here in the Catskills and dreaming of other cool things to do. Software right now far from my mind. That could change at any time. ",
            "created": "Wed, 01 Mar 2023 14:09:16 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Welcome to March! The usual <a href=\"https://github.com/scripting/Scripting-News/blob/master/blog/opml/2023/02.opml\">archiving</a> and initializing. ",
            "created": "Wed, 01 Mar 2023 14:01:48 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}