{
    "created": "2023-03-06T05:00:00.000Z",
    "flInCalendar": true,
    "name": "06",
    "path": "2023/03/06",
    "text": "March 06",
    "type": "calendarDay",
    "subs": [
        {
            "text": "<a href=\"https://github.com/jcubic/chat-gpt/issues/12#issuecomment-1456454401\">Advice</a> from the developer of the <a href=\"https://github.com/jcubic/chat-gpt\">chatgpt bookmarklet</a> on how to customize the name of the file it generates. ",
            "created": "Mon, 06 Mar 2023 16:33:11 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Heard someone say you can't leave your PhD to your children, but you can leave them your farm. I take exception. Both my parents had a PhDs, and this gave me examples for the value of knowledge and intellect, and how to figure things out. I didn't inherit their degrees, but I did get their intellectual power.",
            "created": "Mon, 06 Mar 2023 21:50:49 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "BTW, the bit about <a href=\"https://github.com/Ranchero-Software/NetNewsWire/issues/3896\">NetNewsWire supporting</a> the <a href=\"http://source.scripting.com/#1653758422000\">source:markdown</a> element in RSS may sound ho-hum, but it's actually huge. The new things in open formats tend to sound boring when you first hear about them, they take a few years to fill out, but this is enough to get the ball rolling. \"FeedLand\" is imho going to be an important product. NetNewsWire already is. Between the two products there's enough to start a <a href=\"http://scripting.com/davenet/2000/11/30/bootstrapping.html\">bootstrap</a>. Now I'm using their announcement to entice others to jump on board. They're listening more carefully than before. That's why I'm writing this second post, to be sure people don't miss it. Here are the <a href=\"http://scripting.com/2022/07/19/152235.html?title=devNotesForMarkdownInFeeds\">developer notes</a> for adding Markdown to your feeds and to your reader software. ",
            "created": "Mon, 06 Mar 2023 15:34:06 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/03/30/grannySmithApple.png",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://nypost.com/2023/03/05/immanuel-quickley-carries-knicks-over-celtics-in-double-ot/\">Last night's Knicks game</a> was wonderful. As the Nets gave up on their buy-a-championship nightmare, the slow-growth Knicks approach has been going great. I'm sure the Knicks would've signed KD or Kyrie if they had offered, but so thankful they diss'd the Knicks instead. Idiots. Now the normal order has been restored. Hopefully the Knicks continue to add pieces slowly and let home-grown stars like <a href=\"https://en.wikipedia.org/wiki/Immanuel_Quickley\">IQ</a> continue to grow. It's intoxicating to watch him get the chance to excel as in last night's game, and completely exceed all reasonable expectations. The whole team is fantastic. Our loyalty to the team has paid off. ",
            "created": "Mon, 06 Mar 2023 16:06:11 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"http://scripting.com/publicfolder/chatgpt/city-names-with-t-english.html\">ChatGPT</a>:  \"Give me the names of 23 cities, anywhere in the world, whose names begin with T and have exactly three syllables in their names.\" Obviously some are wildly wrong. But it's still useful to come up with potential codenames for projects. Better than my previous way of doing it, browsing a Google Map sort of randomly.",
            "created": "Mon, 06 Mar 2023 14:17:44 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "A <a href=\"https://github.com/jcubic/chat-gpt/issues/12\">feature request</a> for the bookmarklet I use to save ChagGPT queries. ",
            "created": "Mon, 06 Mar 2023 14:25:06 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I have a new way of syncing up my outline with the public web, and it's quite a bit slower than the previous method. Which means sometimes I rebuild my home page before all the changes are uploaded, leading to some hilarious mistaken posts. Have to tighten this up. ",
            "created": "Mon, 06 Mar 2023 14:19:45 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://mastodon.social/@davew/109968137223267205\">Mastodon</a>, where I have 7.6K followers, generates far more flow than Twitter ever did, where I have 66.7K followers. ",
            "created": "Mon, 06 Mar 2023 13:46:07 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}