{
    "created": "2023-03-13T04:00:00.000Z",
    "flInCalendar": true,
    "name": "13",
    "path": "2023/03/13",
    "text": "March 13",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Today's song: <a href=\"https://www.youtube.com/watch?v=oOyV4kugyfM\">A Apolitical Blues</a>.",
            "created": "Mon, 13 Mar 2023 16:25:03 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Rachel Maddow is bullshit. Every time I listen to her, when she's talking about something I know about, she makes something innocent sound nefarious, I assume depending on her viewers not knowing the facts.",
            "created": "Tue, 14 Mar 2023 01:15:20 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I was fascinated with <a href=\"https://en.wikipedia.org/wiki/History_of_the_People%27s_Republic_of_China\">Communist China</a> when I was a kid. A forbidden place. Hardly anything came out, except culture created out of Communist Party lies. I wrote letters to the Chinese Consulate in New York asking for everything they had. They sent a huge poster of <a href=\"https://en.wikipedia.org/wiki/Mao_Zedong\">Chairman Mao</a> and colorful books with gorgeous drawings of Chinese kids doing <a href=\"http://scripting.com/images/2023/03/13/chairmanMao.png\">amazing things</a> because they studied the teachings of Chairman Mao. I wasn't stupid, I understood this was propaganda, but I loved the way they did it -- as a genre. This is <a href=\"http://scripting.com/images/2023/03/13/autographFromSixthGrade.png\">what I wrote</a> in one of my best friends' autograph book when we graduated sixth grade and went on to junior high. ",
            "created": "Mon, 13 Mar 2023 16:19:54 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2023/03/13/littleRedBook.png",
            "flInCalendar": true
        },
        {
            "text": "Another glitch -- the other day I <a href=\"http://scripting.com/2023/03/11.html#a150413\">asked</a> FeedLand users who had not already registered an email address to do so now. It's basically impossible for me to test this, because I don't have any accounts to use to test this since the connection with Twitter has been pretty glitchy lately. It turns out it's too late to do this transition, so we'll go ahead with the switch to email identity for feedland.org. When it switches over, you'll have to log into feedland.org using your email address, which should work for people who pre-registered. I know it's complicated, I hate it -- it's the worst use of both of our time, we get no new features for all this bullshit. But Twitter is no longer reliable in this role, so we had to do it. I'll keep you all posted here on progress, and appreciate your patience. I think it'll all be pretty smooth after this change. ",
            "created": "Mon, 13 Mar 2023 15:36:01 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "To <a href=\"http://scripting.com/email/\">email subscribers</a>, sorry for the glitch last night. Probably due to the switch to Daylight Savings Time, the wrong version of Scripting News went out at midnight. This feels familiar, but there's nothing in my notes about how to work around this. I will have a look at the code during the day today and see if I can figure out what went wrong. I was able to get the correct email to go out at 6AM EDT today by editing the stats.json file for the app to indicate that the email for the day hadn't yet gone out, and it immediately started sending out the correct email. ",
            "created": "Mon, 13 Mar 2023 13:28:13 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/05/16/weTryHarder.png",
            "flInCalendar": true
        },
        {
            "text": "If Trump were president, he'd have tried to extort some kind of fee to rescue the depositors at SVB. Or just ignored it altogether.",
            "created": "Mon, 13 Mar 2023 13:35:45 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "People's Republic of China",
            "created": "Mon, 13 Mar 2023 16:31:50 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Chairman Mao.",
                    "created": "Mon, 13 Mar 2023 16:31:56 GMT",
                    "inlineImage": "http://scripting.com/images/2023/03/13/chairmanMao.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}