{
    "created": "2023-03-17T04:00:00.000Z",
    "flInCalendar": true,
    "name": "17",
    "path": "2023/03/17",
    "text": "March 17",
    "type": "calendarDay",
    "subs": [
        {
            "text": "On reflection, it's amazing I wasn't killed in my teens. ",
            "created": "Fri, 17 Mar 2023 14:49:36 GMT",
            "type": "tweet",
            "tweetId": "1636744770495053825",
            "tweetUserName": "davewiner",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1636731808116080645\">Poll</a>: I was having a discussion with a friend the other day and I said none of my  friends have had plastic surgery. They asked how I knew, and I admitted I didn't.",
            "created": "Fri, 17 Mar 2023 14:10:53 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "It will be possible to create better teachers out of ChatGPT tech. What led me to that is that it certainly could help people write better bug reports. It would have far more patience than a busy developer, whose job is to fix bugs, not decypher a user's (justifiably) imprecise understanding of how software works. But a chatbot could help, patiently asking the user questions. Then, of course, over time -- the user would learn how to do it themselves, and get this -- they would also learn how software works. There might be some great programmers out there who don't know they are. :smile:",
            "created": "Fri, 17 Mar 2023 14:54:59 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Back in the day, as they say -- when I was going to a city somewhere around the world, I'd post something on my blog and we'd get a meetup going. The world was smaller then or so it seems. Maybe it's just me, maybe I've gotten smaller.",
            "created": "Fri, 17 Mar 2023 15:00:26 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}