{
    "created": "2023-03-26T04:00:00.000Z",
    "flInCalendar": true,
    "name": "26",
    "path": "2023/03/26",
    "text": "March 26",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Today's song: <a href=\"https://www.youtube.com/watch?v=vtJ34oFnpog\">Loving Cup</a>. It took me the longest time to find this song which was buzzing around my head this morning, but I couldn't find the lyrics. What I was ultimately looking for was this line: \"What a beautiful buzz, what a beautiful buzz.\" I was asking for <i>beautiful world</i> and then <i>beautiful girl. </i>A few minutes later another bit of a lyric became clear and it turned out to be the title of the song. I brought it to Bard, it got it right off. A few seconds later Alexa was playing it for me. So ChatGPT is also like <a href=\"https://www.google.com/search?q=site%3Ascripting.com+napster\">Napster</a>, which was a breakthrough because all of a sudden we could program our own music. It'd amaze today's young people to know there was a time when we had to depend on radio stations to get around to the song we were <a href=\"https://en.wiktionary.org/wiki/jonesing\">jonesing</a> <a href=\"https://www.urbandictionary.com/define.php?term=jonesing\">for</a>. We'd sit there with our <a href=\"https://en.wikipedia.org/wiki/Cassette_deck\">cassette recorder</a> waiting for the song to come around so we could get a copy of it. Then think of what a huge revelation <a href=\"https://en.wikipedia.org/wiki/Napster\">Napster</a> was. All of a sudden the floodgates of music opened up. <a href=\"https://en.wikipedia.org/wiki/Jerry_Garcia\">Jerry Garcia</a> didn't make it to that moment, he would've loved it, I'm sure. <a href=\"https://en.wikipedia.org/wiki/Pete_Seeger\">Pete Seeger</a> was alive, not sure <a href=\"https://www.bollier.org/blog/goodbye-pete-seeger\">how he felt</a> about it. But anyone who really loved music imho, had to have been overjoyed. People were talking about music in airports and supermarkets. You had to be there. Napster was like years of Christmas every day for music lovers everywhere. Of course the music industry didn't agree. ",
            "created": "Sun, 26 Mar 2023 14:54:12 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/12/16/santaCoke.png",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1640193983228833793\">Open question</a>: What do you think of ChatGPT for porn?",
            "created": "Mon, 27 Mar 2023 03:28:25 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1640193983228833793",
            "flInCalendar": true
        },
        {
            "text": "I only like <a href=\"https://twitter.com/AP/status/1640094287516905472\">imperfect beauty</a> in women. I find there's little that's interesting in supposedly perfect bodies.  ",
            "created": "Sun, 26 Mar 2023 20:54:14 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I got access to <a href=\"https://bard.google.com/\">Bard</a> this morning, which is Google's version of ChatGPT. I'm still pretty confused about what it is, the same way I was confused about the web in 1994 when I first got Mosaic and was reading various early websites. I can use it, but how do I create for it? I have a huge dataset of my own, most of 28+ years of my writing here on Scripting News starting in 1994. Anyway, the first thing I did was ask if I can add my own data to their massive dataset (their term) and it said yes. I asked how, and it sounds really easy, totally within my ability to do, and almost certainly within your ability too. I took screen shots of the relevant parts of the discussion and added it to the <a href=\"https://github.com/scripting/Scripting-News/issues/254#issuecomment-1484102808\">thread</a> I started on this topic. I will try this out and report back. ",
            "created": "Sun, 26 Mar 2023 13:53:48 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/09/18/newYorker.png",
            "flInCalendar": true
        }
    ]
}