{
    "text": "Catching up on Game of Thrones",
    "created": "Sat, 15 Jul 2017 18:55:07 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Over the July 4 weekend I indulged in a lot of Game of Thrones. They were running the episodes back to back. I tuned in at various times, and got bits of all six seasons. Then, I filled in the blanks. I still have to watch a few episodes in Season 6. ",
            "created": "Sat, 15 Jul 2017 18:55:15 GMT",
            "image": "http://scripting.com/images/2017/07/15/joffrey.png",
            "permalink": "http://scripting.com/2017/07/15.html#a025515"
        },
        {
            "text": "The most illuminating episodes were in Season 1, esp near the end. If you watch Season 1, you'll hear the first mentions of a lot of characters and families whose names would have meant nothing to you the first time through. And the end of Season 1 is a basic primer on the logic of the titular game. Cersei and Ned do a demo with help from Kings Robert and Joffrey and the rest of the cast. ",
            "created": "Sat, 15 Jul 2017 19:14:33 GMT",
            "permalink": "http://scripting.com/2017/07/15.html#a031433"
        },
        {
            "text": "Then there's the question of who is <s>my favorite</s> the best <a href=\"https://duckduckgo.com/?q=game+of+thrones+characters&t=hy&ia=web\">character</a>? There are so many great ones. Obviously all the main characters, Daenerys, Jon Snow, Cersei, Jamie, Tyrion, Sansa, Arya, Ned Stark, it's impossible to pick one. So it has to be a supporting character. If I had to choose a male and female, I'd go with <a href=\"https://en.wikipedia.org/wiki/Ramsay_Bolton\">Ramsay Bolton</a> and <a href=\"https://en.wikipedia.org/wiki/Ygritte\">Ygritte</a>, for opposite reasons. Ramsay is the purest of evil. So entertaining. You always want to know what he's up to now, even though you might have to avert your eyes. And Ygritte, because I am totally head over heels in love with her. I would love love love to hear her say <i>You know nothing Dave Winer. </i>:boom:",
            "created": "Sat, 15 Jul 2017 18:58:51 GMT",
            "permalink": "http://scripting.com/2017/07/15.html#a025851"
        }
    ],
    "permalink": "http://scripting.com/2017/07/15.html#a025507"
}