{
    "text": "Ghost != Medium",
    "created": "Sat, 15 Jul 2017 13:29:12 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "John Gruber <a href=\"https://twitter.com/gruber/status/885919537627103232\">started a thread</a> on Twitter lamenting that Medium is going down a predictable path. To which <a href=\"https://twitter.com/davewiner/status/885920061919199235\">I responded</a>, it's time for a Medium without a business model. A place for people to quickly write a document that stands alone on the open web, and has a chance at longevity, to be part of the record for a long time to come. ",
            "created": "Sat, 15 Jul 2017 13:29:26 GMT",
            "image": "http://scripting.com/images/2017/07/15/legalPad.png",
            "permalink": "http://scripting.com/2017/07/15.html#a092926"
        },
        {
            "text": "Predictably, I wrote a <a href=\"http://scripting.com/2017/07/14.html#a033947\">post</a> about it. ",
            "created": "Sat, 15 Jul 2017 13:30:40 GMT",
            "xref": "http://scripting.com/2017/07/14.html#a033947",
            "permalink": "http://scripting.com/2017/07/15.html#a093040"
        },
        {
            "text": "And also predictable, people who love <a href=\"https://github.com/TryGhost/Ghost\">Ghost</a> say that Ghost already does this. To which I predictably say, Ghost is a nice product, for sure, but if it did what Medium does, people would use it for what they use Medium for, and they don't.",
            "created": "Sat, 15 Jul 2017 14:12:54 GMT",
            "permalink": "http://scripting.com/2017/07/15.html#a101254"
        },
        {
            "text": "Think about Medium this way. It's a big public <a href=\"https://duckduckgo.com/?q=%22legal+pad%22&t=hq&ia=web\">legal pad</a>. In a perfect world, no one owns the pad. When you want to write something you tear off a sheet, write, when you're done you tack it up to a global bulletin board where everyone can see it. Search engines can add it to their indices. People can find it. Forever. You can put something on the record, without having to \"start\" a blog. This has a different feel from starting a blog, which to many people feels like a committment to write regularly, an obligation. This is for the one-off, I have to say something now, post. It has a place in the world of public writing. Ghost is not such a place, and neither is WordPress.  ",
            "created": "Sat, 15 Jul 2017 13:31:39 GMT",
            "permalink": "http://scripting.com/2017/07/15.html#a093139"
        },
        {
            "text": "I've long felt that tying a business model to a global writing pad inevitably leads to it becoming something else. And eventually to the writing disappearing from the web. It is not a plan for long-lived writing, something I feel we should have. Urgently, because every day we don't do it is a day that may be lost to history. ",
            "created": "Sat, 15 Jul 2017 13:35:52 GMT",
            "permalink": "http://scripting.com/2017/07/15.html#a093552"
        },
        {
            "text": "At this point it would be predictable for someone to ask if I know about <a href=\"https://archive.org/\">archive.org</a>. Yes I do. It also is not Medium. :boom:",
            "created": "Sat, 15 Jul 2017 13:37:06 GMT",
            "permalink": "http://scripting.com/2017/07/15.html#a093706"
        }
    ],
    "permalink": "http://scripting.com/2017/07/15.html#a092912"
}