{
    "text": "Morning coffee notes",
    "created": "Wed, 04 Nov 2020 14:45:50 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Good morning sports fans!",
            "created": "Wed, 04 Nov 2020 14:33:35 GMT"
        },
        {
            "text": "How did you spend your night? I watched MSNBC, love Kornacki, you can have the rest of them, but I hated whenever the sound came on saying <span style=\"font-size: 0.9em;\">IT'S TIME TO CALL SOMETHING</span>. It was always something like Kentucky or South Dakota, Vermont or New York. At one point I wrote on Twitter we're on the roller coaster now. That feeling of this is being done to me, I don't like it but at this point I have no choice, I'm on for the ride. I watched as Kornacki flipped over the counties in Florida, a remarkable number of which I was familiar with either from having been there or listening to any number of podcasts instructing me what to look out for. Very depressing. Oh shit. This feels like 2016, I said -- as did everyone else watching the returns. I started nodding off around 9PM and finally decided to go to bed at 10, and woke up at 1AM, and went looking to see how things had turned out and I literally screamed out loud when I saw Trump was ahead in Wisconsin. Oy oy oy. So here we are. And where is that exactly?",
            "created": "Wed, 04 Nov 2020 14:33:56 GMT"
        },
        {
            "text": "Well, Biden is very likely to win. And that is good news, even though they're already spinning on the webs that it would have been better if we won the Senate and lost the presidency, which is such utter bullshit. People are so stupid. Getting rid of Trump was job #1, and it seems we will get rid of him. No I didn't watch his campaign rally in the White House, and yes, I have heard it quoted, and yes, he is trying to be a dictator, and no doubt his voters will listen and believe him, and will drive their cars around running people off the road, and they might even kill people, but we're already dying in great numbers, so what the fuck difference would that make. Here's what getting rid of Trump means. Goodbye Bill Barr. Hello Paris Climate Treaty and let's get back together with the Iran deal. Let's start playing to win in international trade instead of just abdicating and sounding tough. And btw, let's get the babies out of those prisons, find their parents or at least get them into a home-like situation. And then think about all the things Trump won't be able to do if he's just a private citizen. Yes, he can be a first class asshole, and have rallies, but he will also be tried and probably convicted and go to jail. And for sure McConnell will block everything Biden tries to do, but think of it this way, Biden will block everything McConnell wants to do, something Trump didn't do. So fuck you and your fancy theories about wishing Trump were still president and McConnell would be Minority Leader.",
            "created": "Wed, 04 Nov 2020 14:37:51 GMT"
        },
        {
            "text": "So here's something I write every time a Republican wins, even though this time a Republican didn't win. We need to organize on a permanent persistent basis. It's not enough to ask for our money and phone banking at election time. We the non-elites have to be part of governing. You don't get to just ask for our money every four years and then say thanks now go away. We need to be part of this. Luckily we have this great technology that enables this, and we need to use it. Howard Dean was on the right track in 2004, but there was no follow-through (and of course he didn't even get nominated). Facebook and Twitter et al aren't the only models. We can create new media where people get to participate and where spamming means nothing. Today's networks are set up in a way that makes the most money for advertisers. We can set up networks that are great for governing and organizing. Until we do things will just keep getting worse. ",
            "created": "Wed, 04 Nov 2020 14:42:38 GMT"
        },
        {
            "text": "I was depressed at 10PM and 1AM but by 6AM I was over it. I'm ready for the next season in the great drama of American politics.<i> Let's have fun! </i>",
            "created": "Wed, 04 Nov 2020 14:46:20 GMT"
        }
    ]
}