{
    "text": "Why is scripting.com not https? I hope you can see that I have no trouble deploying https sites here. I use <a href=\"https://caddyserver.com/\">Caddy</a> on my Linux servers, and I don't see why anyone uses anything else. It's really easy and requires none of the work people complain about. Anyway the reason scripting.com is http and not https is that the site dates back to 1994, before there was such a thing as https. Google didn't start their push to get the web to convert to https until 2014, 20 years after I started blogging. Have a look at <a href=\"http://scripting.com/1999/12/31.html\">any</a> of <a href=\"http://scripting.com/fatpages/about.html\">my</a> <a href=\"http://scripting.com/davenet/stories/DocSearlsonSteveJobs.html\">archived</a> <a href=\"http://scripting.com/davenet/1994/10/18/billgatesvstheinternet.html\">blog</a> <a href=\"http://scripting.com/davenet/1999/05/24/editThisPage.html\">posts</a> and <a href=\"http://scripting.com/frontier/olddefault.html\">docs</a>, the're pretty much all there. This is something I'm proud of. I wanted to create a record from the start, it was very deliberate. I was already an experienced developer when the web started up, so I had an idea what I was doing. I also use images on my site, in the right margin of posts, and lately as \"inline\" images, in their own boxes with a caption. It's a way for me to play with the ideas, and adds color to pages that are almost all text. So if I were to move the site from S3 to one of my hosted servers, which would be a fairly major undertaking on its own and add a lot of overhead because Amazon takes care of a lot of the bullshit you have to deal with, there would be a small matter of what about the images? They would all break if scripting.com was hosted on https and they were served from http. Now you might say -- Dave all you have to do is move all those images to a place with https support and remap the domains, and take care of all the michegas that's going to pop up. Or suffer with broken images. I decided to instead tell Google to stop trying to own something that belongs to no one and everyone. If they want a more secure web, create it, and make a browser for it, and respect the original web alone. Hopefully this clears it up. ",
    "created": "Sat, 15 Mar 2025 13:16:03 GMT",
    "type": "outline",
    "image": "https://s3.amazonaws.com/scripting.com/images/2023/07/05/pinkyFacingLeft.png",
    "flInCalendar": true
}