{
    "text": "July 1",
    "created": "Wed, 01 Jul 2020 14:08:50 GMT",
    "name": "01",
    "subs": [
        {
            "text": "I spent the day so far combining the \"Radio3\" docs into <a href=\"http://this.how/radio3/\">one Howto page</a>. Consider this a draft, I still have to do a couple more read-throughs. If you have any questions or comments, please post them <a href=\"https://github.com/scripting/Scripting-News/issues/180\">here</a>. ",
            "created": "Wed, 01 Jul 2020 18:02:01 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://twitter.com/djrothkopf/status/1278408076627005442\">David Rothkopf</a>: \"There was a time in our history when the people of this country would be saddened were the president of the United States to stumble into an open pit that was actually a wormhole that sent him hurtling for all eternity to the farthest, coldest, most hostile corner of the universe.\"",
            "created": "Wed, 01 Jul 2020 20:11:16 GMT",
            "type": "outline"
        },
        {
            "text": "Wouldn’t it be great if there were a video game that <a href=\"https://en.wikipedia.org/wiki/SimCity\">simulates</a> a worldwide pandemic.   You get to be Fauci, and have to deal with a mentally incapacitated president and Republican governors who just want to reopen.   Your challenge is to make the US virus free, and win the Nobel Peace Prize.",
            "created": "Wed, 01 Jul 2020 14:08:51 GMT",
            "type": "outline"
        },
        {
            "text": "The best defense against Putin and Trump is to teach every student the basics of journalism. Not just how to detect fake news, but how to write a news story. If we do it now, we'll be glad we did in a few years.",
            "created": "Wed, 01 Jul 2020 14:16:54 GMT",
            "type": "outline"
        },
        {
            "text": "What would Cuomo do?",
            "created": "Wed, 01 Jul 2020 15:23:16 GMT",
            "type": "outline",
            "description": "Let's get our shit together while we still have shit to get together.",
            "metaImage": "http://scripting.com/images/2020/03/26/cuomoBriefing.png",
            "subs": [
                {
                    "text": "I know a lot of people don't like <a href=\"https://en.wikipedia.org/wiki/Andrew_Cuomo\">Andrew Cuomo</a>, governor of New York. I had a sligntly negative opinion of him before the virus hit. My mom didn't like him. She said NY Democrats were really Republicans. I trusted her opinion on that. ",
                    "created": "Wed, 01 Jul 2020 15:16:51 GMT"
                },
                {
                    "text": "I also remember his father ran a really dirty <a href=\"https://gothamist.com/news/ed-koch-held-decades-long-grudge-against-cuomos-over-vote-for-cuomo-not-the-homo-posters\">personal</a> campaign against Ed Koch, so dirty that if he did it today he'd be disqualified from running for anything as a Democrat. I've heard it said that young Andrew did the awful deed. I don't know. ",
                    "created": "Wed, 01 Jul 2020 15:50:44 GMT"
                },
                {
                    "text": "Anyway somehow I've never engaged in state politics here, never understood why a city like NY isn't its own thing at a national level. More people live in the metro area than in the rest of the state. A nice little state could be formed with the five boroughs, Westchester, Rockland, Nassau and Suffolk counties. ",
                    "created": "Wed, 01 Jul 2020 15:24:06 GMT"
                },
                {
                    "text": "Anyway, I went from meh on Cuomo to admiring him when he led us when we desperately needed leadership. I've never seen a politician rise to the occasion like Cuomo did with the virus. Never. ",
                    "created": "Wed, 01 Jul 2020 15:24:19 GMT"
                },
                {
                    "text": "Now the process is more or less complete in New York. Our immediate neighbors, New Jersey, Connecticut, Massachusetts have also done an outstanding job of controlling the virus. ",
                    "created": "Wed, 01 Jul 2020 15:37:00 GMT"
                },
                {
                    "text": "But then there's the rest of the country. Ultimately our health will be the same as the country's. So if the US doesn't get its act together, soon, we're going to be right back where we were in March. Except it will be much worse for a couple of reasons. ",
                    "created": "Wed, 01 Jul 2020 15:24:33 GMT",
                    "flNumberedSubs": "true",
                    "subs": [
                        {
                            "text": "Wear and tear. In many ways we've used up the reserves we had, as people, as economic beings, in our relationships with other people. Rent is due today, it's a crisis for an unthinkable number of people. There's going to be hunger soon, on a scale not seen here in my lifetime, and who knows how bad it will get. It's here now, in March, it was just looming. School is scheduled to resume in a couple of months, but no one really thinks it will. ",
                            "created": "Wed, 01 Jul 2020 15:25:08 GMT"
                        },
                        {
                            "text": "Math. Based on a <a href=\"https://www.nytimes.com/2020/05/27/health/coronavirus-spread-united-states.html\">NYT study</a>, the virus had spread much more than we realized by March, but now it's had another three months to push into every nook and cranny of the country. This wave is going to crest a lot higher than the first one, assuming we can manage to get it to crest before <i>everyone</i> is infected. The higher density means when you go to the supermarket instead of on average there being 1/2 of a Covid carrier with you, now there will be 3. And the load in the air you're breathing will probably be an order of magnitude more dense. Which means you and I will get it, where two months ago, we wouldn't have. Everything about the virus, math-wise, has led the curve straight up, vertical. We're there now. Exploring terrible new territory. It's like being cast out of a space ship in a vacuum with very little oxygen and no possibility of a rescue ship. We're going to have to ride this out.",
                            "created": "Wed, 01 Jul 2020 15:25:16 GMT",
                            "image": "http://scripting.com/images/2020/07/01/orangeBlob.png"
                        }
                    ]
                },
                {
                    "text": "Cuomo, in his daily briefings, kept saying look at the numbers, look at the numbers. Okay. Assuming he is looking at the numbers, he sees we're at the very last moment when the government might be able to help. Not unlike the position NY, Connecticut and NJ were in in March. So here are the two questions on my mind.",
                    "created": "Wed, 01 Jul 2020 15:29:47 GMT",
                    "flNumberedSubs": "true",
                    "subs": [
                        {
                            "text": "If you're Cuomo, what do you do?",
                            "created": "Wed, 01 Jul 2020 15:31:41 GMT"
                        },
                        {
                            "text": "If you're you and me, what do we do with Cuomo?",
                            "created": "Wed, 01 Jul 2020 15:31:48 GMT"
                        }
                    ]
                },
                {
                    "text": "When I think about the second question I think of Biden. He's in a position to appoint Cuomo his top adviser on the the virus. Then Cuomo has a sliver of a national platform to speak on. Not unlike the sliver of a platform Fauci has. And what about the Repubs? Now everyone but Trump is <i>actively</i> saying Wear A Mask. Great. That's new. What more could they do right now? ",
                    "created": "Wed, 01 Jul 2020 15:31:53 GMT",
                    "flNumberedSubs": "true",
                    "subs": [
                        {
                            "text": "Have Fauci testify in the Senate, and treat him with respect. That would send a strong message to the country and the world. Even if the orange blob tweeting in the bunker doesn't get it, we do, and we're taking charge. ",
                            "created": "Wed, 01 Jul 2020 15:33:20 GMT"
                        },
                        {
                            "text": "Even better, have Andrew Cuomo testify, and let him spew his Cuomo arrogance. Let him lecture. Let him show you the numbers. Let him tell you what to do. With Fauci next to him, agreeing, and now we have a much better shot than we had with the leadership of Pence, who still hasn't let go of his allegiance to Trump (he must have some good dirt on him).",
                            "created": "Wed, 01 Jul 2020 15:33:44 GMT"
                        }
                    ]
                },
                {
                    "text": "Let's get our shit together while we still have shit to get together.",
                    "created": "Wed, 01 Jul 2020 15:34:22 GMT"
                }
            ]
        }
    ]
}