{
    "text": "July 2",
    "created": "Thu, 02 Jul 2020 13:47:48 GMT",
    "name": "02",
    "subs": [
        {
            "text": "<a href=\"http://scripting.com/2020/07/02/dontCryForMeArgentina.m4a\">A 25-minute podcast</a> I did this morning. It was mostly about what's in the <a href=\"http://scripting.com/2020/07/02/134749.html?title=onGaslighting\">gaslighting</a> post below. Expanded, and starting with an observation by <a href=\"https://clas.iusb.edu/english/faculty/smith.html\">Ken Smith</a>, English prof at Indiana University, that students deserve to be shown how to use <i>the power tools of our culture.</i> Teachers should say that to them, out loud. I tried saying it loud and felt the power. Led to a story or two. The title of this podcast is <a href=\"https://www.youtube.com/watch?v=KD_1Z8iUDho\">Don't Cry For Me Argentina</a>. Wish I had thought to play that song during the podcast. Next time. :boom:",
            "created": "Thu, 02 Jul 2020 21:09:23 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2020/07/02/dontCryForMeArgentina.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "15221262",
            "image": "http://scripting.com/images/2020/07/02/evita.png"
        },
        {
            "text": "Really interesting discussion going on globally on what <a href=\"https://www.npr.org/2020/06/09/873172499/the-debate-over-objectivity-in-journalism\">objectivity</a> means in journalism, esp in re #BLM. I spent <a href=\"https://rebootnews.wordpress.com/\">many podcasts</a> with Jay Rosen talking about <a href=\"https://en.wikipedia.org/wiki/View_from_nowhere\">his idea</a> of the mythical <i>View from Nowhere.</i> You must disclose who you are, and disclaim that your writing comes from who you are. This came up in another discussion yesterday about <a href=\"http://scripting.com/davenet/2001/01/08/whatIsIntegrity.html#3\">integrity</a>.  \"A [person] has integrity if he or she is what he or she appears to be. That's why integrity commands us to disclose conflicts, so that what we say, and who we appear to be, are in sync. Change the appearance if necessary.\" It's material if the editors of a publication are predominantly of one race. Until this year, however, as far as I know, the subject had never been raised. Times are changing.  ",
            "created": "Thu, 02 Jul 2020 21:17:09 GMT",
            "type": "outline"
        },
        {
            "text": "Reporters can't get it through their heads that someone might want to write publicly to help steer the conversation, not for self-aggrandizement. I know what that's like, I've been a columnist at a big pub. I've had the name of a big university on my business card. This is different. I want to see us survive the virus. I want to survive it myself. Otherwise I don't have any great personal aspirations. I think I can help. That's it. I don't honestly see how, in this moment of crisis in the US, anyone could be worried about getting ahead. Our concern has to be for keeping our system going. It's falling apart, right now, before our eyes. Any idea should be considered, no matter where it comes from. But the gates are really high right now. The keepers are struggling to hold on, and that's exactly what's wrong with discourse.",
            "created": "Thu, 02 Jul 2020 17:55:09 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/09/02/mrFrog.png"
        },
        {
            "text": "My <a href=\"http://pagepark.io/\">web server</a> is an operating system. This has been a goal for a while. ",
            "created": "Thu, 02 Jul 2020 18:36:28 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/07/02/webserverasos.png"
        },
        {
            "text": "BTW can you <a href=\"http://scripting.com/images/2020/07/02/webserverasos.png\">see</a> now why I want HTML in bash? All those names in the list of apps the server is running should have scripts attached to them.",
            "created": "Thu, 02 Jul 2020 21:14:10 GMT",
            "type": "outline"
        },
        {
            "text": "Idea for science fiction story",
            "created": "Thu, 02 Jul 2020 21:48:39 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "a virus hits the world."
                },
                {
                    "text": "far east then europe then the americas."
                },
                {
                    "text": "they know what to do in the far east, they've been here before.",
                    "created": "Thu, 02 Jul 2020 22:13:26 GMT"
                },
                {
                    "text": "europe learns fast."
                },
                {
                    "text": "but in the americas, it's a disaster. the rest of the world walls itself off. isolating the two americas.",
                    "created": "Thu, 02 Jul 2020 21:49:09 GMT"
                },
                {
                    "text": "within months almost everyone has died of either the virus or starvation or in the various civil wars that break out all across both continents.",
                    "created": "Thu, 02 Jul 2020 21:49:15 GMT"
                },
                {
                    "text": "after a few years, expeditions are sent from europe and asia to survey the remains. they found pockets of former americans, mostly naked, living off the land, many practicing cannibalism.",
                    "created": "Thu, 02 Jul 2020 21:49:28 GMT"
                },
                {
                    "text": "the story, from there is about how the natives adapt or don't and the murderous cruelty of the colonists.",
                    "created": "Thu, 02 Jul 2020 21:49:39 GMT"
                }
            ]
        },
        {
            "text": "On gaslighting",
            "created": "Thu, 02 Jul 2020 13:47:49 GMT",
            "type": "outline",
            "description": "Why waste my best thinking on this blog? Nothing ever comes from it. I don't seek your sympathy, btw. :-)",
            "metaImage": "http://scripting.com/images/2020/07/02/gaslight.png",
            "subs": [
                {
                    "text": "Early this morning I wrote a tweet. ",
                    "created": "Thu, 02 Jul 2020 13:54:31 GMT",
                    "subs": [
                        {
                            "text": "I enjoy writing my blog because as I’m writing I feel like I’m helping straighten things out, but it’s an illusion, none of it ends up in the bigger conversation, none of it ends up mattering.",
                            "type": "tweet",
                            "created": "Thu Jul 02 07:12:50 +0000 2020",
                            "tweetId": "1278587419697319936",
                            "tweetUserName": "davewiner"
                        }
                    ]
                },
                {
                    "text": "I think that's pretty straightforward. The only emotion I mention is <i>enjoy.</i> It's true, when I'm writing a long post that organizes something I've had in my mind for days or weeks, and it comes out well, I do enjoy the process. I imagine people reading it, and thinking man this is a great idea or I don't know, I see a problem with it, and then either passing it along as-is, or expanding on it. Either way, I would be happy, because I made a contribution.  ",
                    "created": "Thu, 02 Jul 2020 13:55:20 GMT"
                },
                {
                    "text": "This last week I've written two pieces like that. ",
                    "created": "Thu, 02 Jul 2020 13:56:59 GMT",
                    "flNumberedSubs": "true",
                    "subs": [
                        {
                            "text": "<a href=\"http://scripting.com/2020/06/28/125635.html?title=ourOpportunity\">One which says</a> let's not waste this moment of political action around BLM, at the same time the government is going to spend $10 trillion (a number I made up) to keep the US from collapsing. Instead of having the money go to the 1% which is the default, let's have the money solve the real problems that are behind #BLM, and in the process help everyone. It was a strong piece, and it contains ideas you never hear among pundits. ",
                            "created": "Thu, 02 Jul 2020 14:09:24 GMT"
                        },
                        {
                            "text": "<a href=\"http://scripting.com/2020/07/01/152316.html?title=whatWouldCuomoDo\">The other</a> was about the virus and what's in our immediate future, and how, if we eased up on some of the rules of how politics work, if Biden were to appoint Andrew Cuomo as his primary virus advisor, we could start to have a national response to the virus <i>before January 2021. </i>That we're frozen, can't act, scares the shit out of me, both for my own existence, that of my friends and family, and my country, and honestly the world. The US is too important a part of the world for us to just let it go. We have to do something. I put my plan in writing. ",
                            "created": "Thu, 02 Jul 2020 14:10:02 GMT"
                        }
                    ]
                },
                {
                    "text": "The response to both these pieces, predictably -- crickets.",
                    "created": "Thu, 02 Jul 2020 14:00:02 GMT"
                },
                {
                    "text": "Now I may or may not be <a href=\"https://www.nytimes.com/2019/08/21/arts/gaslight-movie-afterlife.html\">upset</a> about this, I didn't say, but that's not the point. It's not wrong to be upset. You don't have to talk someone down from being upset, assuming I was (I wasn't, it was more frustration). You know what would be better? Ask how you can help. If one person had asked that, I would have said, in glee -- <span style=\"font-size: .9em\">READ THE FUCKING STORIES AND IF YOU LIKE THE IDEAS, PASS THEM ON WITH ALL YOUR POWER</span>. ",
                    "created": "Thu, 02 Jul 2020 14:00:13 GMT"
                },
                {
                    "text": "In the first case, let's try to steer the #BLM conversation to real political action, now, not in the future, and while the marches are great, we must do more. It's so predictable that we'll just let the moment pass and settle for a few symbolic gestures. Monuments come down. A black person is on the $20 bill. Maybe Biden nominates a black woman for VP. But that money -- that's where the power is, and it goes to the friends of Trump and McConnell, Pelosi and Schumer. ",
                    "created": "Thu, 02 Jul 2020 14:01:34 GMT",
                    "image": "http://scripting.com/images/2017/09/01/mrFrog.png"
                },
                {
                    "text": "In the second case, obviously we need and can have, a national response to the virus. We do not have to wait for Trump to leave the White House. And you know what, combining the two, BLM and the response to the virus, there's real power in that, too. If putting these ideas out there resulted in real power and real change, your friend Dave would be over the moon. ",
                    "created": "Thu, 02 Jul 2020 14:03:16 GMT"
                },
                {
                    "text": "If you want to know what I really think -- there's no point in continuing to write these pieces on my blog. They accomplish nothing and leave me with a lot of frustration. I can ride my bike, work on the garden, read books, and enjoy my retirement (I turned 65 this year). I don't want to do just that, but geez if nothing happens when I pour my best ideas into the blog, why bother.",
                    "created": "Thu, 02 Jul 2020 14:04:03 GMT"
                },
                {
                    "text": "Let me try to put it in perspective. I think Andrew Sullivan is a great thinker and writer. I don't agree with everything he says, but every time I read one of his pieces in <a href=\"https://nymag.com/author/andrew-sullivan/\">New York</a>, I get lots of ideas. I feel compelled to act. I think I'm in that class of writer, and I think my talent and experience and ideation process are wasted in this space. ",
                    "created": "Thu, 02 Jul 2020 14:05:57 GMT"
                }
            ]
        }
    ]
}