{
    "text": "July 3",
    "created": "Fri, 03 Jul 2020 12:43:17 GMT",
    "name": "03",
    "subs": [
        {
            "text": "A <a href=\"https://twitter.com/davewiner/status/1279074561582084097\">tweetcast</a> about how things in the US are kind of normal.",
            "created": "Fri, 03 Jul 2020 15:32:33 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1279074561582084097"
        },
        {
            "text": "I've been smelling burned ash everywhere, esp at night. Everywhere I go. I'm thinking this must be a symptom of the virus, so I'm afraid to ask if anyone else smells it. Then on my bike ride I saw a bunch of spent fireworks on the road. Yeah that's the smell. July 4. That should be over soon enough. ",
            "created": "Fri, 03 Jul 2020 19:58:06 GMT",
            "type": "outline"
        },
        {
            "text": "Why more white people understand \"Black Lives Matter\" now. We're realizing that <i>our lives</i> don't matter, and now all of a sudden Black Lives Matter makes a different kind of sense. It's a bit too subtle for some people. But the virus and our society's response to it is making the lights come on, gradually at first, eventually for everyone.",
            "created": "Fri, 03 Jul 2020 15:41:30 GMT",
            "type": "outline"
        },
        {
            "text": "Dear <a href=\"https://lincolnproject.us/\">Lincoln Project</a> people -- how about forking off a new PAC to convince more Americans to wear a mask. Use your marketing smarts to crack this nut. And \"save my life\".",
            "created": "Fri, 03 Jul 2020 12:43:18 GMT",
            "type": "outline"
        },
        {
            "text": "I like how they have a <i>Get Involved</i> button on their website. But when you <a href=\"https://lincolnproject.us/get-involved/\">click</a> they don't say what being involved means, beyond giving them money and your email address and zip code, presumably so they can spam you. I'd love for a campaign to define involvement as solving a problem we have in America, right now.",
            "created": "Fri, 03 Jul 2020 12:46:56 GMT",
            "type": "outline"
        },
        {
            "text": "I like listening to audio books, but I have two peeves. 1. When a book provides numbers for comparison, repeat the numbers at least once. 2. Put the introductory material at the end. Authors go on and on, assuming you won't read it. Oops. ",
            "created": "Fri, 03 Jul 2020 12:56:58 GMT",
            "type": "outline"
        },
        {
            "text": "Another peeve. I was watching a <a href=\"https://en.wikipedia.org/wiki/Dave_Chappelle\">Dave Chappelle</a> show on Netflix. He is really funny. Great comic. But he uses the N-word a lot. And get this -- he uses it to talk about white people. Like this: You my &lt;N-word>. I've been told, not by Chappelle, that it's a term of endearment. To me, that's ridiculous -- it's a threat. Because if I use that term of endearment, a 10-ton weight comes down on my head. I don't like it. We're also told this is a word African-Americans use among themselves, and we wouldn't understand what it means. But many of the people in Chappelle's audience are white. We're his N-words. I'm watching it, and reminded every time I hear the world, and he says it a lot, that this is something I'm not allowed to like. The more I listen to him use the N-word, my inner voice, constantly yapping about nothing, repeats what he says, and I'm concerned that will eventually come out of my mouth, without thought because that actually happens in real life. It's a painful word, not just for African-Americans. I saw <a href=\"https://www.newyorker.com/contributors/jelani-cobb\">Jelani Cobb</a> write <a href=\"https://twitter.com/jelani9/status/1278607474921267200\">on Twitter</a> the other day about the possible capitalization of the word <i>black</i> when used to talk about people of African descent. \"Does anyone feel strongly about upper-casing the B in black? I’m generally opposed to this because it turns race, a nonexistent category, into a proper noun.\" Maybe we should use words everyone can say, and try to stick to words that have meaning, and preferrably <i>one</i> obvious meaning, so we all can understand wtf you're talking about. :smile:",
            "created": "Fri, 03 Jul 2020 13:09:38 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/07/03/tenTonWeight.png"
        },
        {
            "text": "A kitten and a puppy are best friends in this <a href=\"https://twitter.com/amrith/status/1279139764038283264\">Twitter video</a>. ",
            "created": "Fri, 03 Jul 2020 19:49:57 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/amrith/status/1279139764038283264"
        },
        {
            "text": "It isn't a contest",
            "created": "Fri, 03 Jul 2020 16:50:06 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "When I was in sixth grade there was a school-wide spelling bee. I had finished in the top group in my class, so I got to go to the bee for the whole grade. By luck I went first and only got 5 of 10 right. People actually laughed. I went out to the yard to play and wait. ",
                    "created": "Fri, 03 Jul 2020 16:50:33 GMT"
                },
                {
                    "text": "One by one the others came out and each had lower scores than me. In the end I had the highest score of all.",
                    "created": "Fri, 03 Jul 2020 16:50:28 GMT"
                },
                {
                    "text": "Moral of the story for countries who pity the US. This isn't over yet. And it's bad luck to declare victory before it's over. And this isn't really a contest. We like to say we're all in it together, and you know what, we are. ",
                    "created": "Fri, 03 Jul 2020 16:50:16 GMT"
                }
            ]
        },
        {
            "text": "A language worth learning",
            "created": "Fri, 03 Jul 2020 12:44:03 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "JavaScript is a lovely language once you’ve spent a few years getting comfortable with its quirks. Not what I’d recommend as a starter language. Yet it is the language most people choose to learn as their first language. ",
                    "created": "Fri, 03 Jul 2020 12:44:07 GMT"
                },
                {
                    "text": "Here are the qualities I look for in the ideal starter language.  ",
                    "created": "Fri, 03 Jul 2020 12:44:29 GMT",
                    "flNumberedSubs": "true",
                    "subs": [
                        {
                            "text": "One way to do things not 20.  ",
                            "created": "Fri, 03 Jul 2020 12:44:33 GMT"
                        },
                        {
                            "text": "Boring, so the newbie can focus on their own app, not the language weirdnesses.  ",
                            "created": "Fri, 03 Jul 2020 12:44:36 GMT"
                        },
                        {
                            "text": "Frozen. They should be able to run their student projects 40 years from now. Not a place where language designers try out new ideas.",
                            "created": "Fri, 03 Jul 2020 12:44:40 GMT"
                        },
                        {
                            "text": "No callbacks, synchronization handled in runtime.",
                            "created": "Fri, 03 Jul 2020 12:44:43 GMT"
                        },
                        {
                            "text": "Algol-like, so you can get support form millions of experienced developers.  ",
                            "created": "Fri, 03 Jul 2020 12:45:21 GMT"
                        }
                    ]
                },
                {
                    "text": "May think of more qualifications later...",
                    "created": "Fri, 03 Jul 2020 12:51:52 GMT"
                }
            ]
        }
    ]
}