{
    "text": "July 5",
    "created": "Sun, 05 Jul 2020 13:16:00 GMT",
    "name": "05",
    "subs": [
        {
            "text": "Of all the things to be angry about, and there are a lot, the one that gets me the most is that Trump has had <a href=\"https://www.rawstory.com/2020/07/cbs-host-reveals-trump-has-blocked-dr-fauci-interviews-for-last-three-months/\">Fauci muzzled</a> for three months.",
            "created": "Mon, 06 Jul 2020 01:19:53 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1279776680828157953\">Poll</a>: If you could have a reincarnated Martin Luther King, Jr leading the Democratic Party today or Barack Obama, who would you chose?",
            "created": "Sun, 05 Jul 2020 14:23:27 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://nypost.com/2020/07/04/trump-announces-creation-of-national-garden-of-american-heroes/\">Perfect</a>. Take down all Confederate statues and ship them to Trump for his Garden of Heroes of White Supremacy and the <a href=\"http://scripting.com/2020/06/28/144846.html?title=everyPictureTellsAStory\">Not See</a> Party.",
            "created": "Sun, 05 Jul 2020 15:17:04 GMT",
            "type": "outline"
        },
        {
            "text": "A few days ago I <a href=\"http://scripting.com/2020/07/03.html#a195806\">said</a> I figured out that the not-pleasant burnt smell in the air came from fireworks. That was incorrect. A neighbor is having work done on trees. I live in a forest, where trees are a big deal. They're always falling over, and then you need to cut them up and haul the wood away or chop it into firewood. When you cut trees with a chain saw the wood burns, and it doesn't stop burning when the cutting is done. And that adds a stink to the air, like a fire that was put out with water. That's what I was smelling. I know this because I had some trees cut last year, and the stinky smell stuck around for a week. It's the sad smell of a dying creature. On the other hand, when you wake up on a summer morning with dew on everything, and a nice warm feel to the air, with a bit of residual chill, the forest smells like life. It's a wonderful smell. ",
            "created": "Sun, 05 Jul 2020 13:29:46 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/09/08/theTruthCanBeAdjusted.png"
        },
        {
            "text": "<a href=\"https://twitter.com/i/events/1279605407439220738\">Snopes and CNN say</a> Trump did not say Desert Storm took place in Vietnam. I ran a <a href=\"https://www.politicususa.com/2020/07/04/trump-desert-storm-vietnam.html\">link</a> on my <a href=\"http://scripting.com/?tab=links\">linkblog</a> yesterday that said otherwise.",
            "created": "Sun, 05 Jul 2020 13:16:01 GMT",
            "type": "outline"
        },
        {
            "text": "After Trump is gone we have to get rid of the cancel cult. It’s an ugly side effect of the power of online communication. When Trump uses it in his campaign it’s one of the very few things he’s right about.",
            "created": "Sun Jul 05 12:13:28 +0000 2020",
            "type": "outline"
        },
        {
            "text": "Rebuild with Biden.",
            "created": "Sun, 05 Jul 2020 14:26:31 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/07/05/rebuildWithBiden.png"
        }
    ]
}