{
    "text": "July 6",
    "created": "Mon, 06 Jul 2020 14:09:35 GMT",
    "name": "06",
    "subs": [
        {
            "text": "One thing people don’t get is the rate of death in the US is about to increase, radically. There is no <a href=\"https://www.nbcnews.com/politics/politics-news/we-need-live-it-white-house-readies-new-message-nation-n1232884\">living with</a> this, we have to fight it. That our government is okay with such a massive rate of death is a problem, but even worse is the people seem okay with it.",
            "created": "Mon, 06 Jul 2020 19:13:24 GMT",
            "type": "outline"
        },
        {
            "text": "Some of the silos being created today are thin. Not a whole lot of tech keeping the users locked in. However the fact that their content is immovable is what keeps them dependent on the platform.",
            "created": "Mon, 06 Jul 2020 17:43:02 GMT",
            "type": "tweet",
            "tweetId": "1280195592896106496",
            "tweetUserName": "davewiner"
        },
        {
            "text": "Now more than ever we need <a href=\"http://scripting.com/stories/2007/04/23/tvNewsOfTheFuture.html\">Checkbox News</a>. I want to uncheck Trump and see what's left.",
            "created": "Mon, 06 Jul 2020 14:56:11 GMT",
            "type": "outline"
        },
        {
            "text": "\"RSS\" makes <a href=\"https://en.wikipedia.org/wiki/%C3%80_la_carte\">à la carte</a> software possible. <a href=\"https://substack.com/\">Substack</a> is like <a href=\"https://en.wiktionary.org/wiki/prix_fixe\">prix fixe</a> software. You must to use their editor to publish a newsletter. No substitutions. But what if you already have an editor you like?  No <a href=\"https://www.youtube.com/watch?v=M2lfZg-apSA\">soup</a> for you!",
            "created": "Mon, 06 Jul 2020 14:56:50 GMT",
            "type": "outline"
        },
        {
            "text": "Overnight came <a href=\"https://amp.cnn.com/cnn/2020/07/06/health/spain-coronavirus-antibody-study-lancet-intl/index.html\">news</a> of a Spanish research project to find out if the virus has the potential of herd immunity. Apparently not. So we are stuck in this mode until when? Could a vaccine work if there's no possible herd immunity? Anyway, this is like one of those classic fables or myths about the people who were so divided, so hated each other, that they couldn't get together to fight a disease that they can't overcome until they can work together. It's like that famous <a href=\"https://americanenglish.state.gov/files/ae/resource_files/1-the_gift_of_the_magi_0.pdf\">O Henry story</a>, which I won't spoil in case you haven't read it. ",
            "created": "Mon, 06 Jul 2020 14:32:32 GMT",
            "type": "outline"
        },
        {
            "text": "I've been thinking of getting a new Twitter account. I'm pretty sure the <a href=\"https://twitter.com/davewiner\">one</a> I've had since 2006 has a flag on it that says \"Don't suggest it.\" <a href=\"http://scripting.com/2013/08/16/ifAnyoneFromTwitterIsListening\">Explained here</a>. I think this stems back to the controversy about the <a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+%22suggested+users+list%22+twitter&t=hk&ia=web\">Suggested Users List</a>. They eventually did phase it out. And something was done to my account. My follower count, at one time one of the top ten accounts on Twitter, hasn't grown in many years. So maybe it's time to start over, and see if I can have more followers without whatever was done. Anyway, some of the names I've considered are taken: <a href=\"https://twitter.com/boomer\">boomer</a>, <a href=\"https://twitter.com/elgrande\">elgrande</a> (a few friends call me that), <a href=\"https://twitter.com/uncledavey\">uncledavey</a> (one of my favorite titles), <a href=\"https://twitter.com/scripting\">scripting</a>, <a href=\"https://twitter.com/scriptingnews\">scriptingnews</a> (not sure what this account is), <a href=\"https://twitter.com/savemylife\">savemylife</a>. Or I could use one of the many names I already have. Then there's the question of how to transition? I think about it sometimes, but I never actually do it. :boom:",
            "created": "Mon, 06 Jul 2020 14:09:36 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/08/05/norm.png"
        },
        {
            "text": "Why you should wear a mask, illustrated.    ",
            "created": "Mon, 06 Jul 2020 14:53:05 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/07/06/youAreAVirusFactory.png"
        }
    ]
}