{
    "text": "July 10",
    "created": "Fri, 10 Jul 2020 14:16:54 GMT",
    "name": "10",
    "subs": [
        {
            "text": "Why doesn't Dr Fauci have a daily briefing carried by all the networks. Okay we know Trump wouldn't let him, and as long as he's employed by the US govt, Trump can probably stop him. But what if Fauci decided he would be more effective outside of government? Who would bankroll such a venture, as a public service? #savemylife ",
            "created": "Fri, 10 Jul 2020 17:05:51 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/05/01/fauciHead.png"
        },
        {
            "text": "<a href=\"http://scripting.com/2020/07/10/alexaPlayChinaCatSunflower.m4a\">Alexa loves</a> the Grateful Dead too. ",
            "created": "Fri, 10 Jul 2020 22:59:26 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2020/07/10/alexaPlayChinaCatSunflower.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "139991"
        },
        {
            "text": "There's a new <a href=\"https://www.bbc.com/news/technology-53050955\">trend</a> in programming -- we must change our software so as not to, internally, invisibly to users, use terms like black or white, master or slave, etc. I'm editing some code now that has the concept of enabled and disabled. Can you imagine if we have to purge this from our tech vocabulary? The economics of such changes are mind-boggling. And the breakage. What if we used such a term in one of our standards? A frozen one? An ancient one? What then?    ",
            "created": "Fri, 10 Jul 2020 15:02:56 GMT",
            "type": "outline"
        },
        {
            "text": "Roadmap. Do not re-open schools. Run Trump out of town, asap. Temporary acting President Fauci announces a nationwide lockdown. All manufacturing directed to produce PPE, food, shelter for homeless Americans. Elections to be held on Nov 3, mail only.",
            "created": "Fri, 10 Jul 2020 14:29:38 GMT",
            "type": "outline"
        },
        {
            "text": "The problem with journalism exposed in the age of Trump is they don't do anything. You say oh they're not supposed to. Voice from nowhere, etc. But they rarely carry stories of people who do things. Mostly Trump. Occasionally #BLM or but just for a while. That's it. Why does it matter now? Because we've been needing to do things since November 2016. We figure it out when it's too late. It's a repeating pattern. Maybe we need national activism more than we need journalism? We need something different or else we're hosed. ",
            "created": "Fri, 10 Jul 2020 18:43:45 GMT",
            "type": "outline"
        },
        {
            "text": "An EFF to watch the EFF?",
            "created": "Fri, 10 Jul 2020 22:55:47 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2020/07/10/effFounders.png",
            "description": "They are no longer defending electronic freedom, they are protecting the rich monopolists. ",
            "subs": [
                {
                    "text": "The EFF started, <a href=\"https://en.wikipedia.org/wiki/Electronic_Frontier_Foundation\">30 years ago today</a>, with the right idea, defending speech on the then-nascent net. I gave them $5000 at startup, but ultimately they sold us out to the big tech companies. Now we need a new EFF to reign in the original EFF.",
                    "created": "Fri, 10 Jul 2020 23:05:43 GMT"
                },
                {
                    "text": "I blogged about my first <a href=\"http://scripting.com/2005/03/29.html#breakWithEff\">break with the EFF</a> in 2005. Subsequently I <a href=\"http://scripting.com/2014/05/05/#a1399316366\">objected</a> to how they defended podcasting from a patent troll, and ultimately the effort to give <a href=\"http://this.how/googleAndHttp/\">control of the web to Google</a>, that was the absolute last straw. ",
                    "created": "Fri, 10 Jul 2020 18:23:29 GMT"
                },
                {
                    "text": "They are no longer defending electronic freedom, they are protecting the rich monopolists. Ugh. ",
                    "created": "Fri, 10 Jul 2020 23:07:53 GMT"
                }
            ]
        },
        {
            "text": "Hamilton and Brockmire",
            "created": "Fri, 10 Jul 2020 14:16:55 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I subscribed to Disney-Plus so I could watch <a href=\"https://en.wikipedia.org/wiki/Hamilton_(musical)\">Hamilton</a>. ",
                    "created": "Fri, 10 Jul 2020 14:17:00 GMT"
                },
                {
                    "text": "Parts of it I liked, but for the most, it was very Disney. I wasn't expecting that for some reason. I was prepared to be inspired but it never happened. ",
                    "created": "Fri, 10 Jul 2020 14:18:04 GMT"
                },
                {
                    "text": "I then subscribed to Hulu so I could watch <a href=\"https://en.wikipedia.org/wiki/Brockmire\">Brockmire</a>. ",
                    "created": "Fri, 10 Jul 2020 14:18:28 GMT"
                },
                {
                    "text": "It is very good and very not-Disney. <a href=\"https://en.wikipedia.org/wiki/Hank_Azaria\">Hank Azaria</a>, the voice for so many great <a href=\"https://en.wikipedia.org/wiki/List_of_The_Simpsons_cast_members\">Simpsons characters</a>, plays a washed up baseball play-by-play announcer who ends up in a washed up Pennsylvania town, announcing for a team called The Frackers. ",
                    "created": "Fri, 10 Jul 2020 14:18:31 GMT"
                },
                {
                    "text": "It's LOL funny. Really good. And Azaria, as you might imagine, can play any character that requires character. ",
                    "created": "Fri, 10 Jul 2020 14:21:16 GMT"
                }
            ]
        }
    ]
}