{
    "text": "July 12",
    "created": "Sun, 12 Jul 2020 14:17:32 GMT",
    "name": "12",
    "subs": [
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1282339660346335234\">Poll</a>: \"Which site do you respect most for TV and movie reviews?\" ",
            "created": "Sun, 12 Jul 2020 15:43:13 GMT",
            "type": "outline"
        },
        {
            "text": "Can you imagine if the virus were a hurricane (it's doing a lot more damage) we would be debating whether or not it's over. That's because we haven't set up our radar yet. We know how to do it. But Trump won't spend the money. ",
            "created": "Sun, 12 Jul 2020 20:21:59 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/11/20/offWithTheirHeads.png"
        },
        {
            "text": "I wish Fauci would quit and set up his own streaming station where he does daily briefings. I'd chip in $1000. I bet he could raise as much money as he wanted. Never have we so totally needed a <a href=\"http://scripting.com/2015/10/12/itsStillSourcesGoDirect.html\">source to go direct</a>.",
            "created": "Sun, 12 Jul 2020 20:31:29 GMT",
            "type": "outline"
        },
        {
            "text": "I want a system where voters have buddies, like sponsors in a 12-step program, who they commit to voting, and they engage on Election Day and make sure they do. They escort each other to vote. We should have drills. What an incredible demonstration that would be.",
            "created": "Sun, 12 Jul 2020 14:52:35 GMT",
            "type": "outline"
        },
        {
            "text": "BTW, I'm really crusing through <a href=\"https://www.metacritic.com/tv/brockmire\">Brockmire</a>. It's depraved, fascinating, well written and acted. It has a couple of awkward moments, but Hank Azaria is a great actor. You totally get lost in the character. ",
            "created": "Sun, 12 Jul 2020 15:44:36 GMT",
            "type": "outline"
        },
        {
            "text": "Re-open schools? Not yet",
            "created": "Sun, 12 Jul 2020 14:17:33 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2020/07/12/floridaSupermarket.png",
            "description": "We have a lot of pain to go through, then a lot of work to do, before we're ready to re-open the schools. ",
            "subs": [
                {
                    "text": "There's a <a href=\"https://www.youtube.com/watch?v=sraDVyksYMs\">great scene</a> in the movie <a href=\"https://www.youtube.com/watch?v=vq70brIQP40\">Monster</a> where the lead character interviews for a job in a local bank. She's had a hard life, no job history or résumé. The bank officer explains: ",
                    "created": "Sun, 12 Jul 2020 14:17:44 GMT",
                    "subs": [
                        {
                            "text": "\"When the beach party is over you don't get to say, you know what, I think now I'd like to have what everyone else has worked their entire life for. It doesn't work that way.\"",
                            "created": "Sun, 12 Jul 2020 15:12:43 GMT"
                        }
                    ]
                },
                {
                    "text": "That's the speech the virus is giving to the Republican governors of Texas, Florida, Arizona and all the other states that are collapsing under the weight of the virus after re-opening before they did the hard work of getting the virus under control. ",
                    "created": "Sun, 12 Jul 2020 14:29:46 GMT"
                },
                {
                    "text": "The predictable thing happened. The pandemic exploded. ",
                    "created": "Sun, 12 Jul 2020 15:20:44 GMT"
                },
                {
                    "text": "The analogy to the main character of Monster is pretty close to perfect. The governors may have been  naïve, as she was, but life doesn't care about that. You have to pay the price before you get the prize.",
                    "created": "Sun, 12 Jul 2020 15:21:06 GMT"
                },
                {
                    "text": "Charlize Theron in <a href=\"https://en.wikipedia.org/wiki/Monster_(2003_film)\">Monster</a>.",
                    "created": "Sun, 12 Jul 2020 14:42:52 GMT",
                    "inlineImage": "http://scripting.com/images/2020/07/12/charlizeTheronMonsterInterview.png"
                },
                {
                    "text": "<b>The plan</b>",
                    "created": "Sun, 12 Jul 2020 15:25:21 GMT"
                },
                {
                    "text": "First there's no question <i>the schools will not open in the fall. </i>",
                    "created": "Sun, 12 Jul 2020 14:44:42 GMT"
                },
                {
                    "text": "We should stop discussing it. It's out of the question. What may happen is they will try to open the schools in a few of the Republican states, and close them within a few days as the rate of infection goes even higher. Cause and effect. You do something stupid and a week later the infections go up, two weeks later the hospitalizations go up and two weeks after that, the death rate goes up. ",
                    "created": "Sun, 12 Jul 2020 15:22:45 GMT"
                },
                {
                    "text": "In this dimension the virus is totally predictable. Opening the schools in a month, with such a high density of infections, is suicidal on both the individual and societal level. ",
                    "created": "Sun, 12 Jul 2020 15:23:19 GMT"
                },
                {
                    "text": "New Covid cases per million. ",
                    "created": "Sun, 12 Jul 2020 14:56:04 GMT",
                    "inlineImage": "http://scripting.com/images/2020/07/12/newCovidInfectionsPerMillion.png"
                },
                {
                    "text": "Here's the plan we would be executing now if we had competent management. I'm not inventing this, it's the protocol they used in China, Vietnam, Singapore, New York, basically everywhere, to defeat the virus. This was a known method back in March. I first heard about it on the <a href=\"https://www.nytimes.com/2020/03/12/podcasts/the-daily/coronavirus-pandemic.html\">Daily podcast</a>.  ",
                    "created": "Sun, 12 Jul 2020 14:47:22 GMT",
                    "flNumberedSubs": "true",
                    "subs": [
                        {
                            "text": "Nationwide lockdown until the rate of new cases is flat and near the baseline.  ",
                            "created": "Sun, 12 Jul 2020 14:49:27 GMT"
                        },
                        {
                            "text": "Meanwhile stand up national testing and contact tracing. Open source the data so the public can help analyze it. Also useful for teaching the kids, at home, what's going on.",
                            "created": "Sun, 12 Jul 2020 14:49:41 GMT"
                        },
                        {
                            "text": "Create a network of places to isolate newly infected Americans. Hotels, convention centers, college dorms, schools.  ",
                            "created": "Sun, 12 Jul 2020 14:49:46 GMT"
                        },
                        {
                            "text": "Once all that has happened we can open the schools.",
                            "created": "Sun, 12 Jul 2020 14:49:51 GMT"
                        }
                    ]
                },
                {
                    "text": "<b>Florida</b>",
                    "created": "Sun, 12 Jul 2020 15:25:30 GMT"
                },
                {
                    "text": "How bad is it out there? <a href=\"https://twitter.com/LeahDaisyD/status/1282314539460112389\">Leah in the Florida panhandle writes</a>, \"Any state whose residents keep coming to Florida on vacation will keep getting a taste of it. We’re having our busiest tourist season <i>ever</i> this summer. No masks. No social distancing. A fresh batch comes every Saturday to stay a week. Here’s <a href=\"https://www.publix.com/locations/153-watercolor-crossings\">Publix Watercolor</a>, always packed.\"",
                    "created": "Sun, 12 Jul 2020 15:17:55 GMT"
                },
                {
                    "text": "Publix in <a href=\"https://www.google.com/maps/place/Santa+Rosa+Beach,+FL+32459/@30.3960316,-87.3494376,8z/data=!4m5!3m4!1s0x8893e19100c879b1:0xaadc3fb91d731d0b!8m2!3d30.3960324!4d-86.2288322\">Santa Rosa Beach, FL</a>.",
                    "created": "Sun, 12 Jul 2020 14:58:45 GMT",
                    "inlineImage": "http://scripting.com/images/2020/07/12/publixFlorida.png"
                },
                {
                    "text": "Bottom line: Until you go through the pain, then the hard work of containing the virus, it's suicidal to re-open the schools. Even if the government tells us we have to commit suicide, the people won't do it. We will learn. The disaster will explode, but we will learn.",
                    "created": "Sun, 12 Jul 2020 15:18:33 GMT"
                },
                {
                    "text": "Meanwhile teach the kids at home that they're living the consequences of having a poorly educated electorate. Help them study the math and science of viral infections. And study the history, as it's happening.",
                    "created": "Sun, 12 Jul 2020 15:59:26 GMT"
                }
            ]
        },
        {
            "text": "WWTDD?",
            "created": "Sun, 12 Jul 2020 19:11:21 GMT",
            "type": "outline",
            "description": "In these uncertain times, a certain question can help you find your way. ",
            "subs": [
                {
                    "text": "Tyler Durden and his alter ego.",
                    "created": "Sun, 12 Jul 2020 19:11:25 GMT",
                    "inlineImage": "http://scripting.com/images/2020/07/12/tylerDurden.png"
                }
            ]
        }
    ]
}