{
    "text": "July 15",
    "created": "Wed, 15 Jul 2020 14:03:56 GMT",
    "name": "15",
    "subs": [
        {
            "text": "The virus is making us smarter. We can't get out of it until we become experts. At least as virus-savvy as we are about the weather. If you can prepare for a tornado, that's not unlike the virus. Except it's always virus season, everywhere. That's why I say journalism will fix itself. We can't get back to work until we develop information flows we all trust. That's why I'm always banging on the <a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+fauci&t=hk&ia=web\">Fauci</a> drum. As long as he's muzzled by the government, we can't get out of this mess. I wonder if he sees this. But you and I should see it. If you're smart enough to read this blog you're smart enough to understand this simple idea. The virus makes us smarter. The faster we get smarter, the less the damage. That's where our power is. There's no time for bullshit and we need all hands on deck.",
            "created": "Wed, 15 Jul 2020 17:17:55 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/12/24/drummer.png"
        },
        {
            "text": "<a href=\"https://twitter.com/RexChapman/status/1283153317095505920\">Mike Pence</a>: \"We don't want CDC guidance to be a reason why people don't reopen their schools.\" This is a <a href=\"https://en.wikipedia.org/wiki/Crimes_against_humanity\">crime against humanity</a>. Not a trivial one. If we were doing this to another country's children and teachers, we'd be out in the streets protesting, screaming at the top of our lungs. But we seem to not see that <i>we</i> are a cause worth fighting for too. ",
            "created": "Wed, 15 Jul 2020 14:36:23 GMT",
            "type": "outline"
        },
        {
            "text": "DuckDuckGo is getting more <a href=\"https://www.thefreedictionary.com/schlocky\">schlocky</a> all the time. When I <a href=\"http://scripting.com/2017/06/06.html#a080649\">started using it</a> as the default linking service for <a href=\"http://scripting.com/\">this blog</a>, it was as plain as could be. A logo and a text box. Maybe a link at the bottom or off on the side, I have no recollection. But over time they've been adding junk to the page, so much so that this morning, doing a search there, I ended up at a page where you install a Chrome plug-in. I couldn't believe what I was seeing. I paused, tried to imagine how I got there, hit the back button and square in the middle of the DuckDuckGo home page is a <a href=\"http://scripting.com/images/2020/07/15/duckduckgoButton.png\">big button</a>, the <i>only button on the page,</i> and it doesn't submit your search, it takes you to this crazy-ass page to install a plug-in. I chose DuckDuckGo precisely because I thought they would never do crap like this. Seriously rethinking my <a href=\"http://scripting.com/2017/06/06.html#a080649\">decision</a>. Are there any nice search engines that do a decent job that don't have dreams of world domination? ",
            "created": "Wed, 15 Jul 2020 14:22:07 GMT",
            "type": "outline"
        },
        {
            "text": "Who is the narrator in this <a href=\"https://www.youtube.com/watch?v=-6wIOKaHMWo\">Lincoln Project ad</a>? The voice is very familiar. As if it were Brent Spiner or Jon Hamm. Someone like that.",
            "created": "Wed, 15 Jul 2020 14:04:47 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=-6wIOKaHMWo"
        },
        {
            "text": "We need a game like <a href=\"http://scripting.com/davenet/1995/03/20/takingcandyseriously.html\">SimCity</a> to help people understand the math of an exponential growth virus. SimCoronavirus.",
            "created": "Wed, 15 Jul 2020 14:04:11 GMT",
            "type": "outline"
        },
        {
            "text": "My friend <a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+zilar&t=hk&ia=web\">Jeremy Zilar</a> asked a <a href=\"https://twitter.com/jeremyzilar/status/1283199584756432897\">question</a> last night on Twitter: \"Do you organize the silverware as it’s going into the dishwasher, or on the way out as it’s being put away?\" My <a href=\"https://twitter.com/davewiner/status/1283199984863674368\">answer</a>: \"As it's being put away.\" Fascinating question and it got lots of response. Everyone else seems to sort the silverware on the way in. That doesn't feel right to me. First, who wants to handle the dirty silverware any more than you have to? Second, like everything in my kitchen, the dishwasher is not designed for a tall person. The silverware caddy is basically on the floor. So I save time by kind of tossing the silverware. I'd have to bend all the way down to get it into a specific part. And I do sometimes miss, but that makes life more interesting, I find. It's not really an issue for me, because I find that putting away the clean dishes and silverware takes less than a minute. By sorting the silverware on the way in how much could I possibly save? As a programmer I <i>do</i> think about things like this. Even though it had never occurred to me before that you could sort your silverware in the dishwasher. ",
            "created": "Wed, 15 Jul 2020 14:13:16 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/12/20/shrek.png"
        },
        {
            "text": "Your parents probably lied to you.",
            "created": "Wed, 15 Jul 2020 14:04:26 GMT",
            "type": "outline"
        },
        {
            "text": "Moving pocalyp.se",
            "created": "Wed, 15 Jul 2020 16:39:17 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I got it in my head that I should move <a href=\"http://scripting.com/liveblog/users/davewiner/2015/12/26/0720.html\">an old app</a> off an old server onto my newest server using the modern ability of \"PagePark\" to run apps from <i>domain</i> folders. 2.0 days later, I think I have it running. ",
                    "created": "Wed, 15 Jul 2020 16:39:24 GMT"
                },
                {
                    "text": "One of the ideas of the new PP stuff is to remove the server dependencies from Node apps, so you can just move them around where ever you like. Ideally there would be no concept of a server, just apps running in the cloud somewhere. I know there are lots of things like this, don't send me links (we need an acronym for that).",
                    "created": "Wed, 15 Jul 2020 17:51:04 GMT"
                },
                {
                    "text": "pocalyp.se a URL-shortener I wrote in 2015 that makes it possible to categorize links. I hooked it up to Radio3, and I could say this is about Bernie or Snow or Doc and it would create a URL like this:",
                    "created": "Wed, 15 Jul 2020 16:40:15 GMT",
                    "subs": [
                        {
                            "text": "<a href=\"http://bernie.pocalyp.se/3\">http://bernie.pocalyp.se/3</a>",
                            "created": "Wed, 15 Jul 2020 17:55:23 GMT"
                        },
                        {
                            "text": "<a href=\"http://scalia.pocalyp.se/4\">http://scalia.pocalyp.se/4</a>",
                            "created": "Wed, 15 Jul 2020 17:55:23 GMT"
                        },
                        {
                            "text": "<a href=\"http://doc.pocalyp.se/0\">http://doc.pocalyp.se/0</a>",
                            "created": "Wed, 15 Jul 2020 17:55:23 GMT"
                        }
                    ]
                },
                {
                    "text": "Another feature, you can get all the links on a topic, in JSON.",
                    "created": "Wed, 15 Jul 2020 16:44:19 GMT",
                    "subs": [
                        {
                            "text": "<a href=\"http://scalia.pocalyp.se/\">http://scalia.pocalyp.se/</a>",
                            "created": "Wed, 15 Jul 2020 17:56:01 GMT"
                        },
                        {
                            "text": "<a href=\"http://dave.pocalyp.se/\">http://dave.pocalyp.se/</a>",
                            "created": "Wed, 15 Jul 2020 17:56:01 GMT"
                        }
                    ]
                },
                {
                    "text": "For debugging I created an <a href=\"http://scripting.com/misc/pocalypseList.html\">HTML page</a> that has all the links in the database.",
                    "created": "Wed, 15 Jul 2020 17:49:19 GMT"
                },
                {
                    "text": "What became of this project? The same thing that happens to all attempts to categorize things. It was too much to do in the hectic pace of being an internet busybody. :boom:",
                    "created": "Wed, 15 Jul 2020 16:58:00 GMT"
                },
                {
                    "text": "PS: The source code is <a href=\"https://github.com/scripting/urlShortener/blob/master/server.js\">available here</a>. ",
                    "created": "Thu, 16 Jul 2020 01:13:58 GMT"
                }
            ]
        }
    ]
}