{
    "text": "July 26",
    "created": "Sun, 26 Jul 2020 14:08:12 GMT",
    "name": "26",
    "subs": [
        {
            "text": "Wouldn't it be great if DHS and president put the same energy into into helping the American people defeat the virus as they do to try to start a second Civil War? It also ironically might help him get re-elected.",
            "created": "Sun, 26 Jul 2020 19:52:21 GMT",
            "type": "outline"
        },
        {
            "text": "I love reading local real estate ads and imagining who would live in such a place, who did live there, what kind of life I would live if I lived there. Here are two local properties. One has four cottages. You could start your own art colony for a mere <a href=\"https://www.zillow.com/homedetails/11-Tannery-Brook-Rd-Woodstock-NY-12498/2084428274_zpid/\">$825K</a>. This listing gave <a href=\"http://scripting.com/2020/03/19.html#a141211\">NakedJen</a> all kinds of ideas. One cottage for dog lovers, one for beets, one for the Deadheads and one for a year-round <a href=\"https://duckduckgo.com/?q=%22NakedJen+Film+Festival%22&t=hk&ia=web\">NakedJen Film Festival</a>. Another listing, <a href=\"https://www.zillow.com/homedetails/48-Raycliffe-Dr-Woodstock-NY-12498/54151995_zpid/\">$650K</a>, is land only, 6 acres, but it's pretty amazing land. It gives you an idea why artists like to relocate to the mountains on the west side of the <a href=\"https://en.wikipedia.org/wiki/Hudson_Valley\">Hudson Valley</a>. Definitely a site to dream about. ",
            "created": "Sun, 26 Jul 2020 16:34:38 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/03/19/beet.png"
        },
        {
            "text": "I'm having a debate with myself. Should we encourage or discourage <a href=\"http://scripting.com/images/2020/07/26/womanWithSwastikaMask.png\">people</a> wearing <a href=\"https://www.adl.org/education/references/hate-symbols/swastika\">swastika</a> masks? On one hand, it's a <a href=\"https://twitter.com/ProjectLincoln/status/1287388507519025152\">disgusting symbol</a> of race hate. They tried to destroy my people, forced my family to emigrate to the US (not a bad thing btw). We fought WWII against the swastika people. We won. On the other hand, swastika masks probably do as a good job as any other mask, so if that's what they want to wear, maybe we should say okay that's fine, wear your swastika. We may think they're miscreants, desperate for attention, <a href=\"http://this.how/trolls/\">trolls</a> of the first order, but at least they're not spreading the virus. Maybe we should even <i>give</i> them swastika masks??",
            "created": "Sun, 26 Jul 2020 14:08:13 GMT",
            "type": "outline"
        },
        {
            "text": "A woman <a href=\"https://twitter.com/ProjectLincoln/status/1287388507519025152\">modeling</a> a swastika mask.",
            "created": "Sun, 26 Jul 2020 14:13:22 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/07/26/womanWithSwastikaMask.png"
        },
        {
            "text": "If the future is an uncontrolled virus, and/or a raging climate crisis, will there be isolated self-sufficient communities on mountain tops, like <a href=\"https://gameofthrones.fandom.com/wiki/Winterfell\">Winterfell</a>, that allow no ingress or egress? Will it be like <a href=\"https://en.battlestarwikiclone.org/wiki/Cylon_computer_virus\">Battlestar Galactica</a>, with no networking to keep the electronic viruses out? What will be the ideal vacation? Will we envy people with large families, or no families? We already know that <a href=\"http://scripting.com/2020/05/05.html#a145422\">porn</a> will be people talking without masks in public places. ",
            "created": "Sun, 26 Jul 2020 14:22:15 GMT",
            "type": "outline"
        },
        {
            "text": "Every evening I wonder how I will come up with new stuff for the blog the next day. I wonder if this is it, this is the end, I'm fresh out of ideas. But then morning comes, and a big glass of iced coffee, and lots of ideas ready to write. It seems I'm working on tomorrow's posts three or four days in advance, without even being aware of it. ",
            "created": "Sun, 26 Jul 2020 14:29:14 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/01/13/davesCoffee.png"
        },
        {
            "text": "An Ireland <a href=\"https://twitter.com/kenolin1/status/1287384610398248961\">hillside</a>. ",
            "created": "Sun, 26 Jul 2020 17:13:36 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/07/26/personWomanManCameraTv.png"
        },
        {
            "text": "OITNB season 6",
            "created": "Sun, 26 Jul 2020 15:12:25 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I just finished season 6 of Orange is the New Black. It was good, even great at times, until the last couple of episodes when they apparently ran out of story. Then they did the thing so many shows do. They had each of the characters give long speeches about how they feel about things that you already know about. These are very good actors, and they do what they're told, so it's totally ridiculous. They make up for the ridiculousness by playing seriously dramatic music that makes no sense given the total mediocrity of the story and script. Then they copy techniques of famous movies and great TV series, overlaid on bullshit. I got to the point where I dragged the cursor to the right to fast forward. ",
                    "created": "Sun, 26 Jul 2020 15:12:35 GMT"
                },
                {
                    "text": "The final episode does have one surprise in the last set of scenes that's worth stopping for and savoring. But otherwise why can't they just cut down a 13-show season to 11 so they can avoid the mess.",
                    "created": "Sun, 26 Jul 2020 15:13:49 GMT"
                },
                {
                    "text": "I will watch the last season, just to get it off my to-do list.",
                    "created": "Sun, 26 Jul 2020 15:13:58 GMT"
                },
                {
                    "text": "Also the new version of BingeWorthy is coming along nicely. I solved the main problem, anyone can submit programs, without a need for approval. I came up with a away of avoiding spam."
                }
            ]
        }
    ]
}