{
    "text": "July 28",
    "created": "Tue, 28 Jul 2020 14:55:56 GMT",
    "name": "28",
    "subs": [
        {
            "text": "The virus makes us <a href=\"http://scripting.com/2020/07/15.html#a171755\">smarter</a>. :rocket:",
            "created": "Wed, 29 Jul 2020 00:23:01 GMT",
            "type": "outline"
        },
        {
            "text": "The thing that makes fiction interesting is if they take you to a world with characters who feel real who you connect to. And their world, which might be very different from yours, feels real too. The whole thing hangs together. It makes sense what they do, and say, and <i>some</i> of it isn't exactly what you guessed. This is all a long-winded way to say is it gives <a href=\"https://en.wikipedia.org/wiki/Suspension_of_disbelief\">good suspension of disbelief</a>. That's why a show like <a href=\"https://en.wikipedia.org/wiki/Succession_(TV_series)\">Succession</a> works so well. The people are mediocre and foolish. Their world is vastly different from the one we live in. The people are colorful and interesting, educated, but also frail, simple and kind of disgusting, and really stupid at times. But you keep coming back for more because you feel it. ",
            "created": "Wed, 29 Jul 2020 00:28:13 GMT",
            "type": "outline"
        },
        {
            "text": "I don’t care who Biden picks for VP as long as it isn’t a Republican.",
            "type": "outline",
            "created": "Tue Jul 28 08:03:21 +0000 2020"
        },
        {
            "text": "Sports teams are a lot like nursing homes for concentrating and distributing the virus. This restart of everything is ridiculous. We're damaging ourselves in obvious ways that we're in denial about. A pandemic is nothing to fool around with. We need to start over with a new lockdown, only this time do it right. ",
            "type": "outline",
            "created": "Tue Jul 28 11:39:50 +0000 2020",
            "image": "http://scripting.com/images/2017/12/20/shrek.png"
        },
        {
            "text": "<a href=\"http://scripting.com/2016/12/30/learningToRespectMyself.html\">Some of us</a> walk around the world in white, male privileged bodies, yet we still, at our core, don't believe we deserve real friendship. ",
            "created": "Tue, 28 Jul 2020 15:54:21 GMT",
            "type": "outline"
        },
        {
            "text": "I wonder sometimes if people read their own Twitter replies and think how they’d feel if someone talked to them that way.  If you must reply, try a little humility, as in “imho.” Better to RT with a comment so everyone can feel your attitude.",
            "type": "tweet",
            "created": "Tue Jul 28 10:36:11 +0000 2020",
            "tweetId": "1288060678083948544",
            "tweetUserName": "davewiner"
        },
        {
            "text": "On this day in 2016 -- <a href=\"http://scripting.com/2016/07/28/dontFeedDjTrump.html\">Don't feed the Trump</a>. By now most people have <a href=\"https://en.wikipedia.org/wiki/Don_Rickles\">figured</a> out <a href=\"https://en.wikipedia.org/wiki/Rodney_Dangerfield\">Trump's</a> <a href=\"https://en.wikipedia.org/wiki/Joan_Rivers\">schtick</a>, but back then it was new and to many, entertaining. ",
            "created": "Tue, 28 Jul 2020 14:56:28 GMT",
            "type": "outline"
        },
        {
            "text": "I'm going to try to find some good news to put here tomorrow. ",
            "created": "Wed, 29 Jul 2020 00:22:21 GMT",
            "type": "outline"
        },
        {
            "text": "Living in the country, part 3071. Some animal, apparently, has made a nest in the air conditioning system of my car. This includes a fair amount of animal urine. So when I drove into town today, about 1/2 hour in each direction, I was inundated in the smell. Ugh. ",
            "created": "Tue, 28 Jul 2020 15:50:04 GMT",
            "type": "outline"
        },
        {
            "text": "Trump & Biden v the Virus",
            "created": "Tue, 28 Jul 2020 20:10:35 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Trump isn't running against Biden.",
                    "created": "Tue, 28 Jul 2020 20:10:41 GMT"
                },
                {
                    "text": "He's running against the virus."
                },
                {
                    "text": "Biden is running against the virus too."
                },
                {
                    "text": "The campaign covers a full spectrum of sins in the way the US has gotten here. ",
                    "created": "Tue, 28 Jul 2020 20:17:22 GMT"
                },
                {
                    "text": "The Dems are almost as responsible as the Repubs, btw.",
                    "created": "Tue, 28 Jul 2020 20:17:42 GMT"
                }
            ]
        }
    ]
}