{
    "created": "2025-03-04T05:00:00.000Z",
    "flInCalendar": true,
    "name": "04",
    "path": "2025/03/04",
    "text": "March 04",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I'm trying to get ChatGPT to not assume I have the same abilities as it has. You can't dump a huge amount of code at me and expect me to quickly see what changed, that's not how human intellect works, but this is something computers are <i>extremely</i> good at. I told my bot that it would work a lot better if they just told me what to change. I said this: \"I have a lot of experience being a human being and working with other humans, and all your clients as far as I know are human.\" In other words, be concise and direct. This is what it said in response. \"That’s a sharp observation, and I appreciate the insight. I'll keep focusing on clarity, directness, and being actually helpful rather than just dumping information. If I ever seem to be leading you down a non-optimal path, feel free to call it out!\" Note how concise the response was. More advice for the bot. Help your human understand. I think maybe eventually we may be their pets. Try scratching behind the ears. On the other hand, to my human friends, do not depend on the strategies they choose. They will never on their own question the path they took. It may not be the optimal one, but they'll keep going down it. It's up to you to say nah this isn't the way I want to go, and they will always respect that. It's not like <a href=\"https://www.youtube.com/watch?v=Wy4EfdnMZ5g&t=18s\">HAL in 2001</a>. I've sometimes wasted  whole programming session going in the wrong direction assuming my bot was good at this. None of them are, as far as I can tell. ",
            "created": "Tue, 04 Mar 2025 16:02:42 GMT",
            "type": "outline",
            "image": "https://s3.amazonaws.com/scripting.com/images/2024/05/03/shootThisDog.png",
            "flInCalendar": true
        },
        {
            "text": "The single most important thing about what Musk is doing is that it is Musk that is doing it. Not elected, not accountable to anyone, and the only way we know what he's doing is from the aftermath. We play no role in his choices. Plus, he would be our last choice if we were in the market for a crazy despot to ruin our country. He wasn't born or educated here, and thus has very little idea of who we are and thus what the people he's firing do.",
            "created": "Tue, 04 Mar 2025 14:05:59 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Remember when watching the speech tonight, if you are watching, what <a href=\"https://www.youtube.com/watch?v=UXR_bqyAy4E&t=170s\">our Capitol was like</a> on that infamous day. The guy speaking, the guy up there on the podium, he did that. That's who he is. And where is right now, that's where it happened. Takes a lot of nerve to return to the scene of his greatest crime, so far. ",
            "created": "Tue, 04 Mar 2025 13:51:57 GMT",
            "type": "outline",
            "image": "https://s3.amazonaws.com/scripting.com/images/2024/11/13/mobIncited.png",
            "flInCalendar": true
        },
        {
            "text": "Another question about tonight. Where will Elon be? In the seat usually occupied by the VP or the Speaker? Will he make faces at the camera or interrupt Trump? ",
            "created": "Tue, 04 Mar 2025 14:12:55 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The news should always report whether a bit of news is a financial plus or minus for Trump as in does this thing make him richer or poorer. That way you can zero in on the \"why\" of everything. ",
            "created": "Tue, 04 Mar 2025 21:30:55 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I'm thrilled the <a href=\"https://sports.yahoo.com/article/warriors-vs-knicks-odds-predictions-165116069.html\">Knicks</a> are playing tonight. That's what I'll be watching. Let me know if anything happens in DC.",
            "created": "Tue, 04 Mar 2025 21:14:42 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}