{
    "created": "2025-03-05T05:00:00.000Z",
    "flInCalendar": true,
    "name": "05",
    "path": "2025/03/05",
    "text": "March 05",
    "type": "calendarDay",
    "subs": [
        {
            "text": "We need a new kind of social network designed to run an effective response to fascism. So far all we have are profit centers for billionaires and would-be billionaires.",
            "created": "Wed, 05 Mar 2025 15:19:13 GMT",
            "type": "outline",
            "image": "https://s3.amazonaws.com/scripting.com/images/2022/02/16/gaslight.png",
            "flInCalendar": true
        },
        {
            "text": "When I ask a personal question on one of the AI bots, all of a sudden on Facebook I'm getting ads about what I asked about. It could be a coincidence, but it's happened a few times, on more than one system. And I'm a paying customer on all of them. \n",
            "created": "Wed, 05 Mar 2025 22:14:51 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "People who criticize Dems for weak opposition at the SOTU are not hypocrites only if they said before the event what they would do. I was glad not to have to choose. I think in the end they did what made sense to each one individually. The range of response by the Dems was much broader than the Repubs. We should be thankful they haven't capitulated, as so many have, esp in what we used to think of as journalism.",
            "created": "Wed, 05 Mar 2025 15:19:36 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "One thing to be grateful for, Trump didn’t invite any of the Jan 6 rioters back to the Capitol for his speech.",
            "created": "Wed, 05 Mar 2025 14:31:02 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Watch out for people who celebrate your freedom while profiting from your enslavement.",
            "created": "Wed, 05 Mar 2025 14:31:49 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}