{
    "created": "2025-03-15T04:00:00.000Z",
    "flInCalendar": true,
    "name": "15",
    "path": "2025/03/15",
    "text": "March 15",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I'd love to get a list of old school bloggers who are still at it. How would you go about that? I decided to give it to Gemini, limiting it at first to 100 bloggers. Here's the <a href=\"https://daveverse.wordpress.com/2025/03/15/finding-old-school-bloggers-who-are-still-at-it/\">prompt</a> I wrote. For a while I was wondering what \"deep research\" was for, but as it's starting the work, I'm thinking of resources that would fit in -- like blogtree.com -- a fascinating site, gives a clear picture how blogs emerge out of the community of an earlier blog. Anyway it's working on it while I write this post. :smile: ",
            "created": "Sat, 15 Mar 2025 13:59:01 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "An application ChatGPT is great it. You're staring at some code, it's really straightforward, you've done this a thousand times, but it doesn't work. Stare at it some more. Try re-entering it. Change the names of things. Still doesn't work. Copy and paste the problem code into ChatGPT and in an instant it tells you without you even having to ask that your comment isn't properly terminated, so the runtime was never seeing the code, and nothing I did made the slightest difference. The information was there. I had been staring at it, but humans see what we expect to see. Machines don't have that problem, at least not in this way (thinking of hallucinations).",
            "created": "Sat, 15 Mar 2025 13:56:10 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Why is scripting.com not https? I hope you can see that I have no trouble deploying https sites here. I use <a href=\"https://caddyserver.com/\">Caddy</a> on my Linux servers, and I don't see why anyone uses anything else. It's really easy and requires none of the work people complain about. Anyway the reason scripting.com is http and not https is that the site dates back to 1994, before there was such a thing as https. Google didn't start their push to get the web to convert to https until 2014, 20 years after I started blogging. Have a look at <a href=\"http://scripting.com/1999/12/31.html\">any</a> of <a href=\"http://scripting.com/fatpages/about.html\">my</a> <a href=\"http://scripting.com/davenet/stories/DocSearlsonSteveJobs.html\">archived</a> <a href=\"http://scripting.com/davenet/1994/10/18/billgatesvstheinternet.html\">blog</a> <a href=\"http://scripting.com/davenet/1999/05/24/editThisPage.html\">posts</a> and <a href=\"http://scripting.com/frontier/olddefault.html\">docs</a>, the're pretty much all there. This is something I'm proud of. I wanted to create a record from the start, it was very deliberate. I was already an experienced developer when the web started up, so I had an idea what I was doing. I also use images on my site, in the right margin of posts, and lately as \"inline\" images, in their own boxes with a caption. It's a way for me to play with the ideas, and adds color to pages that are almost all text. So if I were to move the site from S3 to one of my hosted servers, which would be a fairly major undertaking on its own and add a lot of overhead because Amazon takes care of a lot of the bullshit you have to deal with, there would be a small matter of what about the images? They would all break if scripting.com was hosted on https and they were served from http. Now you might say -- Dave all you have to do is move all those images to a place with https support and remap the domains, and take care of all the michegas that's going to pop up. Or suffer with broken images. I decided to instead tell Google to stop trying to own something that belongs to no one and everyone. If they want a more secure web, create it, and make a browser for it, and respect the original web alone. Hopefully this clears it up. ",
            "created": "Sat, 15 Mar 2025 13:16:03 GMT",
            "type": "outline",
            "image": "https://s3.amazonaws.com/scripting.com/images/2023/07/05/pinkyFacingLeft.png",
            "flInCalendar": true
        },
        {
            "text": "I asked <a href=\"https://chatgpt.com/share/67d580b2-8a68-8012-ad1a-65f2553978bb\">ChatGPT</a> when Google started making HTTPS a requirement. Then I asked when was HTTPS first deployed, and was surprised it was in 1994 in Netscape Navigator. But apparently it was really buggy and wasn't codified until much later. Then I asked when HTTPS became the norm? 2017. So there's a lot of web out there that isn't being maintained by anyone, it just works, that predates HTTPS being widely adopted, if you believe the timelines ChatGPT produced. ",
            "created": "Sat, 15 Mar 2025 13:26:38 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "BTW, these days the images are served via HTTPS so they don't show up in broken links in RSS readers, including my own \"FeedLand\" which is served over HTTPS. ",
            "created": "Sat, 15 Mar 2025 13:29:49 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Another BTW, I'm still thinking about how I want to transition from the public and open-to-anyone FeedLand servers. So if you're still using .org or .com, they're still on the air doing the same thing they've been doing all along.",
            "created": "Sat, 15 Mar 2025 13:30:36 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://github.com/scripting/wpIdentity/issues/3\">Looking for help</a> with <a href=\"https://www.npmjs.com/package/wpcom\">wpcom</a> API in Node.js app.",
            "created": "Sat, 15 Mar 2025 23:10:46 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}