{
    "created": "2025-03-18T04:00:00.000Z",
    "flInCalendar": true,
    "name": "18",
    "path": "2025/03/18",
    "text": "March 18",
    "type": "calendarDay",
    "subs": [
        {
            "text": "This post is for idiots like you who <a href=\"https://imgs.scripting.com/2025/03/18/theBulwarkHatesYou.png\">click</a> on links to The Bulwark.",
            "created": "Tue, 18 Mar 2025 12:44:53 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "John Palfrey on the moment",
            "created": "Tue, 18 Mar 2025 18:53:58 GMT",
            "type": "outline",
            "description": "It would be a good idea for our Republic to avoid sleepwalking through a Constitutional crisis.",
            "subs": [
                {
                    "text": "This is like that moment, five years ago, when we realized that Covid was going to kill a lot of us but it hadn't happened yet. A lot of people weren't yet aware. My <a href=\"http://scripting.com/images/2024/10/02/palfrey2003.jpeg\">friend</a> <a href=\"https://en.wikipedia.org/wiki/John_Palfrey\">John Palfrey</a>, who is a legal scholar, has been writing about this moment on LinkedIn and Facebook. Things are flashing by very quickly, so I'm going to publish his latest piece here, below, so it gets a chance to get to the places I'm hooked into.",
                    "created": "Tue, 18 Mar 2025 18:52:38 GMT",
                    "type": "outline",
                    "subs": [
                        {
                            "text": "Lawyer friends and non-lawyer friends: has it become hard to say out loud in public: \"we believe in the rule of law in America\"? That seems not remotely controversial as a concept. The relative quiet on this topic is what is striking me most at the moment.",
                            "created": "Tue, 18 Mar 2025 18:54:36 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "It would be a good idea for our Republic to avoid sleepwalking through a Constitutional crisis. Of course there are extremely talented lawyers working overtime on many fronts. Those who are not directly involved in litigation have other tools, including voice and funding and organizing, to make plain the simple truth that we should not let the rule of law slip away in America bit by bit. That will continue to happen if the rulings of federal judges can simply be ignored or sidestepped with impunity.",
                            "flInCalendar": true
                        },
                        {
                            "text": "If the legislature has abdicated its role in checking the power of the executive, and then the judicial branch is also out, well, that leaves just one. This is not \"fancy law stuff\". This is \"4th grade civics stuff\" -- separation of powers, checks and balances (I know, I know, we don't teach civics enough in America...).",
                            "flInCalendar": true
                        },
                        {
                            "text": "It is actually *not* more complicated than that. It can't be that hard to say out loud: \"we value the rule of law in America\" -- no matter your politics or party.",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Get back on the air",
            "created": "Tue, 18 Mar 2025 16:12:28 GMT",
            "type": "outline",
            "description": "The Dems only problem is there is no voice, no pulse, no heartbeat.",
            "metaImage": "https://imgs.scripting.com/2025/03/18/getBackOnTheAir.png",
            "subs": [
                {
                    "text": "The Dems highest priority should be to get the Kamala Harris campaign back on social media, 24 by 7, with the truth and snark, irreverance, disrespectful of the Repubs, as a matter of principle. They were great. Perfect. We need a voice for the Democrats on the social networks. ",
                    "created": "Tue, 18 Mar 2025 16:04:29 GMT",
                    "type": "outline",
                    "flInCalendar": true
                },
                {
                    "text": "Would someone please send this to AOC, Jasmine Crockett, Bernie Sanders, Mark Cuban, James Carville, anyone else you can think of. ",
                    "created": "Tue, 18 Mar 2025 16:18:18 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The Dems only problem is there is no voice, no pulse, no heartbeat. Even without this, they almost won the last election. ",
                    "created": "Tue, 18 Mar 2025 16:16:45 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Everything you like about government came from the Democrats. ",
                    "created": "Tue, 18 Mar 2025 16:13:59 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "We miss you. Get <a href=\"https://daytona.scripting.com/search?q=%22on%20the%20air%22\">back</a> on the air! No time to lose.",
                    "created": "Tue, 18 Mar 2025 16:15:37 GMT",
                    "inlineImage": "https://imgs.scripting.com/2025/03/18/getBackOnTheAir.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}