{
    "created": "2025-03-21T04:00:00.000Z",
    "flInCalendar": true,
    "name": "21",
    "path": "2025/03/21",
    "text": "March 21",
    "type": "calendarDay",
    "subs": [
        {
            "text": "It's been <a href=\"https://imgs.scripting.com/2025/03/21/onemonth.png\">exactly</a> <a href=\"http://scripting.com/2025/02/21.html\">one month</a> since <a href=\"https://this.how/wordland/\">WordLand</a> opened to the public. ",
            "created": "Fri, 21 Mar 2025 20:28:07 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Thanks to <a href=\"https://www.msn.com/en-us/news/technology/my-new-daily-blog/ar-AA1B2vJU?apiversion=v2&noservercache=1&domshim=1&renderwebcomponents=1&wcseo=1&batchservertelemetry=1&noservertelemetry=1\">Ben Werdmuller</a> and <a href=\"https://om.co/2025/03/16/my-new-daily-blog/\">Om Malik</a> for their nice writeups of WordLand on their blogs. They're right. It is a small piece that can be hooked into lots of places, as is WordPress a big place that can host lots of apps many of which haven't been written yet. Products that look outward that can be hooked up in a million ways to everything, and leave the door open for those who follow. Such products are rare in our world. People always try to own their users by locking out competitors. I found a perfect spot for me to put some software, and I am having fun watching people use it, and coming up with new features that build on what we have. I think the writing tools market for WordPress will be huge, and I firmly believe that will turn into what I call \"the writer's web\", which you could also think of as just the web. Ben thinks of it as the \"indie web,\" and that's fine. It's all just the web. Anyway, I should have put something here a long time ago, but I didn't look inside WordPress until a couple of years ago and I really liked what I found. ",
            "created": "Fri, 21 Mar 2025 15:46:04 GMT",
            "type": "outline",
            "image": "https://s3.amazonaws.com/scripting.com/images/2023/04/24/cheshireCat.png",
            "flInCalendar": true
        },
        {
            "text": "Mini-spoilers follow. I'm a Severance lover, it's definitely one of the best shows ever, and I feel even more so after the season 2 finale which I watched last night on AppleTV+. I think there are two types of Severance users. One whose focus is on the evil and the other whose focus is on the love. If you think nothing happened in the finale then you're the first type, if you are the second type, this episode was incredible rich. And we learned what the goats were about and that's not nothing. ",
            "created": "Fri, 21 Mar 2025 14:26:56 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Here's <a href=\"https://chatgpt.com/g/g-67dd5fa5d278819192d9fca03485723f-wordland-support\">something</a> that could be useful. A ChatGPT with instructions on how to help a user with \"WordLand\". Try clicking the <a href=\"https://chatgpt.com/g/g-67dd5fa5d278819192d9fca03485723f-wordland-support\">link</a> and see what happens, esp if you're a regular WordLand user. I discovered the feature first by asking if the bot knew what WordLand was, and it said it did, and got it mostly right. I've been using ChatGPT to develop the product, so it's possible it has retained some of the info. And the <a href=\"https://this.how/wordland/\">docs</a> are on the web. This is one of those times when you really want the AI bot to ingest everything it can find. Worried about hallucinations. But with a product like WordLand, which could show up problems in the browser or a WordPress theme, a lot of the help requests are not problems with WordLand itself. Here's a <a href=\"https://github.com/scripting/wordlandSupport/issues/62\">thread</a> where you can report on your experience. Remember the <a href=\"https://this.how/commentGuidelines/\">guidelines</a>. Thanks! ",
            "created": "Fri, 21 Mar 2025 12:41:10 GMT",
            "type": "outline",
            "image": "https://s3.amazonaws.com/scripting.com/images/2023/04/29/raisins.png",
            "flInCalendar": true
        }
    ]
}