{
    "created": "2025-03-24T04:00:00.000Z",
    "flInCalendar": true,
    "name": "24",
    "path": "2025/03/24",
    "text": "March 24",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I was just thinking about themes for WordPress, and thought to look up Manila themes, and found we have a <a href=\"http://themes.userland.com/newsItems/viewDepartment$New%20Radio%20Theme\">whole website</a> that's still <a href=\"http://themes.userland.com/about\">running</a> (thanks Jake!) where you can see the catalog of themes we had for Manila and Radio (thanks Bryan Bell!). I want something like this for WordPress themes that work beautifully with WordLand-authored blogs. ",
            "created": "Mon, 24 Mar 2025 22:26:22 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The ruling class in America is more out in the open now. Pretty much the same people who brought us the <a href=\"https://en.wikipedia.org/wiki/Bankruptcy_of_Lehman_Brothers\">Lehman Brothers</a> too-big-to-fail meltdown in 2008 and the <a href=\"https://en.wikipedia.org/wiki/Brooks_Brothers_riot\">Brooks Brothers Riot</a> in Y2K. Not sure if <i>oligarch</i> is the right word. Peter O'Toole starred in <a href=\"https://en.wikipedia.org/wiki/The_Ruling_Class_(film)\">The Ruling Class</a>, a favorite when I was younger. The <a href=\"https://www.youtube.com/watch?v=w936v-gomtc\">last song</a> in the movie is pretty freaking great. ",
            "created": "Mon, 24 Mar 2025 14:15:34 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2025/03/24/rulingClass.png",
            "flInCalendar": true
        },
        {
            "text": "I want natural language text macros in ChatGPT. I would devise a macro that turned random text I wrote online into a properly formatted blog post. for example when i write fast i almost never stop to capitalize things that should be capitalized. or i might abbreviate the name of a product so i expect it to fill it in, as a professional copy editor would. I hope we're heading there. And if they have this, put it behind a simple api so i can wire it into my favorite writing tool. We could even work on a set of standards, a higher level Markdown if you will, that goes deeper than formatting. That would be something for an experienced copy editor to do imho. ",
            "created": "Mon, 24 Mar 2025 13:41:33 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "We're getting into WordPress in a new way, the need for a <a href=\"https://github.com/scripting/wordlandSupport/issues/64\">featured image</a> came from users. I didn't know they had this feature in WordPress. If you asked me if it did, I would have said yes, I'm sure it does, but where and what is it called? i could've gotten that too via chatgpt, but i would have had to think of it. that's where having sharp users makes a world of difference. When people thank me for my generosity, they don't get it. I want something out of it, your experience and your mind. It's one of my main raw materials.",
            "created": "Mon, 24 Mar 2025 13:41:03 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "With all the good stuff happening with \"WordLand\" I haven't found time to wind down feedland.com and feedland.org. The servers are still working, though not performing as I'd like them to, but it doesn't seem I'm going to get the time to do a graceful transition before my self-imposed March 31 deadline. So I'll come up with a new plan, and if you're using either of these services, enjoy! and keep <a href=\"https://dictionary.cambridge.org/us/dictionary/english/forewarned-is-forearmed\">backing up</a> your subscription list. ",
            "created": "Mon, 24 Mar 2025 13:26:56 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}