{
    "created": "2025-03-25T04:00:00.000Z",
    "flInCalendar": true,
    "name": "25",
    "path": "2025/03/25",
    "text": "March 25",
    "type": "calendarDay",
    "subs": [
        {
            "text": "What a world we live in. ",
            "created": "Tue, 25 Mar 2025 10:33:28 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "A thought for everyone struggling to see a good future in all the michegas. My advice -- please -- do your protesting, resisting, DEIing, organizing, learning, and look for silver linings (they are there) and most important keep doing things that feed your soul. Treat yourself with love even if the world isn't. So in that spirit for those of us who love cats -- a <a href=\"https://prisonjournalismproject.org/2024/10/23/cats-came-to-my-california-prison/\">story</a>.",
            "created": "Tue, 25 Mar 2025 10:56:18 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "You know how they have <a href=\"https://www.epa.gov/smartgrowth/national-walkability-index-user-guide-and-methodology\">walkability</a> scores for different places? I live in a place now with a score of zero, you can't do anything without a car. I moved from a place with a <a href=\"https://www.walkscore.com/score/301-w-57th-st-new-york-ny-10019\">score</a> of 99. I'd like to have social networks get a score like that, for how much they feed energy into the open web, vs how much they take out. Something that attracts you from the open web, uses it to build its network, but doesn't reciprocate, gets a low score. Like Twitter or Facebook, they'd have a lot of nerve saying they were of the web, and thankfully they don't. But Bluesky? They would like you to believe they are of the web, that they are feeding the web, when they are not. They would get Twitter's score, divided by two for the dishonesty. Substack? They don't make the claim so they're bad for the web but not the worst. Mastodon? They're trying. But they could make a concerted effort to check the boxes on \"textcasting\", and implement support across their entire network. Give writers a chance to really work on the platform. Give Bluesky some competition which they desperately need (by my estimation, probably not theirs). ",
            "created": "Tue, 25 Mar 2025 10:57:17 GMT",
            "type": "outline",
            "image": "https://s3.amazonaws.com/scripting.com/images/2023/04/17/asGoodAsItGets.png",
            "flInCalendar": true
        },
        {
            "text": "This may seem controversial, but the Repubs do have a point re <a href=\"https://en.wikipedia.org/wiki/Diversity,_equity,_and_inclusion\">DEI</a>. We really do have a problem honoring the achievements of white men. I know because I get the bullshit when people have tried to honor me for my achievements. When I was offered a keynote spot a the <a href=\"https://isoj.org/symposia/2019/\">ISOJ conference in 2019</a>, to honor my (then) 25 years of blogging, I told the show runner, <a href=\"https://en.wikipedia.org/wiki/Rosental_Alves\">Rosental Alves</a>,  that his audience wouldn't like me. He is gentle generous person, so I believe he was genuinely puzzled. I decided to go, because a future of journalism conference that thinks the advent of blogs was something for journalists and journalism students to acknowledge was something I wanted to see. But in the Q&A period, it all came out. Bluntly and rudely. My contributions mean nothing because I am a white man and in their minds I couldn't have failed. Do they really believe that? Swimming upstream isn't easy for anyone. The experience at that conference was pretty good proof of that. Behind my back in Silicon Valley, while I was writing about the failures along with the victories, when professional journalists and magazine publishers almost unconditionally worshipped the tech gods, I assume because they respect money more than anything, I wrote about the great victories of tech, but a lot of them didn't come from billionaires and VCs. I don't study the creativity of bankers, I care about tools for creative <i>people.</i> I tried to write the truth, didn't always succeed and sometimes I had to retract. But I did pretty much what journalism preaches. Stayed true to what I believe. The \"white men bad\" thing was an excuse for people to say I was weak or stupid, or whatever they think. So we get the backlash now. Some of the energy that MAGA gets is honest frustration of people who are victims of DEI, despite the hype from \"the woke\" which is a term I despise, what's wrong with being awake, what's the alternative, being asleep? dead? -- these righteous assholes, on both sides of this thing, really do treat people as objects, and that hurts, and that kind of pain is hard to forget. ",
            "created": "Tue, 25 Mar 2025 11:13:58 GMT",
            "type": "outline",
            "image": "https://s3.amazonaws.com/scripting.com/images/2023/02/28/presidentCarter.png",
            "flInCalendar": true
        }
    ]
}