{
    "created": "2025-03-28T04:00:00.000Z",
    "flInCalendar": true,
    "name": "28",
    "path": "2025/03/28",
    "text": "March 28",
    "type": "calendarDay",
    "subs": [
        {
            "text": "When your AI bot gave you code that worked do you go back and thank it and say it worked? I do. I don't feel complete until I do. ",
            "created": "Fri, 28 Mar 2025 14:58:53 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "When you put a hack into a piece of software you have to say out loud \"It's a hack.\" That makes it okay.",
            "created": "Fri, 28 Mar 2025 14:54:11 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "We had it all on the web, and we will again",
            "created": "Fri, 28 Mar 2025 14:25:46 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "When we flatten out the differences between the different social networks, we'll start with their RSS feeds, if it works, ultimately there will be no need for different social networks. And again, if it works, we'll bring back the features of the open web that Twitter left out.",
                    "created": "Fri, 28 Mar 2025 14:25:49 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "This is a much better approach to federation, delivers the benefits long before hashing out the diffs betw ATP and ActivityPub will take. And we really have the choice that Bluesky says they will deliver, and yes, it will also be billionaire-proof.",
                    "created": "Fri, 28 Mar 2025 14:25:59 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "What is art?",
            "created": "Fri, 28 Mar 2025 12:47:53 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Yesterday I <a href=\"http://scripting.com/2025/03/27/131121.html\">posted</a> four new ChatGPT-created drawings, created with the latest upgrade of ChatGPT's drawing functions which are better than previous versions. The usual controversy is rekindled on the networks. The concern as always is that it learned how from human artists, puts artists out of business, and human artists create art, machines can't, and since this is created by software, it isn't art. ",
                    "created": "Fri, 28 Mar 2025 12:47:55 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "This gives me a chance to write a piece I've been wanting to write for a while. The meaning of art imho comes from what it says to and about the person observing it, what it does to them, how it changes them, what they experience. For most people, most of the time, they don't have any idea who created the art beyond their name, nationality and when they lived. If you see enough of their work, you learn about the work, not the person. What you learn from art is always going to be about yourself.  ",
                    "created": "Fri, 28 Mar 2025 12:49:59 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "My father once told me, in all seriousness, the cliche about an abstract work of art -- it isn't art, my father said. I said to him, Dad that you feel so strongly about it means to you it most definitely <i>is</i> art. I believe if he were more truthful about his response, he would say what's behind the feeling, he's experiencing dishonesty, stolen valor, the artist is a profiteer, the person who made it a <i>con</i> artist not a real artist. Pretty similar to what people say in 2025 about art-making machines. ",
                    "created": "Fri, 28 Mar 2025 12:51:48 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "More art examples",
            "created": "Fri, 28 Mar 2025 13:58:26 GMT",
            "type": "outline",
            "description": "I gave ChatGPT a picture of a man and woman, reading the screen of a computer to start, then asked for various renditions.",
            "metaImage": "http://scripting.com/images/2025/03/28/siobanAndLogan.png",
            "subs": [
                {
                    "text": "I gave ChatGPT a picture of a man and woman, reading the screen of a computer, then asked for various renditions. ",
                    "created": "Fri, 28 Mar 2025 13:16:53 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "In the style of Leonardo da Vinci.",
                    "created": "Fri, 28 Mar 2025 13:46:03 GMT",
                    "inlineImage": "https://imgs.scripting.com/2025/03/28/davinci.png",
                    "flInCalendar": true
                },
                {
                    "text": "In the style of the cover of a John Steinbeck novel.",
                    "created": "Fri, 28 Mar 2025 12:51:48 GMT",
                    "inlineImage": "https://imgs.scripting.com/2025/03/28/steinbeck.png",
                    "flInCalendar": true
                },
                {
                    "text": "As if it were an illustration inside Huckleberry Finn by Mark Twain.",
                    "created": "Fri, 28 Mar 2025 13:38:34 GMT",
                    "inlineImage": "https://imgs.scripting.com/2025/03/28/huckFinn.png",
                    "flInCalendar": true
                },
                {
                    "text": "As if it were Mr Caputo and Chapman from Orange is the New Black.",
                    "created": "Fri, 28 Mar 2025 13:38:52 GMT",
                    "inlineImage": "https://imgs.scripting.com/2025/03/28/orangeNewBlack.png",
                    "flInCalendar": true
                },
                {
                    "text": "From Succession with Logan and Sioban Roy.",
                    "created": "Fri, 28 Mar 2025 13:39:54 GMT",
                    "inlineImage": "https://imgs.scripting.com/2025/03/28/succession.png",
                    "flInCalendar": true
                },
                {
                    "text": "From Severance, with Mark S and Helly R.",
                    "created": "Fri, 28 Mar 2025 13:43:56 GMT",
                    "inlineImage": "https://imgs.scripting.com/2025/03/28/severance.png",
                    "flInCalendar": true
                },
                {
                    "text": "If you step through the pictures after giving each a bit of your time, by the time you get here, if you were asked if it's art, I hope you'd say Who cares. If it helps you see something new about anything (probably yourself) whether or not it's art is not the most interesting thing.",
                    "created": "Fri, 28 Mar 2025 13:31:27 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Is software art?",
            "created": "Fri, 28 Mar 2025 13:33:40 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I believe it is. When people say my software thinks like they do, what's really happening is the software has gotten out of their way, they've incorporated the way it works into the base of their spine, so they can remain in the world they're writing about, and forget that they're using a piece of software. They perceive that as the software thinking like they do, which is fine -- it's the goal. But it's quite possible they have a totally different experience that takes them out of their suspension of disbelief by not working the way they expect, the same way it did the last 100 times, or it failes to open a file, or whatever might cause them to leave their own world and have to deal with the one I, and generations of software developers, have created, which can (as I know) be excruciating, humiliating, and whatever else you may feel. ",
                    "created": "Fri, 28 Mar 2025 13:02:31 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}