{
    "text": "Conferences and unconferences",
    "created": "Thu, 11 Oct 2018 14:03:50 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I don't like conferences that are all about the speakers, esp if I don't know who they are. When you put people on stage speaking, they have had so much time to prepare, they have slides for everything they thought of while they were preparing, and sometimes that was months. So it takes forever for them to get to the point. Or they don't do much prep, and they just play back the pitch they made to VCs or play the deck they used on their press tour.",
            "created": "Thu, 11 Oct 2018 14:03:58 GMT",
            "image": "http://scripting.com/images/2018/09/17/peeweeHerman.png"
        },
        {
            "text": "Or they're blowhard CEOs, so full of themselves they hardly know anyone else is there. I once heard <a href=\"https://en.wikipedia.org/wiki/Larry_Ellison\">Larry Ellison</a> speak at a tech industry conference where he thought he was talking to an Oracle User Group! At least we got to hear what he says to them (it was mostly press, financial types and his competitors). ",
            "created": "Thu, 11 Oct 2018 14:04:22 GMT"
        },
        {
            "text": "I stumbled across a different format in the 00s that we called an <i>unconference,</i> a name that has since been usurped by a different format. In <a href=\"http://bloggercon.scripting.com/iv/format.html\">our format</a>, it's a discussion group with a leader at the front who interviews the room. It has to be someone who knows who's there, and has an idea for a story, and has a hardass attitude about people droning, repeating, and self-serving. With someone who knows what they're doing, it's something to behold. Everyone is on their toes, involved. And you can be called on, so you can't afford to lose track of what's going on in the room. ",
            "created": "Thu, 11 Oct 2018 14:04:56 GMT"
        },
        {
            "text": "I find professors and reporters make good moderators. The more opinionated they are the better. ",
            "created": "Thu, 11 Oct 2018 14:05:20 GMT"
        },
        {
            "text": "The <a href=\"https://twitter.com/newsgeist?lang=en\">Newsgeist</a> conference I went to a couple of years ago actually carries on that tradition, in some of the sessions. I wonder why? Maybe it's because <a href=\"https://twitter.com/jeffjarvis\">Jeff Jarvis</a> is involved, and he was a big fan of the format back in the day.",
            "created": "Thu, 11 Oct 2018 14:05:21 GMT"
        },
        {
            "text": "What made me think of this is I've been getting email from <a href=\"https://poptech.org/\">Poptech</a>, a conference in Maine in early November. It's totally about the speakers. Kind of <a href=\"https://www.ted.com/attend/conferences\">TED</a>ish (though it's not a copy, it's a contemorary). I didn't know any of the speakers. I'm pretty sure I don't know any of the attendees. Why spend $2000 for that? Not that I didn't consider it, I did. :rocket:",
            "created": "Thu, 11 Oct 2018 14:06:03 GMT"
        }
    ]
}