{
    "text": "Everett Dirksen could tell a story",
    "created": "Sat, 19 Feb 2022 16:04:22 GMT",
    "type": "outline",
    "metaImage": "http://scripting.com/images/2022/02/19/dirksen.png",
    "subs": [
        {
            "text": "The other day I thought of <a href=\"https://en.wikipedia.org/wiki/Everett_Dirksen\">Everett Dirksen</a>, former Republican senator from Illinois. Probably hadn't thought of him in decades.",
            "created": "Sat, 19 Feb 2022 16:04:30 GMT",
            "flInCalendar": true
        },
        {
            "text": "As a kid, I found him endlessly entertaining. He was a funny looking guy and had a froggy kind of voice, but he told great stories, the kind of stories a pre-teen kid could get into.",
            "created": "Sat, 19 Feb 2022 16:05:25 GMT",
            "flInCalendar": true
        },
        {
            "text": "Here's a <a href=\"https://www.youtube.com/watch?v=7Au2-J-3on0\">video</a> of Dirksen telling a story about lobbying.",
            "created": "Sat, 19 Feb 2022 16:05:13 GMT",
            "flInCalendar": true
        },
        {
            "text": "Then I wondered what happened to the American politicians who could tell a story? There aren't many. Certainly not in Congress or the executive branch, or even the court. ",
            "flInCalendar": true
        },
        {
            "text": "I think this is a bigger problem than it first appears. Because to be good at telling a story is being good at relating to other humans. ",
            "flInCalendar": true
        },
        {
            "text": "But Trump is a good storyteller. People think that Trump resonated with his supporters because they're racists and narcissists, like Trump, but it could just be that he can tell a story. ",
            "created": "Sat, 19 Feb 2022 16:11:11 GMT",
            "flInCalendar": true
        },
        {
            "text": "His stories always have him as the hero, and tend to blame immigrants, people of color for all the problems, but a Woodie Guthrie or Will Rogers for example might get the same people to vote Democratic. That is if you still believe in the basic goodness of most people, which I desperately try to cling to.",
            "created": "Sat, 19 Feb 2022 16:17:13 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}