{
    "text": "Why didn't Zuck fight back?",
    "created": "Sat, 19 Feb 2022 16:41:39 GMT",
    "type": "outline",
    "metaImage": "http://scripting.com/images/2022/02/19/facebookstockoversixmonths.png",
    "subs": [
        {
            "text": "I saw a comment that <a href=\"http://scripting.com/images/2022/02/19/facebookstockoversixmonths.png\">Facebook lost</a> half its market cap because they changed the company's name to Meta. It rings true. It was a really stupid move. ",
            "created": "Sat, 19 Feb 2022 16:41:49 GMT",
            "flInCalendar": true
        },
        {
            "text": "They changed their name because journalism has the power to shape public opinion and markets and they've been trashing the company name, confusing the company with the platform and the user community. It's amazing to me how much power they still have.",
            "created": "Sat, 19 Feb 2022 16:50:52 GMT",
            "flInCalendar": true
        },
        {
            "text": "A few years ago they decided as if by osmosis to conflate the company with the things users do with their service. When the users do something evil, they say Facebook did it. It's beyone inaccurate. Underneath the error it seems to me there must be malice. ",
            "created": "Sat, 19 Feb 2022 16:50:59 GMT",
            "flInCalendar": true
        },
        {
            "text": "Say it often enough and it sticks in the mind. ",
            "flInCalendar": true
        },
        {
            "text": "Facebook == evil. Over and over and over.",
            "created": "Sat, 19 Feb 2022 16:51:03 GMT",
            "flInCalendar": true
        },
        {
            "text": "So rather than try to clean up Facebook as a brand name, they just changed the name of the company and tried to disown the biggest cash cow ever. ",
            "created": "Sat, 19 Feb 2022 16:51:04 GMT",
            "flInCalendar": true
        },
        {
            "text": "Funny thing is that Facebook the company has the best propaganda machine ever invented, but they don't use it for that purpose. If Zuck et al had chosen to usurp journalism's name shaping ability he could probably have destroyed them. ",
            "flInCalendar": true
        },
        {
            "text": "It wouldn't have made a difference to me or other people who don't have the power, but you wonder why they didn't use it? ",
            "flInCalendar": true
        },
        {
            "text": "Sure journalism would have screamed bloody murder. So what. Let them scream. ",
            "created": "Sat, 19 Feb 2022 19:56:54 GMT",
            "flInCalendar": true
        },
        {
            "text": "PS: Recall that the word \"Facebook\" has <a href=\"http://scripting.com/2021/09/17/153104.html?title=facebookIsAtLeastEightThings\">at least 8 meanings</a>.",
            "created": "Sat, 19 Feb 2022 19:56:55 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}