{
    "text": "How about those Mets!",
    "created": "Fri, 04 Oct 2024 13:23:51 GMT",
    "type": "outline",
    "metaImage": "https://imgs.scripting.com/2024/10/04/alonso.png",
    "description": "Oh please let it land anywhere but the glove of a Brewer, and then Alonso is jogging around the bases.",
    "subs": [
        {
            "text": "We are a Mets family. Around the kitchen table in my childhood home, the default question was \"What did the Mets do?\" Before I was born we were a Brooklyn Dodgers family, always National League, but the Dodgers left shortly after I was born and the Mets came along when I was seven, and that was it for us. It was the one thing we all agreed on -- the Mets. Much later when my Mom and I would fight about something, a pretty regular thing -- I invented what I called <a href=\"https://hello.typepad.com/hello/2009/11/shea-stadium-rules.html\">Shea Stadium Rules</a>, which meant that a disagreement could be tabled when we remember that underneath everything we are true Mets fans, and ultimately Mets fans can find something to agree on -- that rain or shine and there was plenty of rain, we always stood with our team. A deeper truth of the Mets was we didn't really mind when they lost. Because underneath it all at a whole other level, the Mets have a <a href=\"http://scripting.com/2018/06/24/181734.html\">philosophy</a> that is strong. We are the Mets and that's all you need to know. ",
            "created": "Fri, 04 Oct 2024 13:23:55 GMT",
            "image": "https://imgs.scripting.com/2024/10/04/caseyStengelMetsManager.png",
            "flInCalendar": true
        },
        {
            "text": "Anyway, last night it wasn't lookin good. It was a winner-take-all game with the hated (for now) Milwaukee Brewers. We hated them because it looked like they were going to end the Mets season in the first round of the playoffs. I was getting ready to take off my Mets cap for the year, and put on my Knicks cap, when Lindor walked, then Nimmo singled, and with runners on first and third and one out, Pete Alonso comes to the plate. He's been cold all year. I hoped for a base hit or at least a long sacrifice fly to bring in the runner on third. I couldn't watch but forced myself to. And then <b>it happened</b>. ",
            "created": "Fri, 04 Oct 2024 13:27:44 GMT",
            "flInCalendar": true
        },
        {
            "text": "We who have been joined at the heart to this team and have been through it all, have come to expect failure, but sometimes winning happens, as it did last night. A big swing. The bat connects. Oh please let it land anywhere but the glove of a Brewer, and then all of a sudden Alonso is jogging around the bases, and delirium takes over, in the living room of my mountain home and everywhere Mets fans were at that fateful hour. ",
            "created": "Fri, 04 Oct 2024 13:30:52 GMT",
            "flInCalendar": true
        },
        {
            "text": "We figured at that point they might as well just retire the side, but the Metsies, who Casey Stengel, the first manager asked \"Can't anyone play this stinkin game!\" -- brought in another run, which it turns out we didn't need. ",
            "created": "Fri, 04 Oct 2024 13:33:54 GMT",
            "flInCalendar": true
        },
        {
            "text": "The Brewers were overwhelmed. They tried to score in the bottom of the ninth but the Mets <a href=\"https://www.google.com/search?q=site%3Ascripting.com+mets+philosophy\">philosophy</a> was too strong.",
            "created": "Fri, 04 Oct 2024 13:34:09 GMT",
            "flInCalendar": true
        },
        {
            "text": "It's like every baseball kid's fantasy -- the count is 3 and 2 ,the team's back is to the wall, up comes the slugger, the crowd is silent and then he hits it <b>out of the park</b> and the team emerges victorious and the young person's fantasy saves the day. We've all been there, many times. Last night we got to live it, again, this time for real. ",
            "created": "Fri, 04 Oct 2024 13:34:22 GMT",
            "flInCalendar": true
        },
        {
            "text": "And now we go to Philadelphia to give them a proper dose of New York love. ",
            "created": "Fri, 04 Oct 2024 13:35:04 GMT",
            "flInCalendar": true
        },
        {
            "text": "Meet the Mets meet the Mets, step right up and greet the Mets, etc. ",
            "created": "Fri, 04 Oct 2024 14:00:24 GMT",
            "flInCalendar": true
        },
        {
            "text": "Game 1 of the NLDS begins tomorrow at 4PM. Good times will be had by all (except Philadelphia fans of course).",
            "created": "Fri, 04 Oct 2024 14:00:31 GMT",
            "flInCalendar": true
        },
        {
            "text": "PS: This wasn't <a href=\"http://scripting.com/stories/2007/10/08/baseballCanTeachUsAboutLif.html#p9\">Mookie</a> in <a href=\"https://baseballhall.org/discover-more/stories/whole-new-ballgame/new-york-mets-1986-world-series\">game 6 </a>of the 1986 World Series, but it was along those lines of improbability.",
            "created": "Fri, 04 Oct 2024 14:00:31 GMT",
            "flInCalendar": true
        },
        {
            "text": "PPS: I love that they give a realtime readout on screen of the probability of each team winning. At the top of the ninth, before all the michegas, the Mets had only a 6% chance of winning. I think every game should come with a graph over time of this stat. It would be an emotional map, much more interesting than the other stats.",
            "created": "Fri, 04 Oct 2024 14:01:17 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}