{
    "text": "Is Facebook broken?",
    "created": "Tue, 06 Jun 2017 08:17:52 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "A really good <a href=\"https://techcrunch.com/2017/06/04/when-you-look-into-the-news-feed-the-news-feed-looks-into-you/\">piece</a> in TechCrunch, you should read it if you care about social networks, how we got to where we are, and how stuck they are, and how weird it's going to get. The last part is left to your imagination in TechCrunch. But it's what I find most interesting.",
            "created": "Tue, 06 Jun 2017 08:18:03 GMT",
            "image": "http://static.scripting.com/larryKing/images/2013/12/10/cow.gif",
            "permalink": "http://scripting.com/2017/06/06.html#a040603"
        },
        {
            "text": "I'm indirectly quoted in the TechCrunch story. They point to Gruber's <a href=\"https://daringfireball.net/2017/06/fuck_facebook\">piece</a> entitled <i>Fuck Facebook,</i> and it extensively quotes a <a href=\"http://scripting.com/2017/05/31.html#a110526\">piece</a> I wrote that explains why I can't/won't point to blog posts on Facebook. I followed up to <a href=\"http://scripting.com/2017/06/03.html#a010637\">say</a> I continue to use FB and hope they fix the problem and turn FB into a fantastic blogging surface that I can cross-post to from my blog.",
            "created": "Tue, 06 Jun 2017 08:19:10 GMT",
            "permalink": "http://scripting.com/2017/06/06.html#a040610"
        },
        {
            "text": "I wasn't kidding. I really have no use for FB as a blogging platform as long as they shun the web that gave them life. It was the <a href=\"https://duckduckgo.com/?q=primordial+soup&t=h_&ia=web\">primordial soup</a> they emerged from. Without it, 11-year-old Zuck would have had no way to experiment with social nets. But now Facebook so obviously tries to keep the web out, but my writing depends on the ability to integrate the writing of the web. It's like programming without the ability to factor replicated code into subroutines. <i>In FB blogging you're starting from scratch every time. </i>Yet Zuck uses Facebook to communicate with his users. His posts never have links and no titles, no styling. Just huge numbers of long paragraphs one after the other. That's probably one of the reasons I never read his posts. Maybe his thinking doesn't build on other people's ideas either? I've never met Zuck. Maybe that tells you something. Do you think the Beatles met Chuck Berry? Weird example I know. :shrug:",
            "created": "Tue, 06 Jun 2017 08:21:02 GMT",
            "permalink": "http://scripting.com/2017/06/06.html#a040602"
        },
        {
            "text": "Should we let the news orgs off the hook? Of course not. They're even worse than Facebook. At least FB lets us post as equals to Zuck. And that's meant some voices have gained traction on FB without approval of Zuck and Company. Examples are numerous. But the NYT? You have to belong to a very exclusive club to be invited to post on their site. You have to know someone. And they have to like you. And that keeps out the truly good ideas. I know that when I read the NYT. I am welcome to read, and to pay, but my ideas aren't good enough to appear alongside the writers of the NYT. So they're even more of a silo than FB. ",
            "created": "Tue, 06 Jun 2017 08:23:30 GMT",
            "permalink": "http://scripting.com/2017/06/06.html#a040630"
        },
        {
            "text": "I still want the web. Look at the post I wrote yesterday about <a href=\"http://scripting.com/2017/06/05.html#a080612\">RSS-in-JSON</a>. I spent a lot of time thinking about it, preparing, reading background material. How sterile it would have been if I could only <i>mention</i> the work I learned from instead of giving you, the reader, who I respect, a chance to read for yourself. Maybe you'd come to a different conclusion? You have to know, after all these <a href=\"http://scripting.com/2014/10/07/20YearsOfBlogging.html\">years</a>, that that's totally OK with me.",
            "created": "Tue, 06 Jun 2017 08:25:28 GMT",
            "permalink": "http://scripting.com/2017/06/06.html#a040628"
        },
        {
            "text": "I want the web and Facebook won't give it to me. So I think now Facebook has a huge self-imposed limit to growth, just like the journalists. Eventually I believe they will pay for it. Yet the conventional wisdom in tech is that Facebook won, they killed the goose that gave them the golden egg. I wouldn't bet on it. ",
            "created": "Tue, 06 Jun 2017 08:42:10 GMT",
            "permalink": "http://scripting.com/2017/06/06.html#a040610"
        }
    ],
    "permalink": "http://scripting.com/2017/06/06.html#a040652"
}