{
    "text": "Twitter's latest change is good",
    "created": "Wed, 12 Aug 2020 13:02:40 GMT",
    "type": "outline",
    "description": "Now you don't have to block or mute people who misuse the ability to respond.",
    "metaImage": "http://scripting.com/images/2020/08/12/elephants.png",
    "subs": [
        {
            "text": "Twitter made a <a href=\"https://techcrunch.com/2020/08/11/twitter-now-lets-everyone-limit-replies-to-their-tweets/\">change</a> <a href=\"https://www.techmeme.com/200811/p25#a200811p25\">yesterday</a> that I never thought to ask for, but should have. Now you can decide who can respond to your posts. ",
            "created": "Wed, 12 Aug 2020 13:08:30 GMT"
        },
        {
            "text": "Your choices of who can reply:",
            "created": "Wed, 12 Aug 2020 13:02:46 GMT",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "Anyone.",
                    "created": "Wed, 12 Aug 2020 13:03:21 GMT"
                },
                {
                    "text": "Only people you follow.",
                    "created": "Wed, 12 Aug 2020 13:03:25 GMT"
                },
                {
                    "text": "Only people you mention in the tweet.",
                    "created": "Wed, 12 Aug 2020 13:03:30 GMT"
                }
            ]
        },
        {
            "text": "And since you can mention no one, you can make it so that no one can respond to a post. This is a good feature because people can still comment on your tweet by RTing it, but they can't speak to everyone who reads it unless you let them. ",
            "created": "Wed, 12 Aug 2020 13:03:41 GMT"
        },
        {
            "text": "It's the Twitter equivalent of what I say to people who want to comment on my blog posts. Start a blog, I advise, and say what you have to say and link to my post. Of course what they really wanted was to use my flow to (very often) zing me personally in some way. I consider that spam. Or hijacking. It gets so insidious so quickly that I haven't had comments here for any duration for many years. It starts off collegial, but quickly devolves into abuse as the trolls take over. And that's exactly what has happened on Twitter. Completely predictable.",
            "created": "Wed, 12 Aug 2020 13:09:23 GMT"
        },
        {
            "text": "People like to say Twitter is about conversation, but that isn't my experience. Very little illuminating conversation. Lots of stupid unfunny supposed jokes, and put-downs, and ads masquerading as opinion.",
            "created": "Wed, 12 Aug 2020 13:10:23 GMT"
        },
        {
            "text": "It's a good change:",
            "created": "Wed, 12 Aug 2020 13:06:15 GMT",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "People should feel more courageous in saying what they really believe, rather than avoiding opportunities for people to attack them. ",
                    "created": "Wed, 12 Aug 2020 13:12:08 GMT"
                },
                {
                    "text": "You don't have to block or mute people who misuse the ability to respond. ",
                    "created": "Wed, 12 Aug 2020 13:12:21 GMT"
                },
                {
                    "text": "People who say they can't comment are wrong, they can, they just have to create their own flow. ",
                    "created": "Wed, 12 Aug 2020 13:12:26 GMT"
                },
                {
                    "text": "The author of the post they're commenting on always has the option to RT if it truly is constructive, which gives commenters the incentive to be civil. ",
                    "created": "Wed, 12 Aug 2020 13:12:32 GMT"
                }
            ]
        },
        {
            "text": "Good move all around.",
            "created": "Wed, 12 Aug 2020 13:12:43 GMT"
        }
    ]
}