{
    "text": "A science fiction plot",
    "created": "Tue, 10 Nov 2020 13:25:43 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "A tyrant autocrat is elected POTUS because a lot of people voted for a third party candidate or thought the other candidate was a shoe-in so they didn't bother to vote at all. ",
            "created": "Tue, 10 Nov 2020 13:26:00 GMT",
            "image": "http://scripting.com/images/2020/01/16/rodneyDangerfield.png",
            "flInCalendar": true
        },
        {
            "text": "The people endured the four years, even though they suffered and many died, the country was looted and its government was dismantled.",
            "flInCalendar": true
        },
        {
            "text": "But! Once the four years was up they voted the tyrant out, replacing him with a solid ethical president and vice president. The citizens relaxed and partied and got back to their business of staying alive during a raging pandemic.",
            "flInCalendar": true
        },
        {
            "text": "But! While they weren't looking, the other party took over state legislatures. This was seen as a crafty foxy move because then they get to gerrymander House districts, which gave them an advantage that meant it was relatively easy for them to control the House. ",
            "created": "Wed, 11 Nov 2020 00:50:02 GMT",
            "flInCalendar": true
        },
        {
            "text": "But! They were even more crafty and foxy. There was a little-known feature of the Constitution that meant that controlling state legislatures meant they controlled who was president.",
            "created": "Wed, 11 Nov 2020 00:50:04 GMT",
            "flInCalendar": true
        },
        {
            "text": "The current president, the tyrant, played golf, as he normally does. People relaxed. \"See he doesn't have any nefarious plans!\" said the citizens.",
            "flInCalendar": true
        },
        {
            "text": "More in the next installment. ",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}