{
    "text": "While we're at it, my first real car (not counting a Renault junker I bought hoping it would magically work, it just barely made it home) was a <a href=\"https://www.thetruthaboutcars.com/tag/datsun-b210/\">Datsun B210</a>. I think I paid $3300 new. Those were the days. It was a very reliable little car. I called it the Lawn Mower because that's about how powerful the engine was (slight exaggeration). Back in those days, the mid-70s, the <a href=\"https://www.fhwa.dot.gov/interstate/history.cfm\">Interstate Highway System</a> wasn't finished, and I drove it all around the country, and a lot of it was on two-lane highways with heavy truck traffic. My poor little lawn mower (with me inside!) would get blown around a lot. But it was very reliable. Only broke down once, and that was due to operator error. I ended up trading it in for a <a href=\"http://scripting.com/images/2021/01/25/voyager.png\">hippie van</a>, a high mileage <a href=\"https://www.youtube.com/watch?v=QsqWuR9JI54\">1974 Plymouth Voyager</a>, which I also drove all over the country. The van ended up dead in a ditch in <a href=\"https://en.wikipedia.org/wiki/Chemeketa_Park,_California\">Chemaketa Park, California</a>, a little community I lived in off <a href=\"https://www.google.com/maps/dir/CA-17,+California/Comanche+Trail,+Lexington+Hills,+CA+95033/@37.1575867,-121.9911122,15z/data=!4m15!4m14!1m5!1m1!1s0x808e37e7e8678013:0x54ed81a461ad50b9!2m2!1d-121.9879274!2d37.1479208!1m5!1m1!1s0x808e37c36d2bf239:0x11177495e7605172!2m2!1d-121.9794407!2d37.1614182!3e0!5i1\">Highway 17</a> between Los Gatos and Santa Cruz. Those were the days. I even remember the name of the road I lived on -- <a href=\"https://www.google.com/maps/place/Comanche+Trail,+Lexington+Hills,+CA+95033/@37.1614182,-121.9816294,17z/data=!3m1!4b1!4m5!3m4!1s0x808e37c36d2bf239:0x11177495e7605172!8m2!3d37.1614182!4d-121.9794407\">Comanche Trail</a>. Long time ago. A really beautiful spot. It's where I did the first version of ThinkTank that had expand and collapse, for the Apple II.",
    "created": "Mon, 25 Jan 2021 14:55:25 GMT",
    "type": "outline",
    "image": "http://scripting.com/images/2021/01/25/chickenOnWhiteHouse.png",
    "flInCalendar": true
}