{
    "text": "What's the alternative to piracy?",
    "created": "Mon, 25 Jan 2021 15:59:32 GMT",
    "type": "outline",
    "description": "Some of my money is going to Fox and I totally object to that. ",
    "metaImage": "http://scripting.com/images/2021/01/25/carlson.png",
    "subs": [
        {
            "text": "I think ultimately the only way TV can work in the future is completely <a href=\"https://en.wikipedia.org/wiki/%C3%80_la_carte\">a la carte</a>. ",
            "created": "Mon, 25 Jan 2021 15:59:42 GMT",
            "flInCalendar": true
        },
        {
            "text": "I have subscribed to FUBO and YouTube TV, each for just one channel, both costing about $65 a month. But the money isn't going to the one channel each, it's being spread over hundreds of channels, and some of my money is going to Fox News and I totally object to that. I might cancel both just to avoid paying any money at all to Fox. ",
            "created": "Mon, 25 Jan 2021 16:08:20 GMT",
            "flInCalendar": true
        },
        {
            "text": "Meanwhile when something comes out on HBO, Apple TV or Disney that I'm interested in, there's no way for me to pay to watch it without buying into everything they sell. (I'm only subscribed to Netflix, Amazon and Hulu.)",
            "created": "Mon, 25 Jan 2021 16:00:24 GMT",
            "flInCalendar": true
        },
        {
            "text": "So what alternative is there to piracy? They've created such a convoluted system, that costs so much money for so little, they've completely destroyed their own business. ",
            "flInCalendar": true
        },
        {
            "text": "Maybe the only thing that can make money in the new system are live sports shows. Or ceremonies like the inaugural, that you want to watch as they're happening. And this is all rent. The technology was paid for a long time ago. The system is screwed up beyond recognition. ",
            "created": "Mon, 25 Jan 2021 16:00:48 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}