{
    "text": "The soundtrack of your life",
    "created": "Fri, 03 May 2024 15:40:44 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I've developed new appreciation for two musicians from my generation: George Harrison and Bob Dylan, thanks to the encouragement of two friends, both of whom have links to my childhood believe it or not, but who are current friends in my <a href=\"https://en.wiktionary.org/wiki/dotage\">dotage</a> and they're both on Facebook. ",
            "created": "Fri, 03 May 2024 15:40:51 GMT",
            "flInCalendar": true
        },
        {
            "text": "So my first friend said she likes <a href=\"https://simple.wikipedia.org/wiki/George_Harrison\">George Harrison</a> the best of all the Beatles, and I thought that's weird because it really was down to Paul and John, I thought -- and then I heard this interview with George asking why he didn't explain in his memoir how he worshipped John as a kid, and George took exception, saying yeah in John's mind that's who I am, a kid who worshipped him, which I never did (says George). So now I have gone back through his music and see holy shit he really was as unique as either of the others, and he was more of a collaborator in his later life than either (of course we never got to find out how John would have evolved past 1980). And he was never going to be taken seriously by the others, so he had to get out of there to have the creative life he wanted. ",
            "created": "Fri, 03 May 2024 15:41:38 GMT",
            "flInCalendar": true
        },
        {
            "text": "About Dylan, the credit goes to my local friend and <a href=\"https://500songs.com/podcast/song-173-all-along-the-watchtower-part-one-hes-not-the-messiah/\">Andrew Hickey</a>, who focused my attention on the <i>music</i> of Dylan's songs, when I had only been focusing on the lyrics. Silly of me. He only ever wanted to be seen as a musician, not a leader of anything, and that's where the difficulty came from, and why I wasn't really interested, even though I had listened to all the Dylan songs many times, and had a few of his albums growing up. So I just played <a href=\"https://en.wikipedia.org/wiki/Tangled_Up_in_Blue\">Tangled Up in Blue</a> and realized this has been rolling around in my mind for days, and I wasn't even aware of it.",
            "created": "Fri, 03 May 2024 15:43:02 GMT",
            "flInCalendar": true
        },
        {
            "text": "Kind of like <a href=\"https://en.wikipedia.org/wiki/All_Along_the_Watchtower\">All Along the Watchtower</a> (another Dylan song) in <a href=\"https://en.wikipedia.org/wiki/Battlestar_Galactica_(2004_TV_series)\">Battlestar Galactica</a>, which I just heard is currently <a href=\"https://www.amazon.com/Battlestar-Galactica-Season-1/dp/B000UU2YKE\">on Amazon</a>. I think it's time for another binge of that. ;-)",
            "created": "Fri, 03 May 2024 15:43:59 GMT",
            "flInCalendar": true
        },
        {
            "text": "Anyway, two doors open, and that's always good. You know this is why you pick your music when you're young and stay with it, because it's the soundtrack of your life, and it has new relevance at every step of your evolution. Sure I listen to other music, but -- it's the songs that were big when I was little that matter most. ",
            "created": "Sat, 04 May 2024 00:04:59 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}