{
    "created": "2022-11-06T04:00:00.000Z",
    "flInCalendar": true,
    "name": "06",
    "path": "2022/11/06",
    "text": "November 06",
    "type": "calendarDay",
    "subs": [
        {
            "text": "So maybe we need to get fascism out of our system in the US. Yes, millions of people could die, but we've been through that before and survived as a country. Maybe after going through the whole fascism mess we'll have a greater appreciation for basic freedoms.",
            "created": "Mon, 07 Nov 2022 04:57:55 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I am not a parody of Elon Musk.",
            "created": "Mon, 07 Nov 2022 04:57:45 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Billionaires got us into this mess, it's <a href=\"https://www.scientificamerican.com/article/einstein-s-parable-of-quantum-insanity/\">insane</a> to think billionaires can do anything but create more messes. ",
            "created": "Mon, 07 Nov 2022 04:22:25 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Because I’ve been <a href=\"https://github.com/scripting/reallySimpleActivityPub/issues/1\">asking</a> about <a href=\"https://tinysubversions.com/notes/reading-activitypub/\">ActivityPub</a> some people think it must be magic or at least interesting. It’s not — it’s a poorly designed and documented reimplementation of preexisting tech. I think only in software does his kind of BS happen. Nevertheless if we can wrangle it into something understandable and usable we might get to an interoperable replacement for Twitter without waiting years for <a href=\"https://en.wikipedia.org/wiki/Jack_Dorsey\">Jack Dorsey</a>, who journos love, to reinvent it all yet again.",
            "created": "Mon, 07 Nov 2022 04:20:10 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2011/11/24/turkey.gif",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1589246937685200896\">Podtrust query</a>. I have both an iPhone and an Android phone. I like to listen to podcasts of course. I drive in areas w/o cell coverage. I need a podcast app that doesn't stream the MP3s, rather it downloads the MP3 and plays it straight through. So far all of them stream. ",
            "created": "Sun, 06 Nov 2022 13:23:50 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}