{
    "created": "2022-11-08T05:00:00.000Z",
    "flInCalendar": true,
    "name": "08",
    "path": "2022/11/08",
    "text": "November 08",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Best advice for new Twitter management team. Stop the seat of the pants bullshit.",
            "created": "Wed, 09 Nov 2022 02:03:40 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I found a bug in the <a href=\"https://github.com/scripting/oldSchoolBlog/blob/master/README.md\">CMS</a> I use to build Scripting News. When I change the title of a story the guid in the RSS feed for the site changes, so if you're reading me in a feed reader, you'll see the story again with its new title. I have a <a href=\"https://github.com/scripting/oldSchoolBlog#v0723----11722-by-dw\">fix</a> for the bug, just haven't deployed it here yet. And my apologies. This bug has been there for a long time. I'm only seeing it now because I'm debugging a feed reader myself. ",
            "created": "Wed, 09 Nov 2022 02:13:37 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "If they put Twitter <a href=\"https://gizmodo.com/elon-musk-twitter-paywall-genius-idiot-nazis-tom-fitton-1849756014\">behind a paywall</a> that will probably be the end of Twitter as the place of record.",
            "created": "Tue, 08 Nov 2022 12:40:51 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Meanwhile, Twitter has missed probably the biggest and easiest <i>huge</i> revenue source available to them and this includes the Dorsey-run Twitter. You have to actually try to buy an ad on Twitter to get it. Their ad system is designed for professional advertisers. They start right off with terminology that no normal person understands. All I know is the one time I considered promoting a tweet, just to see if it worked, I ended up backing out after the first or second question. Instead, they could make it <i>easy. </i>Ask for a credit card (assuming they don't already have it from some other purchase). Then ask which tweet the user wants to promote (unless they came there by clicking the \"promote this tweet button\" on the tweet they want to promote). Then ask how much they want to spend (suggest an amount, \"most people spend $18 the first time they promote a tweet\" for example). Click Submit and off you go. And please follow up with the user by email. Make sure they know how many impressions they got. And you might as well offer a money-back guarantee for the first few tweets. After all the whole thing cost Twitter exactly nothing. And make sure people get their money's worth. It'll be like gambling, fun at first, then addictive. And the money will just roll in. And you can forget about bullshit like paywalls and membership fees. That's nickel and dime stuff. Here we're talking about Google-like money! And with some of the profits you can afford to pay people who produce sticky content that keeps people coming back. You have all the stars, make sure they feel appreciated (something Twitter is doing very badly now, really always have).",
            "created": "Tue, 08 Nov 2022 12:41:22 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/05/18/melo.png",
            "flInCalendar": true
        },
        {
            "text": "Quick update on my eyes. A week ago last Friday I had to <a href=\"http://scripting.com/2022/10/28.html#a133050\">stop wearing a contact lens</a> in my right eye so it could be measured for surgery I'm having late this month. The contact lens interferes with the measuring. I was very apprehensive about this, but it worked out rather well. I do see double in some situations, and depth perception is a problem that I have to always be conscious of, but driving is not a problem as I feared it would be, because all the distances there are far, and there's no problem with depth perception. A couple of days ago a wild turkey walked into my path and I was absolutely sure I was going to hit him, but swerved adeptly in an instant, and he took off at the same moment, and the turkey lived and I was impressed that my eyes and brain were able to work well together. But I do notice how small all the type is on the computer and how, if there are ways to make it more accessible, I sure don't know where they are. So I feel my way around while typing, and I'm sure I leave typos in there. This Friday I go for the measurement and then I can (I think) resume wearing the contact lens. But I kind of like not having to put it in and take it out every day. Maybe I'll stick with this approach. ",
            "created": "Tue, 08 Nov 2022 13:16:41 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Twitter is mostly bullshit",
            "created": "Wed, 09 Nov 2022 01:49:54 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2022/11/08/beatlesGetBack.png",
            "description": "My art is creating new media.",
            "subs": [
                {
                    "text": "I don't get anything from being in a club with journos. ",
                    "created": "Wed, 09 Nov 2022 01:54:54 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I certainly don't get anything from reading bullshit press releases from politicians.",
                    "flInCalendar": true
                },
                {
                    "text": "Or people who make their rep by competing to be the biggest asshole on the planet.",
                    "created": "Wed, 09 Nov 2022 01:50:19 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "My art is creating new media. I want to hang out with similarly minded people and people who want to use new media and help build it. ",
                    "created": "Wed, 09 Nov 2022 01:50:19 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "We got stuck in a rut in Twitter for 16 years. Maybe 5 of those years were spent exploring new ideas. The rest -- bullshit.",
                    "created": "Wed, 09 Nov 2022 01:50:52 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I need my <a href=\"http://scripting.com/2022/05/01/143422.html?title=iWantMyKarass\">karass</a>. ",
                    "created": "Wed, 09 Nov 2022 01:50:07 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}