{
    "created": "2022-11-12T05:00:00.000Z",
    "flInCalendar": true,
    "name": "12",
    "path": "2022/11/12",
    "text": "November 12",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Here's the story of \"RSS\" in a sentence: RSS took off when we signed the NYT and that's the world we've been in for the last 20 years. ",
            "created": "Sat, 12 Nov 2022 15:57:03 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "What I really want from AI is for it to sort all my writing into an index, like the index in the back of a book.  i've got 28 years of writing on my site, and there are definitely threads running through it, but i have never been able to visualize those threads. I want the AI to do an editorial job that would be insurmountable for a human. I know I've tried at times to work with editors on that, and they see the scope of it and just give up. Here's the <a href=\"https://github.com/scripting/Scripting-News/tree/master/blog\">archive</a> btw -- if you have an AI and would like to try it out. ",
            "created": "Sat, 12 Nov 2022 15:13:55 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Anyway, when ActivityPub and RSS merge we will have a fantastic social network along with the news reader of the world, as an open system that the Bigs will never break. We will have the online system we've been waiting for. Now we just have to do everything right. :smile: ",
            "created": "Sat, 12 Nov 2022 14:57:44 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Jack Dorsey is like RBG imho. Both meant well, had big ideas about their own impact, but ultimately waited too long to get out of the way.",
            "created": "Sat, 12 Nov 2022 22:04:46 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "A Twitter <a href=\"https://twitter.com/davewiner/status/1591440142195363840\">thread</a> that begins: \"I want Twitter to live. Don't fuck it up Elon Musk.\"",
            "created": "Sat, 12 Nov 2022 14:41:21 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "BTW, imho -- the open <a href=\"https://en.wikipedia.org/wiki/Fediverse\">Fediverse</a> is great, but it will need help to survive what's coming. ",
            "created": "Sat, 12 Nov 2022 14:42:19 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "And, the best thing for the people, forget about big tech companies, investors, governments, journos -- for the people -- is if Twitter survives and thrives, <i>and</i> the Fediverse grows and is a hotbed of innovation. ",
            "created": "Sat, 12 Nov 2022 14:43:54 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "There are a couple of new features in FeedLand, <a href=\"http://data.feedland.org/changenotes/2022/11/11/205211.html?title=newButtonsOnNewsItems\">documented here</a>. With the first, the Document icon on each news item (<a href=\"http://scripting.com/images/2022/11/11/twoNewIconsScreen.png\">screen shot</a>), you can now link to individual items from a news page on FeedLand, and can of course share that link with others. They will not need to log in. I realized we needed this the other day when I wanted to point to an episode of a podcast, not the podcast feed. We didn't have that ability, now we do. And, a bonus is that we can point to long-form feed items in a comfortable to read format instead of in the middle of all the other items. I found this very useful reading stuff this morning on my iPad. Here's an <a href=\"http://feedland.org/?item=427416\">example</a> of a story from The Atlantic. And an <a href=\"http://feedland.org/?item=435534\">untitled post</a> from today's Scripting News. I have to say, I feel so much more powerful now that I can improve my reading environment so easily.  ",
            "created": "Sat, 12 Nov 2022 14:31:38 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "BTW, you can subscribe to the Change Notes feed, in FeedLand itself, or any other RSS reader. The power of open standards! :smile: ",
            "created": "Sat, 12 Nov 2022 14:33:32 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Why we need Twitter. Elon Musk <a href=\"https://twitter.com/elonmusk/status/1591313397362352130\">nails it</a>. \"FTX meltdown/ransack being tracked in real-time on Twitter.\" Exactly. If we depended on professional journalists for this story they;'d be so confused all that we'd hear is mush. But the insiders are on Twitter, and the story that's coming out at least has some truth behind it. Journalism always tells the same bullshit story. (Which varies a little from time to time, the only consistent thread is how much you, little person, depend on us for all the truth we think you can handle, limited by our pathetic understanding of the facts.) ",
            "created": "Sat, 12 Nov 2022 14:23:42 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "ActivityPub and RSS have to come together. It should be possible for a site that produces RSS feeds for each user to peer with a site that uses ActivityPub in the same way. They should have started with RSS, imho, and added whatever they needed via a namespace. I said this in a <a href=\"https://mastodon.social/@davew/109329535083378801\">message</a> earlier today, and was pleasantly suprised by the collegial response. So hopefully you all understand that when I'm saying things like \"I need to get my linkblogging tool hooked up to Mastodon,\" I've taken part of the problem and put it in simple terms. The goal in coming up with open formats and protocols is to maximize interop. Now we have to go back, and if possible, build a bridge between RSS and ActivityPub.",
            "created": "Sat, 12 Nov 2022 13:52:37 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Journalism is botching the blue checkmark story",
            "created": "Sat, 12 Nov 2022 14:17:19 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "A couple of facts:",
                    "created": "Sat, 12 Nov 2022 14:17:57 GMT",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "I have had a blue checkmark for years.",
                            "created": "Sat, 12 Nov 2022 14:17:55 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Last year I could have changed the name on the account to anything I want.",
                            "created": "Sat, 12 Nov 2022 14:17:55 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "What's new is that anyone can buy a blue checkmark and do this. ",
                    "created": "Sat, 12 Nov 2022 14:18:16 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "If you think people who they gave blue checkmarks to are inherently less prank-oriented than the new ones, that's your story. But what journos are reporting as news is not in fact news. ",
                    "created": "Sat, 12 Nov 2022 14:18:47 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}