{
    "created": "2022-11-14T05:00:00.000Z",
    "flInCalendar": true,
    "name": "14",
    "path": "2022/11/14",
    "text": "November 14",
    "type": "calendarDay",
    "subs": [
        {
            "text": "<a href=\"https://github.com/scripting/reallySimpleActivityPub/issues/1#issuecomment-1313912411\">Thinking out loud</a>. I think there will be an explosion of inbound RSS apps. I want WordPress to do it. Substack. And Mastodon. There should be a new address for a user that's simply an RSS feed. Here's an idea -- let DNS do it the mapping.",
            "created": "Mon, 14 Nov 2022 15:17:38 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://dave.micro.blog/2022/11/14/the-role-twitter.html\">The role Twitter plays</a> from a micro.blog perspective. \"Even if you’re not participating, you’re benefitting from the existence of Twitter.\" ",
            "created": "Mon, 14 Nov 2022 14:14:31 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "If Twitter were to fail, it’s hard to know what else would break. I’d rather not find out. When <a href=\"http://scripting.com/2022/03/12/154157.html?title=googleReaderNineYearsLater\">Google Reader</a> was canceled, with lots of notice, it left a hole that hasn’t yet been filled after nine years. And it was much smaller then, than today's Twitter. I'm sure there are some online services that are too big to fail. This is probably something that should be looked into in Congress, because should one of them fail the American taxpayer will be left footing the bill. My sense is that Twitter <i>is</i> one of those services. ",
            "created": "Mon, 14 Nov 2022 12:36:38 GMT",
            "type": "outline",
            "image": "http://static.scripting.com/larryKing/images/2013/03/15/wickedWitch.gif",
            "flInCalendar": true
        },
        {
            "text": "The NBA and hate",
            "created": "Mon, 14 Nov 2022 13:36:11 GMT",
            "type": "outline",
            "description": "The silence of the stars of the NBA is deafening. ",
            "subs": [
                {
                    "text": "I saw a bit of Dave Chappelle's routine on SNL. Very funny how he points out there are a lot of Jews in Hollywood. (That was sarcasm.) I'm sure they're all assholes. No sarcasm there. I had some dealings with them in Napster days. I couldn't believe the ideas they had in defense of their profits. Really scorched earth shit. The sense of entitlement of these people is something to behold. But to be fair, some of them were Christian and while I didn't meet any I bet some of them were black too. That's more a disease of the entertainment business than it is of any one religion or ethnicity.",
                    "created": "Mon, 14 Nov 2022 13:36:18 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "On the other hand most NBA players are black, obviously, and until now I thought they were pretty neutral about Jews. No reason to think otherwise. Until Kyrie Irving lets out the secret, tests the water. It's met with silence from NBA stars. Only LeBron James speaks out, saying he doesn't \"respect\" what Kyrie said and does not \"condone\" it. That's it? Was condoning it actually an option? That's all they have to say. Geez if it were a white person saying something equivalent about black people, or god forbid a <i>Jewish</i> white person, the league would stop and they'd all wear armbands and have candlelight vigils and they (and we, the fans) would force them to divest from the NBA for life. And that would be right. ",
                    "created": "Mon, 14 Nov 2022 13:37:29 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "To be clear, when you deny the Holocaust you're crawling around in the pain of millions of descendants of Holocaust victims. I am only learning how profound that is, being a child of Holocaust survivors myself, after my parents have been gone for years, enough time to now feel the pain that I grew up in, very much inside me, a big part of my foundation. If you think you can ease the pain of being descendants of slaves by denying the Holocaust, well I don't believe you can, and it's not okay any more than it would be for us to deny that slavery happened, which is something today's Repubs very much are doing. We should be helping each other. I thought we were. But I see how mistaken that was. ",
                    "created": "Mon, 14 Nov 2022 13:42:35 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I'm sensing that antisemitism is one of the foundations of the NBA by their silence, and Dave Chappelle is already known to be a total asshole (why was he hosting SNL). ",
                    "created": "Mon, 14 Nov 2022 13:38:30 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I don't expect them to sanction Kyrie, I expect him to be reinstated, and the silent antisemitism to continue. But they let a little truth slip out. And while I was a huge fan of the NBA before, and felt good about it, because they were the one sports league that cared about people and fought against hate, now I can't stand to watch them knowing what I know now. ",
                    "created": "Mon, 14 Nov 2022 13:38:47 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PS: I knew they were racist, btw -- from the way they treated Jeremy Lin. My fault for choosing to overlook that. ",
                    "created": "Mon, 14 Nov 2022 13:48:00 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PPS: Later, I heard more of the Chapelle monologue. Exactly as I thought. Blacks go deep into our pain and think it’s power? Does he think the millions of children of victims of the Holocaust run Hollywood? And the silence of NBA stars is deafening. And NBC? Wow.",
                    "created": "Tue, 15 Nov 2022 02:22:27 GMT",
                    "type": "outline",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}