{
    "created": "2022-11-15T05:00:00.000Z",
    "flInCalendar": true,
    "name": "15",
    "path": "2022/11/15",
    "text": "November 15",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I am @davew@mastodon.social. Follow me. :smile:",
            "created": "Tue, 15 Nov 2022 22:15:47 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Worth isn't a function of money, or what others think of you. It's what you find when you look inside. That's what you're worth.",
            "created": "Tue, 15 Nov 2022 22:05:38 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Once I discovered I could reverse the color on the Mastodon screen I actually love this mofo. They did a very nice job, even on the docs for the API. I think people who have experience working on software commercially are working on this project. It doesn't suck (surprised). The experience of going through this is unlike any experience I've had in software and I've been doing this a long time. ",
            "created": "Tue, 15 Nov 2022 21:31:14 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2022/11/15/mastodonicon.png",
            "flInCalendar": true
        },
        {
            "text": "A designer of software working now, who hasn’t used Facebook and Twitter, and built on their teachings, is like a current musician having not experienced Coltrane or Beatles. How can you make art thats relevant w/o understanding the art people already know.",
            "created": "Tue, 15 Nov 2022 21:25:12 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I've written my <a href=\"http://scripting.com/code/reallysimpleactivitypub/scriptingglue/\">first four verbs</a> for my Mastodon scripting interface. Voila! I can tell I'm going to be obsessed with this. I actually already am. ;-) ",
            "created": "Tue, 15 Nov 2022 21:14:41 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Artists don't hide",
            "created": "Tue, 15 Nov 2022 21:24:42 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I’ve been reading a lot of music history. When a new album came out, every musician would listen, in the first days. They’d go to their shows. Listen and let it affect their own creative process.",
                    "created": "Tue, 15 Nov 2022 21:25:36 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The Beatles went to a Jimi Hendrix show in London and heard him cover Sgt Pepper, a week after the album came out!",
                    "flInCalendar": true
                },
                {
                    "text": "In software years and years go by and no one looks. Can you believe a book about innovation in languages came out, and no chapter about Frontier. All the new ideas, still not in the vocabulary of designers, decades later, I hope not lost to history.",
                    "created": "Tue, 15 Nov 2022 21:26:13 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "People who think of themselves as friends of mine not willing to spend even five minutes to find out what FeedLand or Drummer are. The first has been out for a month, the latter, a year.",
                    "flInCalendar": true
                },
                {
                    "text": "If you think you’re practicing software art, but you’ve got yourself cloistered and protected from outside influence, you are a pretender, not an artist.",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Ask a Jewish boomer",
            "created": "Tue, 15 Nov 2022 21:16:13 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "If you have a boomer friend who is Jewish, you might  ask what their parents told them about antisemitism and the Holocaust. ",
                    "created": "Tue, 15 Nov 2022 21:16:34 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The idea that we will end up in the ovens is pretty well-ingrained from all those talks.",
                    "created": "Tue, 15 Nov 2022 21:27:27 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "So when a comedian, singer or NBA player talks in dog whistles of their Jew-hate, it pretty much freaks us out. You may hear us laugh but inside we're revisiting our parent's fear and pain, and in their own way, love.",
                    "created": "Tue, 15 Nov 2022 21:16:47 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Now a delicate subject -- when the singer, comedian or NBA player is black, this has a special sting because we heard the stories your parents told you about encounters with the police. It's an incredible perspective-shift. Some of us are listening and let it sink in. ",
                    "created": "Tue, 15 Nov 2022 21:17:00 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Now maybe you can appreciate that <i>our</i> parents had the same kinds of talks with us. Our fear is not just of our own personal deaths, but genocide. In the Holocaust they came to kill all the Jews, whole families, neighborhoods. Everyone who was wearing a yellow star. They would line us up in front of ditches and shoot everyone. Then bring in another group and shoot them so their bodies fell on the bodies that were already there. This <i>actually happened</i> to people of our parents' generation. This wasn't some plot to fool you. It fucking happened. It was only luck that kept them from dying this way, kept them alive so they could be our parents. And to warn us of things happening that are exactly what you are doing. We aren't stupid and we haven't forgotten. We know where you are taking us.",
                    "created": "Tue, 15 Nov 2022 21:17:12 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I believe if this genocide happens in America they will  come for blacks too, so what you all are doing is not just morally indefensible, it's not going to keep you and your family out of the ditches and the ovens. ",
                    "created": "Tue, 15 Nov 2022 21:19:15 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "We should be working together. I always kind of thought we were.",
                    "created": "Tue, 15 Nov 2022 21:20:12 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}