{
    "created": "2022-11-28T05:00:00.000Z",
    "flInCalendar": true,
    "name": "28",
    "path": "2022/11/28",
    "text": "November 28",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Dear friends -- I got my right eye fixed today. Was it worth it? Well I had a good all-afternoon nap, so that was pretty good. Now my vision sucks in a new way, but the how-to guide says it'll clear up in a day or two, at most a week. At times the colors are intense, like I imagine an acid trip to be, and some light reflects off objects like a Fourth of July sparkler. I think this is just foreign material being assimilated into human material. Was it worth it? Hmmm. I'll let you know. But I'm pretty sure it was. Your faithful correspondent -- Davey.",
            "created": "Mon, 28 Nov 2022 21:48:55 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/08/18/uncleSam.png",
            "flInCalendar": true
        },
        {
            "text": "I was looking for links to prior eye surgeries, on the left eye. Not a good story. I started with decent vision, and a left-eye floater freaked me out. An eye surgeon said they could get rid of it, they did, but there was a new dead spot in the middle of my left eye. This surgery, in 2007, has given me crappy vision since then. Finally I had to get the lens in my right eye replaced, that's what was done today. After this, when the dust settles, my vision should be closer to what it was after the first surgery. The lesson: when a doctor says they can fix a condition, find out in advance if the cure is worse. A floater, I learned later, is harmless. Your brain gets used to and and factors it out, you stop seeing the floater after a while. The best thing to do is wait it out. Bigger lesson: if you can avoid surgery, avoid it.  ",
            "created": "Mon, 28 Nov 2022 21:56:49 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Reading some stuff I wrote in <a href=\"http://scripting.com/2007/02/14.html\">2007</a> and <a href=\"http://scripting.com/2010/10/20.html\">2010</a>, I was saddened by how much my blog changed for the worse in a few years, because I was trying to fit into Google Reader's idea of what a blog post was, which was not my own view. I wrote posts of all lengths, some with titles, on their own pages, and others just a sentence or two or a paragraph, many on the same page. They used to coexist in one flow, and it was great! All of a sudden there was a fork, on one side you had to use Twitter and the other side you could use blogging software, on one side you were locked in and in the other you had choice. We've been suffering this division since 2006 or so. But we're in a really good place now because we could rejoin the two flows, and let <i>writers</i> decide how much writing each idea deserves, not a random limit imposed years ago without any clear idea of why. Right now please everyone think about what the world would be like if we had blogs and tweets flowing through one pipe. All kinds of new ways of visualizing flows will develop, the boundaries will melt. You can have it all, I promise, as a software developer. As a writer, we'll learn how to play with length without having to edit to fit an engineer's idea of how writing works. It's as if a geek said to a painter you can only create on a 140 pixel canvas. You could make good art that way, but think of all the art you <i>can't</i> make. I promise, you will be inspired by the new kinds of software we make. Most people using computers today have never been around for a blue-sky boom, where all the rules that were holding us back are gone in an instant. We are there right now folks, let's make the most of the moment. ",
            "created": "Mon, 28 Nov 2022 22:02:58 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2022/11/28/ifyoudontlikethenews.png",
            "flInCalendar": true
        },
        {
            "text": "There are three ways to get content into the Mastodon flow: 1. Activity Streams. 2. The Mastodon API. 3. Feeds. ",
            "created": "Tue, 29 Nov 2022 00:21:47 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I guess getting my eye fixed has helped me see more clearly. :boom:",
            "created": "Mon, 28 Nov 2022 22:52:25 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}