{
    "created": "2022-11-29T05:00:00.000Z",
    "flInCalendar": true,
    "name": "29",
    "path": "2022/11/29",
    "text": "November 29",
    "type": "calendarDay",
    "subs": [
        {
            "text": "A lot of people think I'm too old to ship a product as good as one I shipped N years ago. Those same people think you're rude if you insist that you have done that. I think they get angry, one or two have made fun of me, as if I'm a fool. It's not really very fair or friendly, even though these people may think they're friends. I can think of a dozen people who think I'm rude because I acted like \"FeedLand\" is a breakthrough. Or maybe they didn't like the way I said it? Hmm. I wonder how else you could. I've been through this loop over and over. As long ago as 1989 I was thought to be finished as a software dev. I wish it would get easier once. Just once. If I keep beating the drum, I guess when people see I'm not giving up, they might have a look? I'm not giving up, btw. :smile:",
            "created": "Tue, 29 Nov 2022 18:05:58 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/08/04/melo.png",
            "flInCalendar": true
        },
        {
            "text": "I learned how to use the web from reporters in 1994. I volunteered to run the SF newspaper strike website, and they were shooting me articles from all over the country, in HTML, and telling me how they wanted them published. Most important -- preserve the links. It was an incredible time of learning and fun and working together. That's when I'm happy, making software for people who have a vision.",
            "created": "Tue, 29 Nov 2022 16:40:36 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "A publishing tool that only works with their editor is locking you in.",
            "created": "Tue, 29 Nov 2022 13:45:19 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "This morning my vision is weird, slightly flawed, but on the whole much better than it was before the surgery <a href=\"http://scripting.com/2022/11/28.html#a214855\">yesterday</a>. ",
            "created": "Tue, 29 Nov 2022 14:04:37 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Twitter as a backup",
            "created": "Tue, 29 Nov 2022 14:58:45 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "A good reason to keep a Twitter account.",
                    "created": "Tue, 29 Nov 2022 14:58:48 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Mastodon's scaling is an unknown at this point. And it's growing very quickly.",
                    "flInCalendar": true
                },
                {
                    "text": "Had this thought just now when I couldn't get through to either of the instances I frequent.",
                    "flInCalendar": true
                },
                {
                    "text": "At least think of Twitter as a backup.",
                    "created": "Tue, 29 Nov 2022 16:41:41 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Still diggin!",
            "created": "Tue, 29 Nov 2022 13:58:33 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "The thing I like about the end of 2022 in this part of the internet. My toys are very much on-topic now, after many years of being aggressively ignored by those in-the-know. ",
                    "created": "Tue, 29 Nov 2022 13:58:39 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I kept wanting to say this. I've been counted out many times only to rise again. Sometimes even I believe that bullshit. I'll keep digging until I can't dig no mo.",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}