{
    "text": "A new two-party configuration",
    "created": "Sun, 10 Nov 2019 14:25:26 GMT",
    "type": "outline",
    "description": "There are a lot of winnable votes in the 40 percent who are likely to vote for Trump.",
    "subs": [
        {
            "text": "<i>TL;DR: There are a lot of winnable votes in the 40 percent who are likely to vote for Trump.</i>",
            "created": "Sun, 10 Nov 2019 14:39:33 GMT"
        },
        {
            "text": "Some elections reconfigure the balance between the two parties. Like Nixon, his <a href=\"https://en.wikipedia.org/wiki/Southern_strategy\">southern strategy</a> flipped the south from Dem to Repub. He saw an opportunity, took it, it worked, was transformational, and that reconfiguration is still in place 50 years later. ",
            "created": "Sun, 10 Nov 2019 14:25:38 GMT"
        },
        {
            "text": "Well never imho has the country needed to reconfigure the balance between the parties than it does now. The Repubs are being driven to fascism. That's usually a fringe thing in the US, but now is on its way to becoming mainstream. That is if you believe Trump's \"base\" is fascist. I for one don't think they are."
        },
        {
            "text": "I think they hate liberal elites who think they know everything, but they think (in the flyover states) that they understand nothing about America. That's a complicated idea, and would take a lot of tweets to explain, but there's something real there. The America they grew up believing in, that many of us did, never was what they said it was, but it's still their core idea of America, and we've drifted very far from it. In their minds America is white, Christian, there's a mom and a dad and kids, and Thanksgiving, guns and self-sufficiency. This America doesn't have any problems. It kicks ass. It rules the world. And the white people dominate (a nice way of saying what it does to PoC's).",
            "created": "Sun, 10 Nov 2019 14:26:55 GMT"
        },
        {
            "text": "The basic grievance they have is this. "
        },
        {
            "text": "Look at all the great things they're doing for \"others\" and I'm not getting any help at all. Take care of me first, and let the other guys pull themselves up like I did. "
        },
        {
            "text": "They feel the way they feel. And you probably have a lot of hypocrisy and lies in your own view of the world, btw. I know the family I grew up in did. Some day I'll write a piece about all the lies they clung to. It'll be a long piece. ",
            "created": "Sun, 10 Nov 2019 14:28:51 GMT"
        },
        {
            "text": "Back to Trump's 40 percent. I'm not taling about all of them. Some for sure are real goose-stepping Jew-hating Nazis. But a lot of them just want to hear from a president \"I got your back,\" and then enumerate their fears, so they know you hear them. Even if their fears are off the wall. You can say you hear them without selling your soul, or selling out the former Democratic Party base. And that's how the center-left party can emerge. It'll be called the Democratic Party, but it'll have a lot of until-recently Republicans in it. Nothing wrong with that. The Republicans used to have liberals. ",
            "created": "Sun, 10 Nov 2019 14:29:35 GMT"
        },
        {
            "text": "Because the real important split in the US is between people who believe in the Constitution and those who don't. That's so basic. And now in 2019, it's peak season for converting rule-of-law Republicans to lifetime Democratic Party voters. And where the parents go, the kids are likely to follow. ",
            "created": "Sun, 10 Nov 2019 14:31:33 GMT"
        },
        {
            "text": "So what's more important? A failed push for Medicare for All by President Warren or Sanders, or a new permanent political reality in the US that solves problems for 50 years led by President Bloomberg, Inslee or Klobuchar? I actually like Bloomberg because he mastered the sensibilities of business management, and has had 3 terms as NYC mayor to convert that sensibility to politics and governance. He's shovel ready, in other words. More than any of the others including Biden. ",
            "created": "Sun, 10 Nov 2019 14:32:33 GMT"
        },
        {
            "text": "As I said at the beginning, this is a time when we could reconfigure the two-party system. There are a lot of winnable votes in the 40 percent who will vote for Trump if we nominate a Warren or Sanders. And if those votes plus minorities, city people and suburbanites could compromise, we could have a big enough majority to fix a lot of things. Things that most Trump voters want. Like to be sure of their health care. More jobs. Spending more money on domestic stuff as opposed to unwinnable forever wars. What they want, in a word, is security. These are all natural Democratic issues, and somehow via lies and Democratic lunacy the Repubs have been able to at least partially usurp them. That's because the Dems don't claim them. They get lost in the weeds talking about health benefits for non-citizens and taking away people's health insurance which for crying out loud is not even what the Dems are contemplating.",
            "created": "Sun, 10 Nov 2019 14:35:31 GMT"
        },
        {
            "text": "Reading Fiona Hill's testimony last night, she's saying something similar about the political system in the US. We're smart, we know how to do big things. There are a lot of good people in the United States ready to kick ass. If you can just get the poltiical stuff under control, America will resume the greatness that it never lost. ",
            "created": "Sun, 10 Nov 2019 14:37:12 GMT"
        }
    ]
}