{
    "text": "The AI bots are already smarter",
    "created": "Mon, 01 May 2023 12:05:18 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I read a <a href=\"https://www.nytimes.com/2023/05/01/technology/ai-google-chatbot-engineer-quits-hinton.html\">story</a> in the NYT where the so-called godfather of AI is concerned that AI might get out of control. His two major concerns, as outlined in the article are that people might lose jobs, and not just menial jobs, and we might have a hard time finding out the truth. Another concern is that the bots will be fighting wars on our behalf, as we have seen in many science fiction stories over the generations. ",
            "created": "Mon, 01 May 2023 12:05:25 GMT",
            "image": "http://scripting.com/images/2021/06/29/monaLisa.png",
            "flInCalendar": true
        },
        {
            "text": "Anyway..",
            "created": "Mon, 01 May 2023 12:07:40 GMT",
            "flInCalendar": true
        },
        {
            "text": "ChatGPT is already smarter than humans because it has a non-zero attention span, and isn't trying to promote its own career and has no conflicts of interest. ",
            "created": "Mon, 01 May 2023 12:07:42 GMT",
            "flInCalendar": true
        },
        {
            "text": "On the other hand, if you ask a human a question, the answer will probably just be a canned <a href=\"http://scripting.com/publicfolder/chatgpt/2023/05/01/schpiel-definition.html\">schpiel</a> they have memorized based on hearing a keyword in what you said. ",
            "created": "Mon, 01 May 2023 12:08:30 GMT",
            "flInCalendar": true
        },
        {
            "text": "So it isn't much of a leap to say someday the bots may be smarter than humans. ",
            "created": "Mon, 01 May 2023 12:09:06 GMT",
            "flInCalendar": true
        },
        {
            "text": "The better conclusion is that humans better get our shit together start using our intelligence because the competition is here and it's already better than we are. ",
            "created": "Mon, 01 May 2023 12:09:20 GMT",
            "flInCalendar": true
        },
        {
            "text": "BTW, for years I've been trying to find an explanation of the difference between rain and showers in weather forecasts. I asked ChatGPT and it patiently <a href=\"http://scripting.com/publicfolder/chatgpt/2023/05/01/rain-vs-showers.html\">explained</a>. I asked thousands of humans and the answers I got were either vague or wrong. ",
            "created": "Mon, 01 May 2023 12:11:18 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}