{
    "text": "This used to be easy",
    "created": "Fri, 27 Sep 2019 15:18:46 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I'm returning my old Apple Watch for a $100 credit after getting a new 5th generation watch (I will write it up later). I've done this before and remember the process was easy because they designed the docs well, and took out all the unnecessary steps (something designers call factoring). But this time, instead of writing <a href=\"http://scripting.com/images/2019/09/27/watchDoc.png\">the instructions</a> in a language I understand they use pictures with <a href=\"https://support.apple.com/kb/ph19302\">links</a> to <a href=\"https://support.apple.com/HT204568\">web</a> <a href=\"https://support.apple.com/HT210225\">pages</a>. A couple of problems there. First, they use a very light color to print the URLs and they're too small for me to read, even with my glasses. I used my iPhone's flashlight, but the paper is glossy. I ended up taking a picture of the doc, and blowing it up. Second, couldn't they use a URL shortener? Didn't someone at Apple suggest that? I can't imagine it would cost that much. The whole thing, which I remember as being impressively easy last time is a pain in the ass this time. I think maybe the difference is that Steve is gone and most people who work at Apple started after he left. ",
            "created": "Fri, 27 Sep 2019 14:39:11 GMT",
            "image": "http://scripting.com/images/2019/09/27/appleWatch.png"
        },
        {
            "text": "The instructions also don't seem to say who you call or email to come pick up the watch. A phone number would be nice. It must be here, but for the life of me I can't see it. ",
            "created": "Fri, 27 Sep 2019 14:59:34 GMT"
        },
        {
            "text": "Also there's this weird <a href=\"http://scripting.com/images/2019/09/27/redpaperthing.png\">red paper thing</a> they included. I have no idea what it's for. It might be a piece of tape, but it isn't. There's no peel-off strip on the back. Mysterious.",
            "created": "Fri, 27 Sep 2019 15:04:12 GMT"
        }
    ]
}