{
    "text": "January 3",
    "created": "Thu, 03 Jan 2019 16:27:22 GMT",
    "name": "03",
    "subs": [
        {
            "text": "Working together, in 2019",
            "created": "Thu, 03 Jan 2019 16:27:46 GMT",
            "type": "outline",
            "description": "I'm excited. I believe in our future if we can get beyond our individual self-interest and start thinking and acting collectively. ",
            "subs": [
                {
                    "text": "Whenever I listen to an episode of <a href=\"http://radioopensource.org/\">Radio Open Source</a> I feel like writing an email to Chris Lydon and Mary McGrath, saying basically this. Everything your guests say is right on. I get so excited listening to them, they're so smart. But I want to add something, that the technology you're using contains the answer to the most basic problems they're talking about.  ",
                    "created": "Thu, 03 Jan 2019 16:33:16 GMT",
                    "image": "http://scripting.com/images/2018/02/26/snowboarder.png"
                },
                {
                    "text": "It happened again today on my way to <a href=\"https://en.wikipedia.org/wiki/John_F._Kennedy_International_Airport\">JFK</a>, riding on the E train to the Airtrain to Terminal 5. It was a <a href=\"http://radioopensource.org/post-democracy-in-america/\">show</a> about democracy from December 2016. Not sure how it ended up on my iPhone, but there it was, so I listened. The first guest, <a href=\"https://en.wikipedia.org/wiki/Jill_Lepore\">Jill Lepore</a>, had been to the 2016 election postmortem <a href=\"https://iop.harvard.edu/get-inspired/campaign-managers-conference/campaign-president-managers-look-2016\">event</a> probably at Shorenstein, where the campaign managers of the major campaigns, 17 Repubs and 3 Dems talked about what worked and what didn't. Not one of them understood, she said (and I agreed), the underlying theme of the election, income inequality, but I believe the answer is deeper. Here's what I see. The world is going to hell, and I'm powerless to do anything about it. My life has no meaning. I want to make a difference but I can't. And the people who can are only thinking about furthering their own careers, not of the big picture. Here it is 2019 and still only a few people see the answer isn't any one of us, it's all of us.",
                    "created": "Thu, 03 Jan 2019 16:34:46 GMT"
                },
                {
                    "text": "The second guest, <a href=\"https://en.wikipedia.org/wiki/Ugo_Mattei\">Ugo Mattei</a>, a professor from <a href=\"https://en.wikipedia.org/wiki/Turin\">Torino</a> (where I visited last summer!) got even closer, he said the magic words. He said the secret is <a href=\"http://scripting.com/2018/06/30/122337.html\">working together</a>. This is my mission. Ultimately that's going to be the way we dig out. That's the real 21st century revolution. Everything <a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+%22working+together%22&t=h_&ia=web\">points</a> in that direction. Working. Together. ",
                    "created": "Thu, 03 Jan 2019 16:32:19 GMT"
                },
                {
                    "text": "Lepore also talks about how technology has been a distraction for the Democrats, offering to turn people into <a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+slurry&t=h_&ia=web\">data</a>, and I cheered when I heard that. Of course tech is where I come from, but I went in a radically different direction from Zuck and Bezos. I see technology as empowering us all to take charge of journalism, the same way the <a href=\"https://en.wikipedia.org/wiki/Indivisible_movement\">indivisible movement</a> empowered us to reform politics. You can't have one without the other. Most important we have to stop thinking of journalism as a way for a small number of people to earn a living and do a lousy job of serving the people's interest, and more of a <a href=\"http://scripting.com/2017/02/13/ideaAnIndivisibleGuideForJournalism.html\">civic calling</a>, a way for all of us to add meaning to each others' lives. Until we get there, we'll keep electing losers like Trump and getting no further in solving the climate and social crises. ",
                    "created": "Thu, 03 Jan 2019 16:41:21 GMT"
                },
                {
                    "text": "I want to shake Chris and say hey you're <a href=\"https://en.wikipedia.org/wiki/The_medium_is_the_message\">doing it</a>. The elites you talk with, the ones you choose, they get it. Now we just have to put this in practice. We're not getting any younger. Time is running out for our species. You just have to listen to Radio Open Source to hear that. :boom:",
                    "created": "Thu, 03 Jan 2019 16:45:40 GMT"
                },
                {
                    "text": "PS: I know I'm rambling. I'm excited. I believe in our future if we can get beyond our individual self-interest and start thinking and acting collectively. ",
                    "created": "Thu, 03 Jan 2019 16:47:04 GMT"
                },
                {
                    "text": "PPS: The indivisible movement used the tools of technology, as does Chris's podcast. Remember that when you think tech created the problems, it did. But it also is empowering the solutions.",
                    "created": "Thu, 03 Jan 2019 17:01:56 GMT"
                }
            ]
        }
    ]
}