{
    "text": "January 9",
    "created": "Wed, 09 Jan 2019 20:39:56 GMT",
    "name": "09",
    "subs": [
        {
            "text": "A podcast can be much more than a radio program. Since so many podcasters come from journalism, they miss this opportunity. They have no sense that there's value in the people who hear them.",
            "created": "Thu, 10 Jan 2019 03:46:58 GMT",
            "type": "outline"
        },
        {
            "text": "Because our POTUS is wildly insane, the United States itself is wildly insane. For example, the big controversy over $5 billion for an imaginary thing is overshadowing a real existential crisis, climate change. OK climate change is hard to grasp. What about all the Americans shooting other Americans. Most are American citizens born and bred in the USA. White Christians. As Trump would say, not our best people.",
            "created": "Thu, 10 Jan 2019 00:36:21 GMT",
            "type": "outline"
        },
        {
            "text": "I had a thought that <a href=\"http://radioopensource.org/\">Radio Open Source</a>, probably the longest-running and super excellent podcast that was born out of the <a href=\"http://blogs.harvard.edu/bloggroup/\">Berkman Thursday</a> group and <a href=\"http://bloggercon.scripting.com/\">BloggerCon</a>, could be the centerpiece of a blogging and podcasting network. The people who contribute to ROS, their rolodex of interviewees, are incredible people, but here's something that we haven't begun to tap into -- I bet the <i>people who listen</i> to it are equally incredible. Imagine tapping into their intellect, energy, expertise and vision. Could be very powerful.",
            "created": "Wed, 09 Jan 2019 20:41:02 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/01/09/pistachios.png"
        },
        {
            "text": "I just downloaded all my Flickr data. There's a lot of it. ",
            "created": "Wed, 09 Jan 2019 20:39:57 GMT",
            "type": "tweet",
            "tweetId": "1083101190999691264",
            "tweetUserName": "davewiner"
        }
    ]
}