{
    "text": "January 15",
    "created": "Tue, 15 Jan 2019 13:15:46 GMT",
    "name": "15",
    "subs": [
        {
            "text": "The <a href=\"https://en.wikipedia.org/wiki/Tappan_Zee_Bridge_(1955%E2%80%932017)\">Tappan Zee Bridge</a> was <a href=\"https://twitter.com/Reuters/status/1085368542512513025\">demolished</a> today.",
            "created": "Wed, 16 Jan 2019 03:05:45 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/Reuters/status/1085368542512513025"
        },
        {
            "text": "A friend who's about 10 years younger than me wrote a blog post a while back saying that he was going to stop writing software in about 10 years because he'd be too old to do it at that time. I'm sure he didn't say it to offend me, but it did. He has no idea. And btw that was about five years ago, and he's still going strong. Heh. Also, the other day I wrote a <a href=\"https://twitter.com/davewiner/status/1084300107594588160\">tweet</a> saying that I strive for simplicity in my programming work. I've been doing that ever since I read the source code to a famous OS and saw how clean and sparse it was. I wanted to do that too. That was 40-plus years ago. Today I write cleaner code than I could have at any other point in my career. The younger version of myself could imagine what I do today, but couldn't do it. So the myth that programming is something you forget how to do, or can't do, as you get older is a lie. It's not like basketball or skiing. It's a discipline. And as you get older, you get better. I'm not saying that because I want it to be true (as many people probably think) rather because it is true. ",
            "created": "Tue, 15 Jan 2019 13:35:43 GMT",
            "type": "outline",
            "image": "http://static.scripting.com/larryKing/images/2012/11/10/horse.gif"
        },
        {
            "text": "I had a change in perspective on the shutdown. It isn't a sign of ineptness, it's an attack on the country. Connect the dots. Who's in the White House and where does he get his orders. Thought I would share that, of course no one listens. ;-)",
            "created": "Tue, 15 Jan 2019 13:15:47 GMT",
            "type": "outline"
        },
        {
            "text": "I watched a bit of MSNBC last night, and had another shift in perspective. There's nothing more for them to say. They're repeating things, aghast, that we knew two years ago, that they were aghast at then, when they were fresh. The shift was this. They feel as helpless as I do. Might as well enjoy ourselves. We're stuck. The only ones with any power are the useful idiot in the White House and \"aoc\" of course and Nancy Pelosi. ",
            "created": "Tue, 15 Jan 2019 13:15:55 GMT",
            "type": "outline"
        }
    ]
}