{
    "text": "January 17",
    "created": "Thu, 17 Jan 2019 15:36:16 GMT",
    "name": "17",
    "subs": [
        {
            "text": "<a href=\"https://www.npr.org/sections/goatsandsoda/2018/06/20/621782275/the-refugees-that-the-world-barely-pays-attention-to\">Climate change</a> is going to create many millions of refugees. So the elite in the US want to get good at building walls. I doubt if they care about the southern border of the US though. They're all building estates in New Zealand, as far away from the fallout as they can get. ",
            "created": "Thu, 17 Jan 2019 17:38:05 GMT",
            "type": "outline"
        },
        {
            "text": "The 100 most important technologies according to <a href=\"https://paleofuture.gizmodo.com/technology-ranked-1830501100\">Gizmodo</a>. I think anesthesia is much more important than #85, for example. An interesting conversation-starter.",
            "created": "Thu, 17 Jan 2019 17:36:04 GMT",
            "type": "outline"
        },
        {
            "text": "Today I have some work to do in Amazon S3. I'm just deleting a folder and creating a new one. Every time I go into edit mode on S3 I realize how much time we spend there and how crude the tools are. There must be a million people who maintain data on S3. Why not invest in some great tools for us Amazon? And just think if they were user-level tools, how many more people could benefit from reliable, inexpensive, app-accessible cloud storage. What an advantage they have, and what an opportunity for a competitor. This isn't theoretical, I've created an <a href=\"http://scripting.com/2019/01/08/153359.html\">object store</a> with much better user access than S3, many years ago. Nothing speculative. ",
            "created": "Thu, 17 Jan 2019 15:46:20 GMT",
            "type": "outline",
            "image": "http://scripting.com/2014/12/28/snacks.png"
        },
        {
            "text": "Good morning sports fans! The year 2019 is rushing by. We're approaching February, then before you know it it'll be March, and you know what comes next -- April. After that we start getting ready for summer, and then Halloween and The Holidays, and another year in the bag. That's life folks. ",
            "created": "Thu, 17 Jan 2019 15:36:17 GMT",
            "type": "outline"
        },
        {
            "text": "And it's around this time every year that I fix the copyright notice at the bottom of every page on my blog. ",
            "created": "Thu, 17 Jan 2019 15:38:00 GMT",
            "type": "outline"
        }
    ]
}