{
    "text": "January 19",
    "created": "Sat, 19 Jan 2019 17:27:33 GMT",
    "name": "19",
    "subs": [
        {
            "text": "Two podcasts",
            "created": "Sat, 19 Jan 2019 17:27:34 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I took a longish walk this morning up to <a href=\"https://en.wikipedia.org/wiki/Zabar%27s\">Zabar's</a> and back, and listened to two podcasts on the way, Friday's Daily and last week's Radio Open Source. The Daily was about the splintering of the <a href=\"https://www.nytimes.com/2019/01/18/podcasts/the-daily/womens-march-anti-semitism.html\">Women's March</a> along racial lines. They discussed the issues that the march stood for, all of them women's issues, but they didn't get my perspective, and I marched, so I feel I'm entitled to an opinion. I didn't mind that they called it the Women's March, but I felt it was a march by everyone who was opposed to Trump. I was unhappy when they didn't let people who are anti-abortion speak (I am pro-choice btw). And it was totally predictable, based on experience in the antiwar movement of the 60s and 70s,  that they would splinter and drift into irrelevance, taking our hopes of organizing against Trump with them. ",
                    "created": "Sat, 19 Jan 2019 17:35:20 GMT",
                    "image": "http://scripting.com/images/2019/01/19/zabars.png"
                },
                {
                    "text": "The Radio Open Source episode was about the <a href=\"http://radioopensource.org/is-the-green-new-deal-for-real/\">Green New Deal</a> and our hero \"AOC\". I am a huge fan of the podcast, and I have the same comment about this episode as I do about every one. What people want is meaning in their lives. That's why it's brilliant that AOC included the idea that any American can get a public service job helping America transition to the new energy system. Why is it so exciting? Because people want to make a difference, we all want our lives to mean something. Otherwise everything in the show was illuminating, as always, lots of new facts about solar and wind energy, and a general optimism which is what I enjoy most about the show.  ",
                    "created": "Sat, 19 Jan 2019 17:30:42 GMT"
                }
            ]
        }
    ]
}