{
    "text": "January 30",
    "created": "Wed, 30 Jan 2019 15:00:35 GMT",
    "name": "30",
    "subs": [
        {
            "text": "I know the <a href=\"https://en.wikipedia.org/wiki/50th_Street_(IND_lines)\">station</a> <a href=\"https://www.nytimes.com/2019/01/29/nyregion/mom-subway-stairs-death-malaysia-goodson.html\">this</a> happened at. It's so many levels underground that I take the D or B train from Columbus Circle to get there, instead of walking, because I don't like all the stairs. ",
            "created": "Wed, 30 Jan 2019 16:55:12 GMT",
            "type": "outline"
        },
        {
            "text": "One thing would improve political discourse enormously. Remembering that it's possible, even common, for two things to be true at the same time, that intuitively you might not think could be true at the same time. ",
            "created": "Wed, 30 Jan 2019 16:17:15 GMT",
            "type": "tweet",
            "tweetId": "1090645168104062976",
            "tweetUserName": "davewiner"
        },
        {
            "text": "I accepted an invitation to speak at a future-of-news conference. Like all other such conferences it's sponsored by at least one big <a href=\"http://this.how/googleAndHttp/\">tech company</a>. They get their name on the program, and presumably a booth in the hallway. Probably a session or two focused on their role in the future-of-news ecosystem. And they have a more insidious effect, their presence makes sure that speakers don't criticize them too much, because they're all hoping to get some of the money they've earmarked to support struggling news orgs. I am also the only non-professional speaker, the only blogger, the only user of news. My experience with these conferences is awful. People are polite enough when I speak, but nothing comes of it. I never get invited back. This morning I wonder why I accepted. ",
            "created": "Wed, 30 Jan 2019 15:25:32 GMT",
            "type": "outline"
        },
        {
            "text": "Many years ago at a tech conference, either <a href=\"https://www.edge.org/documents/digerati/Alsop.html\">Stewart's</a> or <a href=\"https://en.wikipedia.org/wiki/Esther_Dyson\">Esther's</a>, I was seated at lunch next to the founder of a sneaker company that had either gone public or sold out leaving the founder very wealthy, in today's terms, he was probably worth billions of dollars. I had recently had my own <a href=\"https://en.wikipedia.org/wiki/Liquidity_event\">liquidity event</a>, so of course we were talking about money, and he volunteered that it was impossible to live for less than $20 million a year. I looked at him for a sign of irony or other form of humor but he appeared serious. I asked if he was serious, and he repeated the claim. I said, pointing to everyone at the table, \"Every one of these people is spending less than $20 million a year.\" He was not impressed. I pointed to the waiters and said they're not spending $20 million a year. Nothing could dislodge his belief. To this day I wonder if it was some form of performance art or is it possible that so much money could make someone so detached from normal people that they actually believe something like that. ",
            "created": "Wed, 30 Jan 2019 15:00:36 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/01/30/richieRich.png"
        }
    ]
}