{
    "text": "The NYT pulled another one",
    "created": "Fri, 26 Jul 2024 15:15:43 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Somehow it's up to the Harris campaign to get the Trumps to have a normal American presidential campaign, not a prelude to a second attempted coup, which is what the Trumps are doing. I can see the op-ed they run in September saying that it's Harris's fault that the Trumps are fascist. ",
            "created": "Fri, 26 Jul 2024 15:16:16 GMT",
            "image": "https://imgs.scripting.com/2024/07/23/hopeKamala.png",
            "flInCalendar": true
        },
        {
            "text": "I <a href=\"http://scripting.com/2024/07/06.html#a135642\">reinstated</a> my subscription because I need to actually read their words, not because they cover news, but because they <i>are</i> news. The news is that the <a href=\"https://en.wikipedia.org/wiki/Fourth_Estate\">fourth estate</a> in the US is gone. They have lost their minds. They aren't even trying. Their op-eds don't reflect facts, such as Trump will never be a serious candidate in the sense that the NYT thinks a candidate should be serious. The Democrats still will. But there's no need as far as I'm concerned, for a legitimate candidate to respond to their taunts. ",
            "created": "Fri, 26 Jul 2024 15:16:39 GMT",
            "flInCalendar": true
        },
        {
            "text": "They completely lost many of us in their extended campaign to force Biden to step aside. I knew they wouldn't stop there, because abusers never stop when you give in to them. They are the tragedy of America now, even more than Trump. We must replace them. The real question is who's going to step up to help restore  journalism to our country. ",
            "created": "Fri, 26 Jul 2024 15:17:38 GMT",
            "flInCalendar": true
        },
        {
            "text": "Thanks for listening.",
            "created": "Fri, 26 Jul 2024 15:18:05 GMT",
            "flInCalendar": true
        },
        {
            "text": "PS: I am not pointing to their piece out of respect for people who have cancelled their subscriptions. ",
            "created": "Fri, 26 Jul 2024 15:18:06 GMT",
            "flInCalendar": true
        },
        {
            "text": "NYT editorial writers, this is what we’re running against.",
            "created": "Fri, 26 Jul 2024 22:13:51 GMT",
            "inlineImage": "https://imgs.scripting.com/2024/07/26/jan72021nyTimesFrontPage.png",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}