{
    "text": "The last moment is passing",
    "created": "Tue, 25 Feb 2025 12:59:25 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I posted <a href=\"https://bsky.app/profile/scripting.com/post/3lixpclusms2l\">something sad</a> on Bluesky last night. It was short, but the thinking behind it wasn't. Here's the quote:",
            "created": "Tue, 25 Feb 2025 12:59:35 GMT",
            "subs": [
                {
                    "text": "It might be the last minute but we can still legally remove Trump, and objectively it’s the only thing that makes any sense.",
                    "created": "Tue, 25 Feb 2025 13:00:00 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "I got two responses from <a href=\"https://muckrack.com/karoli-kuns\">Karoli Kuns</a>, an early blogger, and editor at Crooks and Liars, a long-lived blog that if I recall correctly was started with software I wrote in 2002, so I feel some pride in helping in a small way to enable her accomplishments and contributions, which are long-lived and substantial. Both of her responses missed the sadness in my post, the reflectiveness, but rather did what a lot of arguing online devolves to, showing someone else that their thinking is wrong. I couldn't think straight I was so angry, so I just said no, I'm not going to do this. Lots of experience trying to explain myself in little 300-character bursts, there's no reason to add to the grief of the moment. ",
            "created": "Tue, 25 Feb 2025 13:00:56 GMT",
            "flInCalendar": true
        },
        {
            "text": "But this morning I opened up my Bluesky window and started typing. What came out was far too long to post there, and even a screen shot doesn't fit in the space allotted, so my only choice is to blog it and <a href=\"https://bsky.app/profile/scripting.com/post/3liyx4zmogs26\">post</a> a link on Bluesky. I hope she reads it, because we're not out of options, and as I say in this story, we should be working together, and as far as I know we are not. I say this to everyone I think is making a contribution, my belief that if we can steer our efforts so they are complementary we can square each others' power. It's imho the beginning of our way out of this situation. ",
            "created": "Tue, 25 Feb 2025 13:19:13 GMT",
            "flInCalendar": true
        },
        {
            "text": "Anyway, this is what I wrote. (Note when writing this stuff I tend not to capitalize, a lazy habit I have developed. I decided not to edit that here, just to leave it as it was written.)",
            "created": "Tue, 25 Feb 2025 13:06:13 GMT",
            "subs": [
                {
                    "text": "karoli -- there's a lot to say about this, and i don't like arguing on social networks, and it was late, and i didn't feel like getting into it with you.",
                    "created": "Tue, 25 Feb 2025 13:06:24 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "anyway i wrote what i wrote not as a plan but rather a note that we're passing a line, over which there soon won't be any recourse. we probably are already over the line, but if by some miracle the repubs saw clearly that this was the last chance and enough of them decided to do what so far they have been unwilling to do, there would be a fight. i wasn't saying i thought it was likely, which is what your rebuttals were rebutting, i was just sharing a sad observation that i had made earlier in the day when i was thinking this through. i like to do that because it's part of my creativity. sometimes you think of the ideal answer, and it leads you back to an acceptable answer -- in software design and in writing (which is what i do pretty well with lots of experience).",
                    "flInCalendar": true
                },
                {
                    "text": "what was really frustrating is that i think you and i should be collaborating. giving me grief over something so ridiculous was about 180 degrees opposite of where i think we should be. that we are still doing this to each other, gives an idea of how we got here. the democrats pick on classes of people, sometimes destroying their lives, and big surprise -- a lot of them vote for the other party. i think you think you can dis me the way you did because of my gender, or age, or race, or who the fuck knows. and for all i know you were just having a bad moment and decided to share it with me for some reason having nothing to do with what was bothering me. ",
                    "created": "Tue, 25 Feb 2025 13:08:05 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "karoli -- i think we have to bend over backwards to be kind to each other. we're all going through a terrible time, in ways that may not be obvious. i certainly am, and i don't want to share it with you, but it comes on top of the crazy uncertainty of the political world. ",
                    "flInCalendar": true
                },
                {
                    "text": "anyway that's my response, and maybe now you can see why, as the day was winding down and i was watching some basketball on tv, i didn't feel like getting into it with you.",
                    "flInCalendar": true
                },
                {
                    "text": "the struggle isn't over -- they had antiwar demonstrations in russia, a country that has the kind of government ours is about to become. and the sooner we accept the new reality and get smart about it, and i'm not talking about the repubs, i'm talking about us, the shorter the nightmare will be imho.",
                    "created": "Tue, 25 Feb 2025 13:08:44 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "An afterthought -- the reason it makes sense for the Repubs to join us in removing Trump is the turn away from democratic Europe and toward the authoritarians. <i>This just happened,</i> and it's shocking. We don't even know how to think of ourselves. If I were a Republican, I would think my world just turned upside down. They didn't believe it would come to this, as far as I can tell. So it may be a time when real change is possible. We've become so fatalistic that we couldn't even recognize such an opportunity. ",
            "created": "Tue, 25 Feb 2025 13:24:26 GMT",
            "flInCalendar": true
        },
        {
            "text": "The Atlantic <a href=\"https://www.theatlantic.com/newsletters/archive/2025/02/what-would-a-liberal-tea-party-look-like/681819/\">asked</a> in a story yesterday what a liberal <a href=\"https://en.wikipedia.org/wiki/Tea_Party_movement\">tea party movement</a> would look like. They're doing it too. We should create an <i>American</i> tea party. We're so addicted to divides we can't see when we're doing it ourselves. ",
            "created": "Tue, 25 Feb 2025 13:58:36 GMT",
            "flInCalendar": true
        },
        {
            "text": "And btw, having explained all that was overlooked in my simple idea, if we managed to remove Trump, what part of your mind thinks we wouldn't also remove Vance? Geez Louise. :smile:",
            "created": "Tue, 25 Feb 2025 13:59:14 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}