{
    "text": "Email with John Naughton",
    "created": "Wed, 07 Apr 2021 13:54:48 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "<b>Dave's intro</b>",
            "created": "Wed, 07 Apr 2021 14:04:18 GMT",
            "flInCalendar": true
        },
        {
            "text": "We used to have systems in blogging that better-enabled discourse like what's going on between <a href=\"https://en.wikipedia.org/wiki/John_Naughton\">John Naughton</a> and myself. Primitive stuff like permalinks, which nowadays would seem like a huge innovation.  Interestingly, we're talking about making the web a better communication system for writers. ",
            "created": "Wed, 07 Apr 2021 13:55:00 GMT",
            "flInCalendar": true
        },
        {
            "text": "Back in the day, when blogging was new, when we had an idea like this, I could just write the software and post an upgrade. Even if JN wasn't using my software, the people who made the software he used would hear about it, and fairly quickly would match the feature. Who knows why, but I'd bet it was mostly the competitive impulse. There's Dave adding a feature for a user, we'd better add it too. But the writers' web doesn't work like that any more. We have to try to get the attention of young companies with billion dollar valuations, running a rocket ship three  feet off the ground. Even a small bump could blow them up. Believe me I know what it's like, somewhat. Been there. ",
            "created": "Wed, 07 Apr 2021 14:08:03 GMT",
            "flInCalendar": true
        },
        {
            "text": "Anyway, JN responded to my post with a post <a href=\"https://memex.naughtons.org/tuesday-6-april-2021-2/33463/\">on his blog</a>, and I wish I could point to it, but his software doesn't have permalinks, so I'll just reproduce it here. ",
            "created": "Wed, 07 Apr 2021 13:58:38 GMT",
            "flInCalendar": true
        },
        {
            "text": "<b>Email from John Naughton</b>",
            "created": "Wed, 07 Apr 2021 14:00:29 GMT",
            "flInCalendar": true
        },
        {
            "text": "Many thanks for <a href=\"http://scripting.com/2021/04/06/150554.html?title=copypastetopublish\">writing</a>. Funny coincidence: I was about to write to you about the email exchange you’ve embarked on with Ray Ozzie, but that can wait for another day. For now, I just wanted to say that I’m with you all the way in your view that the formulaic editing tools offered by platforms like Blogger, WordPress, Medium, Substack et al are, clumsy and restrictive to use. And I wholeheartedly agree that writers should be able to use whatever tool they find best for them, and that publishing platforms should make it easy to upload text and implement whatever formatting is needed.",
            "created": "Wed, 07 Apr 2021 14:00:34 GMT",
            "flInCalendar": true
        },
        {
            "text": "My own journey has taken me about 90% of the way towards that. I decided years ago that from henceforth everything I wrote would be composed as ASCII text rather than in a proprietary format (e.g. Microsoft Word) and stored as such. So I started doing that, relying on <a href=\"https://pandoc.org/\">Pandoc</a> to transform my text into pdf, Word, LaTex or whatever. (In doing that, I was of course harking back to when I first started writing on a Unix time-shared machine, producing plain marked-up text which was then fed into troff to produce beautifully typeset copy.) When John Gruber and Aaron Swartz (RIP) came up with Markdown in 2004 as a lightweight way of marking-up text, I adopted that. And eventually, thanks to Quentin I found a writing app that worked for me — <a href=\"https://ulysses.app/\">Ulysses</a> — and have used that ever since. Once WordPress started to accept Markdown text, all my blog posts (except the daily Substack version of the blog) have been written that way. Ulysses will also spit out a version of any text I write in a variety of proprietary formats and so looks like being the only writing tool I will need from now until I keel over.",
            "created": "Wed, 07 Apr 2021 14:01:17 GMT",
            "flInCalendar": true
        },
        {
            "text": "Now, to your point that “Basically, it should be possible to hook your writing tool directly to both WordPress and Substack”… It turns out that Ulysses eventually cracked the WordPress route, and so I can now hit a button and have it immediately uploaded to, and formatted on, <a href=\"https://memex.naughtons.org/\">Memex 1.1</a>. The HTML looks a bit verbose and clunky, but it renders just fine. And it’s efficient and quick. So getting Substack to create an API that enables Ulysses to upload as easily would that I would be nearly there.",
            "created": "Wed, 07 Apr 2021 14:02:52 GMT",
            "flInCalendar": true
        },
        {
            "text": "Nearly, but not quite — which is why I really appreciate your feature request to Substack to also enable paragraph-level permalinks.",
            "flInCalendar": true
        },
        {
            "text": "Keep well.",
            "flInCalendar": true
        },
        {
            "text": "John",
            "flInCalendar": true
        },
        {
            "text": "<b>FInal notes from Dave</b>",
            "created": "Wed, 07 Apr 2021 14:04:45 GMT",
            "flInCalendar": true
        },
        {
            "text": "Also, note to self, I have to make it so that when people copy the text of my posts, the # permalinks don't get copied. Every time JN quotes me I see them there, and it makes me cry because I work so hard on the words and the pound signs just do not belong there! Oy.",
            "created": "Wed, 07 Apr 2021 13:55:35 GMT",
            "flInCalendar": true
        },
        {
            "text": "Also, to John, I'd love to hear what you say re my conversation with <a href=\"http://scripting.com/2021/04/04/174604.html?title=theLostAppsOfThe80s\">Ray</a>. We'll figure out how to make this work. Hosting a salon with great minds such as yourself and Ray is something I love to do. ",
            "created": "Wed, 07 Apr 2021 14:06:21 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}