{
    "text": "Driving notes",
    "created": "Mon, 16 Mar 2020 20:07:03 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I took a three-hour round-trip drive today. Had a lot of time to think and figured some stuff out.",
            "created": "Mon, 16 Mar 2020 20:07:09 GMT",
            "flNumberedSubs": "true",
            "subs": [
                {
                    "text": "There should be a clear and simple FAQ page that tells us how to increase the odds that we don't get the virus, but at the same time preserves as much of our quality of life as possible. I will start to write this, and check out what I write with doctors and medical researchers to be sure I get it right.",
                    "created": "Mon, 16 Mar 2020 20:07:36 GMT"
                },
                {
                    "text": "Listen to <a href=\"https://www.nytimes.com/2020/03/16/podcasts/the-daily/coronavirus-recession.html\">today's Daily podcast</a>. There is no point trying to stimulate the economy. The economy is going down. A lot of companies are going to fail, or emerge very damaged. It's possible whole industries will disappear. ",
                    "created": "Mon, 16 Mar 2020 20:09:05 GMT"
                },
                {
                    "text": "At the same time, other countries are getting back online after successfully controlling the virus. China, Singapore, South Korea and possibly Vietnam, will be careful to disconnect while the rest of the world tries to get the virus under control. It's hard to reboot a down economy. And the longer it's down the harder it gets. ",
                    "created": "Mon, 16 Mar 2020 20:10:06 GMT"
                },
                {
                    "text": "The last two points combined could mean that if the US takes a long time to eradicate the virus, not only will a lot of people suffer and die, when we emerge from the pandemic we will find we have a wrecked economy, and no way to quickly recover. We may be ceding our status as a rich country. I know that's hard to grasp, but there's more at stake here than health, it's our way of life. Americans generally don't understand why we have an elevated standard of living, why the rest of the world tolerates our lunacy, as it escalates. They may love us now, but they'll forget that love when we are a less than first world country. ",
                    "created": "Mon, 16 Mar 2020 20:11:26 GMT"
                },
                {
                    "text": "New Orleans. Look at how hard it was for that city to get back on its feet, even though it's part of a country that wasn't much affected by Katrina. This time it isn't just one city, it's  the entire western world. ",
                    "created": "Mon, 16 Mar 2020 20:13:36 GMT"
                },
                {
                    "text": "Part of the trip was on the New York State Thruway. Happy to report there were lots of trucks on the highway. Presumably they're supplying the stores that have been depleted by hoarding. ",
                    "created": "Mon, 16 Mar 2020 20:15:23 GMT"
                },
                {
                    "text": "I stopped at three drug stores on the trip. I have three items I need to get: hand sanitizer, a thermometer and acetaminophen. I was only able to get the <a href=\"https://en.wikipedia.org/wiki/Paracetamol\">acetominaphen</a> (aka paracetamol, Tylenol). If you don't have it on hand, you should -- they <a href=\"https://www.cnn.com/2020/03/16/health/coronavirus-ibuprofen-french-health-minister-scn-intl-scli/index.html\">say</a> ibuprofen is not good to treat the symptoms of the virus, it actually seems to <i>help</i> the virus. ",
                    "created": "Mon, 16 Mar 2020 20:16:14 GMT"
                },
                {
                    "text": "The failure of our government to test in the US is going to cost us trillions of dollars and many thousands of lives. It's the most expensive mistake in American history. All the more galling that it was <a href=\"https://en.wikipedia.org/wiki/Occam%27s_razor\">obviously</a> done to cover up for the most <a href=\"https://www.businessinsider.com/trump-keep-passengers-on-grand-princess-cruise-ship-coronavirus-2020-3\">stupid of reasons</a>. ",
                    "created": "Mon, 16 Mar 2020 20:17:23 GMT"
                },
                {
                    "text": "If the Republicans won't get Trump to resign, we really have to consider other means to make it happen. I am out of ideas myself, but I'm thinking about it. You should too. We've waited too long, and every day we wait means we're going to have to dig out of a deeper hole, and we're going to lose a lot of people. ",
                    "created": "Mon, 16 Mar 2020 20:46:58 GMT"
                },
                {
                    "text": "Every store I was in on this trip I had this thought: The virus is here with me. I don't know if that's true, but I believe it is. Thank god you can't get infected by breathing (true, I hope). I washed my hands many times today. :soap:",
                    "created": "Mon, 16 Mar 2020 20:24:42 GMT"
                },
                {
                    "text": "Math is running the world now. Covid19 has always been a possibility. And of course our leader is the least math-savvy person you'll ever come across.",
                    "created": "Mon, 16 Mar 2020 20:26:43 GMT"
                }
            ]
        }
    ]
}