{
    "text": "Examples of #savemylife journalism",
    "created": "Mon, 18 May 2020 14:52:03 GMT",
    "type": "outline",
    "description": "People who were terrified by 9/11 certainly have the capacity to understand the danger of the virus, they just haven't seen it yet. ",
    "metaImage": "http://scripting.com/images/2020/05/18/slc.png",
    "subs": [
        {
            "text": "I spoke for an hour yesterday with \"NakedJen\" in Salt Lake City. ",
            "created": "Mon, 18 May 2020 14:40:41 GMT"
        },
        {
            "text": "The pandemic there is very different from how it is where I live. Even though I moved to the country, I still live very much in the influence of NYC, which has suffered greatly. Massachusetts is less than an hour away by car, has been hit hard too. But in the mountain west, where Jen lives, a Republican territory, they <i>aren't</i> hunkered down like we are. Jen and her family of course are. They're smart. ",
            "created": "Mon, 18 May 2020 14:52:44 GMT"
        },
        {
            "text": "My conclusion has been this: we're going to have to hit the wall a couple more times before everyone understands how frightfully scary and unknown this virus is. It would help if the US government were leading, but that wouldn't be enough. People who were terrified by 9/11 certainly have the capacity to understand the danger of the virus, they just haven't seen it yet. They will, I'm sure of it, because there's no other way out of the conundrum.",
            "created": "Mon, 18 May 2020 14:53:57 GMT",
            "image": "http://scripting.com/images/2019/11/14/weTryHarder.png"
        },
        {
            "text": "I think everyone should read three bits of writing before they risk their lives or those of others before trying to resume their former lives. ",
            "created": "Mon, 18 May 2020 14:43:55 GMT"
        },
        {
            "text": "Start with <a href=\"https://www.nytimes.com/2020/05/14/opinion/coronavirus-young-people.html\">Mara Gay's first person account</a> of getting and \"surviving\" the virus in the NYT. She's young, fit, got the disease in mid-April, and it's destroyed her health. That's not too strong a word based on her account. People may not know this isn't binary, you don't just live or die. Some people survive and have lingering incapacity. How long does it last? <i>No one knows. </i>We are exploring uncharted territory in the US because other countries halted the pandemic before they got to the stage we're at. I hope she fully recovers. I'm worried that she won't. She tells a powerful story. Uses her position on the <a href=\"https://www.nytimes.com/interactive/2018/opinion/editorialboard.html\">Editorial Board</a> of the Times in a noble way, in a blogger's way, btw.",
            "created": "Mon, 18 May 2020 17:54:46 GMT"
        },
        {
            "text": "Speaking of bloggers, you should also read <a href=\"https://www.zeldman.com/2020/05/16/its-a-good-day/\">Zeldman's account</a> of getting Covid-19 in mid-February and still is incapacitated. His daughter has it too. He's going through the same thing, though he's considerably older than Gay. ",
            "created": "Mon, 18 May 2020 14:46:27 GMT"
        },
        {
            "text": "A random thought. We're hearing about younger people, some very young, who are having horrific experiences. Why aren't we hearing these stories from older people? Possibly the older people don't survive to become incapacitated. Maybe Covid-19 is long-term a young person's disease after all. Remember it isn't binary. ",
            "created": "Mon, 18 May 2020 14:47:28 GMT"
        },
        {
            "text": "One more must-read piece -- <a href=\"https://www.newyorker.com/science/medical-dispatch/amid-the-coronavirus-crisis-a-regimen-for-reentry\">Atul Gawande's checklist</a> of how medical personnel in Boston are avoiding getting the infection. It's not any one thing, they do it by carefully incorporating the techniques the CDC recommended before they were silenced by the US government, the ones followed by the winners, South Korea, Taiwan, <a href=\"http://scripting.com/2020/05/02/145311.html?title=coronavirusInVietnam\">Vietnam</a>, China. ",
            "created": "Mon, 18 May 2020 14:48:38 GMT"
        },
        {
            "text": "All three pieces fall strongly into the category of \"save my life\" journalism. Rather than inciting fear, Gawande shows us how to calmly and systematically increase our odds of not getting the disease. If I could make reading these pieces a requirement to continue reading my blog, I would. I want the smartest readers. Being smart is an investment, you learn what others are learning and think and do what you have to to protect yourself and others. ",
            "created": "Mon, 18 May 2020 15:03:50 GMT"
        },
        {
            "text": "Stay safe and wash your hands! :heart:",
            "created": "Mon, 18 May 2020 15:05:20 GMT"
        }
    ]
}