{
    "text": "Join a parade today",
    "created": "Wed, 26 Mar 2025 15:48:36 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "This morning‘s <a href=\"https://daveverse.wordpress.com/2025/03/26/join-a-parade-today/\">early morning missive</a> from WordLand..",
            "created": "Wed, 26 Mar 2025 15:48:41 GMT",
            "flInCalendar": true
        },
        {
            "text": "Talking with friends about What To Do.",
            "flInCalendar": true
        },
        {
            "text": "I actually have an idea.",
            "created": "Wed, 26 Mar 2025 15:50:06 GMT",
            "flInCalendar": true
        },
        {
            "text": "We all try to lead a parade, with a big viral idea, if only everyone would follow me, it might just work. A lot of us have that feeling. My advice — it doesn’t work. Lose it. Instead, find a parade you can join, and add your energy, talent and experience to it.",
            "flInCalendar": true
        },
        {
            "text": "We have a tremendous oversupply of would-be parade leaders, we need to build momentum, and it doesn’t really matter what it is or who leads it. As long as it’s something the press can cover. A movement that begets more motion. A huge march in DC. Demonstrations at Tesla dealers. Blogging in a group. Helping an existing group route around an outage. Making a great list of causes others can join. Reading a blog and finding the thing the blogger is looking for. And so on.",
            "flInCalendar": true
        },
        {
            "text": "There’s great satisfaction in joining a righteous cause that’s working, my bother, my sister.",
            "flInCalendar": true
        },
        {
            "text": "This goes back to something observed in standards work. The standard is set by the person who goes second, not the one who goes first. The person who chooses to interop instead of blazing a new incompatible trail. We should celebrate people who support others as much as we do the one who goes first. You need both, and the thirds and fourth adopters to create a movement.",
            "flInCalendar": true
        },
        {
            "text": "At a time like now when there’s no room for error or individual ego, as Ben Franklin’s so wisely said during America’s revolution, we must all hang together or most assuredly we will all hang separately.",
            "flInCalendar": true
        },
        {
            "text": "PS: One way facebook can cripple a nascent movement, by the algorithm not showing you parades you might like too much. Remember Zuck is trying to ingratiate himself to trump. I find I’m seeing posts of vital interest to me over 24 hours after they were posted, when 165 people have already liked it. Suspicious behavior. We need to own our own social net. ",
            "created": "Wed, 26 Mar 2025 15:49:05 GMT",
            "flInCalendar": true
        },
        {
            "text": "PPS: This philosophy led me to build on WordPress as a foundation, instead of building my own, which I am fully capable of. It’s working much better this way, so far. Could the be a way toward our own social net? Possibly.",
            "created": "Wed, 26 Mar 2025 15:49:09 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}