{
    "text": "Yes, journalism is a thing",
    "created": "Sun, 04 Apr 2021 22:34:19 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "<a href=\"http://scripting.com/2021/04/03.html#a131835\">Journalism is a thing</a>, a whole, it makes sense to talk about in the way I talk about it. I don't need a lecture at this level, although people often do it for some reason.",
            "created": "Sun, 04 Apr 2021 22:36:41 GMT",
            "flInCalendar": true
        },
        {
            "text": "I read a piece recently somewhere, I forget where, that said people who think rapid universal change can't take place -- they aren't paying attention. The example they cited was that not too long ago people were smoking everywhere. Now there are severe limits on where you can smoke, and people seem to respect the limits. We made a decision as a society to change our behavior and it happened quickly. And you could have made the same kinds of arguments, that there is no such thing as a \"smoker\" -- but there was. ",
            "created": "Sun, 04 Apr 2021 22:37:31 GMT",
            "flInCalendar": true
        },
        {
            "text": "It also happened with <a href=\"https://en.wikipedia.org/wiki/Same-sex_marriage#Legal_recognition\">same-sex marriage</a>. Hard to believe it first became legal in the US in 2015! Had you asked me in 2014 if that was possible I would have said no. Then it changed, just like that. ",
            "created": "Sun, 04 Apr 2021 22:38:03 GMT",
            "flInCalendar": true
        },
        {
            "text": "Covid is another one. Who would have thought that people could hibernate for more than a year in the US. I recorded a <a href=\"http://scripting.com/2020/03/05.html#a181825\">podcast</a> in March last year, just to mark how ludicrous I thought it was yet at the same time inevitable. We do go through real transitions. I expect there will be plenty more. ",
            "created": "Sun, 04 Apr 2021 22:38:34 GMT",
            "flInCalendar": true
        },
        {
            "text": "And at some point some journalism org will trip over the idea that repping the people's interest makes their art work as a business like nothing else before. Sometimes I think that's all we're arguing about in the US. The elites talk to the elites and ignore the rest of us. So remind me, why are we supporting this?",
            "created": "Sun, 04 Apr 2021 22:39:26 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}