{
    "text": "What This Means To You",
    "created": "Wed, 19 Jan 2022 14:20:00 GMT",
    "type": "outline",
    "description": "Journalism should always clearly answer the question: What This Means To You. Don't run the piece until you can answer it. And maybe consider getting some new reporters who can. ",
    "metaImage": "http://scripting.com/images/2022/01/19/occupy.png",
    "subs": [
        {
            "text": "If journalism wanted to help, they would always stay in the present, talk about what Repubs are doing now to undermine democracy, and explain carefully and often what the impact of those actions will have in the future. ",
            "created": "Wed, 19 Jan 2022 15:00:11 GMT",
            "image": "http://scripting.com/images/2022/01/19/goodbyeTrump.png",
            "flInCalendar": true
        },
        {
            "text": "The <a href=\"https://en.wikipedia.org/wiki/2021_Virginia_gubernatorial_election\">election for governor in Virginia</a> was an excellent example. Journalism could have said that despite what the candidate is saying this is what Repubs do when they gain control of a state government, esp one in the South. So when you vote for the Republican, no matter how you feel about Critical Race Theory, he's doing to do X, Y and Z which are things that most Americans find hideous. And btw, the Democrats could do that too. They are awfully nice to their Republican friends. And the result is we're doomed. ",
            "created": "Wed, 19 Jan 2022 15:30:27 GMT",
            "flInCalendar": true
        },
        {
            "text": "When Trump was first running in 2016, only <a href=\"http://scripting.com/2020/12/01/173412.html?title=bestJournalismOfTheDecade\">one reporter wrote a story</a> explaining what a Trump presidency would be like. They should have all been doing it. All the time. <a href=\"http://scripting.com/2022/01/18/125952.html?title=weMustSaveOurselves\">Saving ourselves</a> begins with telling ourselves <a href=\"http://daytona.scripting.com/?q=occam%27s%20news&collection=scriptingnews\">the truth</a>, and realizing that journalism and the Democrats are not doing that. ",
            "created": "Wed, 19 Jan 2022 15:31:03 GMT",
            "flInCalendar": true
        },
        {
            "text": "Summary of the above. Journalism should always clearly answer the question: What This Means To You. Don't run the piece until you can answer it. And maybe consider getting some new reporters who can. ",
            "created": "Wed, 19 Jan 2022 14:59:31 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}