{
    "text": "News Products from FeedLand",
    "created": "Wed, 26 Oct 2022 14:44:00 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Over on <a href=\"https://micro.blog/JohnPhilpin/13551299\">micro.blog</a> John Philpin was blazing his way through News Products. I said I would help him get through it today. That's the purpose of this blog post. ",
            "created": "Wed, 26 Oct 2022 14:50:33 GMT",
            "flBulletedSubs": "true",
            "collapse": "true",
            "subs": [
                {
                    "text": "Background: There are many new ideas in FeedLand. I've spent all of 2022 working on it, and I've been self-sidelined in <a href=\"http://rss.land/\">rss.land</a> for many of the 20 years since the RSS 2.0 spec was finalized, so I had a lot of ideas waiting to be tried out. One of those is News Products, it's one of the ways FeedLand is a developer platform. ",
                    "created": "Wed, 26 Oct 2022 14:44:09 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "First there are <a href=\"http://docs.feedland.org/newsProducts.opml\">docs</a> on News Products. They begin: \"A news product is a one-page website you create with FeedLand for people outside of FeedLand to read.\" ",
            "created": "Wed, 26 Oct 2022 14:47:12 GMT",
            "flInCalendar": true
        },
        {
            "text": "There is an easy path into News Products, and it's explained <a href=\"http://docs.feedland.org/newsProducts.opml#1663600074000\">first</a> in the docs. John took that approach first, with excellent results. But he wants to do more than that, so let's scoot ahead to the most advanced form of News Product, which require you to specify them in an outline.  ",
            "created": "Wed, 26 Oct 2022 14:48:04 GMT",
            "flInCalendar": true
        },
        {
            "text": "The most advanced News Product I have at this time is <a href=\"http://news.scripting.com/\">news.scripting.com</a>. It uses all the features of News Products. And in the spirit of sharing, here's the <a href=\"http://scripting.com/publicfolder/feedland/products/newsScriptingCom.opml\">OPML source</a> for the product. You can start with that, and make changes to customize it for whatever product you have in mind. The docs go into <a href=\"http://docs.feedland.org/newsProducts.opml#1663602349000\">great detail</a> on this outline-based products. ",
            "created": "Wed, 26 Oct 2022 14:52:39 GMT",
            "flInCalendar": true
        },
        {
            "text": "If John or anyone else has questions, I've started a <a href=\"https://github.com/scripting/feedlandSupport/issues/108\">thread</a> on the FeedLand support repo. ",
            "created": "Wed, 26 Oct 2022 14:53:59 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}