{
    "text": "Peter Kafka <a href=\"https://www.vox.com/recode/2021/4/20/22394032/apple-podcast-subscription-plans\">writing</a> in Vox said today that Apple \"more or less invented podcasting.\" This is the kind of <a href=\"http://scripting.com/images/2021/04/21/lie.png\">dishonest</a> bullshit reporting that I'm always railing about. Anyway this inspired a longish <a href=\"https://twitter.com/grovesprof/status/1384871198933331968\">thread</a> on Twitter this morning, All I can say is 1. Oy and 2. Check out <a href=\"https://podcasts.apple.com/us/podcast/podcasts-a-storytelling-breakthrough/id1212045046?i=1000489182690\">Walter Isaacson's</a> podcast about the origins of podcasting. Glad to finally have a credible historian on the record on this. Kafka and Vox you should run a retraction. What people don't get about podcasting, it was a product. Marketed as such. But not with a financial model attached to it. We wanted to create new media, without barriers to entry, so the people could participate. 20 years later and I have to say that actually worked. Reporters don't respect any tech accomplishment that didn't generate a few billionaires (they should, there might be more if they did), but I made a bunch of money in the early tech industry, and I didn't feel very motivated to make more. I <a href=\"http://scripting.com/davenet/2000/10/19/transcendentalMoney.html\">learned</a> about what money can and can't do. Up to a point it's great, it buys your freedom, after that, there are limits to consumption, having good friends and fun is more important. And <a href=\"http://scripting.com/images/2021/04/21/tedTurnerQuote.png\">sex</a>, that's important <a href=\"http://www.quoteswise.com/ted-turner-quotes-2.html#:~:text=I%20bet%20you're%20all,as%20good%20as%20average%20sex.&text=Being%20a%20billionaire%20or%20being,t%20make%20that%20much%20difference.\">too</a>. Anyway, I'm proud of our accomplishments with podcasting, even if reporters and Apple generally don't care. ",
    "created": "Thu, 22 Apr 2021 01:11:47 GMT",
    "type": "outline",
    "image": "http://scripting.com/images/2017/09/21/mask.png",
    "flInCalendar": true
}