{
    "text": "When you realize the president has lost his mind",
    "created": "Fri, 30 Jun 2017 15:01:22 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Most episodes of <a href=\"https://en.wikipedia.org/wiki/The_West_Wing\">The West Wing</a> were pretty good, some were great; one of the <a href=\"http://westwing.wikia.com/wiki/The_Midterms\">so-so ones</a> featured a sub-plot where the president was obsessed with an obscure school board election in New Hampshire. ",
            "created": "Fri, 30 Jun 2017 15:01:36 GMT",
            "image": "http://scripting.com/images/2017/06/30/help.png",
            "permalink": "http://scripting.com/2017/06/30.html#a110636"
        },
        {
            "text": "The staff struggles with this, trying to get him to snap out of the dream. The person who offended him so many years ago and the president are now in completely different leagues. He should be looking for wins re whole countries, large ones with big armies and nukes and powerful leaders, like himself. Not a person running for a school board in a small state in a quiet part of the country he's in charge of. ",
            "created": "Fri, 30 Jun 2017 15:03:23 GMT",
            "permalink": "http://scripting.com/2017/06/30.html#a110623"
        },
        {
            "text": "Kind of like our current president and the morning <a href=\"http://nymag.com/daily/intelligencer/2017/06/what-happened-between-trump-morning-joe-and-the-enquirer.html\">news show</a> he's now obsessed with. I don't think the people defending him on TV are doing him, themselves or us any favors. Any adult watching this, anywhere, understands what's going on. ",
            "created": "Fri, 30 Jun 2017 15:03:15 GMT",
            "permalink": "http://scripting.com/2017/06/30.html#a110615"
        },
        {
            "text": "PS: That episode included one of the best <a href=\"https://www.youtube.com/watch?v=nhGk6eF65Fo\">Martin Sheen speeches</a> of the entire series, only these days the White House <i>does</i> host meetings of the Ignorant Tightass Club. ",
            "created": "Fri, 30 Jun 2017 15:12:29 GMT",
            "permalink": "http://scripting.com/2017/06/30.html#a110629"
        }
    ],
    "permalink": "http://scripting.com/2017/06/30.html#a110622"
}