{
    "text": "The Putinites in America",
    "created": "Sun, 27 Mar 2022 14:55:34 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "So much disappointment in what Biden said about Putin. As I've <a href=\"https://twitter.com/davewiner/status/1508069853193773057\">said</a>, I don't care. Putin has to go, whether or not Biden said it out loud. ",
            "created": "Sun, 27 Mar 2022 14:55:41 GMT",
            "flInCalendar": true
        },
        {
            "text": "But there's a much more dangerous despot-in-waiting here in the good old US of A.",
            "created": "Mon, 28 Mar 2022 02:59:48 GMT",
            "image": "http://scripting.com/images/2020/01/29/uncleSamRoulette.png",
            "flInCalendar": true
        },
        {
            "text": "He tried to overthrow the government and came incredibly close to doing it. I remember while it was going on, wondering if the entire US Congress was being executed while we were watching the riot. If the attackers had been somewhat better organized, that's exactly what would have been going on. And how would our country ever recover from that. ",
            "created": "Sun, 27 Mar 2022 15:23:50 GMT",
            "flInCalendar": true
        },
        {
            "text": "The coup didn't work, but that was only luck. The organizers are still free, and they're getting ready for Coup II and this one is going to work. They're using our own laws to pre-rig the outcome of the next national election.",
            "created": "Mon, 28 Mar 2022 02:59:12 GMT",
            "flInCalendar": true
        },
        {
            "text": "So to President Biden, who was refreshingly honest and open about Putin (and I don't think it was a gaffe, btw) what are we going to do about the Putinites in America?",
            "created": "Sun, 27 Mar 2022 15:01:55 GMT",
            "flInCalendar": true
        },
        {
            "text": "PS: The only punishment for Trump was he lost his TWTR.",
            "created": "Sun, 27 Mar 2022 15:01:56 GMT",
            "flInCalendar": true
        },
        {
            "text": "PPS: No one scanned them for weapons as they entered the Capitol. That the Capitol was completely undefended can't have been an accident. I wasn't born yesterday and neither were you. If that had happened in another country would have believed there wasn't help on the inside?",
            "created": "Sun, 27 Mar 2022 15:03:47 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}