{
    "text": "July 4",
    "created": "Wed, 04 Jul 2018 18:17:13 GMT",
    "name": "04",
    "subs": [
        {
            "text": "And this is the <a href=\"https://www.youtube.com/watch?v=rdPOAhBp2Ag\">song</a> we sing on this day, every year. <i>Red and white blue suede shoes. I'm Uncle Sam, how do you do?</i>",
            "created": "Wed, 04 Jul 2018 18:33:11 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=rdPOAhBp2Ag"
        },
        {
            "text": "You know how developers say don't develop for Twitter because you'll be sorry. Well someday soon you'll be saying that about the open web. And the company? That will be Google. Then you may ask Why didn't anyone warn me? But dear friends, you <i>were</i> <a href=\"http://this.how/googleAndHttp/\">warned</a>. ",
            "created": "Wed, 04 Jul 2018 18:29:11 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/07/04/uncleSam.png"
        },
        {
            "text": "In the United States, today is <a href=\"https://en.wikipedia.org/wiki/Independence_Day_(United_States)\">Independence Day</a>. In tech the open web is the key to our independence. Don't sell out Thank the open web by supporting it.",
            "created": "Wed, 04 Jul 2018 18:32:13 GMT",
            "type": "outline"
        },
        {
            "text": "Yesterday's <a href=\"https://github.com/scripting/Scripting-News/issues/86\">thread</a> about converting WordPress sites has a lot of good practice in it. It's so complete that I'd say that wp.com sets the standard today for blog portability and limited lock-in. If someday you need to leave WordPress, you should be able to do it. Now someone needs to put a Medium-like UI on WordPress and we'll have an answer for people who insist on using for on-the-record writing. WordPress is a much better place to do that, imho.",
            "created": "Wed, 04 Jul 2018 18:20:26 GMT",
            "type": "outline"
        },
        {
            "text": "A cool thing about \"Art Show\" is that when I get my next place I'll know what prints to put on the walls. I've never had a good idea. Now I have <i>lots</i>. ",
            "created": "Wed, 04 Jul 2018 18:17:14 GMT",
            "type": "outline"
        }
    ]
}