{
    "text": "July 19",
    "created": "Thu, 19 Jul 2018 13:09:16 GMT",
    "name": "19",
    "subs": [
        {
            "text": "Good morning sports fans!",
            "created": "Thu, 19 Jul 2018 13:09:17 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"http://scripting.com/misc/blackout/\">Yesterday</a>: \"Waiting for other people to save us isn't working.\"",
            "created": "Thu, 19 Jul 2018 21:42:23 GMT",
            "type": "outline"
        },
        {
            "text": "Mid-morning yesterday I realized that what I had been writing on this blog and elsewhere for months, if not years, amounted to one simple idea. <i>Waiting for other people to save us isn't working.</i> What could I do to focus on that idea? I decided to use my blog home page for 24 hours to say it. <a href=\"http://scripting.com/misc/blackout/\">That is what</a> appeared on the home page of Scripting News yesterday. ",
            "created": "Thu, 19 Jul 2018 13:10:00 GMT",
            "type": "outline"
        },
        {
            "text": "I don't understand why the NYT would <a href=\"https://www.nytimes.com/2018/07/18/technology/personaltech/tech-reporter-does-not-use-tech.html?smtyp=cur&smid=tw-nytimesbusiness\">employ a tech reporter</a> who isn't immersed in tech. The world is. Walk around any city if you doubt me. I haven't read many of his stories, but I would wonder if he's missing something important since he basically is one big blind spot when it comes to tech. I'm hoping the reporter who reported on the reporter was exaggerating, as they sometimes do. :boom:",
            "created": "Thu, 19 Jul 2018 14:55:15 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/07/19/alien.png"
        },
        {
            "text": "The Democrats have a new campaign <a href=\"https://www.politico.com/story/2018/07/18/house-democrats-midterms-campaign-slogan-730907\">slogan</a> \"For the people.\" It's close. But it betrays an attitude that separates you from us. Better to get down in there. Luckily there is a <a href=\"https://www.loc.gov/item/48034353/\">very American idea</a> that fits. \"We the people...\" I'd leave the elipses in the expression to let memory remind us that we remember who we are. ",
            "created": "Thu, 19 Jul 2018 14:40:21 GMT",
            "type": "outline"
        },
        {
            "text": "BTW, I hope no networks are planning to televise Trump's <a href=\"http://www.foxnews.com/politics/2018/07/18/military-parade-requested-by-trump-initially-estimated-to-cost-12m-official-says.html\">military parade</a>, but I suspect it's a lost cause. More free campaign coverage for Republicans. ",
            "created": "Thu, 19 Jul 2018 13:49:17 GMT",
            "type": "tweet",
            "tweetId": "1019942620548788224",
            "tweetUserName": "davewiner"
        },
        {
            "text": "A Congressperson’s job isn’t to get re-elected, it’s to run the US government.",
            "created": "Thu, 19 Jul 2018 14:32:02 GMT",
            "type": "outline"
        },
        {
            "text": "Trump can't arrest McFaul",
            "created": "Thu, 19 Jul 2018 13:25:08 GMT",
            "type": "outline",
            "description": "Someone would ask Hey boss, how exactly do you plan to get McFaul to show up for this interrogation? That would be the end of the discussion. ",
            "subs": [
                {
                    "text": "Re exaggeration to feed our <a href=\"http://scripting.com/2018/07/19/131456.html\">rage addiction</a> -- a classic example. The president is considering whether to accept Putin's proposal to give Mueller access to the twelve <a href=\"https://en.wikipedia.org/wiki/Main_Intelligence_Directorate\">GRU</a> hackers in exchange for being given access to <a href=\"https://en.wikipedia.org/wiki/Michael_McFaul\">Ambassador McFaul</a> and <a href=\"https://en.wikipedia.org/wiki/Bill_Browder\">Bill Browder</a> and a few others. ",
                    "created": "Thu, 19 Jul 2018 13:19:12 GMT",
                    "image": "http://scripting.com/images/2018/07/19/strongman.png"
                },
                {
                    "text": "This was a cause to set our hair on fire? It's a fantasy. It might happen in a few years if Trump is able to establish a dictatorship with no rule of law. No doubt he fantasizes about that, but it isn't happening now.  ",
                    "created": "Thu, 19 Jul 2018 13:33:07 GMT"
                },
                {
                    "text": "Yet Maddow and McFaul and a hundred reporters we'd like to respect pretend that Trump could do this! Hah. He's having a meeting about it, says Maddow. The mood is somber. This is gross malpractice. She must know it's no threat, that someone in the meeting would ask Hey boss, how exactly do you plan to get McFaul to show up for this interrogation? That would be the end of the discussion. No judge would sign a subpoena. No cop would arrest him. What would the charge be? We have the rule of law in the US, and thank goodness it's holding. ",
                    "created": "Thu, 19 Jul 2018 13:26:22 GMT"
                },
                {
                    "text": "There is plenty to be upset about, but this is a cheap thrill. The liberal media is being every bit as bad as Fox News. Cut it out. We have minds, we're educated and we know when you're bullshitting. This is bullshit.",
                    "created": "Thu, 19 Jul 2018 13:24:25 GMT"
                }
            ]
        },
        {
            "text": "We're addicted to rage",
            "created": "Thu, 19 Jul 2018 13:14:56 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Look at how awful this thing is, and that. And we exaggerate to make things look worse than it is (more on that <a href=\"http://scripting.com/2018/07/19/132508.html\">in a bit</a>). In the meantime, what we were told would happen is happening. We're losing our will to act. We had great demonstrations around the inauguration. But that wasn't enough. Isn't enough. We have to be smart. Learn from the experience of Russia and Ukraine. What would the resistance there do differently if they had a do-over? We have a chance to look at our own future, and change direction. We keep missing chances. We have all the tools we need to make it work. But we have to risk, we have to be willing to sacrifice. Before it's too late. Because every day it's too late for what we could have done yesterday. ",
                    "created": "Thu, 19 Jul 2018 13:15:44 GMT",
                    "image": "http://scripting.com/images/2018/04/02/yosemiteSam.png"
                }
            ]
        }
    ]
}