{
    "text": "July 20",
    "created": "Fri, 20 Jul 2018 13:58:00 GMT",
    "name": "20",
    "subs": [
        {
            "text": "Russia has been <i>hacking</i> our political system, not meddling or interfering. Further, Trump isn't embarrassing the United States, he's <i>humiliating</i> it.",
            "created": "Fri, 20 Jul 2018 21:26:45 GMT",
            "type": "tweet",
            "tweetId": "1020423089551814656",
            "tweetUserName": "davewiner"
        },
        {
            "text": "<a href=\"https://www.nytimes.com/2018/07/18/arts/television/simpsons-matt-groening-apu.html?action=click&module=MoreInSection&pgtype=Article&region=Footer&contentCollection=Television\">Matt Groening</a> still isn't listening. Apu <i>is</i> lovable. The <a href=\"http://scripting.com/2018/04/10/221756.html\">problem</a> is not political correctness, or people being offended, it’s that Apu creates problems for Indian-Americans because there are so few South Asian characters on TV. Apu dominates. I'm sure the Simpsons and Groening didn't intend it, but it's happening just the same. ",
            "created": "Fri, 20 Jul 2018 21:35:11 GMT",
            "type": "outline"
        },
        {
            "text": "Bike riding pro tip. If you want to ride faster, be sure your tires are fully inflated.",
            "created": "Fri, 20 Jul 2018 19:11:05 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/07/20/biketire.png"
        },
        {
            "text": "Andrew Sullivan <a href=\"http://nymag.com/daily/intelligencer/amp/2018/07/andrew-sullivan-why-trump-has-such-a-soft-spot-for-russia.html\">explains</a>, convincingly, that the idea of appealing to the conscience of Repubs is misguided. They've made it very clear that to the extent they have such things, they will have no influence on what they do. This piece is required reading, imho. And the business-as-usual approach of Bernie Sanders et al is unsupportable. <i>We need to close ranks.</i> Stop trying to optimize and just focus on getting the Repubs out of our government, asap.",
            "created": "Fri, 20 Jul 2018 17:40:44 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"http://myword.io/\">MyWord Editor</a> needed to be <a href=\"http://twitter.myword.io/users/davewiner/essays/056.html\">updated</a>. :rocket: ",
            "created": "Fri, 20 Jul 2018 13:58:01 GMT",
            "type": "outline"
        },
        {
            "text": "Why Facebook doesn't ban liars",
            "created": "Fri, 20 Jul 2018 18:52:15 GMT",
            "type": "outline",
            "description": "What would happen if Facebook banned Infowars and Breitbart and other lie-spreading make-believe news orgs?",
            "subs": [
                {
                    "text": "I love the <a href=\"https://www.nytimes.com/column/the-daily\">Daily podcast</a>, but it may be because I'm a neophyte in most of what they cover. When they cover Facebook, and other tech industry topics, they are the neophytes, and imho, they once again, imho, have missed the story in <a href=\"http://podcatch.com/archive/2018/07/20/570056.html\">today's podcast</a>. ",
                    "created": "Fri, 20 Jul 2018 18:52:26 GMT",
                    "image": "http://scripting.com/images/2018/07/20/biketirereverse.png"
                },
                {
                    "text": "The story is Facebook's attempts to regulate the virality of lies. They're not trying to eliminate the lies, because as Zuckerberg states, we all make mistakes, and if they banned people or organizations that told lies, they'd be banning a lot of valuable interactions and people. Instead, when a story starts going viral, and if it's a lie, they tell the algorithm to ignore its popularity. To me, someone with some experience managing online communties, though not at the scale of Facebook, that seems to be a clever and wise solution. ",
                    "created": "Fri, 20 Jul 2018 18:53:14 GMT"
                },
                {
                    "text": "The Times reporter wants them to do more. He says Zuckerberg will have to use his power. He has no obligation to be fair, applying the <a href=\"https://en.wikipedia.org/wiki/First_Amendment_to_the_United_States_Constitution\">standards</a> of a western democracy to speech on Facebook. He could do what the NYT would like him to do, ban Infowars, Breitbart and Gateway Pundit, and keep the NYT and Washington Post. But this isn't what Facebook wants.",
                    "created": "Fri, 20 Jul 2018 18:55:37 GMT"
                },
                {
                    "text": "What would happen if Facebook banned Infowars and Breitbart and other lie-spreading make-believe news orgs? They'd start their own Facebook. You might think it's not possible, but Facebook knows how many followers they have, and how hard the technology is. \"Facebook is a business,\" Zuck said. And as a business he has to think about growth, and defending against potential competition.",
                    "created": "Fri, 20 Jul 2018 18:57:40 GMT"
                },
                {
                    "text": "The last thing he wants is to give the right-wing infowarriors an excuse to move their users off Facebook and onto a right-wing-approved social network. I am sure that's coming, btw. I'm sure he's sure as well. And he wants to put that out as far in the distance as he can. ",
                    "created": "Fri, 20 Jul 2018 18:59:14 GMT"
                }
            ]
        },
        {
            "text": "Any senator could stop this",
            "created": "Fri, 20 Jul 2018 14:18:27 GMT",
            "type": "outline",
            "description": "If a Republican senator wanted to do something brave to call a timeout on the Trump presidency until some basic questions were answered, all they would have to do is this.",
            "subs": [
                {
                    "text": "If a Republican senator wanted to do something brave to call a timeout on the Trump presidency until some basic questions were answered, all they would have to do is this...",
                    "created": "Fri, 20 Jul 2018 14:39:18 GMT",
                    "image": "http://static.scripting.com/larryKing/images/2014/05/25/goodHumor.gif"
                },
                {
                    "text": "Announce that they were voting against <a href=\"https://nypost.com/2018/07/17/kavanaugh-has-least-support-of-any-supreme-court-pick-in-three-decades/\">Kavanaugh</a> and make sure everyone understood this is why. Then a few other Republican senators can join in, and then we'd have a bi-partisan discussion of the very minimum loyalty we insist on from a POTUS. ",
                    "created": "Fri, 20 Jul 2018 14:18:42 GMT"
                },
                {
                    "text": "Congress can act as representatives of the people. Never mind what they say to pollsters' questions. Imagine they knew how disloyal the president is. Act as a way of preventing the First Amendment being a <a href=\"https://en.wikipedia.org/wiki/The_Constitution_is_not_a_suicide_pact\">suicide pact</a>. Which is what's actually happening. Fox News has taken control of the political process, more than Trump, imho.",
                    "created": "Fri, 20 Jul 2018 14:19:17 GMT"
                },
                {
                    "text": "Update: Andrew Sullivan <a href=\"http://nymag.com/daily/intelligencer/amp/2018/07/andrew-sullivan-why-trump-has-such-a-soft-spot-for-russia.html?__twitter_impression=true\">explains</a>, persuasively, why this won't happen.",
                    "created": "Fri, 20 Jul 2018 16:33:27 GMT"
                }
            ]
        }
    ]
}