{
    "text": "July 21",
    "created": "Sat, 21 Jul 2018 13:15:19 GMT",
    "name": "21",
    "subs": [
        {
            "text": "I'm a one-issue voter for 2018 and beyond. Make politics boring again.",
            "created": "Sat, 21 Jul 2018 14:03:20 GMT",
            "type": "outline"
        },
        {
            "text": "The business-as-usual approach of <a href=\"https://www.theblaze.com/news/2018/07/20/alexandria-ocasio-cortez-makes-another-embarrassing-gaffe-and-bernie-sanders-tweets-it-out\">Bernie Sanders</a> et al is unsupportable. We need to close ranks. Stop trying to optimize and just focus on getting the Repubs out of our government, asap.",
            "created": "Sat, 21 Jul 2018 13:55:41 GMT",
            "type": "outline"
        },
        {
            "text": "I like to write about <a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+%22central+park%22&t=h_&ia=web\">Central Park</a> as the analog of the open web, and the city surrounding it as the silos. This <a href=\"http://scripting.com/images/2018/07/21/fiftyNinthStreetNYC.png\">photo</a> shows the analogous interface.",
            "created": "Sat, 21 Jul 2018 13:51:32 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1020569848957538310"
        },
        {
            "text": "It takes courage to write a <a href=\"https://werd.io/2018/life-on-the-darkest-timeline\">blog post</a> like this from Ben Werdmüller. Whenever we write, imho, we're saying something simple. This is what I see. These are my values. This is what it's like to be me. By showing yourself, you become vulnerable, and that has a cost. Better to be safe. But sometimes you have so much to say, the pain is so great, it has to come out. One thing I've discovered in a life of ups and downs -- it's true -- it's darkest just before dawn. :boom: ",
            "created": "Sat, 21 Jul 2018 13:15:20 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/05/17/mrNatural.png"
        },
        {
            "text": "What Russia has on Trump",
            "created": "Sun, 22 Jul 2018 01:31:21 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I think <a href=\"https://www.gq.com/story/what-putin-has-on-trump\">Julia Ioffe</a> got it right. This is what Putin has over Trump.",
                    "created": "Sun, 22 Jul 2018 01:31:31 GMT"
                },
                {
                    "text": "At any time they could leak to news orgs proof that without Russian hacking of the 2016 election Trump would have lost.",
                    "created": "Sun, 22 Jul 2018 01:32:55 GMT"
                },
                {
                    "text": "Anything else is BS, pee tapes, etc. No one, especially Trump, would care.",
                    "created": "Sun, 22 Jul 2018 01:33:03 GMT"
                }
            ]
        },
        {
            "text": "Being a conservative in 2018",
            "created": "Sat, 21 Jul 2018 16:38:09 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I'm a conservative. Something former-Republican conservatives can probably relate to. I think the vast majority of Americans who are freaked out about the Trump presidency could legitimately be described as conservative. However I've been voting solid Democratic since 2004.",
                    "created": "Sat, 21 Jul 2018 16:38:13 GMT"
                },
                {
                    "text": "For me, a bridge too far was the Iraq war. By 2004 we knew there were no WMDs, that the government had lied to us. This was huge. On such a serious matter as war or peace, you can't do what they did and keep the support of good Americans. At the moment they're talking about <a href=\"https://foreignpolicyblogs.com/2017/07/19/dont-want-smoking-gun-mushroom-cloud/\">mushroom clouds</a> you need to suck it up and trust the government has seen something unthinkable that you can't see. Not lying out of their ass, as the Bushies were. ",
                    "created": "Sat, 21 Jul 2018 16:38:29 GMT"
                },
                {
                    "text": "It was the realization that <a href=\"http://scripting.com/images/2018/07/21/colinPowelUn.png\">this moment</a> was based on a lie, that meant I would never vote Republican again.",
                    "created": "Sat, 21 Jul 2018 16:38:40 GMT",
                    "urltweet": "https://twitter.com/davewiner/status/1020705432527155202"
                },
                {
                    "text": "Yes, I firmly believe in Choice, am in favor of radical gun control, I have a serious pre-existing condition, so I get how important health insurance is. But you could actually vote Republican before 2000 and still have these positions.",
                    "created": "Sat, 21 Jul 2018 16:40:23 GMT"
                },
                {
                    "text": "Or so I thought. ;-)",
                    "created": "Sat, 21 Jul 2018 16:40:40 GMT"
                },
                {
                    "text": "And voting Democratic is no panacea."
                },
                {
                    "text": "Think Snowden."
                },
                {
                    "text": "But the United States is what it is. No generation gets to radically change direction. I say that as a baby boomer who marched for peace in the 60s and 70s."
                },
                {
                    "text": "This is the lesson of America.",
                    "created": "Sat, 21 Jul 2018 16:40:50 GMT"
                },
                {
                    "text": "Change is continuous. A country that still hasn't shaken off the legacy of slavery isn't going to transform into a European socialist country in a generation. Not after what we've been through in the last 20 years.",
                    "created": "Sat, 21 Jul 2018 16:40:55 GMT"
                },
                {
                    "text": "We made a lot of changes in the last ten years. And our chain has been yanked back. Hopefully that's all it is. But it's a mistake to try to yank it again. It's time to compromise. We need to elect a president we'd all like to have a cup of coffee with. Not someone who wags his finger and talks over us. Who doesn't listen. Who is as much a narcissist as the current asshole in the White House.",
                    "created": "Sat, 21 Jul 2018 16:41:04 GMT"
                },
                {
                    "text": "My slogan, if you've made it this far is this -- Make Politics Boring Again.",
                    "created": "Sat, 21 Jul 2018 16:41:15 GMT"
                },
                {
                    "text": "I felt, once Obama was elected, that that was as good as it was going to get. We are the United States. That means we're fucked up. But at least let's think a bit before we start pushing people around.",
                    "created": "Sat, 21 Jul 2018 16:41:27 GMT"
                },
                {
                    "text": "Toby Ziegler nails it in <a href=\"https://www.youtube.com/watch?v=S4vU1ygmq-s\">this scene</a> in The West Wing. \"They'll like us when we win.\" This could be the motto of America right up there with <a href=\"https://en.wikipedia.org/wiki/E_pluribus_unum\">E Pluribus Unum</a>. :rocket:",
                    "created": "Sat, 21 Jul 2018 16:41:28 GMT",
                    "urlvideo": "https://www.youtube.com/watch?v=S4vU1ygmq-s"
                }
            ]
        },
        {
            "text": "I think IFTTT supports rssCloud",
            "created": "Sat, 21 Jul 2018 16:02:25 GMT",
            "type": "outline",
            "isComment": "true",
            "subs": [
                {
                    "text": "This is why I think that.",
                    "created": "Sat, 21 Jul 2018 16:02:54 GMT"
                },
                {
                    "text": "When I post an item to my <a href=\"http://scripting.com/?tab=links\">linkblog</a>, it also goes to an <a href=\"http://radio3.io/users/davewiner/rss.xml\">RSS feed</a>.",
                    "created": "Sat, 21 Jul 2018 16:02:58 GMT"
                },
                {
                    "text": "I have an <a href=\"https://ifttt.com/\">IFTTT</a> app that <a href=\"https://ifttt.com/applets/15217689d-if-new-feed-item-from-http-radio3-io-users-davewiner-rss-xml-then-post-a-tweet-to-bullmancuso\">watches</a> that feed, and when something new shows up posts it to this <a href=\"https://twitter.com/bullmancuso\">Twitter account</a>.",
                    "created": "Sat, 21 Jul 2018 16:03:09 GMT"
                },
                {
                    "text": "I also ping the <a href=\"http://scripting.com/opmlHowto/dave/rssCloud/walkthrough.html\">rssCloud</a> notifier, the one that's pointed to from the &lt;cloud> <a href=\"http://scripting.com/images/2018/07/21/cloudElement.png\">element</a> in the feed. It tells an app how to be notified immediately of an update.",
                    "created": "Sat, 21 Jul 2018 16:03:32 GMT"
                },
                {
                    "text": "Here's the thing. The Twitter feed gets the update immediately now. Sometime in the last year (?) or so it started being instantaneous. Unless they're polling the feed ridiculously often, they must be hooked in through the &lt;cloud> element. ",
                    "created": "Sat, 21 Jul 2018 16:04:09 GMT"
                },
                {
                    "text": "If they did, I think this is very cool. :boom:",
                    "created": "Sat, 21 Jul 2018 16:04:58 GMT"
                }
            ]
        },
        {
            "text": "Not left or right",
            "created": "Sat, 21 Jul 2018 15:57:05 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I don't like \"left\" and \"right\" -- because it implies that there are just two answers for everything, and a formula that leads to a correct answer.",
                    "created": "Sat, 21 Jul 2018 15:57:09 GMT"
                },
                {
                    "text": "Every left person thinks this way and every right person thinks the opposite on everything. I doubt if anyone is really like but I am not. ",
                    "created": "Sat, 21 Jul 2018 15:57:22 GMT"
                },
                {
                    "text": "I am neither left or right. I think for myself. I try to understand each issue and form my own position. I do not delegate my thinking to others.",
                    "created": "Sat, 21 Jul 2018 15:57:53 GMT"
                }
            ]
        }
    ]
}