{
    "text": "July 23",
    "created": "Mon, 23 Jul 2018 12:43:42 GMT",
    "name": "23",
    "subs": [
        {
            "text": "By now it should be obvious if the news industry had built its own distribution system, they'd be raking in cash like FB and Google, and instead of laying off reporters, they'd be looking for new places to invest the proceeds.",
            "created": "Tue, 24 Jul 2018 01:27:39 GMT",
            "type": "outline"
        },
        {
            "text": "Apparently tomorrow is the day Google will start flagging sites that use HTTP, the <a href=\"http://this.how/googleAndHttp/\">standard web protocol</a>, as \"not secure.\" Curious to see how people react. BTW, <a href=\"https://www.cnet.com/news/chrome-warns-of-not-secure-sites-to-cut-web-surveillance-tampering-faq/\">this link</a> has auto-playing video. It may be \"secure\" but it's also obnoxious. This blog and all my other sites use HTTP. I don't see that changing. I expect this will make writing for the web more of a chore. That's life I guess. I don't want Google to be able to mold the web to its needs. I never signed on to being a <a href=\"http://scripting.com/2018/06/13/142326.html\">Google developer</a>, and never would. Basic rule: Google is a guest on the web, as we all are, and guests don't make the rules. ",
            "created": "Mon, 23 Jul 2018 14:35:53 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/07/23/webIsDeadFreeGift.png"
        },
        {
            "text": "One thing you can be sure of, when a lot of reporters get laid off, <a href=\"https://mediagazer.com/180723/p10#a180723p10\">you'll hear about it</a>. It's not true of a lot of other things. Big news happens, no coverage. It's not just because we're losing reporters, the ones that we have don't integrate well with the rest of the world.",
            "created": "Tue, 24 Jul 2018 01:14:58 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"http://scripting.com/2018/07/22.html\">Yesterday</a> I wrote that Frontier does not have hoisting. This is incorrect. It does. I found it in the docs written in <a href=\"http://scripting.com/frontier/manual/chapter07.html\">1996</a> and <a href=\"http://scripting.com/opmlHowto/dave/editorOpmlOrg/helpMenu.html#commandsInTheOutlinerMenu\">2008</a>, and tested it with the two built-in verbs, <a href=\"http://docserver.userland.com/op/hoist\">op.hoist ()</a> and <a href=\"http://docserver.userland.com/op/deHoist\">op.dehoist ()</a>. My memory is imperfect. What I should have said is that I didn't use the feature, even though it was there.  ",
            "created": "Mon, 23 Jul 2018 17:54:11 GMT",
            "type": "outline"
        },
        {
            "text": "For my friends in journalism -- eventually Facebook, Google and Twitter will have to push the far right off their services, per your <a href=\"https://qz.com/1329967/facebooks-fight-against-bad-content-is-as-chaotic-as-ever/\">wishes</a>. But that won't be the end of the tectonic <a href=\"https://en.wikipedia.org/wiki/Plate_tectonics\">plate shifts</a> in news. The right will form their own services, where your product will be excluded, and will still apply pressure on the public companies to treat your work as suspect, and they will have to give them what they want. At that point you must have control of your own distribution. ",
            "created": "Mon, 23 Jul 2018 17:39:40 GMT",
            "type": "outline"
        },
        {
            "text": "Trump's latest tweet is no joke. It's a huge escalation. He blew through all the <a href=\"https://en.wikipedia.org/wiki/DEFCON\">defcons</a>. The issue isn't whether or not to <a href=\"https://twitter.com/jeffjarvis/status/1021334339399843840\">ban him</a> from Twitter rather, where does he go for a rush after this? I <a href=\"http://this.how/trolls/\">wrote</a> this about Trump as a troll in 2016: \"Immunity to outrage builds up over time. What pissed people off six months ago will barely show up as a blip today.\" You can already see that this tweet isn't getting people riled up as it might have a few months ago. They understand how his trolling works. This is a serious problem for him. Without the ability to escalate through tweeting, he might have to resort to flyovers and actual attacks.",
            "created": "Mon, 23 Jul 2018 13:32:16 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/07/23/trumphead.png"
        },
        {
            "text": "So it's almost official, <a href=\"https://www.thedreamshake.com/2018/7/23/17602366/carmelo-anthony-to-reportedly-sign-for-veterans-minimum-with-the-houston-rockets\">Melo is going to the Rockets</a> for the veteran's minimum. I predict they won't like it any more than OKC did, unless Melo is willing to lead the second unit. That might work. Otherwise there's one too many on the starting unit that needs the ball. It's great that Harden and Paul have worked it out. Melo is still going to be a catch-and-shoot three point shooting guy. Not many moves to the rim for him.",
            "created": "Mon, 23 Jul 2018 14:16:14 GMT",
            "type": "outline"
        },
        {
            "text": "Libraries have a purpose I’ve never seen written up — as sanctuaries for children of troubled households. As a child, there was a safe place I could go at night, when things were crazy at home. A place they cared about kids, as people.",
            "created": "Mon, 23 Jul 2018 12:43:43 GMT",
            "type": "outline"
        },
        {
            "text": "When Repubs say they want to vote Democratic, the correct <a href=\"https://twitter.com/davewiner/status/1021377132629512192\">response</a> is to say hey great to have you on the team! Let's really make America great again. I was dismayed when people pissed all over <a href=\"https://twitter.com/Comey/status/1021132108381683712\">James Comey</a> when he said (basically) he want Democrats to win in November. That's <i>good</i> news. He found the right answer. The lights are coming on. People have so much trouble taking <i>yes</i> for an answer.",
            "created": "Mon, 23 Jul 2018 12:45:11 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/07/23/louieAnderson.png"
        },
        {
            "text": "I have a philosophy. I don’t care how you got to the party. Whether you took the subway, walked, came by spaceship or were driven by your chauffeur. What’s important is you’re here. Now let’s party! 🎉",
            "created": "Mon, 23 Jul 2018 12:44:14 GMT",
            "type": "outline"
        },
        {
            "text": "Librarians",
            "created": "Mon, 23 Jul 2018 12:56:35 GMT",
            "type": "outline",
            "description": "Librarians will always be special to me. Their ethos, their role, is so essential to a functional community. They don't get enough credit elsewhere, but with me, they are American heroes.",
            "subs": [
                {
                    "text": "I wanted to say what I said <a href=\"http://scripting.com/2018/07/23.html#a124343\">above</a> about libraries and librarians for many years, but as long as my parents were alive, I didn't want to write about it. I still don't want to write about it in any great detail, because I understand why it was like it was.  ",
                    "created": "Mon, 23 Jul 2018 12:56:39 GMT"
                },
                {
                    "text": "Anger, pain and fear are passed down through generations. I knew their parents, and I knew what they all went through to get to America. I came to believe later in life that the responsibility of a parent is to do better than was done to them as a child, and both my parents achieved that. ",
                    "created": "Mon, 23 Jul 2018 13:07:41 GMT"
                },
                {
                    "text": "Back in the 60s, when I was growing up, things were different. Now, I think a kid could walk into a police station and tell the story of his house, and there might be some help. But not then. People stayed out of the internal life of families. ",
                    "created": "Mon, 23 Jul 2018 13:09:24 GMT"
                },
                {
                    "text": "The library really was a sanctuary for me. The librarians at the <a href=\"https://www.yelp.com/biz/queens-borough-public-library-auburndale-flushing\">Auburndale branch</a> of the Queens Borough Public Library knew me, they knew what I was interested in, what books I liked, what stories I liked to hear, and tell. The most important thing was they treated me as a real person. For kids, even today, that's rare.",
                    "created": "Mon, 23 Jul 2018 12:58:14 GMT"
                },
                {
                    "text": "That's why librarians will always be special to me. Their ethos, their role, is so essential to a functional community. They don't get enough credit elsewhere, but with me, they are American heroes.",
                    "created": "Mon, 23 Jul 2018 13:03:40 GMT"
                }
            ]
        }
    ]
}