{
    "text": "July 25",
    "created": "Wed, 25 Jul 2018 13:36:22 GMT",
    "name": "25",
    "subs": [
        {
            "text": "There ought to be a social network called Happy Hour. In order to get in you have to take a breathalyzer to prove that you're legally drunk. Obviously nothing you say there counts.",
            "created": "Thu, 26 Jul 2018 02:35:57 GMT",
            "type": "outline"
        },
        {
            "text": "I made a small probably insignificant change to the scripting.com RSS feed. If you see any problems, please report them <a href=\"https://github.com/scripting/Scripting-News/issues/89\">here</a>. ",
            "created": "Thu, 26 Jul 2018 01:03:24 GMT",
            "type": "outline"
        },
        {
            "text": "This is a test post. I don’t care how you got to the party. Whether you took the subway, walked, came by spaceship or were driven by your chauffeur. What’s important is you’re here. Now let’s party! :rocket:",
            "created": "Thu, 26 Jul 2018 01:05:03 GMT",
            "type": "outline"
        },
        {
            "text": "I was reviewing some <a href=\"http://morningcoffeenotes.com/\">old podcasts</a>, and came across one from 2007. I was talking about Google Toolbar and a conversation I had with Marissa Mayer. I didn't remember the controversy, but was able to piece it together from listening to the <a href=\"http://static2.podcatch.com/blogs/gems/snedit/cnMar1B.mp3\">podcast</a> and <a href=\"http://scripting.com/2006/02/16.html#When:9:37:59AM\">reading</a> <a href=\"http://scripting.com/2005/02.html\">old</a> <a href=\"https://web.archive.org/web/20050225052941/http://www.thetwowayweb.com/2005/02/22\">blog</a> <a href=\"http://scripting.com/2005/02/22.html\">posts</a>. It was a really evil thing. They changed links in HTML pages in Firefox (this predates Chrome) to point to Google's sites. It came pre-installed in Firefox. This was Google eleven years ago. Obviously that attempt to hijack the web didn't work. But this time they're coming back with their own browser, and are doing it slowly. But I don't doubt for a minute the idea is to go all the way, to make the web as much Google's as Facebook's world is Facebook's (I know that sounds weird). ",
            "created": "Wed, 25 Jul 2018 14:31:43 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/07/25/jet.png"
        },
        {
            "text": "A friend sent a pointer to <a href=\"https://www.assembly.org/summer18/demoscene\">Assembly</a>, which is a <a href=\"https://en.wikipedia.org/wiki/Demoscene\">demoscene</a>. I had heard about these, and filed it away as something to be puzzled about. Do I know anyone who is going to this event?",
            "created": "Wed, 25 Jul 2018 14:02:10 GMT",
            "type": "outline"
        },
        {
            "text": "Good morning HTTP fans. I still haven't gotten the new version of Chrome here so I don't have to look at their defacement of my blog and other sites, yet. I read in the <a href=\"https://www.cnet.com/news/chrome-warns-of-not-secure-sites-to-cut-web-surveillance-tampering-faq/\">CNET story</a> (warning self-playing video) earlier in the week that Firefox isn't labeling HTTP-standard sites as <a href=\"https://www.urbandictionary.com/define.php?term=Evil%20Incarnate\">evil incarnate</a>. Is this true? Is it something they are perhaps willing to commit to? If so, I will probably switch to Firefox. I have some other ideas, like moving off the web and providing my blog in an <a href=\"https://electronjs.org/\">Electron</a> app, far away from Google's ability to <a href=\"http://this.how/googleAndHttp/\">push</a> me around (hah, Electron is built on Chrome, I wonder how independent it really is). Anyway, If anyone knows what Firefox's plan is, please post a note <a href=\"https://github.com/scripting/Scripting-News/issues/88\">here</a>. Or any other browser that accepts the web as TBL defined it. Warning: I may have to delete the thread because posts like this tend to draw trolls. You know who you are. Restrain yourself! :boom:",
            "created": "Wed, 25 Jul 2018 13:36:23 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/07/25/point.png"
        },
        {
            "text": "Ode to a sick tooth",
            "created": "Thu, 26 Jul 2018 02:11:27 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I have the worst toothache ever."
                },
                {
                    "text": "I've got a bag of ice and a bottle of wine. "
                },
                {
                    "text": "And a dentist appointment."
                },
                {
                    "text": "Tomorrow at nine."
                }
            ]
        },
        {
            "text": "How journalism views Facebook",
            "created": "Wed, 25 Jul 2018 15:57:14 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "<a href=\"https://twitter.com/chrislhayes/status/1022118404411588610\">Chris Hayes</a>: \"Facebook is the equivalent of a massively profitable factory that just dumps all of its waste into the river and never has to pay for the cost to clean it up.\"",
                    "created": "Wed, 25 Jul 2018 15:57:39 GMT",
                    "urltweet": "https://twitter.com/chrislhayes/status/1022118404411588610"
                },
                {
                    "text": "<a href=\"https://twitter.com/nxthompson/status/1022120139146321923\">Nicholas Thompson</a>: \"I think it's more like a massively profitable company that builds a giant river that everyone both drinks from and pees into. And it doesn't know how to clean it up.\"",
                    "created": "Wed, 25 Jul 2018 15:58:13 GMT",
                    "urltweet": "https://twitter.com/nxthompson/status/1022120139146321923"
                },
                {
                    "text": "<a href=\"https://twitter.com/davewiner/status/1022134114848309249\">Me</a>: \"That's not my experience as a FB user. I'd love to see a journalism outfit break out of the pack and take a contrary position, considering that FB has a tough problem and they're smart, and aren't doing a bad job of iterating to an answer.\"",
                    "created": "Wed, 25 Jul 2018 15:59:13 GMT",
                    "urltweet": "https://twitter.com/davewiner/status/1022134114848309249"
                },
                {
                    "text": "There's a lot I don't like about Facebook, and I've been very <a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+facebook&t=h_&ia=web\">public</a> <a href=\"http://scripting.com/stories/2007/10/13/whyFacebookSucks.html\">about</a> it. But the criticism they're getting from the journalism world now is uniformly negative and not insightful and doesn't stimulate a useful discussion. It's mostly a woe-is-me look at how dumb they are (or corrupt or a horror show). ",
                    "created": "Wed, 25 Jul 2018 15:59:51 GMT"
                },
                {
                    "text": "I'd love to see journalism take a dispassionate and informed look at this, teach us something,  based on an understanding of the problem they're trying to solve. A perspective that a theater critic would have, or an art, movie, food or music critic. Some idea of how we got here. Think a few steps out into the future, add a sense of what's at stake, and what would happen if FB did what they believe they should obviously do (which would be imho about as successful as Trump's trade war). ",
                    "created": "Wed, 25 Jul 2018 16:06:33 GMT"
                },
                {
                    "text": "People who use Facebook seem to like it. The advertisers pay money to be there. If it were as bad as these guys say why would they do that? There's a lot of <a href=\"https://en.wikipedia.org/wiki/The_Fox_and_the_Grapes\">sour grapes</a> here, or the appearance of sour grapes. They have to watch out for that. And it begs the question if Facebook is so wrong, why have none of you ever tried to compete with them? ",
                    "created": "Wed, 25 Jul 2018 16:05:47 GMT"
                }
            ]
        }
    ]
}