{
    "text": "July 26",
    "created": "Thu, 26 Jul 2018 15:57:09 GMT",
    "name": "26",
    "subs": [
        {
            "text": "Riding in a crowded elevator in Manhattan today. A woman was talking loudly and obscenely about how she hates where she works. She was so angry, entitled, arrogant. One of her office mates died last week, she said, and they didn't announce it. She said the owner was an asshole. As I was getting off, she described the owner as \"left wing,\" and then I got it. Next year he won't be left wing, he'll be a dirty Jew and she'll be wearing a swastika pin on her lapel. The nasty people are coming out of the closet. We're going to a bad place. ",
            "created": "Thu, 26 Jul 2018 15:57:10 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/07/26/superWomanActionFigure.png"
        },
        {
            "text": "I was going to a dentist for an emergency root canal. While I was lying helpless and in great emotional distress, I wondered why the Nazis don't come fully out of the closet. They must be scared we will kill them. My train of thought went to just how I would like to kill the Nazi woman on the elevator. It helped me deal with the emotional pain of being so helpless while I could hear my tooth being drilled and smelling the fumes coming out of my mouth, sort of a burning tooth BBQ. I have to say there is a reason I am willing to endure so much discomfort to avoid being in the dentist's chair. Why don't they just put you under, or load you up with opiates? ",
            "created": "Thu, 26 Jul 2018 16:13:49 GMT",
            "type": "outline"
        },
        {
            "text": "The <a href=\"https://www.nytimes.com/interactive/2018/upshot/election-2016-voting-precinct-maps.html\">big NYT map</a> today was interesting, even if it is a bit dated. I looked up all the places I've lived and they were all blue, except the street I grew up on in Queens. That was red. I thought about all my mom's neighbors and how they must have mostly been Trump voters. In a way I was glad she never found out. Some of the racist things I've heard them say now make sense. The neighborhood is turning, from white and Christian to Asian. I can't imagine they will vote for Trump, but wtf do I know. ",
            "created": "Thu, 26 Jul 2018 15:59:10 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1022656776326598661\">Poll</a>: Collusion?",
            "created": "Fri, 27 Jul 2018 02:04:46 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1022656776326598661"
        }
    ]
}