{
    "text": "July 31",
    "created": "Tue, 31 Jul 2018 17:11:57 GMT",
    "name": "31",
    "subs": [
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1024447641860628480\">Poll</a>: Would you vote for Al Franken?",
            "created": "Wed, 01 Aug 2018 00:20:07 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1024447641860628480"
        },
        {
            "text": "<a href=\"https://github.com/scripting/Scripting-News/issues/90\">Braintrust query</a>: Looking for icons for Hoist and Dehoist. For a refresher on what hoisting is, watch this <a href=\"https://www.youtube.com/watch?v=AXt1LBABe_k\">short video</a>. The range of possible icons is what's in Font-Awesome. Here's the <a href=\"https://fontawesome.com/cheatsheet\">cheatsheet</a>. I started an <a href=\"https://github.com/scripting/Scripting-News/issues/90\">issue</a> on the Scripting News repo, please post any suggestions you have. ",
            "created": "Tue, 31 Jul 2018 20:13:13 GMT",
            "type": "outline"
        },
        {
            "text": "Silent movies are great. In this <a href=\"https://twitter.com/moodvintage/status/1024357836921417728\">scene</a> Buster Keaton is rejected by a hat check girl, without a word spoken. ",
            "created": "Wed, 01 Aug 2018 00:17:24 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/moodvintage/status/1024357836921417728"
        },
        {
            "text": "The <a href=\"https://decentralizedweb.net/\">Decentralized Web Summit</a> starts today in San Francisco. Of course I totally support the decentralized web. I do it from NYC. The idea of a summit for something that's decentralized is interesting. Anyway, the web <i>is</i> decentralized. No one entity controls who can post to it or what they build on it. It is in danger of being centralized, always, usually by big tech companies, but sometimes governments. But that doesn't mean the web should run away from its decentralized nature. In fact, I think the \"decentralized web\" can't be anything other than the web itself. What is the naming protocol for the DCW? That's got to be DNS, the naming system of the web. It works, it scales, isn't without problems, but then whatever anyone comes up with as a replacement will have problems too, and will have to compete with a huge installed base. ",
            "created": "Tue, 31 Jul 2018 17:11:58 GMT",
            "type": "outline",
            "image": "http://scripting.com/2016/01/30/strongman.png"
        }
    ]
}