{
    "text": "Cuomo",
    "created": "Sun, 14 Mar 2021 01:52:20 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Has anyone polled New York voters on whether they want Governor Andrew Cuomo to resign? I haven’t seen any results. The journalists and politicians pushed <a href=\"https://en.wikipedia.org/wiki/Al_Franken\">Al Franken</a> out just like they’re pushing <a href=\"https://www.cnn.com/2021/03/13/politics/andrew-cuomo-chuck-schumer-kirsten-gillibrand/index.html\">Cuomo</a> out now. Why not have a <i>somewhat</i> democratic process? Wouldn’t the cause be better served?",
            "created": "Sat, 13 Mar 2021 15:03:28 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1370731015531028482",
            "flInCalendar": true
        },
        {
            "text": "Why Cuomo matters. First, being fair to everyone matters. And when you see someone rushed off, as is happening with Cuomo, and what happened to Franken, and other people you probably never heard of, this has a nasty side-effect with people who identify with Cuomo and Franken and the others. They think you're going to do the same to them. Some would say if you did nothing wrong you have nothing to worry about. Hah. You know where that comes from. That's the kind of shit <a href=\"https://en.wikipedia.org/wiki/Joseph_McCarthy\">Joseph McCarthy</a> used to say about people who worried about being purged in one of his un-American trials. It's a common thread, and totally anti-democratic. We believe in due process here, not in mob rule. And what's happening here is mob rule, even if you aren't willing to say so publicly, you know it is. Take a close look at why you're not willing to say it publicly. What does that say about where you live. And what does it say about you.",
            "created": "Sat, 13 Mar 2021 17:19:27 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The more they try to rush Cuomo's resignation, the more I want it to stop. I'm a NY voter, btw.",
            "created": "Sat, 13 Mar 2021 18:44:38 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}