{
    "text": "Horse race politics",
    "created": "Fri, 29 Dec 2017 16:00:05 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I'm not big on horse races, but I just realized that Trump forces the Repubs to be less radical, less insane, esp after the Roy Moore experience in Alabama. Let me explain.",
            "created": "Fri, 29 Dec 2017 16:00:54 GMT",
            "flNumberedSubs": "true",
            "subs": [
                {
                    "text": "First, Roy Moore is a crazy candidate. A total looney bird. Would only be worse if he wore a Gestapo outfit while he rode his horse to the polls. His insanity would appeal to a very small group of people, normally, but Alabama is not normal. You could nominate <a href=\"https://en.wikipedia.org/wiki/Jeffrey_Dahmer\">Jeffrey Dahmer</a> or <a href=\"https://en.wikipedia.org/wiki/Charles_Manson\">Charles Manson</a> and they'd probably get elected as a Repub in Alabama, any time except now. ",
                    "created": "Fri, 29 Dec 2017 16:01:16 GMT"
                },
                {
                    "text": "Trump has shown us where crazy gets us. People are tired of it. Even solid Republican voters. Exhausted, and it's only getting worse. Enough that <i>Roy Moore lost to a Democrat. </i>Mitch McConnell <a href=\"https://www.apnews.com/cfe1852e997043e3b4d41c08e296e1ea\">noted</a> that this was in the reddest of red states. That's a signal to every other state. Nominate a lunatic and no matter if you're Mississippi or Texas or Wyoming or Alaska, the Democrat is going to win. ",
                    "created": "Fri, 29 Dec 2017 16:02:05 GMT"
                },
                {
                    "text": "So... some red states will nominate moderate Repubs instead of the normal Tea Party asshole. And others will go ahead and nominate someone who's as crazy as Trump or Moore. Either way, politics won't scare us as much in the next cycle. ",
                    "created": "Fri, 29 Dec 2017 16:03:37 GMT"
                },
                {
                    "text": "However, that's not to say that the Repubs who are nominated, crazy or moderate, won't take their orders from the same billionaire assholes, the Kochs, Adelsons, Mercers, etc. Their form of lunacy won't go away any time soon.",
                    "created": "Fri, 29 Dec 2017 16:04:41 GMT"
                }
            ]
        }
    ]
}