{
    "text": "October 1",
    "created": "Mon, 01 Oct 2018 14:16:19 GMT",
    "name": "01",
    "subs": [
        {
            "text": "The Scripting News <a href=\"https://github.com/scripting/Scripting-News/blob/master/blog/opml/2018/09.opml\">OPML file</a> for September 2018.",
            "created": "Mon, 01 Oct 2018 19:42:03 GMT",
            "type": "outline"
        },
        {
            "text": "Collins, Flake and Murkowski should become Democrats. Take the suspense out of Election Day.",
            "created": "Tue, 02 Oct 2018 00:44:04 GMT",
            "type": "outline"
        },
        {
            "text": "I remember listening to a NYT podcast a few weeks ago where they said Kavanaugh's confirmation was locked in. \"Not sports fans,\" I <a href=\"http://scripting.com/2018/09/19/154910.html\">said</a> to myself. \"Nor do they remember the 2016 election.\"",
            "created": "Tue, 02 Oct 2018 02:04:01 GMT",
            "type": "outline"
        },
        {
            "text": "I listened to today's <a href=\"http://podcatch.com/archive/2018/10/01/254049.html\">Daily podcast</a>. Very good. Not listening to victims of abuse is an American tradition. As I've said in two recent pieces, abuse is the context of our civilization. It's everywhere. In homes and schools, offices, Congress, and you can be sure this isn't the first time a Supreme Court nominee has been a rapist (assuming he did it, which I do). We all have to learn how to listen. But getting some to listen is a start. ",
            "created": "Mon, 01 Oct 2018 20:55:23 GMT",
            "type": "outline"
        },
        {
            "text": "One of the things that makes GitHub a good candidate for an object database for a CMS is that it can store all kinds of data, including code. In fact, it's original design is for storing code, all the other data types were extra. ",
            "created": "Mon, 01 Oct 2018 15:13:47 GMT",
            "type": "outline"
        },
        {
            "text": "It would be interesting if an actor who looked something like Kavanaugh, recorded a 5-minute play where he said the exact word-for-word same things Kavanaugh said in his <a href=\"https://www.youtube.com/watch?v=ORdRbReYOv0\">opening statement</a> but substituted Dems with Repubs, Clintons with Kochs, left with right, and go ahead and make him black. Make videos of Republican focus groups watching it. ",
            "created": "Mon, 01 Oct 2018 14:36:40 GMT",
            "type": "outline"
        },
        {
            "text": "My two cents on Inrupt",
            "created": "Mon, 01 Oct 2018 19:44:08 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Some people have asked what I think of Tim Berners-Lee’s <a href=\"https://www.fastcompany.com/90243936/exclusive-tim-berners-lee-tells-us-his-radical-new-plan-to-upend-the-world-wide-web\">new project</a>.",
                    "created": "Mon, 01 Oct 2018 19:44:17 GMT",
                    "flNumberedSubs": "true",
                    "subs": [
                        {
                            "text": "It’s a worthwhile goal.",
                            "created": "Mon, 01 Oct 2018 19:44:32 GMT"
                        },
                        {
                            "text": "Its success depends on getting other devs to sign on.",
                            "created": "Mon, 01 Oct 2018 19:47:31 GMT"
                        },
                        {
                            "text": "<a href=\"https://www.inrupt.com/\">Startups</a> are hard.",
                            "created": "Mon, 01 Oct 2018 19:47:21 GMT"
                        },
                        {
                            "text": "There are other approaches, going back to the web itself. ",
                            "created": "Mon, 01 Oct 2018 19:44:33 GMT"
                        }
                    ]
                }
            ]
        },
        {
            "text": "Anna and Stallman",
            "created": "Mon, 01 Oct 2018 14:16:20 GMT",
            "type": "outline",
            "description": "We should have a better pitch for the kids, not all-or-nothing like Stallman, and not total sell-out like the VCs, rather here's how you can help make things better, improve chances for freedom. ",
            "subs": [
                {
                    "text": "I just saw my friend <a href=\"https://it.wikipedia.org/wiki/Anna_Masera\">Anna Masera</a> interviewing <a href=\"https://en.wikipedia.org/wiki/Richard_Stallman\">Richard Stallman</a> on <a href=\"https://twitter.com/annamasera/status/1046761759476985856\">Twitter</a>. She asked the right question. I wonder if he knows that he has to sell people on his vision. But it's amazing to see all those young minds show up where ever he does.",
                    "created": "Mon, 01 Oct 2018 14:16:26 GMT",
                    "image": "http://scripting.com/images/2018/10/01/parrot.png"
                },
                {
                    "text": "I had a similar experience when I went to <a href=\"https://www.startupschool.org/\">Startup School</a> in Palo Alto a few years ago. They had all these rich successful entrepreneurs on stage saying how they did it, but during the breaks I was always surrounded by young folk who wanted to know about open technology.  ",
                    "created": "Mon, 01 Oct 2018 14:21:54 GMT"
                },
                {
                    "text": "We should have a better pitch for the kids, not all-or-nothing like Stallman, and not total rape-and-pillage like the VCs, rather here's how you can help make things better, improve chances for freedom. Because that's how imho you solve the conundrum Anna pointed out. Who goes first, business or education? Well the answer is when you have something open, use it and understand the value in it and protect it. ",
                    "created": "Mon, 01 Oct 2018 14:17:24 GMT"
                },
                {
                    "text": "So many people who are involved in podcasting for example don't understand how the fact that it's open means they have opportunities. Later when Amazon or Apple or Google take control, they'll wonder how to make it open. That won't work, but keep it open? That can work. ",
                    "created": "Mon, 01 Oct 2018 14:18:10 GMT"
                },
                {
                    "text": "See also, from 2011: <a href=\"http://scripting.com/stories/2011/10/31/whyIStandUpForStallman.html\">Why I stand up for Stallman</a>. ",
                    "created": "Mon, 01 Oct 2018 14:27:52 GMT"
                }
            ]
        }
    ]
}