{
    "text": "October 4",
    "created": "Thu, 04 Oct 2018 13:50:01 GMT",
    "name": "04",
    "subs": [
        {
            "text": "Can you imagine living in a town where <a href=\"http://scripting.com/images/2018/10/04/diner.png\">this</a> is the only restaurant?",
            "created": "Thu, 04 Oct 2018 21:00:16 GMT",
            "type": "outline"
        },
        {
            "text": "In the early days of #metoo there wasn't much point in trying to say that there were men who were respectful of women. Men who see women as people, just like they are, and believe in the <a href=\"https://en.wikipedia.org/wiki/Golden_Rule\">Golden Rule</a>, and apply it. There was an angry hashtag for this, #notallmen, which translated as #wedontwanttohearit. Even so, I believe that most women get that men are people, just like they are. We know that there are all kinds of people of all genders, with issues that were created through their families or genes or other factors. There are differences in bodies and strength, but I have wanted to say that our bodies are the same size online. It was therefore refreshing to see this <a href=\"https://www.vox.com/first-person/2018/10/4/17933530/sexual-assault-me-too\">piece</a>, that started as a Twitter thread, written by a woman, who says what imho needed to be said.",
            "created": "Thu, 04 Oct 2018 14:58:25 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/10/04/gumby.png"
        },
        {
            "text": "Iris DeMent: <a href=\"https://www.youtube.com/watch?v=nlaoR5m4L80\">Let the mystery be</a>. ",
            "created": "Thu, 04 Oct 2018 20:30:04 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=nlaoR5m4L80"
        },
        {
            "text": "<a href=\"https://www.zillow.com/\">Zillow</a> tries to show me houses I'd like, which I appreciate, but so far they haven't connected the dots. He's looking in a bunch of different geographies. What do they have in common? What other geographies should he be looking in? Find me a great house, within three hours of a big airport, etc. The algorithm can do it. It's advertising of the best kind, the kind I <i>want.</i> ",
            "created": "Thu, 04 Oct 2018 15:51:38 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1047856173809119233\">Poll</a>: Will Kavanaugh be confirmed?",
            "created": "Thu, 04 Oct 2018 14:29:23 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1047856173809119233"
        },
        {
            "text": "Some TV series are special, like dessert, like a rich layer cake with lots of sweet frosting and butter. You eat the slice slowly, savoring every bite, and even so it disappears too quickly. <a href=\"https://en.wikipedia.org/wiki/Better_Call_Saul\">Better Call Saul</a> is like that. Some episodes of <a href=\"https://en.wikipedia.org/wiki/Game_of_Thrones\">Game of Thrones</a>. The entirety of <a href=\"https://en.wikipedia.org/wiki/The_Wire\">The Wire</a>. And lately, <a href=\"https://en.wikipedia.org/wiki/Maniac_(miniseries)\">Maniac</a> on Netflix was savory in that sense. NakedJen is watching it now. Hope she loves it. I just saw a <a href=\"https://twitter.com/DanDotLewis/status/1047845366681554944\">note</a> from a friend on Twitter saying he had watched four episodes of Maniac and was giving up. I know the feeling. I went through that with <a href=\"https://en.wikipedia.org/wiki/Castle_Rock_(TV_series)\">Castle Rock</a>. The first episodes were great but then I lost interest. I did manage to muddle through, because I wanted to know how it ended. Then there are shows that everyone loves that I can't even get started with. <a href=\"https://en.wikipedia.org/wiki/Peaky_Blinders_(TV_series)\">Peaky Blinders</a>, for example. Or <a href=\"https://en.wikipedia.org/wiki/The_Expanse_(TV_series)\">The Expanse</a>. I cannot figure out wtf is going on in that one. I feel if I can just gain traction I'll love it. But I never have been able to.",
            "created": "Thu, 04 Oct 2018 13:50:02 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/10/04/maniac.png"
        }
    ]
}