{
    "text": "October 5",
    "created": "Fri, 05 Oct 2018 17:11:09 GMT",
    "name": "05",
    "subs": [
        {
            "text": "Something in Kavanaugh's opening statement I never understood. He said: \"As we all know, in the United States political system of the early 2000s, what goes around comes around.\" What is he talking about? Bush v Gore? The 9-11 attacks? The war in Iraq? The Swift Boat travesty?",
            "created": "Sat, 06 Oct 2018 02:26:58 GMT",
            "type": "tweet",
            "tweetId": "1048400342407438338",
            "tweetUserName": "davewiner"
        },
        {
            "text": "After Kavanaugh’s opening statement that should have been it, but the Dems didn’t think on their feet. They had their plan, why not let the FBI investigate. But they now had something much stronger. Kavanaugh had disqualified himself. The press missed this too. But it's weird the Dems missed this. How many of them are former prosecutors? At least Blumenthal, Harris and Klobuchar are. I can't believe they didn't notice his testimony had crossed a line. They should have questioned him on <a href=\"http://scripting.com/images/2018/10/02/kavanaughExcerpt.png\">every word</a> in that three paragraph flameout. On TV while everyone was watching, and all the Repubs could offer was the prosecutor from Arizona. ",
            "created": "Sat, 06 Oct 2018 02:25:06 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1048397576989540353",
            "image": "http://scripting.com/images/2018/10/05/monstersFullSize.png"
        },
        {
            "text": "There's conventional wisdom in the tech world that only standards made between big companies matter. In my experience, without exception, it's the exact opposite. Only the ones that grew \"in the wild\" (from the BigCo perspective) work as standards, as opposed to PR hype.",
            "created": "Fri, 05 Oct 2018 17:11:10 GMT",
            "type": "outline"
        }
    ]
}