{
    "text": "October 8",
    "created": "Mon, 08 Oct 2018 15:02:21 GMT",
    "name": "08",
    "subs": [
        {
            "text": "I made a list of <a href=\"http://scripting.com/misc/senate2018/\">Democratic candidates</a> for Senate in 2018 so I could donate to all. There are 34 total candidates. The normal 33 plus the special election for Al Franken's seat in Minnesota.  So if you wanted to give $25 to each, it would cost $850.",
            "created": "Mon, 08 Oct 2018 15:52:00 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://www.techmeme.com/#a181008p18\">Google+</a> was unmotivated by any need for what it did. No one loved it. It was born only to slow Facebook growth. It’s like having a kid so it can beat up your neighbor’s kid. Products, to be any good, must be motivated, have a creative purpose.",
            "created": "Mon, 08 Oct 2018 19:43:22 GMT",
            "type": "outline"
        },
        {
            "text": "I will be using <a href=\"https://www.w3schools.com/css/css3_variables.asp\">CSS variables</a>. ",
            "created": "Mon, 08 Oct 2018 17:39:11 GMT",
            "type": "outline"
        },
        {
            "text": "Being picky is for losers",
            "created": "Mon, 08 Oct 2018 16:55:01 GMT",
            "type": "outline",
            "description": "There's a real joy in giving up on perfection. Now you can get something done.",
            "subs": [
                {
                    "text": "I find people who are willing to trade off moral superiority against losing the election, still, given all that's happening, the most depressing thing about American politics. No one cares about your \"point\" -- we're trying to get back on course. ",
                    "created": "Mon, 08 Oct 2018 16:55:07 GMT",
                    "image": "http://scripting.com/images/2018/10/05/monstersFullSize.png"
                },
                {
                    "text": "Thinking of an analogy. Suppose you're taking a car trip and your navigator decides to take you over a bridge that's washed out because it's shorter than the detour that isn't washed out. ",
                    "created": "Mon, 08 Oct 2018 16:55:16 GMT"
                },
                {
                    "text": "Sometimes you have to give up one thing to get the thing you really need.",
                    "created": "Mon, 08 Oct 2018 16:56:27 GMT"
                },
                {
                    "text": "Manchin voted for Kavanaugh. His opponent will for sure vote with McConnell on everything. Manchin would not have been the deciding vote if it came down to that. ",
                    "created": "Mon, 08 Oct 2018 16:55:22 GMT"
                },
                {
                    "text": "There's a real joy in giving up on perfection. Now you can get something done.",
                    "created": "Mon, 08 Oct 2018 16:56:56 GMT"
                }
            ]
        },
        {
            "text": "#metoo as a political issue",
            "created": "Mon, 08 Oct 2018 15:02:22 GMT",
            "type": "outline",
            "description": "Because there is unfairness in the #metoo movement, because it silences a legitimate point of view, it gives the Republicans something to campaign on that resonates. We have a problem. Much more than Kavanaugh.",
            "subs": [
                {
                    "text": "A longtime friend was taken down by #metoo. Lost everything. The screed against him, posted on Medium, when edited down to real, not imagined, accusations was that when he was drunk he felt the breasts of a woman who was also drunk, in public, at a party at a tech conference.  ",
                    "created": "Mon, 08 Oct 2018 15:02:32 GMT"
                },
                {
                    "text": "He admitted it, and apologized, even though because he is an alchoholic, he had no memory of it. I thought the accusation should have been made without a lot of the imagined offenses, very clearly. ",
                    "created": "Mon, 08 Oct 2018 15:03:17 GMT"
                },
                {
                    "text": "He wasn't one of the famous targets of #metoo, he was just quietly deleted. ",
                    "created": "Mon, 08 Oct 2018 17:41:25 GMT"
                },
                {
                    "text": "No, I don't think it was fair, but that isn't the point of my story."
                },
                {
                    "text": "I posted a note of love and support for my friend on Facebook, and almost immediately the threats of accusations against me came both publicly and privately. Nothing that amounted to anything, but it made it clear I'd better shut up, or else I'll be joining my friend in oblivion. "
                },
                {
                    "text": "When I was terribly sick in 2002, he was one of three friends who stood by me. He came to visit regularly while I was recuperating. He always listens when I have something to say. He's a good friend. He also can be a total jerk. I've seen that too. He got drunk on a lot of bullshit, not just alcohol. ",
                    "created": "Mon, 08 Oct 2018 15:04:35 GMT"
                },
                {
                    "text": "Since then the #metoo parade has passed him by. I'm sure very few people remember what happened to him. But he can't get back on his feet. He's in AA now. He's become a house husband, taking care of the kids while his wife works. I'm sure some people take pleasure in this, feel it's only fair that a man's life be destroyed this way, because so much terrible stuff has happened to women.",
                    "created": "Mon, 08 Oct 2018 15:04:50 GMT"
                },
                {
                    "text": "Finally I get to the point of the story..",
                    "created": "Mon, 08 Oct 2018 15:05:27 GMT"
                },
                {
                    "text": "Maybe you're right, in some moral way, maybe men do deserve this. But while my friend's life has been destroyed, he can still vote. His friends can vote. I won't vote Republican because of this, but I would like the Democrats to start worrying about this too, not seeing it as so one-sided, that all women are right and fair, always, and would never accuse a man of doing something he didn't actually do. Or wouldn't embellish it to make it more dramatic. Or use an accusation to get even for some other perceived offense. Or maybe for no reason at all. ",
                    "created": "Mon, 08 Oct 2018 15:05:12 GMT"
                },
                {
                    "text": "Women are people, as humanly flawed as men. Give them a way to hurt other people, and they will use it. The idea that a woman would never make an accusation unless they knew it was true is incorrect. So we need to do better than simply \"believe the woman.\"",
                    "created": "Mon, 08 Oct 2018 15:06:22 GMT"
                },
                {
                    "text": "BTW, there was abuse in my family when I was growing up. So I know how it ruins lives. I've written about it on my blog. There's a lot more I could write if I had the courage to do so. ",
                    "created": "Mon, 08 Oct 2018 15:07:13 GMT"
                },
                {
                    "text": "Conclusion: Because there is unfairness in the #metoo movement, because it silences a legitimate point of view, it gives the Republicans something to campaign on that resonates. We have a problem. Much more than Kavanaugh.",
                    "created": "Mon, 08 Oct 2018 15:12:02 GMT"
                }
            ]
        }
    ]
}