{
    "text": "October 15",
    "created": "Mon, 15 Oct 2018 14:16:13 GMT",
    "name": "15",
    "subs": [
        {
            "text": "<a href=\"http://scripting.com/images/2018/09/10/naomiOsaka.png\">Previous</a> header image, <a href=\"https://en.wikipedia.org/wiki/Naomi_Osaka\">Naomi Osaka</a>, hero of this year's US Open. The <a href=\"http://scripting.com/images/2018/10/15/nighthawks.png\">new one</a> is from <a href=\"https://en.wikipedia.org/wiki/Nighthawks\">Nighthawks</a>, a painting by Edward Hopper. ",
            "created": "Mon, 15 Oct 2018 15:01:37 GMT",
            "type": "outline"
        },
        {
            "text": "I haven't listened to <a href=\"https://en.wikipedia.org/wiki/Exile_on_Main_St.\">Exile on Main St</a> in too long. ",
            "created": "Mon, 15 Oct 2018 21:12:39 GMT",
            "type": "outline"
        },
        {
            "text": "Why didn’t Elizabeth Warren hold on to the results of <a href=\"https://www.memeorandum.com/181015/p5#a181015p5\">her study</a> until Trump raised the <a href=\"https://www.realclearpolitics.com/video/2018/07/05/trump_offers_1_million_for_pocahontas_elizabeth_warren_to_take_dna_test.html\">issue</a> again? Raising it herself just before the midterms seems like the most disadvantageous timing. Imagine if Trump re-stated his offer of $1 million, then she could release the study. Bonk. Wasted opportunity?",
            "created": "Mon, 15 Oct 2018 21:14:03 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/10/24/elizabethWarren.png"
        },
        {
            "text": "On Facebook, King Kaufman asks if the bike rider in <a href=\"http://scripting.com/images/2018/10/15/bikeInRightLane.png\">this picture</a> is doing the right thing. I responded:  What the bike rider doing is correct. The only alternative would be to go in the left lane, and another driver is going to be pissed about that (he has to wait for the bike to get going and over to the right before he gets up to speed).",
            "created": "Mon, 15 Oct 2018 19:04:46 GMT",
            "type": "outline"
        },
        {
            "text": "This is the most puzzling and curiosity-provoking <a href=\"https://www.nytimes.com/2018/10/13/opinion/stephen-elliott-moira-donegan-media-men.html\">article</a> I've read about #metoo. The men, who said they were innocent, were critical of another man who also claims innocence, for coming forward. \"The collective sense is that Mr. Elliott should do what they’re doing: 'taking one for the team,' as one of them put it.\" Elliot said “Multiple people asked me at first if I was O.K. just taking a bullet for the movement. Because of their politics and, frankly, because of mine.”",
            "created": "Mon, 15 Oct 2018 15:20:03 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1051853321680502784\">Poll</a>: Have you ever been the subject of or participated in a <a href=\"https://en.wikipedia.org/wiki/Whispering_campaign\">whisper campaign</a>?",
            "created": "Mon, 15 Oct 2018 15:17:49 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1051853321680502784"
        },
        {
            "text": "<a href=\"https://github.com/scripting/Scripting-News/issues/96\">Braintrust query</a>: Don Park <a href=\"https://twitter.com/donpark/status/1051533792324636673\">wrote</a> on Twitter -- \"I feel that discovery layer is missing or lacking. blogrolls didn't scale. ring blogs just sucked. SEO is just survival-of-the-fittest money pit. Discovery layer is critical. Without it, even recent push to reshape blogs into shops is meaningless. even small towns have a Main Street for discovery. Blogrolls worked more like book recommendations. Hard to maintain too. Worked well with new technology. With other and over multiple topics, not so well. We need a more self-organizing and ad-hoc, emergent if you will.\" I'd like to do some thinking and experimenting in this area. It's a good time for me. Maybe others who have blogs want to do join in. Here's the thread. ",
            "created": "Mon, 15 Oct 2018 14:19:22 GMT",
            "image": "http://scripting.com/images/2018/10/15/knicks.png",
            "type": "outline"
        },
        {
            "text": "I've known Don Park for a long time. Goes back to when I lived in the middle of the golf course at the end of <a href=\"https://www.google.com/maps/place/Sharon+Park+Dr,+Menlo+Park,+CA+94025/@37.4248451,-122.2205468,17z/data=!4m5!3m4!1s0x808fa4e515ff326d:0xc832d9097802f942!8m2!3d37.4244532!4d-122.2083052\">Sharon Park Drive</a> in Menlo Park. Don did the INIT for <a href=\"https://archive.org/details/TNM_Userland_IAC_Toolkit_for_programmers_1991_20170830_0072/page/n0\">UserLand IAC Toolkit</a>, which <a href=\"https://duckduckgo.com/?q=UserLand+IAC+Toolkit&t=h_&ia=web\">was</a> the precursor for the Apple Event Manager and ultimately XML-RPC and SOAP. Don is thinking about blogs these days, and <a href=\"https://twitter.com/donpark/status/1051533792324636673\">posted</a> something <a href=\"https://twitter.com/donpark/status/1051544612911738880\">interesting</a> on Twitter yesterday about blogrolls. He says wtf happened. There is no good discovery mechanism for blogs. I agree. Don had some immediate ideas, so I offered to start a thread on it, so maybe we could come up with some experiments we could do to see if maybe we couldn't bootstrap something now. That's what the previous post, the <a href=\"http://scripting.com/2018/10/15.html#a141922\">braintrust query</a> is about.",
            "created": "Mon, 15 Oct 2018 14:16:14 GMT",
            "type": "outline"
        }
    ]
}