{
    "text": "October 16",
    "created": "Tue, 16 Oct 2018 18:25:10 GMT",
    "name": "16",
    "subs": [
        {
            "text": "I just gave $25 to <a href=\"https://secure.actblue.com/donate/donate-primary-web\">Joe Donnelly</a> who's running for <a href=\"http://scripting.com/misc/senate2018/\">Senate</a> in Indiana.",
            "created": "Tue, 16 Oct 2018 18:43:05 GMT",
            "type": "outline"
        },
        {
            "text": "Occam News Service reports that the Trump family sells protection and PR services to foreign governments like Saudi Arabia.",
            "created": "Wed, 17 Oct 2018 02:28:42 GMT",
            "type": "outline"
        },
        {
            "text": "I had to see a specialist doctor today. At 63 my doctors are all younger than me. This one was so bright, careful in explaining and listening, enthusiastic about good health, an evangelist. Just 31 years old. Made me feel so optimistic about the future.",
            "created": "Wed, 17 Oct 2018 02:29:06 GMT",
            "type": "outline"
        },
        {
            "text": "Here's a <a href=\"https://twitter.com/davewiner/status/1052224515932073990\">weird idea</a> I proposed to one of my favorite political analysts. Why can't journalism raise issues? They don't have to let politicians drive this. Don't the voters have issues that need airing? What about the people who wrote the Constitution who expected Congress to act as a check on the Executive branch? Why do we have to sit on the sidelines and accept the crap they hand us. Now <a href=\"https://twitter.com/davewiner/status/1052317163778990081\">Elizabeth Warren</a> is doing it. Jeez. You'd think they wrote off the intellect and seriousness of the electorate. Time to change the way we do things. Journalism could be where the change starts. Of course they would have to listen, for a new idea to penetrate. :boom:",
            "created": "Tue, 16 Oct 2018 21:50:05 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/10/16/think.png"
        },
        {
            "text": "I want a new kind of news where there are no professionals. Only user-generated ideas. No blame discussed. No live debates. Only ideas for how to solve the obvious problems, and then we write the Occam’s version of the story.",
            "created": "Wed, 17 Oct 2018 02:35:20 GMT",
            "type": "outline"
        },
        {
            "text": "My agenda for the midterms",
            "created": "Tue, 16 Oct 2018 18:25:11 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I scattered $25 contributions all around <a href=\"http://scripting.com/misc/senate2018/\">the country</a> for Senate races, so of course now I'm getting calls and spam from Dems wanting more. ",
                    "created": "Tue, 16 Oct 2018 18:25:32 GMT"
                },
                {
                    "text": "If they're willing to call me, with a real human being (it seems) why not send an email written by a human being, asking if I have anything I want to contribute that might not be money?",
                    "created": "Tue, 16 Oct 2018 18:26:04 GMT"
                },
                {
                    "text": "Someday political parties will do more than advertise, they will gather the best ideas from the people and implement them. A different kind of transparency."
                },
                {
                    "text": "Right now I'd tell the Dems to talk about <a href=\"http://scripting.com/images/2018/10/16/oversight.png\">oversight</a>. ",
                    "created": "Tue, 16 Oct 2018 18:26:27 GMT"
                },
                {
                    "text": "Restoring power to Congress.",
                    "created": "Tue, 16 Oct 2018 18:26:34 GMT"
                },
                {
                    "text": "And that means voting out the Repubs.",
                    "created": "Tue, 16 Oct 2018 18:26:36 GMT"
                },
                {
                    "text": "I'd like to hear some promises from Dems that they plan to provide the missing oversight.",
                    "created": "Tue, 16 Oct 2018 18:26:51 GMT"
                }
            ]
        }
    ]
}