{
    "text": "October 18",
    "created": "Thu, 18 Oct 2018 14:02:49 GMT",
    "name": "18",
    "subs": [
        {
            "text": "BloggerCon history: <a href=\"http://this.how/bloggercon/#1539876200000\">The grids for BloggerCon I</a>. ",
            "created": "Thu, 18 Oct 2018 15:49:02 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"http://scripting.com/archives/bloggerCon/I/participants/\">BloggerCon I participant list</a>. I started with the original <a href=\"https://cyber.harvard.edu/blogs/gems/bloggerCon/opml/eitherDay.opml\">OPML file</a> and converted it to a web page. There are duplicates and people who were there who aren't on this list. \"It is what it is.\" ",
            "created": "Thu, 18 Oct 2018 17:51:08 GMT",
            "type": "outline"
        },
        {
            "text": "I posted a <a href=\"https://github.com/scripting/Scripting-News/issues/96#issuecomment-431107515\">note</a> to the 2018 blogroll discussion about the work I did restoring the blogroll from 2003 from the first BloggerCon meetup. ",
            "created": "Thu, 18 Oct 2018 18:07:39 GMT",
            "type": "outline"
        },
        {
            "text": "<s>What I want most -- a list of people who were at BloggerCon I. I'm always surprised by people who were there that I have no recollection of. For me it was a whirlwind, huge fun of course, but few distinct memories.</s>",
            "created": "Thu, 18 Oct 2018 16:04:39 GMT",
            "type": "outline"
        },
        {
            "text": "Terry Heaton sent a note yesterday reminding me that the original BloggerCon was held in October 2003, in other words, exactly 15 years ago this month. We missed the actual days, which I can infer from <a href=\"http://scripting.com/2003/10.html\">my blog</a> was October <a href=\"http://scripting.com/2018/10/04.html\">4</a> and <a href=\"http://scripting.com/2018/10/05.html\">5</a>. Unfortunately the first archive.org <a href=\"https://web.archive.org/web/20040818060437/http://www.bloggercon.org:80/\">snapshot</a> of the BloggerCon home page was in 2004, when were getting ready for BloggerCon III at Stanford. I'm going to keep looking on my servers and backups for data about the first BloggerCon. I'm going to archive that as I started <a href=\"http://history.userland.com/\">archiving</a> the old userland.com websites last month. ",
            "created": "Thu, 18 Oct 2018 14:28:13 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/10/05/monstersFullSize.png"
        },
        {
            "text": "<a href=\"http://thepomoblog.com/index.php/the-web-is-its-own-culture/\">Terry Heaton</a> on what BloggerCon means to him. ",
            "created": "Thu, 18 Oct 2018 16:00:02 GMT",
            "type": "outline"
        },
        {
            "text": "I switched away from the <a href=\"https://nypost.com/2018/10/17/knicks-put-on-a-show-and-open-season-with-hawks-destruction/\">Knicks</a> season opener to watch the <a href=\"http://www.espn.com/mlb/story/_/id/25011260/fan-interferes-attempt-boston-red-sox-mookie-betts-catch-ball\">ALCS playoffs</a> for a few minutes. When I came back the Knicks had set a record for the most points in a 2nd quarter by any Knicks team. Yes the Hawks suck. But still.. Could this Knicks team be a winner? Failing that could they at least be fun? It's been so long, 2012 to be specific, since the Knicks were fun to be a fan of. Meanwhile over in Houston, the <a href=\"https://www.houstonchronicle.com/sports/texas-sports-nation/rockets/article/3-pointers-Takeaways-from-the-Rockets-loss-to-13316609.php\">Rockets</a> have the Curse of Carmelo. I feel sorry for the old man. I really do. He was the heart of the Knicks for so long. Hate to see him become a <a href=\"https://en.wikipedia.org/wiki/Journeyman_(sports)\">journeyman</a>, the way he made <a href=\"http://scripting.com/2013/12/19/whatIfTheKnicksHadKeptJeremyLin.html\">Jeremy Lin</a> leave home. I guess <i>what goes around comes around</i> applies. Funny coincidence, Lin, who now comes off the bench for the Hawks, played in last night's game at the Garden. He was a bit rusty at first, but the old magic is still there, you can see it. ",
            "created": "Thu, 18 Oct 2018 14:02:50 GMT",
            "type": "outline",
            "image": "http://static.scripting.com/larryKing/images/2013/12/07/knicksTeam.gif"
        },
        {
            "text": "Louis CK and the Daily",
            "created": "Thu, 18 Oct 2018 21:05:23 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "The question of what to do with Louis CK was featured <a href=\"https://www.nytimes.com/2018/10/18/podcasts/the-daily/louis-ck-comedy-cellar-metoo.html?action=click&module=audio-series-bar&region=header&pgtype=Article\">today</a> on the Daily podcast. It's a good thing to talk about, and it should be looked at from all sides, esp ones that haven't been challenged yet. It's especially important to challenge people who say LCK should never work again. ",
                    "created": "Thu, 18 Oct 2018 21:05:34 GMT"
                },
                {
                    "text": "They mention the example of Mel Gibson's anti-semitism. I was a fan, but I couldn't understand how Hollywood could ever let him work again after what he did. So I've had the same \"nuke him\" impulse around another issue. Mel Gibson is making movies. I don't think people are more or less expressive of their anti-semitism because he is. I've gotten over it, I won't go to see his movies. I still object to him as a celebrity, I can never think of him without thinking how he feels about Jews. I don't want to laugh at his jokes. But that's me. He gets to exist, and practice his art. ",
                    "created": "Thu, 18 Oct 2018 21:08:42 GMT"
                },
                {
                    "text": "Noam Dworman, the owner of the Comedy Cellar club in NY made the only important point in all of this. He doesn't object to other owners refusing to let LCK perform on their stages, as long as no one tries to force him to ban him as well. I'm pretty sure this is one of those moral questions that doesn't actually have an answer. Maybe all artists that are great must also be flawed human beings. Maybe the reason why Louis CK is so good is that he is so bad? Maybe he can keep it under control as long as exposure is the penalty although in his case I could see where he might like being exposed. ",
                    "created": "Thu, 18 Oct 2018 21:11:14 GMT"
                },
                {
                    "text": "I don't have the answer, but on the other hand I don't think anyone else does either. I think that's what the owner of the club was trying to say.",
                    "created": "Thu, 18 Oct 2018 21:15:02 GMT"
                }
            ]
        }
    ]
}