{
    "text": "October 22",
    "created": "Mon, 22 Oct 2018 13:23:50 GMT",
    "name": "22",
    "subs": [
        {
            "text": "This Neil deGrasse Tyson <a href=\"https://www.youtube.com/watch?v=4SXHMm5I-68\">segment</a> on the evolution of the eye helped me understand something important about evolution. \"We like to think of our eyes as state of the art, but 375 million years later, we still can't see things right in front of our noses, or discern fine details in near-darkness the way fish can. When we left the water why didn't nature just start over again and evolve us a new set of eyes that were optimal for seeing in the air? Nature doesn't work that way. Evolution reshapes existing structures over generations, adapting them with small changes. It can't just go back to the drawing board and start from scratch.\" ",
            "created": "Mon, 22 Oct 2018 18:31:57 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/10/22/neilDeGrasseTyson.png"
        },
        {
            "text": "It's been a week since we started a <a href=\"https://github.com/scripting/Scripting-News/issues/96\">thread</a> about discovery in blogs. We haven't discussed much, as far as I can see, that hasn't already been tried. One idea, one-click to subscribe to a blog's feed was something we did <a href=\"http://scripting.com/2018/10/22/141111.html\">at UserLand</a> in 2002. The problem wasn't technology, it wasn't hard, rather it was how to get enough of the blogging tools to support the same calls to form critical mass. It didn't happen. Here's my conclusion on the discussion so far. Two things are needed to upgrade the blogosphere. 1. A growing excited user base. 2. A (somewhat) dominant vendor who is committed to user choice, and therefore uses open clonable formats and protocols. #1 is a prerequisite for anything to happen imho. #2 is a lesson I learned when the clonability of UserLand's products was not reciprocated by our competitors. That's an important lesson and I don't think many others are aware of it. As with our tech, it's available to anyone who wants it. ",
            "created": "Mon, 22 Oct 2018 13:42:27 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/10/22/santaForAmerica.png"
        },
        {
            "text": "A reminder. <a href=\"https://www.youtube.com/watch?v=fVDZDSoxtJU\">This</a> is what Trump did to our judicial system. This schmuck is on the Supreme Court. It wasn't just a bad dream.",
            "created": "Mon, 22 Oct 2018 14:47:18 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=fVDZDSoxtJU"
        },
        {
            "text": "I just ordered an iMac Pro. The only upgrade I got was doubling the memory to 64GB. I usually buy as little Apple memory as possible, but I was <a href=\"https://arstechnica.com/gadgets/2018/02/imac-pro-review-not-a-consumer-machine-but-not-quite-perfect-for-pros-either/3/#h1\">warned</a> that installing memory on this machine is not so easy. So I paid the luxury tax. The <i>whole thing</i> is a luxury, my <a href=\"http://scripting.com/images/2018/10/22/currentMac.png\">current iMac</a> performs pretty well. I use it as a writing machine, blogging and software, and I guess it's mostly doing I/O, it's not compute-bound. But this is the last moment for me to buy a new Mac, this is the last O/S release that <a href=\"https://github.com/scripting/Scripting-News/issues/98\">runs Frontier</a>. There's no direct port planned as far as I know. And hopefully before this machine dies, there will be a Linux port, which is where I'd rather be spending my time. Or possibly my JavaScript codebase will be rich enough so I can port my dev tools to be independent of Frontier. Not my preferred path forward. I've been using a Mac since 1984, with a brief hiatus at the end of the 90s. The total with tax and AppleCare came to $6,497.66. It will be delivered between November 6 and 8. Just in time to either celebrate victory in the election or drown my sorrows in defeat. ",
            "created": "Mon, 22 Oct 2018 13:23:51 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/10/22/mac.png"
        },
        {
            "text": "Radio UserLand's coffee mug",
            "created": "Mon, 22 Oct 2018 14:11:11 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Just for fun, I reconstructed the Radio UserLand coffee mug icon in 2002.",
                    "created": "Mon, 22 Oct 2018 14:14:18 GMT",
                    "subs": [
                        {
                            "text": "<a href=\"http://127.0.0.1:5335/system/pages/subscriptions?url=http://scripting.com/rss.xml\" title=\"Click on the XML coffee mug to subscribe to &quot;Scripting News&quot; in Radio UserLand.\"><img src=\"http://scripting.com/images/2018/10/22/coffeeMugIcon.png\" border=\"0\" width=\"36\" height=\"36\" alt=\"Subscribe to &quot;Dave's Handsome Radio Blog!&quot; in Radio UserLand.\"></a>",
                            "created": "Mon, 22 Oct 2018 14:11:27 GMT"
                        }
                    ]
                },
                {
                    "text": "The icon appeared on every Radio blog, and Manila site, and on the Scripting News home page. At the time that was a lot of support believe it or not. ",
                    "created": "Mon, 22 Oct 2018 14:14:53 GMT"
                },
                {
                    "text": "If you click the icon it sends a message to the server running on port 5335 of the local machine, which was Radio UserLand, telling it to subscribe to the URL for Scripting News' RSS feed. The app would come to the front, confirm that you want to subscribe, and if so it would add the feed to the database. ",
                    "created": "Mon, 22 Oct 2018 14:11:59 GMT"
                },
                {
                    "text": "It could have worked for any feed on any blog. It was our hope that it would catch on, but that wasn't the mood of the time. People wanted to blaze their own trail. And it probably should have moved to a centralized publicly owned resource, the commons (like DNS perhaps). But it wasn't meant to be, it didn't happen, and easy subscription became a feature-advantage of the silos over open blogging. ",
                    "created": "Mon, 22 Oct 2018 14:13:02 GMT"
                }
            ]
        }
    ]
}