{
    "text": "October 24",
    "created": "Wed, 24 Oct 2018 20:18:48 GMT",
    "name": "24",
    "subs": [
        {
            "text": "Do you build on the <a href=\"https://developer.github.com/v3/\">GitHub API</a>? If so <a href=\"https://twitter.com/davegandy/status/1055301382037782529\">what have you</a> created?",
            "created": "Thu, 25 Oct 2018 03:36:39 GMT",
            "type": "outline"
        },
        {
            "text": "If a few thousand poor people from Central America <a href=\"https://www.theguardian.com/us-news/2018/oct/24/caravan-migrants-what-is-it-where-from-guatemala-honduras-immigrants-mexico\">walking</a> to the US over 1200 miles away can threaten the well-being of our country, why are we spending $600 billion a year on defense? (The answer is they are no threat. We are set up to process them. That's why we spend so much on borders. We could look this shit up before we accept the premise of Republican hype. Jerry Brown should run for president just to get the Dems back on track hype wise. This stuff is simple, but the current Dem leadership is as Trump says weak.)",
            "created": "Wed, 24 Oct 2018 21:14:20 GMT",
            "type": "outline"
        },
        {
            "text": "BTW, if you’re worried about 7000 poor refugees 1200 miles south of the US border, don’t <a href=\"https://en.wiktionary.org/wiki/freak_out\">freak out</a> but there are 129 <i>million</i> <a href=\"https://en.wikipedia.org/wiki/Mexico\">Mexicans</a> south of the US border, most of them closer than 1200 miles. ",
            "created": "Thu, 25 Oct 2018 03:27:50 GMT",
            "type": "outline"
        },
        {
            "text": "I went for a haircut today at a Russian barber shop here in NYC. They had Fox News on, which is unusual, they usually have Turner Classic Movies (one of the reasons I like the place). So Fox News was going on endlessly talking about the bombs. There was very little news, not much to say. I'm totally tuning into this these days. It's all very repetitive. Like the commenters are instruments in an orchestra who can be relied on to play certain notes when called on. The moderator, Wolf or <a href=\"http://scripting.com/images/2018/10/24/cnnOnTheStreet.png\">Chris</a> or Jake or Brett or whoever is the conductor of the orchestra. He's following a script that's whispered in his ear by <a href=\"https://en.wikipedia.org/wiki/Broadcast_News_(film)\">Holly Hunter</a>. Mindless crap that's been focus group tested to the max. Blah and blah oh and btw blah, blah. Polls. When is it ok to politicize. No it's too soon for sure. Stay tuned there's much more breaking news to come. ",
            "created": "Wed, 24 Oct 2018 20:18:49 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/10/24/stars.png"
        }
    ]
}