{
    "text": "October 26",
    "created": "Fri, 26 Oct 2018 15:33:51 GMT",
    "name": "26",
    "subs": [
        {
            "text": "Counting the <a href=\"http://scripting.com/images/2018/10/26/countingTheDays.png\">days</a> to the apocalypse. ",
            "created": "Sat, 27 Oct 2018 03:01:29 GMT",
            "type": "outline"
        },
        {
            "text": "They <a href=\"https://twitter.com/davewiner/status/1056019274718941184\">found</a> the guy's fingerprints and DNA on the bombs. And they found Trump's programming running his mind. Don't miss this point. Now getting attacked by Trump, in his rallies and tweets, has a new measurable cost, one it didn't have before this week. We used to think (hope) his rallies and tweets were harmless. Now we know they are not.",
            "created": "Sat, 27 Oct 2018 03:11:19 GMT",
            "type": "outline"
        },
        {
            "text": "Here's a <a href=\"http://scripting.com/davenet/1994/10/18/billgatesvstheinternet.html\">web page</a> published in 1994. Your browser can still read it. That's a minor miracle. If a tech company owned the web, it's almost certain it would have broken long ago. Because no one owns the web, it still works.",
            "created": "Sat, 27 Oct 2018 02:54:02 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/965714699168858112"
        },
        {
            "text": " I read a post this morning by <a href=\"https://twitter.com/davewiner/status/1055890611105087493\">Evan McMullen</a>, a conservative Republican saying \"the next political tribe in America will care about everyone.\" I commented \"sign me up.\" Then someone <a href=\"https://twitter.com/bob2cleo/status/1055890152256618497\">said</a> \"That's the Democrats.\" And I thought \"That's bullshit.\" You want to keep losing elections, keep demonizing white men. There's a lot of resentment building, the Repubs have figured out how to tap into it. On the other hand McMullen's theoretical party, by design, will care about everyone. ",
            "created": "Fri, 26 Oct 2018 20:05:29 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/12/20/shrek.png"
        },
        {
            "text": "If Trump were a regular citizen would the Secret Service arrest him for inciting violence against Democrats and journalists? Is he criminally liable for what his acolytes do at his behest? (BTW, Bernie never told anyone to attack Steve Scalise so that's bullshit.)",
            "created": "Fri, 26 Oct 2018 19:37:59 GMT",
            "type": "outline"
        },
        {
            "text": "There is a reason for young healthy people to buy insurance even though there is no longer a <a href=\"https://thehill.com/policy/healthcare/365185-final-gop-tax-bill-repeals-obamacare-mandate\">requirement</a> that you do so. Pre-existing conditions. You probably don't have any when you're young, so you can get insurance. They can't cut you off if you get one if you were previously covered (it would be something if they could, you could get cut off as soon as you need insurance). So starting and maintaining continuous coverage, even if you get insurance through a job, is a <b>good</b> idea. You never know when you might become a person with a P.E.C. ",
            "created": "Fri, 26 Oct 2018 17:06:05 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/09/02/mrFrog.png"
        }
    ]
}