{
    "text": "October 29",
    "created": "Mon, 29 Oct 2018 15:37:26 GMT",
    "name": "29",
    "subs": [
        {
            "text": "The deeper I get into this (unnamed) project the more convinced I am that GitHub makes a good object database for a CMS. I haven't hit any limits. It's slow-going only because I don't want to have to live with half-baked ideas long-term, as we did <a href=\"http://scripting.com/frontier/manual/chapter06.html\">with Frontier</a>. Obvious advantage here is that a big tech company is maintaining the back-end at scale with good economic terms. That is also its biggest disadvantage. On the other hand GIT is very much not exclusive to GitHub/Microsoft. So here's hoping haha that they don't <a href=\"https://duckduckgo.com/?q=embrace+extend+site%3Ascripting.com&t=h_&ia=web\">Embrace & Extend</a> devs out of the picture.",
            "created": "Mon, 29 Oct 2018 15:37:27 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/10/29/microsoftBrain.png"
        },
        {
            "text": "It never crossed my mind that Twitter should <a href=\"https://www.theatlantic.com/technology/archive/2018/10/twitter-should-kill-retweet/574321/\">eliminate RT</a>.  ",
            "created": "Mon, 29 Oct 2018 21:18:44 GMT",
            "type": "outline"
        },
        {
            "text": "I've been thinking how software evolution works much like natural <a href=\"http://scripting.com/2018/10/22.html\">evolution</a>. The more I learn, the better the fit. Now I understand why I like programming so much, esp projects that last years, even decades. If this is evolution, think about it, who's god? Haha. :boom:",
            "created": "Mon, 29 Oct 2018 16:45:46 GMT",
            "type": "outline"
        },
        {
            "text": "Having finished Battlestar Galactica, <a href=\"http://www.vulture.com/2018/10/bodyguard-netflix-review.html\">this will</a> be my next binge. ",
            "created": "Mon, 29 Oct 2018 15:47:05 GMT",
            "type": "outline"
        },
        {
            "text": "Resurrection of blogging?",
            "created": "Mon, 29 Oct 2018 20:17:12 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "One thing I know for sure, if you want to lead a rebirth of blogging, the first thing to do is to start blogging. The resurrection will not be led by non-bloggers.",
                    "created": "Mon, 29 Oct 2018 20:17:17 GMT",
                    "image": "http://scripting.com/images/2018/10/29/eggMcMuffin.png"
                },
                {
                    "text": "Reminds me of a public debate I had with <a href=\"https://en.wikipedia.org/wiki/Yochai_Benkler\">Yochai Benkler</a> many years ago. I was stating something like this, that the best software is developed by users. He asked if you had to have cancer to develop a treatment. He stumped me with that. ;-)",
                    "created": "Mon, 29 Oct 2018 20:18:41 GMT"
                },
                {
                    "text": "My response, many years later, is that blogging is not a disease, not something to be avoided, and the tools we have for it are for human expression. A scientist would not understand the language of the human blogger if she weren't herself a blogger.",
                    "created": "Mon, 29 Oct 2018 20:18:42 GMT"
                },
                {
                    "text": "On the other hand a cancer researcher has to think like the disease, not the human. There is no chance (as far as I can imagine) for the doctor to become the cancer. So the treatments have to be developed without the first-hand experience of being a user.",
                    "created": "Mon, 29 Oct 2018 20:18:52 GMT"
                }
            ]
        }
    ]
}