{
    "text": "October 31",
    "created": "Wed, 31 Oct 2018 12:29:39 GMT",
    "name": "31",
    "subs": [
        {
            "text": "Somehow <a href=\"https://gab.com/\">gab.com</a> got <a href=\"http://scripting.com/images/2018/10/31/gabHome.png\">knocked off</a> the web, by GoDaddy or Joyent or a combination thereof. <a href=\"https://twitter.com/davewiner/status/1057791349708283904\">I wanted to know how</a> this happened, and if people agree that Gab should go, where is the line? It can't be that Nazis use their service, because Nazis use everything. I think the ACLU and the EFF should be involved here, and try to come up with some rules for all parties, so we don't have to wing this every time. ",
            "created": "Thu, 01 Nov 2018 03:01:57 GMT",
            "type": "outline"
        },
        {
            "text": "Did you ever watch the movie <a href=\"https://en.wikipedia.org/wiki/Wag_the_Dog\">Wag the Dog</a>? Trump is <a href=\"https://www.politico.com/story/2018/10/31/trump-mexico-stop-migrant-caravan-950103\">doing</a> exactly what the White House did in the movie with one big difference. They aren't hiding the con.",
            "created": "Wed, 31 Oct 2018 20:43:38 GMT",
            "type": "outline"
        },
        {
            "text": "Apple has finally made moving to a new machine as effortless as it can be, without having everything be in the cloud. Now Dropbox has to figure this out too. My Dropbox folder is where it used to be but it doesn't recognize it on the new system. Perhaps because the name of the boot drive changed? Not sure. But I have a huge Dropbox, with systems built in it that have been running for years. Not happy that I have to re-download every file, when they're all already on the system. It's going to take at least 24 hours based on past experience. ",
            "created": "Wed, 31 Oct 2018 17:06:39 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/10/31/happyDiosDeLaMuerto.png"
        },
        {
            "text": "If I ever start a publication, my contributing editors are going to be domain experts who don't have big titles who have the independence to say the truth, instead of having to keep a lot of other people with big titles happy. The way you get and keep a big title is by fudging the truth.",
            "created": "Wed, 31 Oct 2018 14:46:06 GMT",
            "type": "outline"
        },
        {
            "text": "The Moneyball of politics",
            "created": "Wed, 31 Oct 2018 17:10:35 GMT",
            "type": "outline",
            "description": "Hillary didn't lose because she had bad ideas, quite the opposite. She just didn't know if she was a nurturing mother or a strict father. ",
            "subs": [
                {
                    "text": "<a href=\"https://en.wikipedia.org/wiki/George_Lakoff\">George Lakoff</a> was on MSNBC last night, along with an <a href=\"http://thesaurus.land/?word=affable\">affable</a> <a href=\"https://en.wikipedia.org/wiki/Bill_Kristol\">Republican pundit</a>, to talk about his ideas of how politics works. Lakoff's view is as far as I'm concerned exactly right. Republicans represent the strict father, and Democrats the nuturing mother. When you vote Republican it's probably because in the house you grew up in the father was a strong figure and the mother not. If you vote Democratic, you're seeking the mother, because that's what you trust. ",
                    "created": "Wed, 31 Oct 2018 17:10:39 GMT",
                    "image": "http://scripting.com/images/2018/10/31/moneyball.png"
                },
                {
                    "text": "The Repubs know about this, and play into it, and the Dems think we make voting decisions based on policy. That isn't the observed behavior. If you ever doubted it, Trump is the proof. He says whatever he wants. People don't care. It's who he is and how confident he is that makes them feel comfortable.",
                    "created": "Wed, 31 Oct 2018 17:12:53 GMT"
                },
                {
                    "text": "Lakoff also talks about <a href=\"https://www.theguardian.com/science/head-quarters/2017/jul/20/the-power-of-framing-its-not-what-you-say-its-how-you-say-it\">framing</a>. It matters how you present an idea more than what the idea actually is. <a href=\"https://en.wikipedia.org/wiki/Partial-Birth_Abortion_Ban_Act\">Partial birth abortion</a>, for example, sounds horrible. But if you or a family member needed an abortion to save their life, you'd see it differently. Framing. Lakoff says \"Don't think about an elephant\" as Trump might say \"Don't kill Jews.\" When Trump says it, he's putting the idea of You -> Killing -> Jews in your head. He can say he said not to do it. But it's just as effective at planting the idea when negated.",
                    "created": "Wed, 31 Oct 2018 17:24:36 GMT"
                },
                {
                    "text": "An example from my own life. Talking with an Apple exec at a tradeshow in the 1990s he said \"We're not trying to crush you,\" from which I concluded they are trying to crush me. It's the way the mind works. Lakoff sees that clearly, but TV pundits and Democrats don't know this. They really don't. They think facts are how people make up their minds. ",
                    "created": "Wed, 31 Oct 2018 17:26:45 GMT"
                },
                {
                    "text": "Even though he's so brilliant, when Lakoff goes on MSNBC it's a disaster. None of his very important ideas are communicated. He says \"Don't think about the elephant,\" and leaves it to the listener to figure it out. The other panelist and perhaps the moderator have no idea what he's talking about, and unless you had read his book, or attended a lecture, or listened to a <a href=\"http://scripting.com/stories/2008/02/25/interviewWithGeorgeLakoff.html\">podcast</a>, you couldn't. No discussion happens, it's a wasted opportunity. I've seen this happen twice now. Frustrating as hell. Because it's hard to explain how fucked up a system is within the system itself. ",
                    "created": "Wed, 31 Oct 2018 17:13:49 GMT"
                },
                {
                    "text": "I think these ideas are as powerful as <a href=\"https://en.wikipedia.org/wiki/Moneyball\">Moneyball</a> was to baseball when they were discovered by <a href=\"https://slate.com/culture/2011/11/michael-lewis-and-billy-beane-talk-moneyball.html\">Billy Beane</a> of the Oakland As. Since then it's been practiced by football, basketball, and other baseball teams with much success. Moneyball says you should look at what factors make a difference in winning, and do that. An inexpensive hitter who reliably gets on base, even by walking, is more central to winning than an expensive high percentage hitter. You look at the numbers and do what they say to do. The As, a poor team, couldn't afford to buy the great players, so instead they bought players that made them win. :boom:",
                    "created": "Wed, 31 Oct 2018 17:29:00 GMT"
                },
                {
                    "text": "Lakoff is the equivalent of Moneyball, but applied to politics. Lakoff's laws are observable. Hillary didn't lose because she had bad ideas, quite the opposite, she had smart ones, based on decades of experience in government, and a genius mind. She just didn't know if she was a nurturing mother or a strict father. ",
                    "created": "Wed, 31 Oct 2018 17:32:13 GMT"
                },
                {
                    "text": "I don't think we're going to dig out of this until the leadership and the marketing people in the Democratic Party learn about Lakoff's family and framing. A book by <a href=\"https://en.wikipedia.org/wiki/Michael_Lewis\">Michael Lewis</a> would be hugely impactful.",
                    "created": "Wed, 31 Oct 2018 17:15:59 GMT"
                },
                {
                    "text": "PS: We will eventually sort it out, I think, if we survive Trump. The next generation of leaders in the Democratic Party are really something. I'm thinking of <a href=\"https://en.wikipedia.org/wiki/Stacey_Abrams\">Stacey Abrams</a>, <a href=\"https://en.wikipedia.org/wiki/Andrew_Gillum\">Andrew Gillum</a>, <a href=\"https://en.wikipedia.org/wiki/Alexandria_Ocasio-Cortez\">Alexandria Ocasio-Cortez</a> and <a href=\"https://en.wikipedia.org/wiki/Beto_O%27Rourke\">Beto O'Rourke</a>. Any combination of them could be the 2020 ticket. Or maybe something really smart from a marketing standpoint, <a href=\"https://twitter.com/shannonrwatts/status/1057314813787820033\">Stacey Abrams</a> as VP and Joe Biden at the top of the ticket. That would be a Moneyball ticket imho.",
                    "created": "Wed, 31 Oct 2018 17:17:38 GMT"
                }
            ]
        },
        {
            "text": "Morning coffee notes",
            "created": "Wed, 31 Oct 2018 14:45:51 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Good morning sports fans!",
                    "created": "Wed, 31 Oct 2018 12:29:40 GMT",
                    "type": "outline"
                },
                {
                    "text": "Just getting started with my new iMac Pro. It seems pretty fast. I got a warning about the <a href=\"https://github.com/scripting/Scripting-News/issues/98\">OPML Editor</a>, but it launched. ",
                    "created": "Wed, 31 Oct 2018 12:30:11 GMT",
                    "type": "outline"
                },
                {
                    "text": "One of the big problems with the setup is that I had two old Firewire devices, one a La Cie drive and the other a very old external monitor that have plugs that don't fit into any of the ports on the back of the iMac. Not sure where I'll go with this, but the lack of an external monitor is a real problem.",
                    "created": "Wed, 31 Oct 2018 12:54:22 GMT",
                    "type": "outline"
                },
                {
                    "text": "I started a <a href=\"https://github.com/scripting/Scripting-News/issues/101\">thread</a> for help with my iMac issues. :boom:",
                    "created": "Wed, 31 Oct 2018 13:00:02 GMT",
                    "type": "outline"
                },
                {
                    "text": "I guess it's time to get a new second monitor. The one I've been using is from 2006. I'm guessing the monitors have gotten better. I use the second monitor for status displays. It's like a driver-side mirror in a car. Now I have to figure out what kind of monitor to get. Figuring it probably won't be from Apple. I hear Dell makes good monitors. ",
                    "created": "Wed, 31 Oct 2018 13:24:09 GMT",
                    "type": "outline"
                }
            ]
        }
    ]
}