{
    "text": "Walking on country roads",
    "created": "Fri, 24 Apr 2020 14:20:27 GMT",
    "type": "outline",
    "description": "Remember, there's a pandemic going on. Stay safe walking on our beautiful country roads. ",
    "metaImage": "http://scripting.com/images/2020/04/24/countryRoad.png",
    "subs": [
        {
            "text": "In the country north of NYC where I now live, we're seeing an influx of city folk, staying at their summer homes or using AirBnB's or whatever. And of course they're getting out and walking on our beautiful roads. ",
            "created": "Fri, 24 Apr 2020 14:26:33 GMT"
        },
        {
            "text": "But some of them bring their aggressive city walking habits with them, something I'm very familiar with because I also know how to walk <a href=\"http://scripting.com/2017/11/27.html#a203503\">in Manhattan</a>, learned the hard way. ",
            "created": "Fri, 24 Apr 2020 14:30:12 GMT"
        },
        {
            "text": "Here are some common-sense rules for walking on country roads.",
            "created": "Fri, 24 Apr 2020 14:20:31 GMT",
            "flNumberedSubs": "true",
            "subs": [
                {
                    "text": "Wear a mask.",
                    "created": "Fri, 24 Apr 2020 17:45:31 GMT"
                },
                {
                    "text": "Walk on the side of the road, not in the middle.",
                    "created": "Fri, 24 Apr 2020 14:24:09 GMT"
                },
                {
                    "text": "Pick a side of the road to walk on and stick with it.",
                    "created": "Fri, 24 Apr 2020 14:24:34 GMT"
                },
                {
                    "text": "If you're in a group of say four people, don't walk four-across. ",
                    "created": "Fri, 24 Apr 2020 14:24:28 GMT"
                },
                {
                    "text": "Leave room for people to pass you.",
                    "created": "Fri, 24 Apr 2020 14:24:50 GMT"
                },
                {
                    "text": "Remember cars and bikes use country roads too. :-)",
                    "created": "Fri, 24 Apr 2020 14:27:49 GMT"
                },
                {
                    "text": "If someone is walking faster, as they approach (assuming you hear them) slow down a little, or stop, to make the passing faster. Stay slow until they are a few yards ahead, so you minimize the breathing their exhaled viruses. ",
                    "created": "Fri, 24 Apr 2020 14:26:59 GMT"
                }
            ]
        },
        {
            "text": "I offer this advice because a few people are walking like there is no pandemic and their breath is free of virus and they're assuming so is everyone else's. ",
            "created": "Fri, 24 Apr 2020 14:25:27 GMT"
        }
    ]
}