{
    "created": "2021-11-08T05:00:00.000Z",
    "flInCalendar": true,
    "name": "08",
    "path": "2021/11/08",
    "text": "November 08",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I just heard that a longtime friend and fellow outliner Scott Love has died. Oy. I knew Scott when he was our chief product marketer at <a href=\"https://en.wikipedia.org/wiki/Living_Videotext\">Living Videotext</a> back in the 80s. He was part of the team that shipped ThinkTank, Ready and MORE. When we sold to Symantec, Scott went to NeXT where he was on the rollout team for their product. His heart was in outliners. He went on to start Aquaminds, which he explains in his <a href=\"https://www.quora.com/profile/Scott-Love\">bio</a> on Quora. Scott was a brilliant creative funny friendly and vulnerable human. He put his heart into everything he did. His boss, before he worked for me, Alfred Mandel, called him Nudgie. When I heard that I started using that name for him too, until I realized it might not be the nicest thing. Recently Scott and I reconnected on Twitter. In a private exchange he said he liked the name. I'm sorry his life was so short. His enthusiasm and big heart and super active mind will be missed. ",
            "created": "Mon, 08 Nov 2021 20:56:42 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/11/08/scottLove.png",
            "flInCalendar": true
        },
        {
            "text": "Scott and I had dinner many times, and often traveled together on business. We always joked about how we were going to take on the then-dominant tech company IBM. It was either Boca or Bucha, which was short for Bucharest, where we were surely headed if we failed to defeat the mighty IBM. We'd talk about catching the red-eye to Bucharest. I don't know why it was then (and still is now) so funny. Bucharest was a pretty awful place at the time, run by an even worse dictator than IBM -- <a href=\"https://en.wikipedia.org/wiki/Nicolae_Ceau%C8%99escu\">Nicolae Ceaușescu</a>. ",
            "created": "Mon, 08 Nov 2021 21:08:32 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "GitHub could be the next MS-DOS.",
            "created": "Mon, 08 Nov 2021 14:38:15 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1457719057570992131",
            "flInCalendar": true
        },
        {
            "text": "I would still love to read a simple summary of the second part of the Washington Post review of January 6. The part where they tell us minute by minute what the president of the United States, the commander-in-chief, was doing while the US Capitol was under seige. ",
            "created": "Mon, 08 Nov 2021 14:43:29 GMT",
            "type": "tweet",
            "tweetId": "1457720829664538631",
            "tweetUserName": "davewiner",
            "flInCalendar": true
        },
        {
            "text": "Slavery formed us",
            "created": "Mon, 08 Nov 2021 19:37:28 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2021/11/08/slavery.png",
            "description": "Slavery is deeply rooted and it isn't over yet.",
            "subs": [
                {
                    "text": "I'm reading two books at the same time. ",
                    "created": "Mon, 08 Nov 2021 19:37:35 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "<a href=\"https://www.amazon.com/Zookeepers-Wife-War-Story/dp/039333306X\">The Zookeeper's Wife</a> and <a href=\"https://en.wikipedia.org/wiki/Uncle_Tom%27s_Cabin\">Uncle Tom's Cabin</a>. ",
                    "created": "Mon, 08 Nov 2021 19:37:46 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "One about the Holocaust, the other about slavery. The pairing has me thinking about the differences. ",
                    "created": "Mon, 08 Nov 2021 19:46:58 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "This has been the year for me of reading about slavery. It has really been an eye-opening experience. ",
                    "created": "Mon, 08 Nov 2021 19:43:56 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "One observation, <a href=\"https://en.wikipedia.org/wiki/The_Holocaust\">the Holocaust</a> was unthinkably horrible, but it wasn't slavery, the oppressors were trying to anihilate us, not enslave us. ",
                    "created": "Mon, 08 Nov 2021 19:39:15 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It was over in five years. ",
                    "created": "Mon, 08 Nov 2021 19:39:27 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Antisemitism is permanent, but it is not slavery. ",
                    "created": "Mon, 08 Nov 2021 19:44:33 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "<a href=\"https://en.wikipedia.org/wiki/Slavery_in_the_United_States\">Slavery</a> <a href=\"https://www.theguardian.com/news/2019/aug/15/400-years-since-slavery-timeline\">lasted</a> over <a href=\"https://en.wikipedia.org/wiki/Slavery_in_the_colonial_history_of_the_United_States\">400 years</a>, and imho it isn't over yet. It had a chance to form the whole culture of not just the US as some of our European friends sometimes imply, all white people everywhere are indicted. ",
                    "created": "Mon, 08 Nov 2021 19:48:20 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "There are lots of other differences, but the thing most Americans don't get is that slavery is deeply rooted and it isn't over yet. And if we want it to be over, it's going to require a near-universal conscious decision to end it. ",
                    "created": "Mon, 08 Nov 2021 19:40:13 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Thanks for listening.",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}