{
    "created": "2021-11-30T05:00:00.000Z",
    "flInCalendar": true,
    "name": "30",
    "path": "2021/11/30",
    "text": "November 30",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Beatles: <a href=\"https://www.youtube.com/watch?v=NCtzkaL2t_Y\">Don't Let Me Down</a>.",
            "created": "Tue, 30 Nov 2021 15:34:30 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=NCtzkaL2t_Y",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1465704456528400390\">Poll</a>: When will you watch [[Get Back]]?",
            "created": "Tue, 30 Nov 2021 15:29:32 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1465704456528400390",
            "flInCalendar": true
        },
        {
            "text": "I'm glad I read the <a href=\"http://scripting.com/2020/08/19.html#a160302\">book</a> about the <a href=\"https://en.wikipedia.org/wiki/Spanish_flu\">1918 pandemic</a> last year, because I understand something that most people should and don't. Mutations aren't necessarily bad, in fact over time the mutations will make the virus less deadly. It's all about evolution and survival of the fittest. Mutation is how evolution happens. A new variant shows up and if it is in some way more likely to propagate and survive than previous variants, it will stick around and thrive, and continue to mutate. If a virus kills its host -- that's not good for survivability. So what happens over time, a virus like Covid becomes less harmful and more transmissible, that's how it becomes \"the flu.\" The 1918 influenza virus is still with us today. But it doesn't kill people in the numbers that it did a hundred years ago. Over time Covid will get less deadly too.",
            "created": "Tue, 30 Nov 2021 15:44:30 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/04/19/coronavirus.png",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://heathercoxrichardson.substack.com/p/november-29-2021\">Heather Cox Richardson</a> confirmed <a href=\"http://scripting.com/images/2021/11/30/hcrquote.png\">something</a> that I had been wondering about -- do Congresspeople in the US, esp Republicans, worry about the safety of their families if they were to act independently of Trump. I was sure that some of them do, but I had never heard this reported on the news. So far they only talk about threats involving losing their jobs. But if the threats were about physical well-being, that's another thing. That's how it works in Russia for journalism and politics. The one year I was at Davos I spent some time hanging out with Russian journalists. This was in 2000, when Russia had supposedly liberalized. I went to a big session in the main hall where one of the officers of the Russian government was speaking, someone who I had been introduced to by my sponsor, the person who got me my white badge (a journalists' credential, the best one available, got me entry to every session, unlike most journalists attending). At one point I stood up and asked a challenging question of the Russian. He gave me a typical evasive answer. But here's the thing -- after I did that, none of my Russian journalist friends would talk to me. Obviously their political system didn't work like ours. Today when there is no pretense at freedom in Russia, I imagine it's much worse. And according to HCR's reporting, we're headed down that path in the US. The next year seems to be our last chance to turn it around. ",
            "created": "Tue, 30 Nov 2021 14:06:11 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/11/12/russianDressing.png",
            "flInCalendar": true
        },
        {
            "text": "I have continued watching [[Get Back]]. Everyone should watch this, if you're a creative, or your work involves creative people. Creativity needs to be nurtured and protected. I'm sure there are other lessons coming, but I'm going through it slowly, I'm still on the first segment. ",
            "created": "Tue, 30 Nov 2021 14:20:10 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Tesla notes",
            "created": "Tue, 30 Nov 2021 14:53:20 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "On Thursday it'll be two weeks since I got the Tesla Model 3. Here are some thoughts. ",
                    "created": "Tue, 30 Nov 2021 14:53:26 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I haven't been using the autopilot more than just trying it, seeing it veer into a head on collision, I quickly took control. i'm pretty sure it wasn't actually going to kill me, it was a simple situation, Highway 28 from Boiceville to West Hurley, a <a href=\"https://www.google.com/maps/@41.9792245,-74.2513003,3a,75y,117.7h,55.47t/data=!3m8!1e1!3m6!1sAF1QipPO1fyoXuIDtIHcKA4Ip3wRL8bdSc58hv_Qfmlh!2e10!3e11!6shttps:%2F%2Flh5.googleusercontent.com%2Fp%2FAF1QipPO1fyoXuIDtIHcKA4Ip3wRL8bdSc58hv_Qfmlh%3Dw203-h100-k-no-pi-4.4466395-ya52.469-ro-1.6197597-fo100!7i7680!8i3840\">wide road</a>, easy for the autopilot.",
                    "created": "Tue, 30 Nov 2021 14:53:26 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "But here's the thing -- like the self-driving features of the Subaru, the self-driving features of the Tesla are always there, ready to take over if it thinks you're fucking up. It did a thing weird on a drive out my little dirt road, it sounded an alarm that I was driving off the road. loud screeching sound. I was doing no such thing.",
                    "created": "Tue, 30 Nov 2021 14:54:52 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The thing that really distinguishes the Tesla as far as i'm concerned isn't the power, or battery, those are nice -- but the full integration of the computer system in the experience. The Subaru is a hodgepodge of different systems that don't know about each other. Very confusing. i've gotten to just using <a href=\"https://en.wikipedia.org/wiki/CarPlay\">Car Play</a> for everything and ignoring the rest. ",
                    "created": "Tue, 30 Nov 2021 14:56:22 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "What this says to me is that in a couple of years, there will be a Mercedes EV with a big screen like Tesla's and no dashboard again like Tesla. And the same or better integration. It'll be running Apple, Amazon or Google software. and it will be as good as Tesla's software because they hire out of the same talent pool.  ",
                    "created": "Tue, 30 Nov 2021 14:57:12 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}