{
    "text": "Echoes of 2002",
    "created": "Wed, 22 Jun 2022 16:21:33 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I have the same attitude about \"RSS\" in 2022 as I did in 2002. I wanted to move, to clean up the mess, start with a fresh new foundation. It worked then, and I believe now twenty years later it'll work again.",
            "created": "Wed, 22 Jun 2022 16:21:39 GMT",
            "flInCalendar": true
        },
        {
            "text": "So much has changed. There was no Twitter or Facebook in 2002. None of the writing systems we use now existed. I think RSS 2.0 even predates Wordpress.",
            "created": "Wed, 22 Jun 2022 16:22:05 GMT",
            "flInCalendar": true
        },
        {
            "text": "I have found a way to make it much simpler and easier to evolve feeds on the web, and I'm not waiting for permission I'm just going ahead. That's in fact what happened after RSS 2.0 with podcasting. We just did it, no one objected, and off we went. ",
            "created": "Wed, 22 Jun 2022 16:22:18 GMT",
            "flInCalendar": true
        },
        {
            "text": "The theme is totally opposite of the one in 2002, when I was basically finishing RSS, and giving it over to everyone to do with as they please. The roadmap said it clearly. This is it. No more new stuff in RSS itself. If you want to add to it, you can, but to get support for your ideas you're on your own. I wasn't signing up for another stint as notetaker for this particularly community. It was too thankless a job. But guess what, not much happened. The RSS people are using today is pretty much what they were using 20 years ago. There have been some new applications, and there are some respectful projects to add a new namespaces. That's more or less what the roadmap called for. So without any leadership, it kind of took care of itself.",
            "created": "Wed, 22 Jun 2022 16:55:46 GMT",
            "flInCalendar": true
        },
        {
            "text": "Anyway, RSS as they say is what it is. There's also Atom and RDF, these exist and are in use. Very little if any innovation across the whole market, all of the new stuff has been in the individual products, but there are severe limits on what they can do because the format isn't moving.",
            "created": "Wed, 22 Jun 2022 16:57:52 GMT",
            "flInCalendar": true
        },
        {
            "text": "My thought is that I can write some new software, as everyone else is, but with the thought that I want people to do the same as I am doing. At the same time, I don't care if you do it or not, if you pick up the ideas or don't. All I'm looking for is a critical mass of people who want to experiment with a new cleaned-up simplified feed system built on what was built before. ",
            "created": "Wed, 22 Jun 2022 16:59:17 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}