{
    "text": "Today I am in agreement with NYC mayoral candidate Andrew Yang about the Knicks and Jeremy Lin. <a href=\"https://twitter.com/bflats2020/status/1354055404393811969\">He says</a>: \"When the Knicks dumped Jeremy Lin that was the last straw for me. This is the franchise that gave <a href=\"https://www.sportskeeda.com/basketball/5-worst-contracts-handed-out-in-nba-history/2\">Jerome James</a> $30 million. You let the most beloved Knicks figure in years who lit the Garden and City up walk over money?  Come on.\" Amen. Under his note are a mix of comments including the usual that Lin wasn't that good, but who knows. If the Knicks had loved him maybe he would have continued to be an inspiration to the team and to New Yorkers. Instead, the Knicks stuck with Melo, who clearly was jealous of the attention <a href=\"http://scripting.com/2013/12/19/whatIfTheKnicksHadKeptJeremyLin.html\">Lin</a> was getting. Lin might have done great if they had kept coach <a href=\"https://en.wikipedia.org/wiki/Mike_D%27Antoni\">Mike D'Antoni</a>, but they let him go too. Who knows. But nothing was known at the moment the Knicks said goodbye to Linsanity. And for all the Asian-Americans who live in the city, a cause of celebration disappeared. I think I may have loved the whole thing mostly because of the way it made them light up in civic pride. And I couldn't help but feel that the NBA was being a bit racist in their treatment of Lin. My suggestion to the mayoral candidate, Mr Yang, is that he campaign on giving <a href=\"https://en.wikipedia.org/wiki/James_L._Dolan\">James Dolan</a> the boot. Find a new owner for the Knicks. I also agree with commenters who said you can't decide to leave a team. Once a Knick fan, <a href=\"http://scripting.com/stories/2012/05/02/punchingGlassInALockerRoom.html\">sadly</a>, always a Knicks fan. ",
    "created": "Tue, 26 Jan 2021 14:16:37 GMT",
    "type": "outline",
    "image": "http://static.scripting.com/larryKing/images/2013/12/07/knicksTeam.gif",
    "flInCalendar": true
}