{
    "text": "You won! Now be a mensch..",
    "created": "Thu, 15 Jun 2023 13:23:01 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "We ought to change the rules for wealth to something like this. When you achieve a certain amount of wealth, you are declared a winner. A champion. There's a ceremony where you get a medal and a special kind of credit card that allows you entry to the VIP room wherever you go. In that room you have free drinks, the most comfortable chairs, fantastic snacks, for you and a guest. Everywhere you go people are required to salute you. All the benefits. You eat the best food, sit in first class, and you live in a very nice house or apartment where all your neighbors are also champs. ",
            "created": "Thu, 15 Jun 2023 13:23:06 GMT",
            "image": "http://scripting.com/images/2022/12/01/santa.png",
            "flInCalendar": true
        },
        {
            "text": "All that, sounds great right, but what do you give up? You can't make any more money. That's it. Your earning days are over. You won. Now find something else to do. You can't have more than one house, one car -- no private jets, you can't own sports teams or CNN. You have to live like a human being, not consume more than double what a non-champ consumes. ",
            "created": "Thu, 15 Jun 2023 13:25:24 GMT",
            "flInCalendar": true
        },
        {
            "text": "If this sounds like socialism or communism, deal with it. Because when you own 12 homes and fly around in your private jet, and consume hundreds of times more than you can possibly use, you're putting the continued existence, of all of us, in jeopardy. ",
            "created": "Thu, 15 Jun 2023 13:23:20 GMT",
            "flInCalendar": true
        },
        {
            "text": "PS: You get free guitar lessons too, and a nice guitar. :guitar:",
            "created": "Thu, 15 Jun 2023 13:28:04 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}