{
    "created": "2021-12-06T05:00:00.000Z",
    "flInCalendar": true,
    "name": "06",
    "path": "2021/12/06",
    "text": "December 06",
    "type": "calendarDay",
    "subs": [
        {
            "text": "My <a href=\"https://twitter.com/davewiner/status/1467942360608870418\">one-tweet manifesto</a> for users of note-taking outliners. \"There should be a standard format for notes apps so that switching is something you could do as often as you like, so that you can always use the best tool for the job.\"",
            "created": "Mon, 06 Dec 2021 19:39:38 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/03/31/mcCartneyAbbeyRoad.png",
            "urltweet": "https://twitter.com/davewiner/status/1467942360608870418",
            "flInCalendar": true
        },
        {
            "text": "Outliners should support \"OPML\", then users will be able to switch between products without having to convert their work. OPML is the best candidate for interop between outliners, and we are <i>not</i> a long way from that. It's a mature format, widely deployed. it's something I think the users are going to have to ask for because the developers are either too busy, or are not on board with the idea of people being able to use their work independently of the tools they use. I'm not looking to profit here, any more than I profited from RSS or podcasting. I want the users be empowered, because we need better-organized thinkers more than anything. I'm here to help. ",
            "created": "Mon, 06 Dec 2021 17:06:10 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "What got me going on this was a <a href=\"https://twitter.com/pierce/status/1467874084608520195\">tweet</a> from the editor of Protocol, about the pain in switching from different outliners, and a <a href=\"https://twitter.com/pierce/status/1467876578814271489\">subsequent tweet</a> in the thread where he said the answer was a <a href=\"http://scripting.com/images/2021/12/06/longway.png\">long way off</a>. Emphatically it is not a long way off. This isn't that new. We were doing outliners 40 years ago. These problems have been solved. Let's work together, users and developers. ",
            "created": "Mon, 06 Dec 2021 17:12:22 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Herfe ",
            "created": "Mon, 06 Dec 2021 19:39:33 GMT",
            "flInCalendar": true
        },
        {
            "text": "In journalism there's conventional wisdom and there's what everyone knows. Sometimes they are at odds. When that happens, they report the conventional wisdom. It's <a href=\"https://www.quora.com/What-does-the-phrase-Nobody-ever-got-fired-for-choosing-IBM-mean\">like</a> \"Nobody gets fired for buying IBM.\"",
            "created": "Mon, 06 Dec 2021 18:13:26 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Peloton, 25 rides in",
            "created": "Mon, 06 Dec 2021 21:14:12 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "25 rides.",
                    "created": "Mon, 06 Dec 2021 21:14:18 GMT",
                    "inlineImage": "http://scripting.com/images/2021/12/06/25rudes.png",
                    "flInCalendar": true
                },
                {
                    "text": "I got an email from Peloton yesterday congratulating me on 25 rides. ",
                    "created": "Mon, 06 Dec 2021 21:24:45 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I've got a groove all righty. Here's how it works. I have my teacher, Emma Lovewell. Such a sweetie, she's like a neice to me, so nerdy and she has a lot of things right. I don't have to do this ride, I <i>get</i> to do it, she says. I am becoming something, let's find out what it is, she continues. Anyway, I found this 20-minute ride of hers that I really like, so I just keep doing that ride very day, over and over. I really like the tunes, there's a Tom Petty song (American Girl), and Fleetwood Mac, Genesis, even a Beatles song. I know them in order. I pay attention to her instructions, somewhat, but I do what I want to do. I take a break after every song, even though she wants me to keep going. As long as the music is off I don't have to pedal. I take a sip of water and let my legs recover a little. And then I'm back at it. I sing along. Close my eyes a lot. And before you know it, the ride is over. And I always feel great after the ride. Like Superman. Mind is clear, body strong, I'm directed, going somewhere. ",
                    "created": "Mon, 06 Dec 2021 21:20:37 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Now people say it's hard to get the shoes in and out, but I find it really easy to get them in, a little more difficult to get them out. It's like snapping ski boots into the bindings. I have the official Peloton shoes. I can't figure out how the top strap works so I leave them undone. ",
                    "created": "Mon, 06 Dec 2021 21:18:40 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Another thing -- I can't ride standing up. I don't feel balanced. But I think I will get it. ",
                    "created": "Mon, 06 Dec 2021 21:19:22 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "This works. I am getting a daily exertion, no matter the weather, day or night, and am getting stronger. I only wish I had started this regimen 20 years ago, imagine how my body would have responded, but it is what it is. I'm doing great for an old dude! :boom:",
                    "created": "Mon, 06 Dec 2021 21:19:44 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}