{
    "created": "2021-12-12T05:00:00.000Z",
    "flInCalendar": true,
    "name": "12",
    "path": "2021/12/12",
    "text": "December 12",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Already <a href=\"http://docserver.scripting.com/drummer/search.opml\">Daytona</a> has improved my writing. I think I could be writing a book now, a memoir, a <a href=\"https://www.amazon.com/Zen-Art-Motorcycle-Maintenance-Inquiry/dp/0060589469\">Zen and the Art of Motorcycle Maintenence</a>, my <a href=\"http://daytona.scripting.com/?q=island%20book&collection=scriptingnews\">Island Book</a>. A new dimension has opened up. Until now writing has been more or less Of The Moment. As Google has punished me for not supporting their various <a href=\"http://this.how/googleAndHttp/\">hijacks</a> of the web, the writing has become more ephemeral, kind of like Twitter -- once written -- hard to find again. With Daytona all of a sudden my <a href=\"https://en.wikipedia.org/wiki/Memex\">memex</a> has memory. My writing is upgraded a billion percent. ",
            "created": "Sun, 12 Dec 2021 15:21:31 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/12/12/zen.png",
            "flInCalendar": true
        },
        {
            "text": "An Island Book is a book that after it's published you have to go live on an island. ",
            "created": "Sun, 12 Dec 2021 15:27:10 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Here's an idea. I have a drone that communicates with my peloton via satellite, so it's not constrained by range. I can send the drone anywhere I like, but I have to ride there on my peloton. Obviously what I see on my screen is what the drone sees. I think it would quickly become addictive, not that peloton isn't already addictive. PS: I can fly. :rocket:",
            "created": "Sun, 12 Dec 2021 17:22:09 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I use <a href=\"https://en.wikipedia.org/wiki/Debugger\">debuggers</a> as an integral part of the coding process. I almost never run anything complex without stepping through the code in the debugger, to be sure it's running the way I intended it to. Having the data it's working on right there, easily browsable, gives me ideas for new functionality. Imagine being a surgeon who can get <a href=\"https://en.wikipedia.org/wiki/Fantastic_Voyage\">inside</a> the living body, turn off all the systems to examine things, then click a button and have the organism reanimate. And then imagine having such a tool available to you and not using it. There are programmers who don't use debuggers. They're working at a lower level imho. Like flying without instruments. ",
            "created": "Sun, 12 Dec 2021 15:18:00 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The first environment I used that had a real debugger was <a href=\"https://en.wikipedia.org/wiki/THINK_C\">THINK C</a>. Before that it was <a href=\"https://en.wikipedia.org/wiki/Printf_format_string\">printf</a>, <a href=\"https://borlandpascal.fandom.com/wiki/WRITE_and_WRITELN\">writeln</a>, etc.",
            "created": "Mon, 13 Dec 2021 03:38:52 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "In a <a href=\"http://daytona.scripting.com/?q=bootstrap&collection=scriptingnews\">bootstrap</a> you do things by hand, a lot, until you can see how you can have the machine do it for you, with you losing the minimum amount of power and gain the most ease. That's why you have to develop things in layers. ",
            "created": "Sun, 12 Dec 2021 14:56:17 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/12/12/natural.png",
            "flInCalendar": true
        },
        {
            "text": "So I have the last 4.5 years of Scripting News in the Daytona index, now I desperately want all the rest of the years, but that's not going to be so easy. In 2017 I had a really good idea of how I wanted the data stored, but until then, I was playing around a lot. A lot of it is in OPML, somewhere, probably. But a lot more of it is in HTML. But it's pretty incredible to have 4.5 years. Makes all that writing so much more useful.",
            "created": "Sun, 12 Dec 2021 14:57:19 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I noticed people are talking about <a href=\"http://docserver.scripting.com/drummer/search.opml\">Daytona</a> on their blogs, and there's a general positive view of it, and an expectation that I will continue to improve it. That's all good. But a lot of that depends on how much I get back from users. Ideas that are interesting, not necessarily obvious, and aren't expressed in terms of panic. I want to move this forward, with friends, with people who are as excited as I am and are ready to roll up their sleeves and participate. But if you wait for me to do it, then I'll just add the things I want. I'm hoping that \"Drummer\" users take an interest. And not just \"do this for me now\" -- help out. I can't read minds, and I don't really like working for free. I don't want dollars, I want the product of intelligent, kind people who help. My friend <a href=\"http://daytona.scripting.com/?q=nakedjen&collection=scriptingnews\">NakedJen</a> has the perfect motto for this, \"You can fake caring, but you can't fake showing up.\"",
            "created": "Sun, 12 Dec 2021 17:22:48 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Edward Hopper",
            "created": "Mon, 13 Dec 2021 00:12:12 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2021/12/12/hopperPeopleInTheSun.png",
            "subs": [
                {
                    "text": "<a href=\"https://www.edwardhopper.net/people-in-the-sun.jsp\">People In The Sun</a>, 1960.",
                    "created": "Mon, 13 Dec 2021 00:12:16 GMT",
                    "inlineImage": "http://scripting.com/images/2021/12/12/peopleInTheSun.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}