{
    "text": "The NYT and Hillary's Emails",
    "created": "Mon, 14 Dec 2020 15:33:07 GMT",
    "type": "outline",
    "metaImage": "http://scripting.com/images/2020/05/11/butHerEmails.png",
    "subs": [
        {
            "text": "A friend writes: \"Sorry if this sounds stupid.  Why does the blame lie with NYT?\" ",
            "created": "Mon, 14 Dec 2020 15:33:27 GMT",
            "flInCalendar": true
        },
        {
            "text": "I wrote this back.",
            "created": "Mon, 14 Dec 2020 15:33:51 GMT",
            "subs": [
                {
                    "text": "Good question.",
                    "created": "Mon, 14 Dec 2020 15:38:56 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "They were fed the [%search: Hillary's Emails%] story by a conservative dirty trickster, and they went with it, made it a campaign, based on either cynicism or ignorance.",
                    "created": "Mon, 14 Dec 2020 15:33:57 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It hinges on whether the people at the NYT understood what email servers are, and have some basic idea of how they work and what they do. If they didn't know then it was ignorance. If they did know, then it was cynicism that basically their readers would have no idea and would trust them when they said <i>this is a big story</i> by repeatedly putting it on page one.",
                    "created": "Mon, 14 Dec 2020 15:34:11 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Yet the things they said amounted to WTF -- how is this relevant. They never explained. And of course we now understand that there was nothing there.",
                    "created": "Mon, 14 Dec 2020 15:34:32 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I don't doubt that Hillary Clinton would have been president for the last four years if they had done their job honestly and competently. ",
                    "created": "Mon, 14 Dec 2020 15:34:39 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The NYT's impact was at least that of Facebook. So when they blame Facebook they should have just as many column-inches about how the NYT fucked us up the ass in 2016. ",
                    "created": "Mon, 14 Dec 2020 15:34:58 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}