{
    "text": "The likely sequence of events in Afghanistan, from reading a bunch of stuff and watching Maddow last night, which had a lot of info the other news reports didn't. Trump did a deal with the Taliban in <a href=\"https://en.wikipedia.org/wiki/Afghan_peace_process#:~:text=The%20second%20peace%20treaty%20was,the%20terms%20of%20the%20agreement.\">Feb 2020</a>. The Afghan government was not included in the deal. The Taliban agreed to stop shooting at American troops, and the US agreed to withdraw completely by May 2021. There were probably private deals that will enrich Trump and his buddies. Remember our government was an unabashed <a href=\"https://en.wikipedia.org/wiki/Kleptocracy#:~:text=Kleptocracy%20(from%20Greek%20%CE%BA%CE%BB%CE%AD%CF%80%CF%84%CE%B7%CF%82%20kl%C3%A9pt%C4%93s,misappropriating%20government%20funds%20at%20the\">kleptocracy</a> in 2020. Once the deal was in place, it set in motion something that should have been obvious to the US negotiators, and for that matter, American journalists -- the local governments and probably the national government made individual deals with the Taliban. In exchange for money and protection, they switched sides. I probably would have done it too. So there was no resistance when the US withdrew. The Taliban just marched in, having won a political and economic victory if not a military one. No one gave the order for the American-supplied troops to fight. They took off their uniforms and went home. We'll have to see what happens to these people once we're fully gone from Afghanistan. A lot of Afghans didn't see this coming, that's why there was so little preparation for an immediate evacuation. Hard to blame this on the US. People wanted to stay and see what would happen, maybe the US-supplied army and the US-puppet regime would prevail? As it turns out, a bad bet.",
    "created": "Tue, 17 Aug 2021 11:39:37 GMT",
    "type": "outline",
    "image": "http://scripting.com/images/2020/10/09/stupidman.png",
    "flInCalendar": true
}