{
    "text": "Sex in the workplace",
    "created": "Wed, 03 Mar 2021 14:48:31 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I was founder and CEO of a small Silicon Valley company in the 1980s. A few dozen people at its peak. I had invested everything in the company, and it was touch and go all the way. If I lost, I would have been totally broke, financially and personally, so I didn't have time to play around. ",
            "created": "Wed, 03 Mar 2021 15:01:59 GMT",
            "flInCalendar": true
        },
        {
            "text": "I also had a girlfriend, a long distance relationship, and remember being frustrated that her friends told her no man could be faithful that long, but I was. Maybe I was a fool because I got blamed for it anyway. But that's not the story. ",
            "created": "Wed, 03 Mar 2021 21:36:47 GMT",
            "flInCalendar": true
        },
        {
            "text": "There were plenty of women in the company, including execs. I wanted the best people I could get for the job, and I was raised by a <a href=\"http://scripting.com/2018/02/26/024939.html\">woman</a> who was accomplished and smart, so I believed in the idea of gender balance and practiced it. ",
            "created": "Wed, 03 Mar 2021 14:55:59 GMT",
            "flInCalendar": true
        },
        {
            "text": "I also was propositioned a fair number of times by women who worked for me. Totally inappropriate. I brushed them off, but occasionally had to sit down and say this was something you could get fired for, if it didn't stop. ",
            "created": "Wed, 03 Mar 2021 14:56:17 GMT",
            "flInCalendar": true
        },
        {
            "text": "There was so much sex going on in the company. And there was also gossip about who I was sleeping with (CEOs get gossiped about, no surprise). The whole thing was depressing. Our company was often on the brink of going under, and to some it was just a job, and maybe they felt it was hopeless, but I couldn't afford to. And there was no way to stop the gossip without making the issues even bigger. ",
            "created": "Wed, 03 Mar 2021 14:56:41 GMT",
            "flInCalendar": true
        },
        {
            "text": "Eventually we had a hit product, and noticed that when the company was growing the gossip became less important. ",
            "created": "Wed, 03 Mar 2021 14:59:32 GMT",
            "flInCalendar": true
        },
        {
            "text": "The point of the story is that sex in the workplace is complicated. It isn't just about men with power using it to take advantage of lower level employees. I think a lot of people must know this, and are overlooking, deliberately or not, when discussing this topic. ",
            "created": "Wed, 03 Mar 2021 14:56:59 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}