{
    "text": "Berkman weblogs, followup",
    "created": "Wed, 15 Aug 2018 14:10:04 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "A followup to my post <a href=\"http://scripting.com/2018/08/10.html#a121444\">last Friday</a>. I had just heard about something happening with the blogs we hosted in <a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+berkman+weblogs&t=hi&ia=web\">2003</a> and beyond at <a href=\"http://blogs.harvard.edu/\">blogs.harvard.edu</a>. I'm still not clear on what happened. I would like to know, and to see if there's anything we can do to keep the archived content available at the same address it has been at all along. ",
            "created": "Wed, 15 Aug 2018 14:10:09 GMT"
        },
        {
            "text": "I got a <a href=\"https://twitter.com/zittrain/status/1027936755796860928\">response</a> to one of my tweets from Jonathan Zittrain, a former colleague at <a href=\"http://cyber.harvard.edu/\">Berkman</a>, who is still there. He pointed me to the <a href=\"https://blogs.harvard.edu/blog/2018/07/13/upcoming-changes/\">FAQ</a> they posted. Not much information there about what was about to happen, or has happened since. At the very least we should know what remains, what is gone, and what is the plan for the future. And perhaps we, outside of Harvard, can help in some way. We have some experience with these issues. ",
            "created": "Wed, 15 Aug 2018 14:11:21 GMT"
        },
        {
            "text": "I think a great university like <a href=\"https://en.wikipedia.org/wiki/Harvard_University\">Harvard</a> that places a high value on learning, history, tradition, and played a big role in fostering the development of social media, both as the home of <a href=\"https://en.wikipedia.org/wiki/Mark_Zuckerberg#College_years\">Mark Zuckerberg</a> in the early Facebook days, and <i>at the very same time</i> to the nascent blogging and podcasting community, should take an active interest not only in preserving the record, but in helping to set standards for how the web can continue long-term, even in the age of silos and corporate ownership. We, collectively, have a responsibility imho to do this well. ",
            "created": "Wed, 15 Aug 2018 14:12:34 GMT"
        },
        {
            "text": "PS: Imho this is a project that should interest <a href=\"https://library.harvard.edu/\">librarians</a> at Harvard and elsewhere. There are a lot of great libraries there.",
            "created": "Wed, 15 Aug 2018 14:28:27 GMT"
        }
    ]
}