{
    "text": "100 pointless editorials",
    "created": "Wed, 15 Aug 2018 15:09:02 GMT",
    "type": "outline",
    "description": "Hopefully on Friday morning, in the non-existent afterglow of the pointless editorial demonstration, they will start looking outside their cocoon for answers. ",
    "subs": [
        {
            "text": "I don't see what good <a href=\"http://www.gctelegram.com/opinion/20180814/some-newspapers-are-buying-into-ill-conceived-protest\">100 editorials</a> tomorrow will do. The problem journalism has is that it is at war with a formidable adversary, the head of the US government. It's time to consult with people who have studied war. I suspect they will say that 100 editorials wouldn't have had much impact on Japan or Germany at the beginning of World War II. We never would have thought to respond to the 9/11 attacks with 100 stinging editorials. When attacked in an outright and clear act of war, aim at the power of the enemy, analyze and develop our own power, and fight back, to win.",
            "created": "Wed, 15 Aug 2018 15:13:06 GMT",
            "image": "http://scripting.com/images/2018/08/15/paratrooper.png"
        },
        {
            "text": "In this case, the enemy is very powerful. His greatest power is that he didn't demobilize his supporters when he took office as every other presidential incumbent has. It's smart. I pleaded with Obama to do exactly that when he took office in 2009. The web was ready to take Obama's message of intellectual and just government all around the world. Instead he stuck to norms. And ran head-on into a Republican blockade. Nothing could get him out of the Rose Garden and back on the campaign trail. ",
            "created": "Wed, 15 Aug 2018 15:15:17 GMT"
        },
        {
            "text": "Let this be a lesson from now on: Presidents must stay on the campaign trail at all times. The power of the presidency is to rally the people, and when done best it's a unifying campaign, not a divisive one, like the one Trump persists.",
            "created": "Wed, 15 Aug 2018 15:16:25 GMT"
        },
        {
            "text": "And that, imho is exactly what journalism must do. ",
            "created": "Wed, 15 Aug 2018 15:35:27 GMT"
        },
        {
            "text": "Journalism has to break the biggest norm it has. Break the wall that separates it from their supposed audience, which is <i>rapidly</i> dissipating. They've lost the ones that follow Trump. The rest of us are losing patience. Hopefully on Friday morning, in the non-existent afterglow of the pointless editorial demonstration, they will start looking outside their cocoon for answers. ",
            "created": "Wed, 15 Aug 2018 15:15:59 GMT"
        }
    ]
}