{
    "text": "Smells as a time machine",
    "created": "Wed, 17 Jun 2020 13:13:09 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Smells are an incredible thing, a time machine, when you get a whiff of something from long ago, it reaches deep into your emotional memory and you experience the feelings from long ago, most deeply felt are the feelings of childhood and the people who raised me.",
            "created": "Wed, 17 Jun 2020 13:13:14 GMT"
        },
        {
            "text": "For example, when I moved to NYC from California in 2010, when I went for a walk in the morning in Central Park, I'd get the smell of the woods and the morning dew, mixed with salt air of the ocean. It took me back to my <a href=\"https://www.google.com/maps/@40.5735409,-73.8634283,3a,75y,52.24h,89.64t/data=!3m7!1e1!3m5!1sH90kfd-HjSqxwYfJBxsdGQ!2e0!6s%2F%2Fgeo3.ggpht.com%2Fcbk%3Fpanoid%3DH90kfd-HjSqxwYfJBxsdGQ%26output%3Dthumbnail%26cb_client%3Dmaps_sv.tactile.gps%26thumb%3D2%26w%3D203%26h%3D100%26yaw%3D44.51749%26pitch%3D0%26thumbfov%3D100!7i16384!8i8192\">grandmother's house</a> in Rockaway. She's long gone, the house isn't ours anymore, but the memory sure is.",
            "created": "Wed, 17 Jun 2020 13:13:58 GMT"
        },
        {
            "text": "Morning smells here in the Catskills, where I live now, take me back to <a href=\"https://www.google.com/maps/place/Copake,+NY+12516/@42.1092826,-73.5762083,14z/data=!3m1!4b1!4m5!3m4!1s0x89dd867b736b3061:0x1ec908b2690186d1!8m2!3d42.1034549!4d-73.5499249\">summer camp</a>. The rituals. <a href=\"https://en.wikipedia.org/wiki/Taps\">Taps</a> at bedtime, <a href=\"https://en.wikipedia.org/wiki/Reveille\">reveille</a> to wake us in the morning. The food they served that my mother never did. Butter on bread. What a revelation. We didn't eat butter at home. ",
            "created": "Wed, 17 Jun 2020 13:14:53 GMT"
        },
        {
            "text": "Playing softball every day. Swimming. Canoeing. And most deep gratitude for the weekly care package from mom with home baked cookies and stories from home. I'm sure she put as much care into the packages as I did in savoring them. Until I experienced the summer smell of camp, here and now, at age 65, mom gone, I never recalled those packages. If I had I would have never doubted our bond. ",
            "created": "Wed, 17 Jun 2020 13:17:21 GMT"
        }
    ]
}