{
    "text": "Jew Hate is all around us",
    "created": "Sat, 19 Nov 2022 12:26:18 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "When I was growing up, and still to this day, the word \"Jew\" was, to me, dirty. I didn't like to hear it. It smelled like rot and death and sadness. I had this idea before I was conscious, before I was in school. Yet I knew all along that I was a Jew. Where did I get it from? I guess I grew up in it. It must've come from my family and neighbors and schoolmates, even teachers, and on TV, in music and radio. Reading. Who knows. But it was there. It still is.",
            "created": "Sat, 19 Nov 2022 12:26:23 GMT",
            "flInCalendar": true
        },
        {
            "text": "So that's why I don't use the word \"antisemitism\" any more. It sounds so technical, almost benign. Instead let's call it what it is -- Jew Hate.",
            "flInCalendar": true
        },
        {
            "text": "When Jew Haters practice their hate, they're moving the needle towrd Holocaust, which even though it's a very strong word isn't strong enough. It's genocide. The killing of an entire ethnic group, systematically, with the goal of eliminating all of them. ",
            "created": "Sat, 19 Nov 2022 12:27:40 GMT",
            "flInCalendar": true
        },
        {
            "text": "Now I don't think anything we do can eliminate or even reduce Jew Hate. But letting it out of its box and into the public conversation as it has been lately, amazingly coming from black men, that despite what Jon Stewart says, that is not okay. It's not liberal to allow Jew Hate to be laughed at on SNL. Or to allow an NBA star to shout it from his million-follower Twitter account, or for a pop singer to say he wants to kill Jews, again on a million-follower Twitter account. When you do that, you invite all the other Jew Hate to come out and play. And once it's out, that means Jews are going to die. Once out, it might not be possible to stop it. Something to think about Jon Stewart when they take you and your family away for your final solution.",
            "created": "Sat, 19 Nov 2022 12:28:40 GMT",
            "flInCalendar": true
        },
        {
            "text": "I'm old and tired and fed up with accepting that it's too dangerous to speak up about this. If no one else will, I guess, I will. If no NBA star will reassure me that the NBA is not filled with Jew Haters, I'm going to assume it is. I will never watch an NBA game without thinking that every black man on the floor hates me because of my ancestry and blames me for their misery and would like to see me and my kin killed in a horrible way. I don't wish that for them. But I also can't enjoy a sport where the participants feel that way about me, and they don't even know me. ",
            "flInCalendar": true
        },
        {
            "text": "If you think you're liberal and a fair-minded person and just another Good American, it 's time to say something. Otherwise you're going to have to explain to your grandchildren what you did as it was happening again, only this time in the USA.",
            "created": "Sat, 19 Nov 2022 12:29:45 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}