{
    "text": "Embrace the creativity of others",
    "created": "Sun, 14 Sep 2025 00:18:19 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I wrote a <a href=\"http://scripting.com/davenet/1996/10/24/QueSeraSera.html\">piece</a> in October 1996 after attending a conference of the tech industry that as it turns out was in its final stages. This was one of the last times it met. I was coming from the web, and wanted to see if anyone else was ready to change how we work with each other. ",
            "created": "Sun, 14 Sep 2025 00:33:58 GMT",
            "subs": [
                {
                    "text": "Here's an invitation to truly embrace the creativity of others. Instead of beating your breast about how great you are, try saying how great someone else is. Look for win-wins, make that your new religion. Establish a policy that nothing will be announced unless it can be shown that someone else will win because of what you're doing. How much happier we would be if instead of crippling each other with fear, we competed to empower each others' creativity.",
                    "created": "Sun, 14 Sep 2025 00:15:58 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "I've been following that ideal ever since, people seem to misinterpret it for subservience or weakness, or a pretense to cover another kind of greed, when it's really sincere, and all about strengthy. Sometimes people say yes, and when that happens magical things happen. I swear to god. I've been there. I've done it, it's not something you can do on your own, by definition. It's rare when people actually help each other and thereby create something. It's why the Beatles are such a great story. Someday I still hope to be part of a group like that. Right now, it's still <i>totally</i> everyone for themself.  That is breaking. Read the news. But I believe if we did start really collaborating and not just talking about it, things would change very very quickly. Things would happen that can't happen until we work together. ",
            "created": "Sun, 14 Sep 2025 00:19:51 GMT",
            "flInCalendar": true
        },
        {
            "text": "I had it figured out in 1996, but still haven't figured out how to make it happen, and time <i>is</i> running out.",
            "created": "Sun, 14 Sep 2025 00:30:07 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}