{
    "text": "Apple zealots suck",
    "created": "Wed, 09 Dec 2020 18:19:25 GMT",
    "type": "outline",
    "description": "Headphones and iPhones aren't sex toys or drugs. They're products. They're good products, but they also suck like all products do. ",
    "metaImage": "http://scripting.com/images/2020/12/09/jobs.png",
    "subs": [
        {
            "text": "I have a very pragmatic problem with the religious zeal people have for Apple products. I can't tell when I should take their advice if they always gush about everything. ",
            "created": "Wed, 09 Dec 2020 18:19:35 GMT",
            "flInCalendar": true
        },
        {
            "text": "Two recent examples. ",
            "created": "Wed, 09 Dec 2020 18:19:48 GMT",
            "flNumberedSubs": "true",
            "subs": [
                {
                    "text": "A friend, a VC, told me that the XS Max was totally worth the $1500. So I got one. No way it was worth that. I replaced it this year with a new SE for $350, and I love it, actually more than the XS Max because it's only $350. I'm cheap that way.",
                    "created": "Wed, 09 Dec 2020 18:19:46 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Another friend told me last month I had to get the new earpods. $250. A little steep, but the way he was talking, it sounded like Moses had come down from the mountain with the secret to human happiness, and I could get it for only $250. So I did it, on an impulse. Well, they're nice enough, but there's absolutely nothing special about them. I like my <a href=\"https://www.amazon.com/Sony-WH-1000XM4-Canceling-Headphones-phone-call/dp/B0863TXGM3/ref=sr_1_1_sspa?dchild=1&keywords=WH-1000XM4+Wireless+Noise-Canceling+Headphones&qid=1607538440&sr=8-1-spons&psc=1&spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUEyVEtROTdWUkwwVVExJmVuY3J5cHRlZElkPUExMDEwMDc3MjJONDJPRklMN0dBMSZlbmNyeXB0ZWRBZElkPUEwODA4MjY1MjVEWVdBQ1VSVDBXNCZ3aWRnZXROYW1lPXNwX2F0ZiZhY3Rpb249Y2xpY2tSZWRpcmVjdCZkb05vdExvZ0NsaWNrPXRydWU=\">Sony overear headphones</a> better (almost exactly the same price, btw). I buy headphones on a whim, so I know what's good. These are ok, but didn't not deserve the review they got. ",
                    "created": "Wed, 09 Dec 2020 18:19:47 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "So all this ends up backfiring for people who want to help Apple sell product, which btw, I'm happy about since I bought Apple shares in 1997, and have watched them make me rich,. But as a user, I am offended by the way people go on and on about such bullshit. Headphones and iPhones aren't sex toys or drugs. They're products. They're good products, but they also suck like all products do. ",
            "created": "Wed, 09 Dec 2020 18:21:21 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}