{
    "text": "Plot for a political sci fi comedy",
    "created": "Wed, 27 Aug 2025 14:39:16 GMT",
    "type": "outline",
    "description": "It's the future, and the great power of the X galaxy, on the planet Y of star Z, has accidentally elected a despotic prime minister who also happens to be an excellent standup comic.",
    "metaImage": "http://scripting.com/images/2025/08/27/comicPrimeMinister.png",
    "subs": [
        {
            "text": "It's the future, and the great power of the X galaxy, on the planet Y of star Z, has accidentally elected a despotic prime minister who also happens to be an excellent standup comic. Kind of like Robin Williams, from the planet you come from, but he's a centipede and only breathes what you would think of as Chef Boyardee lasagna, but it's not really that, it's different. ",
            "created": "Wed, 27 Aug 2025 14:53:25 GMT",
            "image": "https://imgs.scripting.com/2025/08/27/chefBoyardeeLasagna.png",
            "flInCalendar": true
        },
        {
            "text": "Anyway, he's old, 757 centuries give or take, and they're expecting him to die soon, and they can elect someone boring so they can forget about politics. Everyone is looking forward to the relaxation. ",
            "created": "Wed, 27 Aug 2025 14:58:32 GMT",
            "flInCalendar": true
        },
        {
            "text": "And then one day he does die, and everyone breathes a huge sigh of relief, until later that night, on the 10-screen equivalent of what you would think of as TV, hilarity ensues when the \"dead\" PM showed up, looking fit, young and dashing, doing slapstick and talking about how he's going to make a mess of something. ",
            "created": "Wed, 27 Aug 2025 14:59:09 GMT",
            "flInCalendar": true
        },
        {
            "text": "Everyone was furious and then puzzled, we thought he was dead -- until the rumor started going around that the scientists had invented a sort of \"artificial\" thing that could perfectly emulate anyone or anything, including a Lasagna-breathing centipede comic despot from planet Y of star Z in the X galaxy. Everyone was pissed, but mostly agreed the PM was still pretty funny.",
            "created": "Wed, 27 Aug 2025 14:59:47 GMT",
            "image": "https://imgs.scripting.com/2025/08/27/heLovesLasagna.png",
            "flInCalendar": true
        },
        {
            "text": "End of pilot. ",
            "created": "Wed, 27 Aug 2025 14:54:38 GMT",
            "flInCalendar": true
        },
        {
            "text": "Movie poster demo.",
            "created": "Wed, 27 Aug 2025 15:01:43 GMT",
            "inlineImage": "https://imgs.scripting.com/2025/08/27/heLovesLasagna.png",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}