{
    "text": "Defaulting, explained simply",
    "created": "Sat, 14 Jan 2023 14:49:59 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Anyone who can understand the rules of baseball or football, who can play poker or Monopoly, can understand the rules of defaulting.",
            "created": "Sat, 14 Jan 2023 15:01:27 GMT",
            "flInCalendar": true
        },
        {
            "text": "If the US were to default the same thing would happen to the US that happens to a person if they fail to make a payment on a loan. ",
            "created": "Sat, 14 Jan 2023 14:56:27 GMT",
            "flNumberedSubs": "true",
            "subs": [
                {
                    "text": "Foreclosure, the lender seizes assets to cover the default.  ",
                    "created": "Sat, 14 Jan 2023 14:58:39 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Your credit rating goes down and cost of borrowing goes up. ",
                    "created": "Sat, 14 Jan 2023 14:58:57 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Today, before default, the US defines what money is. If we create a dollar that's worth a dollar. No other country has this power.",
            "created": "Sat, 14 Jan 2023 14:51:54 GMT",
            "flInCalendar": true
        },
        {
            "text": "The world lets us do this for them because a dollar is considered the safest way to store value. That's why the US dollar is the world's dominant <a href=\"https://en.wikipedia.org/wiki/Reserve_currency#United_States_dollar\">reserve currency. </a>",
            "created": "Sat, 14 Jan 2023 14:51:53 GMT",
            "flInCalendar": true
        },
        {
            "text": "However if we default, there goes the safety. It's gone, and that kind of trust, built over <a href=\"https://www.smithsonianmag.com/sponsored/alexander-hamilton-debt-national-bank-two-parties-1789-american-history-great-courses-plus-180962954/\">hundreds of years</a>, once lost will never come back.",
            "created": "Sat, 14 Jan 2023 14:51:57 GMT",
            "flInCalendar": true
        },
        {
            "text": "Then we really will be as poor as the oligarchs want us to think we are.",
            "created": "Sat, 14 Jan 2023 14:52:32 GMT",
            "flInCalendar": true
        },
        {
            "text": "So, why are the oligarchs who own all our sources of news, willing to let a default actually happen? I think it's a good chance it's due to inbreeding, narcissism, stupidity, selfishness and resentment. They don't believe they will suffer personally if the US turns into an economic basket case. Maybe they won't. For sure, that's <i>all</i> they care about. ",
            "created": "Sat, 14 Jan 2023 14:52:45 GMT",
            "flInCalendar": true
        },
        {
            "text": "I keep waiting for a news article that doesn’t gloss over the real impact of defaulting. If news were run like journalism this would be the horserace of the millenium. A story with a billion angles. We'd all tune in every night to hear how bad it'll be. But they clearly aren't interested in that. They're interested in keeping their jobs. That probably also explains why we're not responding to the climate crisis or the pandemic. ",
            "created": "Sat, 14 Jan 2023 14:07:35 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}