{
    "text": "September 1",
    "created": "Wed, 01 Sep 2021 12:44:10 GMT",
    "type": "calendarDay",
    "name": "01",
    "subs": [
        {
            "text": "On Facebook, when you reply to a post you disagree with, your followers will then see it in their timeline. This puts people who follow you in an awkward position. I want to unfollow you because I don't want my timeline polluted with nonsense about how great the former president is (for example), and the only way I can do that is by unfollowing you. So your momentary feeling of righteousness has a hidden potential cost you should be aware of. 1. You help a cause you disagree with and 2. You alienate your friends.  ",
            "created": "Wed, 01 Sep 2021 20:12:05 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/12/20/shrek.png",
            "flInCalendar": true
        },
        {
            "text": "BTW, [[Drummer]] runs on Linux, in case that wasn't clear. And Windows and Mac. I use a Mac mostly, but I'd love to convert to Linux. Only one app is keeping me on the Mac, the OPML Editor, and only for its ability to manage my development work. But Drummer is getting pretty close to being able to do that. When it's fully up to speed I will be able to run everything in Linux, and believe me -- I will relax. I'm skating on thin ice on the Mac and know it. ",
            "created": "Wed, 01 Sep 2021 13:26:46 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"http://scripting.com/2021/08/31.html#a153800\">Yesterday</a> I put out a call for new \"Drummer\" testers, asking for people with blogging and/or scripting experience. I should have also asked for people who have used [[outliners]], such as LogSeq, Roam, Obsidian, Org-mode, my own MORE, ThinkTank and Ready, or others. [[Drummer]] is all about outlining, as I said yesterday -- unabashedly so. We used to be reserved about software centered on outlining, but no more. Send an email or Twitter DM if you're interested in being in the test group. ",
            "created": "Wed, 01 Sep 2021 12:53:09 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The press is full of <a href=\"https://www.memeorandum.com/210831/p138#a210831p138\">reports</a> that President Biden screwed up the pullout from Afghanistan. But none of the people saying he did it wrong say what he should have done instead. ",
            "created": "Wed, 01 Sep 2021 13:13:27 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The usual monthly ritual is complete. Archived the <a href=\"https://github.com/scripting/Scripting-News/blob/master/blog/opml/2021/08.opml\">August posts</a>, and started my outline with a fresh slate for September. Trying to imagine what wonders and atrocities await us! :boom:",
            "created": "Wed, 01 Sep 2021 12:44:11 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Tagging in Scripting News",
            "created": "Wed, 01 Sep 2021 13:30:38 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "My use of [[tagging]] has been going for a while now, and i'm still doing it, which in my experience is a total success for a categorization system. Even better, some of the tags are getting enough references to be useful, for example <a href=\"http://scripting.com/?tag=drummer\">Drummer</a>.",
                    "created": "Wed, 01 Sep 2021 13:30:47 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "What seems to come next is to hook all of this up with a Wiki, so the landing page for a tag can have more than just links to articles. In other words all of this amounted to integrating an outliner with a Wiki, which was one of my goals after hanging out with <a href=\"https://www.google.com/search?q=ward+cunningham+site%3Ascripting.com\">Ward Cunningham</a> for a couple of days <a href=\"http://scripting.com/2016/08/23/gettingBlogsAndWikisTogether.html\">a few years back</a>. ",
                    "created": "Wed, 01 Sep 2021 13:32:03 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Software development sometimes is like painting. You do something over and over iteratively, from a lot of angles, and arrive somewhere, but that itself is probably just on the road to what's next after that. ",
                    "created": "Wed, 01 Sep 2021 13:32:45 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}