{
    "text": "September 3",
    "created": "Fri, 03 Sep 2021 14:14:44 GMT",
    "type": "calendarDay",
    "name": "03",
    "subs": [
        {
            "text": "<a href=\"http://oldschool.scripting.com/ryantate/2021/09/03/133431.html?title=helloWorld\">Ryan Tate</a> is an old school Scripting News reader, and now is an old school Drummer blogger. ",
            "created": "Fri, 03 Sep 2021 18:29:10 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I wish Facebook would silence the spammy viral phishy poll messages that get thousands of shares, my friends fall for them, and they're certainly gathering all kinds of data that hurt people, they're easy to detect, it should be a big issue for journos, but for some reason it isn't.",
            "created": "Fri, 03 Sep 2021 16:22:06 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/09/01/mrFrog.png",
            "flInCalendar": true
        },
        {
            "text": "I saw a supposed expert on Wolf Blitzer's show on CNN last night saying there was nothing the Dems could do about Roe v Wade. This is what passes for expertise at CNN these days. People who look nice in a suit and learned how to speak in CNN style.",
            "created": "Fri, 03 Sep 2021 15:39:47 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Drummer user note: When you're creating something new in a chronologic structure, use the big + icon at the <a href=\"http://scripting.com/images/2021/09/03/plusIcon.png\">top of the icon bar</a>. Don't do it by hand. The software that cares about chronologic notes ignores nodes that were created by hand. The + icon puts special attributes on the nodes that matter. You could if you wanted to do it yourself. But why would you? I'm saying this 20 different ways, here on Scripting News and everywhere else I can think to because I want [[Drummer]] users to get this right. It's important. :rocket:",
            "created": "Fri, 03 Sep 2021 14:14:45 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I'm doing user support for the first time since [[Fargo]] days and am reminded of what sucks about it. In the groups I am part of, as a user,when I ask for help I have reproduced the problem on my machine several times. I have tried workarounds. I've thought about it. I don't immediately ask for help, because I know the other people are like me, doing it for love, it's not their job, they're helping because they like to help. For whatever reason the groups I assemble often don't do this. At the first sign of trouble they post something that's impossible to understand, and it's really clear they didn't try it again, or they would have spotted their mistake. Support is a dear resource. Use it when you need it, but be sure first that you do need it. ",
            "created": "Fri, 03 Sep 2021 14:58:48 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "We have to fight, at some point",
            "created": "Fri, 03 Sep 2021 17:23:20 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2021/09/03/rbg.png",
            "description": "The good guys have been scared of a fight, and the Repubs have been walking all over the Constitution.",
            "subs": [
                {
                    "text": "Last night I saw Amy Klobuchar interviewed on CNN and the reporter pressed her to say that <a href=\"https://www.theguardian.com/law/2021/jun/13/stephen-breyer-retire-supreme-court-alexandria-ocasio-cortez\">Breyer should resign</a> while there's a Dem president, was wondering why no one wishes <a href=\"https://en.wikipedia.org/wiki/Ruth_Bader_Ginsburg\">RBG</a> had resigned when Obama was president, but of course there was <a href=\"https://en.wikipedia.org/wiki/Merrick_Garland#Supreme_Court_nomination\">Merrick Garland</a>.",
                    "type": "tweet",
                    "created": "Fri Sep 03 17:21:35 +0000 2021",
                    "tweetId": "1433842623043805210",
                    "tweetUserName": "davewiner",
                    "flInCalendar": true
                },
                {
                    "text": "On the other hand, in hindsight, we should have had the fight over the Supreme Court when Garland was nominated and <a href=\"https://www.npr.org/2016/03/16/470664561/mcconnell-blocking-supreme-court-nomination-about-a-principle-not-a-person\">McConnell refused to confirm</a>. Obama could have taken that as an affirmation, and seated Garland. It would have been a better time to fight.",
                    "type": "tweet",
                    "created": "Fri Sep 03 17:21:35 +0000 2021",
                    "tweetId": "1433842624314679334",
                    "tweetUserName": "davewiner",
                    "flInCalendar": true
                },
                {
                    "text": "I said it at the time. If McConnell won't vote, then after a decent amount of time, Garland takes the seat. Set a new precedent, if the Senate abdicates its responsibility, we go forward without them.",
                    "type": "tweet",
                    "created": "Fri Sep 03 17:21:36 +0000 2021",
                    "tweetId": "1433842625451335716",
                    "tweetUserName": "davewiner",
                    "flInCalendar": true
                },
                {
                    "text": "The good guys have been scared of a fight, and the Repubs have been walking all over the Constitution. You can't be nice always, sometimes you have to hit back. We've been delaying and delaying. And btw, where are the indictments of Trump, <a href=\"https://en.wikipedia.org/wiki/Merrick_Garland#Attorney_General_(2021%E2%80%93present)\">Mr Attorney General</a>?",
                    "type": "tweet",
                    "created": "Fri Sep 03 17:22:58 +0000 2021",
                    "tweetId": "1433842969812119560",
                    "tweetUserName": "davewiner",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Roe v Wade, day 2",
            "created": "Fri, 03 Sep 2021 14:53:13 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "<a href=\"https://twitter.com/kairyssdal/status/1433803558290223104\">On Twitter Kai Ryssdal asks</a>: \"What happens now?  I mean, courts/procedure-wise.\"",
                    "created": "Fri, 03 Sep 2021 14:53:23 GMT",
                    "urltweet": "https://twitter.com/kairyssdal/status/1433803558290223104",
                    "flInCalendar": true
                },
                {
                    "text": "I am not a lawyer...",
                    "created": "Fri, 03 Sep 2021 14:54:40 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The Supreme Court declined to put a stay order on the law, so Texas can and will presumably enforce it.",
                    "created": "Fri, 03 Sep 2021 14:54:42 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "But the lawsuits can proceed, as if the SC did nothing.",
                    "created": "Fri, 03 Sep 2021 14:54:46 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Here's another question even more ominous imho.",
                    "created": "Fri, 03 Sep 2021 14:53:31 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Now that Texas found a way around the Constitution, what other rights can they infringe on this way?",
                    "created": "Fri, 03 Sep 2021 14:54:49 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Pick an amendment, it's easy to construct an analog.",
                    "created": "Fri, 03 Sep 2021 14:54:55 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Pass a law saying immigrants can't ride on public transportation. If one is caught doing it, you just have to document it and, you (or more likely your employer) can sue the bus driver, the bus company, the city, other passengers. ",
                    "created": "Fri, 03 Sep 2021 14:55:01 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}