{
    "text": "September 8",
    "created": "Wed, 08 Sep 2021 14:34:01 GMT",
    "type": "calendarDay",
    "name": "08",
    "subs": [
        {
            "text": "Options for creativity are in the <a href=\"https://en.wikipedia.org/wiki/Edge_case\">edge cases</a>. ",
            "created": "Wed, 08 Sep 2021 19:02:29 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "When you recommend a podcast please say a little about what it is and why you recommended it. Typically to find out what a podcast actually is takes hours of listening. and usually they're disappointing or too boring, or have a 1/2 hour commercial at the start.",
            "created": "Wed, 08 Sep 2021 15:15:10 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Worth starring Michael Keaton",
            "created": "Wed, 08 Sep 2021 18:09:53 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2021/09/08/worth.png",
            "description": "Netflix should have done for the families what they wanted Keaton's character to do. Tell their stories. ",
            "subs": [
                {
                    "text": "The Netflix movie <a href=\"https://en.wikipedia.org/wiki/Worth_(film)\">Worth</a> got great <a href=\"https://www.metacritic.com/movie/worth\">reviews</a>, and it stars <a href=\"https://en.wikipedia.org/wiki/Michael_Keaton\">Michael Keaton</a> so I got out the popcorn and sat down to watch with great expectations and came away not liking the movie. That was almost a week ago, and I've had some time to reflect on why it was so bad. ",
                    "created": "Wed, 08 Sep 2021 18:11:12 GMT",
                    "collapse": "true",
                    "subs": [
                        {
                            "text": "Interestingly, the score on Metacritic for Worth has gone down by 20 points since I looked late last week. Now it gets a 66, \"generally favorable\" which is not great. But I left the first paragraph alone. ",
                            "created": "Wed, 08 Sep 2021 18:19:26 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "First, Keaton is a great actor, and this was an unusual role for him, playing a lawyer whose job it was to save the economy from being sued to oblivion by the families of victims of 9/11 by giving them money. ",
                    "created": "Wed, 08 Sep 2021 18:11:25 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Now I'm going to spoil the plot, but it's kind of funny -- you might not even realize this was the plot, esp the second part, after you watched the whole movie, that's how poorly done it was. So here goes. ",
                    "created": "Wed, 08 Sep 2021 18:12:35 GMT",
                    "flNumberedSubs": "true",
                    "subs": [
                        {
                            "text": "The families wanted their dead relatives' stories told, they cared less about how much money they got, although the money was important to some.",
                            "created": "Wed, 08 Sep 2021 18:13:05 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "The families of rich people who died scammed the regular people and they took a lot more of the money from the settlement, and there was nothing Michael Keaton could do about it. ",
                            "created": "Wed, 08 Sep 2021 18:13:42 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "But the most important part of the plot was that Keaton started out as a stiff and heartless lawyer and came out the other end as a champion of the people. Only we never saw the process by which this transformation took place. ",
                            "created": "Wed, 08 Sep 2021 18:14:24 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "The conclusion I came to, after giving this enough time, was that it should have been a 6 to 10-part series. Netflix should have done for the families what they wanted Keaton's character to do. Tell their stories. That's where the juice was. If you want to make Keaton the central thread, that's a good way to do it. But we just got tiny little glimpses of the families here and there, and no understanding of who actually died in the 9/11 attack. And that's a shame, because it could be a good story. Maybe a bit like <a href=\"https://en.wikipedia.org/wiki/Six_Feet_Under_(TV_series)\">Six Feet Under</a>. ",
                    "created": "Wed, 08 Sep 2021 18:15:18 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Anyway as a movie it was imho a failure. Michael Keaton, as always, commands your attention in a good way, just to see someone who's a true artist at his craft. ",
                    "created": "Wed, 08 Sep 2021 18:16:48 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "My podcasting habit wanes",
            "created": "Wed, 08 Sep 2021 14:41:04 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2021/09/08/boatSailingAway.png",
            "description": "How about a rational outspoken person to balance the crazy outspoken people. McNeil with a good sidekick could do that. ",
            "subs": [
                {
                    "text": "Editor's note: This started as a <a href=\"https://twitter.com/davewiner/status/1435615566476230661\">thread</a> on Twitter and turned into a ramble <a href=\"http://scripting.com/2021/09/08/144104.html?title=myPodcastingHabitWanes\">here</a> on my blog...",
                    "created": "Wed, 08 Sep 2021 14:46:10 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I have to admit the only podcast I listen to these days is <a href=\"https://www.wnyc.org/shows/bl\">Brian Lehrer</a>, and I don't listen to that very often. ",
                    "created": "Wed, 08 Sep 2021 14:41:11 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "If <a href=\"https://heathercoxrichardson.substack.com/\">Heather Cox Richardson</a> did one, I would listen. A weekly version of her newsletter. Yes. She's one of those people I never have an argument with, and always learn something from. ",
                    "created": "Wed, 08 Sep 2021 14:43:27 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "In contrast the <a href=\"https://www.nytimes.com/column/the-daily\">Daily podcast</a> (which used to be my main daily news fix a year or more ago) sucks so much now because the NYT reporters are either dumbing things down intolerably or (sorry but this is more likely) they're just too young and inexperienced to have a clue. About anything, even what they're supposed to be expert in. I know they hire kids with great degrees from great schools, but I wonder if they aren't all the pre-med-type students who just go for the grade and recommendation. ",
                    "created": "Wed, 08 Sep 2021 15:07:47 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "And then think about all the doctors they keep inviting on to CNN and MSNBC. The same ones all the time and they say the same things. You wouldn't need AI to do what they do!  ",
                    "created": "Wed, 08 Sep 2021 15:07:59 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Also I would listen to a [[Donald McNeil]] weekly podcast about what's new with Covid. I wouldn't mind if he also talked about cooking, or great trips he's taken that didn't get him fired from the NYT. I think he should be as popular as that <a href=\"https://open.spotify.com/show/4rOoJ6Egrf8K2IrywzwOMk\">asshole</a> on Spotify who got Covid and is taking oxycloriquin or whatever. How about a rational outspoken person to balance the crazy outspoken people. McNeil with a good sidekick could do that. ",
                    "created": "Wed, 08 Sep 2021 14:41:31 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "They could do a clean sweep of MSNBC while you're at it. Again, clinging to a world that is gone. No patience for that. Get <a href=\"https://heathercoxrichardson.substack.com/\">HCR</a> and <a href=\"https://donaldgmcneiljr1954.medium.com/\">DM</a> to begin. Offer Brian Lehrer a nightly spot. That's three hours right there. The people they have now are out of ideas. Need a rest, a change of venue. Put them out of their misery. ",
                    "created": "Wed, 08 Sep 2021 14:42:42 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Who to blame for Afghanistan?",
            "created": "Wed, 08 Sep 2021 14:34:02 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Who to blame for the Afghanistan debacle? ",
                    "created": "Wed, 08 Sep 2021 14:34:09 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It's not nearly as complicated as journalism makes it sound.",
                    "created": "Wed, 08 Sep 2021 14:34:28 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The people who voted to re-elect Bush in 2004.",
                    "flInCalendar": true
                },
                {
                    "text": "Blame yourself if you‘re one of them. We had a chance to listen to the world and use our dominance in so many areas other than blowing up Iraq.",
                    "flInCalendar": true
                },
                {
                    "text": "Very limited imagination.",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}