{
    "text": "September 9",
    "created": "Thu, 09 Sep 2021 13:10:20 GMT",
    "type": "calendarDay",
    "name": "09",
    "subs": [
        {
            "text": "I'm loving going through [[Rick and Morty]] for the second time. I've promoted it to my friends, but the comments I get back are a lot like the ones about [[Bojack Horseman]]. They're turned off by the fact that it's a cartoon. I don't mind it at all, myself, and it has the advantage that they can go places with their imaginations that human actors can't. That's esp important for a show like R&M. Also another thing I like is that there's no fourth wall at weird times. Rick talks like a game show host, about commercial breaks, and then talks about episodes, and seasons of R&M. I love it when writers are free to talk to us through the characters, quite literally, not through manipulation. I think it's a masterpiece, as I did with <a href=\"https://www.google.com/search?q=site%3Ascripting.com+bojack\">Bojack</a>. Here's the thing, as kids we loved cartoons right? I know I did. I also loved movies. So now I like movies made for adults, why not cartoons for adults?",
            "created": "Thu, 09 Sep 2021 15:05:24 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/09/09/jessica.png",
            "flInCalendar": true
        },
        {
            "text": "2015: <a href=\"http://scripting.com/2015/08/30/whyYouMustWatchBojackHorseman.html\">Why you must watch Bojack Horseman</a>.",
            "created": "Thu, 09 Sep 2021 16:35:29 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Listen. There are plenty of famous delusional loudmouths. Why aren't there any sane loudmouths to balance them? I'll tell you why -- because being confident and outspoken is considered a sin among the sane. But! It's not a sin to communicate in a way more people understand.",
            "created": "Thu, 09 Sep 2021 14:36:57 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Liberty doesn't mean you can take a crap in the middle of the supermarket or burn down your own house. ",
            "created": "Thu, 09 Sep 2021 13:23:58 GMT",
            "type": "tweet",
            "tweetId": "1435957204151111680",
            "tweetUserName": "davewiner",
            "flInCalendar": true
        },
        {
            "text": "I wonder when someone in journalism is going to break the Republican lie that we're all independent of each other, that somehow we don't need the help of others to eat, stay warm, stay alive. We don't live on the prairie in the old times, before railroads and medicine. If your house catches fire, my house will too. Once we establish that foundation, that we depend on each other, we can solve problems, but not as long as our political life is mired in this argument about what liberty means. ",
            "created": "Thu, 09 Sep 2021 13:20:16 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I am very happy with the way \"Drummer\" testing is going. There have been some surprising contributions, really good questions, and plenty of people actually using the software. Enough people to keep it moving. And I'm not in a rush. As far as I'm concerned this is the whole game. I have no development plans beyond Drummer and the scriptable apps I've lined up to hook into it. I'm not sure why this time is different, but I'm not arguing. :boom: ",
            "created": "Thu, 09 Sep 2021 13:10:21 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}