{
    "text": "September 11",
    "created": "Sat, 11 Sep 2021 13:58:22 GMT",
    "type": "calendarDay",
    "name": "11",
    "subs": [
        {
            "text": "I get <a href=\"https://andrewsullivan.substack.com/\">Andrew Sullivan's email newsletter</a>. Today's edition was a podcast <a href=\"https://podcasts.apple.com/us/podcast/michael-wolff-on-the-trump-threat/id1536984072?i=1000534947059\">interview</a> with <a href=\"https://en.wikipedia.org/wiki/Michael_Wolff_(journalist)\">Michael Wolff</a>, who I've met several times. Wolff is a great conversationalist, his writing is irreverent, and he's also very generous personally. The same <a href=\"https://twitter.com/justinbaragona/status/1416791009082712070?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1416791009082712070%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwww.businessinsider.com%2Fwatch-michael-wolff-flip-out-at-cnns-brain-stelter-2021-7\">people dismiss him</a> who dismiss me. So I started <a href=\"https://podcasts.apple.com/us/podcast/michael-wolff-on-the-trump-threat/id1536984072?i=1000534947059\">listening</a> and it's great. I did a <a href=\"https://www.google.com/search?q=andrew+sullivan+podcast\">search</a> for \"Andrew Sullivan podcast\" on Google and <a href=\"https://podcasts.apple.com/us/podcast/the-dishcast-with-andrew-sullivan/id1536984072\">there it is</a>. Another podcast to check out. I'm going to give it a try.",
            "created": "Sat, 11 Sep 2021 13:58:23 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/09/11/kaepernick.png",
            "flInCalendar": true
        },
        {
            "text": "BTW, I agree with absolutely everything <a href=\"https://twitter.com/justinbaragona/status/1416791009082712070\">Michael Wolff says</a> to Brian Stelter, about Stelter, CNN and journalism. Stelter asks what he should do differently, Wolff says \"listen more\" and of course Stelter just laughed at Wolff, pretty sure there wasn't any listening going on. They are in a deep increasingly irrelevant rut. We need a new news. ",
            "created": "Sat, 11 Sep 2021 15:18:46 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Speaking of podcasts, the next Now & Then episode I listened to was great, it was about <a href=\"https://podcasts.apple.com/us/podcast/attacking-and-defending-voting-rights/id1567665859?i=1000533835280\">voting rights in American history</a>. What's happening now is actually fairly typical. There's so much interesting stuff they left out in grade school history, which I used to love, my favorite subject after English. Now I'm wondering where I can take a remedial history class after I go through all the Now & Then episodes, which I'm clearly going to do. I also wonder who's going to do the history of tech with the rigor, curiosity and humor of Richardson and Freeman.",
            "created": "Sat, 11 Sep 2021 14:01:34 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "An unpublished post from 2008",
            "created": "Sat, 11 Sep 2021 14:45:10 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "<i>I was going through some notes and came across this piece I wrote on 5/19/2008 about how <a href=\"http://scripting.com/2018/02/26/024939.html\">my mother</a> uses computers. I guess I didn't publish it because she was a regular reader of my blog, and might be offended. But she won't read it now, and if she did I would tell her this is how I loved you, knowing all about the stubborness and willfull ignorance of how computers work. Which is odd because her children and husband made their careers making these damn things work, in some fashion. </i>",
                    "created": "Sat, 11 Sep 2021 14:45:26 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "One of my standard disclaimers after I Am Not A Lawyer and Murphy-willing is My Mother Loves Me. I say this to let everyone know that no matter how much you dis me, no matter how much you hurt my feelings or make me feel worthless, I know that as a last resort my mother still thinks I'm great. (I hope she still feels that way after reading this.) And I love my mother, all this is said with the deepest admiration, with a bit of irony and tongue in cheek. ",
                    "created": "Sat, 11 Sep 2021 14:47:41 GMT",
                    "image": "http://images.scripting.com/archiveScriptingCom/2008/05/19/rockingChair.gif",
                    "flInCalendar": true
                },
                {
                    "text": "All that said, my mother is one stubborn person. \";->\"",
                    "created": "Sat, 11 Sep 2021 14:47:44 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "She's been using a Mac for 20 years -- 20 years! And she still doesn't know what a menu is or a window or the desktop or an icon, or a toolbar. But she does, somehow, know that if you press cmd-shift-4 you get a screen capture of the front window and it creates an icon on the desktop (what she calls this I have no idea). She showed me all her icons. I asked how she knew that, she said \"I just know it.\"",
                    "flInCalendar": true
                },
                {
                    "text": "It's as if kids born in Czechoslavakia in the 1930s were somehow taught this in grade school?",
                    "flInCalendar": true
                },
                {
                    "text": "We have this clash every so often. I tell her she must go to the local community college or public library and take a class in basic computer usage. That she would get back a ton of time for doing this, and I'd be able to show her a lot more cool things she could do with her Mac. But she won't do it. It's as if one could drive a car without knowing which pedal was the brake and which the gas, or what the gear shift was, or the difference between the steering wheel and the volume control on the radio. If my mother drove her car like she drives her Mac the streets of NYC would not be a safe place to drive.",
                    "flInCalendar": true
                },
                {
                    "text": "This came up over the weekend because I was trying to teach her to use WordPress, software that seems fairly straightforward and easy to use -- to me, but when viewed through my mother's eyes was unbelievalby difficult. It's not totally WordPress's fault. There are so many layers to the screen of a Macintosh. First there's the OS, it has menus, a desktop, windows, etc. All of which have controls and their own logic. Then there's the browser. It has an address bar, a search box (hers got stretched somehow so the address bar was tiny and it was huge (why is the search box even resizable?). It has a toolbar, Preferences, bookmarks (oy she totally doesn't get bookmarks). And then there's WordPress, and it has chrome too, just like the browser does! How can you tell the difference? I don't know.",
                    "created": "Sat, 11 Sep 2021 14:57:28 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "For me this stuff is understandable because each piece came in one at a time.  But when I saw how it looked to someone who not only didn't have that perspective, but didn't have the time or patience or spongelike learning brain of a child to grok all the layers of logic at play, it's just something to laugh about and shrug off.  ",
                    "flInCalendar": true
                },
                {
                    "text": "Yet she understands the <i>purpose</i> of the web, viscerally. ",
                    "flInCalendar": true
                },
                {
                    "text": "All this made me think that now that we have a handful of activities identified, blogging, bookmarking, clicking, chat, email, etc. one could start from scratch and design a computer that just did these things without layers at all. ",
                    "flInCalendar": true
                },
                {
                    "text": "Or my mom could take a class at the local public library. \";->\"",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}