{
    "text": "September 17",
    "created": "Fri, 17 Sep 2021 15:04:49 GMT",
    "type": "calendarDay",
    "name": "17",
    "subs": [
        {
            "text": "A bee flew into my mouth while I was riding my bike today. I quickly swatted it out of there, but I got stung anyway. That was 1/2 hour ago, and the swelling went down quickly. Whew good thing I didn't inhale the little fucker. ",
            "created": "Fri, 17 Sep 2021 20:01:06 GMT",
            "type": "tweet",
            "tweetId": "1438956233998880773",
            "tweetUserName": "davewiner",
            "image": "http://scripting.com/images/2021/09/17/simpsonsBeeGuy.png",
            "flInCalendar": true
        },
        {
            "text": "Everything we think is a new low in American governance is far from it. We were taught a lot of crap in school. The people whose egos were being protected are all long-dead. Was it worth it? No, of course not. It would have been much better if they taught the unvarnished truth.",
            "created": "Fri, 17 Sep 2021 20:17:49 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I thought this would make an interesting <a href=\"http://scripting.com/images/2021/09/17/tabsOpenInDrummer.png?x=1\">screen shot</a>. Each tab is an outline I have open in \"Drummer\" all the time. Every idea can be slotted into each of these. And sometimes they move from one to the other as they get more \"done.\" Most but not all are calendar structured. People often ask how I use outliners, this is at one level, the answer. ",
            "created": "Fri, 17 Sep 2021 15:40:16 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Facebook is at least seven things",
            "created": "Fri, 17 Sep 2021 15:31:04 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2021/09/17/facebookBlue.png",
            "description": "Each of the different Facebooks are limited by the others. ",
            "subs": [
                {
                    "text": "Here's the list. ",
                    "created": "Fri, 17 Sep 2021 15:31:10 GMT",
                    "flNumberedSubs": "true",
                    "subs": [
                        {
                            "text": "Mark Zuckerberg. ",
                            "created": "Fri, 17 Sep 2021 16:06:44 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "A public corporation.",
                            "created": "Fri, 17 Sep 2021 15:31:16 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "60K employees. ",
                            "created": "Fri, 17 Sep 2021 16:07:15 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Servers, software, other tech.",
                            "created": "Fri, 17 Sep 2021 15:31:23 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "An advertising platform.",
                            "created": "Fri, 17 Sep 2021 17:15:39 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "A user community.",
                            "created": "Fri, 17 Sep 2021 15:31:29 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Connections to the rest of the web.",
                            "created": "Fri, 17 Sep 2021 15:31:58 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "When journalism refers to \"Facebook\" I don't think they're ever clear on which Facebook they're talking about.",
                    "created": "Fri, 17 Sep 2021 15:32:13 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Each of the different Facebooks are limited by the others. ",
                    "created": "Fri, 17 Sep 2021 15:32:43 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "But if you are aware of all the different things \"Facebook\" is, their stories are usually mush. ",
                    "created": "Fri, 17 Sep 2021 15:33:20 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "What I'm learning from The Wire",
            "created": "Fri, 17 Sep 2021 15:04:50 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I have no idea how many times I've watched <a href=\"https://en.wikipedia.org/wiki/The_Wire\">The Wire</a> from beginning to end, but it's probably more than five. The last time I remember watching it was in 2010 when I just moved to NYC. I was living in the West Village, and had an active social life, and The Wire was something nice to do calmly, alone, just to get absorbed by a fictitious yet very familiar culture, again. Like coming home in a way.",
                    "created": "Fri, 17 Sep 2021 15:05:13 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "That's the thing about all good series that achieve suspension of disbelief, you feel like you're in the story, you're part of the family. And <a href=\"https://www.metacritic.com/tv/the-wire\">The Wire</a> with five seasons of 13 shows each, each show an hour, with all the characters and their stories, and relationships, makes for very absorbing reality-shifting and an emotionally satisfying experience. ",
                    "created": "Fri, 17 Sep 2021 15:28:53 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Sometimes I know what's coming, and amazingly, sometimes I've forgotten. But some big events, you remember, and experience them in full fidelity now, as you did the first time. ",
                    "created": "Fri, 17 Sep 2021 15:12:05 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Also if I recall correctly the first seasons were only available in low-rez, they came out before 4K, but somehow they've upgraded the source material and it's all up state of the art, at least to my eyes, which aren't the strongest.",
                    "created": "Fri, 17 Sep 2021 15:12:45 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Anyway, I'm toward the end of season 2. Not even close to half way through. Looking forward to the end of the day when I might watch a couple of epsiodes.",
                    "created": "Fri, 17 Sep 2021 15:14:12 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "And get this, while I'm working through The Wire, I can't watch cable news. It's just too sad, slow, repetitive and just wrong. On one hand you see how great we can be as story-tellers, and the stories told on MSNBC and CNN aren't stories at all. The characters say nothing. Even the ones with reputations for saying a lot. There's absolutely no human connection. And you can see that the things they're saying are repeats, just like watching The Wire for the 5th or 10th time, but there's never a question about what the characters might say or do, it's always exactly the same. Yet it's supposed to be The News which would lead you to believe their intention is to say new things. ",
                    "created": "Fri, 17 Sep 2021 15:14:51 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I keep asking the question -- does news have to be as bad as it is? Could imagination bet part of it, curiosity, intellect, depth of knowledge about something other than politics or law? Maybe this is just what happens when you become older and more experienced than everyone on the news. They all seem flat and boring, and just plain stupid, bored with their jobs, but keeping the seat warm. But does it have to be this way?",
                    "created": "Fri, 17 Sep 2021 15:26:06 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "I turned off Maddow last night",
            "created": "Fri, 17 Sep 2021 15:24:18 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I turned off Maddow  last night as she was reporting a leak of software for elections. She left out the vital part of the story, was this the first time the software had leaked? If not, all it tells you is the people who are doing the \"recount\" in Arizona are bad people. This is not news. If they were new leaks, I doubt I'd be hearing about it first on Maddow.",
                    "created": "Fri, 17 Sep 2021 15:24:25 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Come to think of it for all their breathess breaking stories, I can't remember Maddow ever cited by another news org as the source of a major story. Yet they often present their work as such.",
                    "created": "Fri, 17 Sep 2021 15:25:43 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "And the dishonesty when it comes to tech reporting, gives me an idea of how dishonest their other reporting must be. ",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}