{
    "text": "September 20",
    "created": "Mon, 20 Sep 2021 22:16:34 GMT",
    "type": "calendarDay",
    "name": "20",
    "subs": [
        {
            "text": "<i>Twitter Pro</i> probably seems like a weird idea. Could there be <i>professional</i> Twitter users? There are. It's a writer's platform. The name they chose makes such an idea uncomfortable, perhaps. But it's a for real idea. ",
            "created": "Mon, 20 Sep 2021 22:16:35 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The next round of changes in [[Drummer]] will be about organizing tweets, using Twitter as a source for your writing work. Here's the use-case. You're out and about, and get an idea that belongs on the to-do list for your latest project. Open up Twitter, and post a note about it. When you get back to your desktop the note will already be in a Drummer outline, ready for you to act on it. It doesn't matter what kind of writer you are, whether you write for yourself, as a note-taker, if you write docs, research, news reporting, a blog, or a great novel. If you're a writer and and a steady user of Twitter, and interested in [[tools for thought]] and outliners, I'd like to add you to the Drummer test group in a few days because I want to groom the product to your use of it. Send me an email, let me know if this interests you and we'll get you on board soon. ",
            "created": "Mon, 20 Sep 2021 22:20:56 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/06/14/strongman.png",
            "flInCalendar": true
        },
        {
            "text": "All kinds of \"twitterpro\" names are <a href=\"https://www.hover.com/domains/results?q=twitterpro\">available</a>, somewhat amazingly. I've learned to control my domain name buying fetish, somewhat. I bought <a href=\"http://drummer.land/\">drummer.land</a> recently. I found myself using that term when writing docs. I had to have it. Anyway. My name is Dave and I'm a domain name buying addict. ",
            "created": "Mon, 20 Sep 2021 22:40:26 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://en.wikipedia.org/wiki/Omar_Little\">Omar Little</a> is the most likeable character on [[The Wire]]. <a href=\"https://en.wikipedia.org/wiki/Marlo_Stanfield\">Marlo Stanfield</a> is the coldest. For some reason I think of Marlo as <a href=\"https://en.wikipedia.org/wiki/Matt_Mullenweg\">Matt Mullenweg</a>. I know that's weird. Matt is a very nice fellow. But I guess the parallel is that I am <a href=\"https://en.wikipedia.org/wiki/Avon_Barksdale\">Avon Barksdale</a> to his Marlo Stanfield? The Wire is good, but it's <a href=\"https://en.wikipedia.org/wiki/The_Wire_(season_1)\">Season 1</a> that's great. The remaining four seasons kind of coast a little after the spectacular creative success of the first. ",
            "created": "Mon, 20 Sep 2021 22:44:45 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "One thing that makes The Wire so watchable is the huge number of fully developed characters interacting with each other. ",
            "created": "Tue, 21 Sep 2021 02:17:14 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "As summer winds down (tomorrow is the last day), I chose to listen to music instead of a podcasts on today's bike ride. I am loaded up with new ways of thinking from having gone through the archive of the <a href=\"https://podcasts.voxmedia.com/show/now-then\">Now & Then podcast</a>. If you find your podcast fare is repetitive or shallow, dive into that podcast. It's a great college course in the history behind current affairs. Anyway, I've loaded up my <a href=\"https://en.wikipedia.org/wiki/IPhone_SE_(2nd_generation)\">iPhone SE</a>, a very middle-class iPhone thank you, with lots of music history, and set it to shuffle the songs. The songs of my childhood. As this summer winds down, it feels like a metaphor for the summer of my own life winding down. The feelings from childhood that I re-experience with the music were the \"other side\" of the experiences  of adulthood which is now passing just like summer. The dreams of a child were of the future, full of possibilities, are now balanced by the regrets of an old man. I'm doing my best to stay fit, but it gets harder every year. This fall, esp because the pandemic is now going into its <i>third</i> winter, has a grim feel to it. I know winter can be beautiful in the Hudson Valley. But this winter, unlike recent past winters, there's a sense of dread that hasn't been there before.",
            "created": "Mon, 20 Sep 2021 22:47:34 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I love to write. ❤️",
            "created": "Mon, 20 Sep 2021 23:00:03 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}