{
    "text": "September 22",
    "created": "Wed, 22 Sep 2021 12:59:01 GMT",
    "type": "calendarDay",
    "name": "22",
    "subs": [
        {
            "text": "The Dems should run ads saying how much the average retirement account will go down if the Repubs crash America's credit.   Make it concrete. Estimate how the market will react.  Now is the time to run those ads. If the campaigns didn't go to sleep between elections...",
            "type": "outline",
            "tweetId": "1440701426007642115",
            "tweetUserName": "davewiner",
            "created": "Wed, 22 Sep 2021 15:36:01 GMT",
            "flInCalendar": true
        },
        {
            "text": "As an experiment, I created a <a href=\"http://scripting.com/2021/09/22/152122.html?title=aThreadFromMyTweetStreamAsCapturedByDrummer\">blog post</a> out of a tweet stream, with no editing. Copy/paste. ",
            "created": "Wed, 22 Sep 2021 15:23:14 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I remember what I was doing at 24 and it wasn't <a href=\"https://twitter.com/gabegutierrez/status/1440437507284291602\">dying</a> of a completely and easily preventable disease.",
            "created": "Wed, 22 Sep 2021 15:13:01 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Yesterday's <a href=\"https://www.google.com/search?q=site%3Ascripting.com+%22Now+%26+Then%22+podcast&rlz=1C5CHFA_enUS743US747&sxsrf=AOaemvIVpAvY-txEFkhAmn7_YEpVusb3MQ%3A1632323867619&ei=G0lLYdWiJfKi_Qajqa-YAg&oq=site%3Ascripting.com+%22Now+%26+Then%22+podcast&gs_lcp=Cgdnd3Mtd2l6EAM6BwgAEEcQsANKBAhBGABQ7R1YzDJgjjZoAXACeACAAU6IAcMBkgEBM5gBAKABAcgBCMABAQ&sclient=gws-wiz&ved=0ahUKEwiVnKai8JLzAhVyUd8KHaPUCyMQ4dUDCA8&uact=5\">Now & Then podcast</a>, about the history of NYC, was the first one that was disappointing. At one point Heather Cox Richardson said, almost proudly, that the only thing she knows about NYC is the line in the song <a href=\"https://www.youtube.com/watch?v=2u1zK8AaHic\">New York, New York</a> \"If you can make it there you can make it anywhere.\" This is one of my big problems with podcasts, the thing that tunes me out, when people speak from a position of false expertise. They're having a grand time, and while I (the listener) am deciding whether or not to cut them off, based on the probability that they'll ever say anything interesting before the end. Yesterday I cut them off and listened to music for the second half of my ride. It's the same reason I can't watch any MSNBC show for more than 3 minutes. They're filling the air, meantime I know there are things going on they should be informing me of, and add to things my mind can think about. Okay so N&T had a bad episode, not the end of the world, the other most recent episodes are totally worth listening to, I highly recommend them, and I will keep listening in the hope that the NYC episode was just a bad idea they followed through on instead of canning. ",
            "created": "Wed, 22 Sep 2021 15:03:18 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/11/23/heartNY.png",
            "flInCalendar": true
        },
        {
            "text": "We are now all complete newbies when it comes to understanding how networks can be used to spread misinformation. We might look back in a few years and realize that our first line of defense was Facebook, Inc. Maybe tearing them down is like the press tearing down HRC in 2016. I don't trust their judgement on this stuff, do you?",
            "created": "Wed, 22 Sep 2021 14:58:52 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The debt limit vote is filibusterable you say?   Perfect time to nuke the filibuster.",
            "type": "tweet",
            "tweetId": "1440657219855413250",
            "tweetUserName": "davewiner",
            "created": "Wed, 22 Sep 2021 12:40:21 GMT",
            "flInCalendar": true
        },
        {
            "text": "A thread from my tweet stream, as captured by Drummer",
            "created": "Wed, 22 Sep 2021 15:21:22 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "If only we had journalism covering itself we'd probably learn they've been doing the exact same thing since the dawn of journalism.  This is a big defect in our system, no one is watching journalism.  (<a href=\"https://t.co/w8nGgjZTfb\">link</a>)",
                    "type": "tweet",
                    "tweetId": "1440665921412947969",
                    "tweetUserName": "davewiner",
                    "created": "Wed, 22 Sep 2021 13:14:56 GMT",
                    "url": "https://t.co/w8nGgjZTfb",
                    "subs": [
                        {
                            "text": "For example, what do you think the Pulitzer Prize is, other than a bunch of ads they do about journalism every year. No doubt the awards are highly politicized, and stories looking too deeply into corrupt journalism probably don't stand much chance of getting an award.",
                            "type": "tweet",
                            "tweetId": "1440694739032969219",
                            "tweetUserName": "davewiner",
                            "created": "Wed, 22 Sep 2021 15:09:27 GMT",
                            "subs": [
                                {
                                    "text": "Until there's some way for journalism's corruption to be exposed, why would any intelligent person think there's anything but corruption in journalism? In an Occam's Razor sort of way.  I'm watching The Wire, about to start Season 5, btw, if you know what that's about. ;-)",
                                    "type": "tweet",
                                    "tweetId": "1440695147432345603",
                                    "tweetUserName": "davewiner",
                                    "created": "Wed, 22 Sep 2021 15:11:04 GMT",
                                    "subs": [
                                        {
                                            "text": "There's this great scene at the end of Season 4, with Bodie and McNulty on a park bench. Bodie is talking about how fucked up the bosses are in the drug mob in Baltimore. It sounds just like what McNulty would say about the police department. That's the point.",
                                            "type": "tweet",
                                            "tweetId": "1440695501842628612",
                                            "tweetUserName": "davewiner",
                                            "created": "Wed, 22 Sep 2021 15:12:29 GMT",
                                            "subs": [
                                                {
                                                    "text": "Here's the scene with Bodie and McNulty.    (<a href=\"https://t.co/EtwlxhFKEz\">link</a>)",
                                                    "type": "tweet",
                                                    "tweetId": "1440700692214083606",
                                                    "tweetUserName": "davewiner",
                                                    "created": "Wed, 22 Sep 2021 15:33:06 GMT",
                                                    "url": "https://t.co/EtwlxhFKEz",
                                                    "flInCalendar": true
                                                }
                                            ],
                                            "flInCalendar": true
                                        }
                                    ],
                                    "flInCalendar": true
                                }
                            ],
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}