{
    "text": "September 28",
    "created": "Tue, 28 Sep 2021 11:49:45 GMT",
    "type": "calendarDay",
    "name": "28",
    "subs": [
        {
            "text": "I always feel great after a bike ride.",
            "created": "Tue, 28 Sep 2021 22:05:49 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I was thinking of adding a landline feature to my cable service. $12.99 a month sounds okay. But then I saw the <a href=\"http://scripting.com/images/2021/09/28/voicePlan.png\">fine print</a>. Oy. I remember how hard it was to get rid of a feature last time around. I swear if only they'd stop scamming. I'm paying $8.99 a month to rent an Apple TV, even though I already had an Apple TV. Them's the rules they said. Can't get TV without paying the set top box tax. Oy oy. An Apple TV costs <a href=\"https://www.amazon.com/2021-Apple-TV-4K-32GB/dp/B0933D3SN6/ref=sr_1_1_sspa?dchild=1&keywords=apple+tv&qid=1632844905&sr=8-1-spons&psc=1&spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUEyRlkxQzZKRUkyQ1hJJmVuY3J5cHRlZElkPUEwOTU5MTI3MU1JQVJMRlNWSVM1MyZlbmNyeXB0ZWRBZElkPUEwMzg0NjkyMU81UjBBS0JSMExaNiZ3aWRnZXROYW1lPXNwX2F0ZiZhY3Rpb249Y2xpY2tSZWRpcmVjdCZkb05vdExvZ0NsaWNrPXRydWU=\">$169</a> on Amazon.",
            "created": "Tue, 28 Sep 2021 15:59:02 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/05/07/subtleArtOfNotGivingAFuck.png",
            "flInCalendar": true
        },
        {
            "text": "What made me think of getting a landline? All of a sudden the phone app on my <a href=\"https://en.wikipedia.org/wiki/Pixel_4a\">Pixel 4a</a> refuses to connect over wifi, a requirement since there's no cell service here. Not having a reliable way to make a phone call, that's not okay. And the way I used to make calls on my computer with Google Hangouts, that doesn't work anymore either. They said use Google Chat now. OK, but where in Google Chat, on my desktop (which they have) can I make a phone call? Every one of these companies is missing part of the plan for how to build reliable service around the still relatively new (I guess) open network. They all still want to completely control you and soak you for services you don't want, and change things around so you never get to feel confident in using their software. How that helps them, I have no idea.",
            "created": "Tue, 28 Sep 2021 16:02:53 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "It drives me crazy that the press makes everything about Dems and Repubs. Yes the Dems will be disappointed if the country disintegrates into civil war and becomes a zombie zone full of covid, but don't you get that other people will be unhappy too?",
            "created": "Tue, 28 Sep 2021 12:29:43 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "We’re really governed by journalism. They are not transparent, not accountable to anyone, dishonest, corrupt, no moral compass. Controlled by oligarchs. Not subject to recall. We are powerless against them. We have few if any rights.",
            "created": "Tue, 28 Sep 2021 11:49:46 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<s>Twitter appears to be <a href=\"http://scripting.com/images/2021/09/28/twitterDown.png\">down</a>, at least through the web.</s>",
            "created": "Tue, 28 Sep 2021 16:21:43 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}