{
    "text": "September 30",
    "created": "Thu, 30 Sep 2021 12:34:11 GMT",
    "type": "calendarDay",
    "name": "30",
    "subs": [
        {
            "text": "I don't want to jinx anything but \"Drummer\" is getting pretty solid. Nothing much will change when the product is available publicly, the process will continue, more fixes and features, more interop. I have a lot of little projects I want to do, all designed to build an open ecosystem of thought tools and their adjuncts. The first verison of Drummer will be a blogging tool and a scripting system. But there will be more of all of it. ",
            "created": "Fri, 01 Oct 2021 00:32:12 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/01/11/drummer.png",
            "flInCalendar": true
        },
        {
            "text": "I watched the beginning of <a href=\"https://www.metacritic.com/tv/the-problem-with-jon-stewart\">Jon Stewart's show</a> on Apple TV. He says he doesn't look well, but he looks fine. I'm not sure this show is going to work. The old JS was confident, sassy even. Certainly never self-conscious. In charge. Comfortable.",
            "created": "Fri, 01 Oct 2021 00:45:34 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I was mentioned once on The Daily Show when Jon Stewart was hosting it. As a result I was invited to do a <a href=\"http://scripting.com/manila/bloggerCon/iii/invitation.html\">BloggerCon</a> at Stanford, the third one. It was a good event. ",
            "created": "Fri, 01 Oct 2021 00:48:25 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "As someone who ran a social net long before Facebook booted up, I suspect what we're seeing on FB has less to do with the company and more to do with the scaling up of humanity on social nets.  Journalism has made this about one person, Zuck, probably because that's how the journalism works. Kind of like <a href=\"https://www.youtube.com/watch?v=QMcXvP_J_8g\">Don Geiss</a> on 30 Rock? ",
            "created": "Thu, 30 Sep 2021 12:34:12 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "TFT Hacker is <a href=\"https://twitter.com/TfTHacker/status/1443513598366601220\">looking</a> for an open source JavaScript outliner, other than <a href=\"https://github.com/scripting/concord\">Concord</a>. ",
            "created": "Thu, 30 Sep 2021 12:36:03 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}