{
    "text": "Morning ramble",
    "created": "Thu, 11 Nov 2021 14:26:07 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I signed up for Twitter Blue for $2.99 under the mistaken impression that it got me through paywalls. Okay it doesn't do that. Sigh.",
            "created": "Thu, 11 Nov 2021 14:26:14 GMT",
            "flInCalendar": true
        },
        {
            "text": "I'd be happy to pay $100 a month, but even so I will not use Twitter as the primary way I read news. Not ever going to happen, I already have news reading tools that blow Twitter out of the water. Sorry Jack. I've been working on this stuff for a long time (just like you).",
            "flInCalendar": true
        },
        {
            "text": "So we're still a really long way away from having rational networked news. Yet the deficiencies of news are what's killing us as a democracy and a world power. It isn't Facebook, that's just a diversion. Most people are falling for it. The problem is that the news system is sick. We talk about inequality in terms of how much money people have, but what about inequality in terms of the information they have access to. I pay for better news that poorer people can. But even with that I'm still  impoverished. News people are lazy. I can't believe they weren't all trying to get a real ticktock of Trump on January 6, starting on January 7 (give them a few hours to get over the shock). But I hear from the Washington Post that they thought they had an innovative idea to look into this in October! Holy shit. Is that what they think news is. Oy we are so lost. ",
            "created": "Thu, 11 Nov 2021 16:25:37 GMT",
            "flInCalendar": true
        },
        {
            "text": "I want news like they portrayed it in Hollywood when I was young. The shit where they go out to get the story that brings down the empire. The biggest story of 2021 is what was Trump doing, who was he calling, what threats was he making, when the insurrection was actually going on. I read the WP story. It's really weak. We should know a lot more by now. And this was happening all through the Trump presidency. The news was resetting expectations constantly, noting that Trump wasn't a normal president over and over. Well we figured that out thanks, now how about telling us what he's actually doing. ",
            "flInCalendar": true
        },
        {
            "text": "We're all information impoverished, just pretending we're informed, but in our hearts all of us knowing we have no idea what's being done to us in our own name.",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}