{
    "text": "My podcasting habit wanes",
    "created": "Wed, 08 Sep 2021 14:41:04 GMT",
    "type": "outline",
    "metaImage": "http://scripting.com/images/2021/09/08/boatSailingAway.png",
    "description": "How about a rational outspoken person to balance the crazy outspoken people. McNeil with a good sidekick could do that. ",
    "subs": [
        {
            "text": "Editor's note: This started as a <a href=\"https://twitter.com/davewiner/status/1435615566476230661\">thread</a> on Twitter and turned into a ramble <a href=\"http://scripting.com/2021/09/08/144104.html?title=myPodcastingHabitWanes\">here</a> on my blog...",
            "created": "Wed, 08 Sep 2021 14:46:10 GMT",
            "flInCalendar": true
        },
        {
            "text": "I have to admit the only podcast I listen to these days is <a href=\"https://www.wnyc.org/shows/bl\">Brian Lehrer</a>, and I don't listen to that very often. ",
            "created": "Wed, 08 Sep 2021 14:41:11 GMT",
            "flInCalendar": true
        },
        {
            "text": "If <a href=\"https://heathercoxrichardson.substack.com/\">Heather Cox Richardson</a> did one, I would listen. A weekly version of her newsletter. Yes. She's one of those people I never have an argument with, and always learn something from. ",
            "created": "Wed, 08 Sep 2021 14:43:27 GMT",
            "flInCalendar": true
        },
        {
            "text": "In contrast the <a href=\"https://www.nytimes.com/column/the-daily\">Daily podcast</a> (which used to be my main daily news fix a year or more ago) sucks so much now because the NYT reporters are either dumbing things down intolerably or (sorry but this is more likely) they're just too young and inexperienced to have a clue. About anything, even what they're supposed to be expert in. I know they hire kids with great degrees from great schools, but I wonder if they aren't all the pre-med-type students who just go for the grade and recommendation. ",
            "created": "Wed, 08 Sep 2021 15:07:47 GMT",
            "flInCalendar": true
        },
        {
            "text": "And then think about all the doctors they keep inviting on to CNN and MSNBC. The same ones all the time and they say the same things. You wouldn't need AI to do what they do!  ",
            "created": "Wed, 08 Sep 2021 15:07:59 GMT",
            "flInCalendar": true
        },
        {
            "text": "Also I would listen to a [[Donald McNeil]] weekly podcast about what's new with Covid. I wouldn't mind if he also talked about cooking, or great trips he's taken that didn't get him fired from the NYT. I think he should be as popular as that <a href=\"https://open.spotify.com/show/4rOoJ6Egrf8K2IrywzwOMk\">asshole</a> on Spotify who got Covid and is taking oxycloriquin or whatever. How about a rational outspoken person to balance the crazy outspoken people. McNeil with a good sidekick could do that. ",
            "created": "Wed, 08 Sep 2021 14:41:31 GMT",
            "flInCalendar": true
        },
        {
            "text": "They could do a clean sweep of MSNBC while you're at it. Again, clinging to a world that is gone. No patience for that. Get <a href=\"https://heathercoxrichardson.substack.com/\">HCR</a> and <a href=\"https://donaldgmcneiljr1954.medium.com/\">DM</a> to begin. Offer Brian Lehrer a nightly spot. That's three hours right there. The people they have now are out of ideas. Need a rest, a change of venue. Put them out of their misery. ",
            "created": "Wed, 08 Sep 2021 14:42:42 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}