{
    "text": "Worth starring Michael Keaton",
    "created": "Wed, 08 Sep 2021 18:09:53 GMT",
    "type": "outline",
    "metaImage": "http://scripting.com/images/2021/09/08/worth.png",
    "description": "Netflix should have done for the families what they wanted Keaton's character to do. Tell their stories. ",
    "subs": [
        {
            "text": "The Netflix movie <a href=\"https://en.wikipedia.org/wiki/Worth_(film)\">Worth</a> got great <a href=\"https://www.metacritic.com/movie/worth\">reviews</a>, and it stars <a href=\"https://en.wikipedia.org/wiki/Michael_Keaton\">Michael Keaton</a> so I got out the popcorn and sat down to watch with great expectations and came away not liking the movie. That was almost a week ago, and I've had some time to reflect on why it was so bad. ",
            "created": "Wed, 08 Sep 2021 18:11:12 GMT",
            "collapse": "true",
            "subs": [
                {
                    "text": "Interestingly, the score on Metacritic for Worth has gone down by 20 points since I looked late last week. Now it gets a 66, \"generally favorable\" which is not great. But I left the first paragraph alone. ",
                    "created": "Wed, 08 Sep 2021 18:19:26 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "First, Keaton is a great actor, and this was an unusual role for him, playing a lawyer whose job it was to save the economy from being sued to oblivion by the families of victims of 9/11 by giving them money. ",
            "created": "Wed, 08 Sep 2021 18:11:25 GMT",
            "flInCalendar": true
        },
        {
            "text": "Now I'm going to spoil the plot, but it's kind of funny -- you might not even realize this was the plot, esp the second part, after you watched the whole movie, that's how poorly done it was. So here goes. ",
            "created": "Wed, 08 Sep 2021 18:12:35 GMT",
            "flNumberedSubs": "true",
            "subs": [
                {
                    "text": "The families wanted their dead relatives' stories told, they cared less about how much money they got, although the money was important to some.",
                    "created": "Wed, 08 Sep 2021 18:13:05 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The families of rich people who died scammed the regular people and they took a lot more of the money from the settlement, and there was nothing Michael Keaton could do about it. ",
                    "created": "Wed, 08 Sep 2021 18:13:42 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "But the most important part of the plot was that Keaton started out as a stiff and heartless lawyer and came out the other end as a champion of the people. Only we never saw the process by which this transformation took place. ",
                    "created": "Wed, 08 Sep 2021 18:14:24 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "The conclusion I came to, after giving this enough time, was that it should have been a 6 to 10-part series. Netflix should have done for the families what they wanted Keaton's character to do. Tell their stories. That's where the juice was. If you want to make Keaton the central thread, that's a good way to do it. But we just got tiny little glimpses of the families here and there, and no understanding of who actually died in the 9/11 attack. And that's a shame, because it could be a good story. Maybe a bit like <a href=\"https://en.wikipedia.org/wiki/Six_Feet_Under_(TV_series)\">Six Feet Under</a>. ",
            "created": "Wed, 08 Sep 2021 18:15:18 GMT",
            "flInCalendar": true
        },
        {
            "text": "Anyway as a movie it was imho a failure. Michael Keaton, as always, commands your attention in a good way, just to see someone who's a true artist at his craft. ",
            "created": "Wed, 08 Sep 2021 18:16:48 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}