{
    "text": "Between Taylor and Maggie",
    "created": "Mon, 07 Mar 2022 14:48:33 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I read a <a href=\"https://espiers.medium.com/do-journalist-need-to-be-brands-5e0510dfa67b\">piece</a> by Elizabeth Spiers about a spat between Maggie Haberman and Taylor Lorenz which I had seen some of but didn't understand the bigger context. Now that I've read her summary, I wrote my own thread, reproduced here. BTW, I write my threads on Twitter using my own <a href=\"http://thread.center/\">thread.center</a> tool. I think everyone should use it. It's not about me making money, it's free, but I like to make software for users, and you can help by being one. Thanks. ",
            "created": "Mon, 07 Mar 2022 14:48:41 GMT",
            "flInCalendar": true
        },
        {
            "text": "I didn't realize what the disagreement was between <a href=\"https://twitter.com/maggieNYT\">Maggie Haberman</a> and <a href=\"https://twitter.com/TaylorLorenz\">Taylor Lorenz</a>. ",
            "created": "Mon, 07 Mar 2022 14:51:41 GMT",
            "flInCalendar": true
        },
        {
            "text": "I think I, as a user of news, represent a third point of view. I think we need to <a href=\"http://daytona.scripting.com/?q=rebooting%20the%20news&collection=scriptingnews\">reboot the news</a>, have needed to do that for a long time.",
            "created": "Mon, 07 Mar 2022 23:43:03 GMT",
            "flInCalendar": true
        },
        {
            "text": "I want news that is of the people, by the people and for the people. I don't think people should have big careers in news. A journalist is like a piece of networking hardware or software, they connect the experience and expertise of all of us to each other. They've gotten so far off track, they don't have any actual contact with people who aren't influencers in the TL sense of it or people in power in the MH model. ",
            "flInCalendar": true
        },
        {
            "text": "I don't want any of that. I want to be informed and I want fresh ideas. And if I can't get it from journalism, I'll seek it out elsewhere. I had hoped that that process would have yielded something more tangible by now, but we are still controlled by journalism, and as I've written <a href=\"http://scripting.com/2022/03/05.html#a170242\">elsewhere</a>, they are not in any way accountable to us. That's not a good situation.",
            "created": "Mon, 07 Mar 2022 14:53:09 GMT",
            "flInCalendar": true
        },
        {
            "text": "I doubt if any journalists will read this and if they do, I'm sure they'll find a way to dismiss it -- they always do. ",
            "flInCalendar": true
        },
        {
            "text": "BTW, I used to be an influencer, often quoted in journalism, both off and on the record. I even did a little pseudo journalism as a contributing editor at Wired for a couple of years in the 90s.",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}