{
    "text": "Another story. When I was in grad school, in Wisconsin, I lived in a <a href=\"https://www.google.com/maps/@43.0683469,-89.387218,3a,75y,133.83h,83.15t/data=!3m7!1e1!3m5!1siwxmm2ZOCoKITaSDRlnXwA!2e0!6shttps:%2F%2Fstreetviewpixels-pa.googleapis.com%2Fv1%2Fthumbnail%3Fpanoid%3Diwxmm2ZOCoKITaSDRlnXwA%26cb_client%3Dmaps_sv.tactile.gps%26w%3D203%26h%3D100%26yaw%3D131.00456%26pitch%3D0%26thumbfov%3D100!7i16384!8i8192\">house</a> with nine other students, on <a href=\"http://davetravel.scripting.com/2004/08/27#a36\">West Wilson St</a>, overlooking <a href=\"https://en.wikipedia.org/wiki/Lake_Monona\">Lake Monona</a> and a park with tennis courts. It was the best time of my life. Always a party to come home to, and I loved the work I was doing with computers at the university, and I had a cat named Nurse, who I brought with me to Madison from NYC. She was a great cat. When I adopted her from a cat lady in an apartment on the east side of Manhattan, who had at least 50 cats in her small apartment, she pointed out this kitten who was protecting a sickly cat from the others. That's the one I took, and I called her Nurse because that's what she was when I met her. Anyway, in Madison, Nurse found a boyfriend, I guess, and she got pregnant, and had her kittens in the big house on West Wilson. I gave her a box in the corner of my room, and people were coming in all the time to see and touch the incredible kittens she had birthed. But one morning, they were all gone! The box was empty. No Nurse, no kittens! I did eventually find her, in a drawer in my dresser which I had left open, with some socks and stuff, there she was. I didn't tell anyone because her intention was clear. Then a few days later, kittens everywhere! Nurse was sitting somewhere off on her own and the kittens were discovering all aspects of the big house they were born in and all the people. A couple of days later we put them up for adoption and Nurse went to the vet to get fixed, and when she came home they were gone and she went on with her life hunting mice and birds. ",
    "created": "Thu, 29 Sep 2022 12:34:42 GMT",
    "type": "outline",
    "flInCalendar": true
}