{
    "text": "My night at the Dean campaign",
    "created": "Fri, 12 Jan 2024 14:28:25 GMT",
    "type": "outline",
    "description": "The campaign had video that showed clearly that the press was actively trying to kill his candidacy. ",
    "metaImage": "https://imgs.scripting.com/2024/01/12/deanhq.png",
    "subs": [
        {
            "text": "I'd love to tell you a story about the time I had the authority to post to the Dean campaign home page, and they deleted a post I wrote on the night of the famous <a href=\"https://www.youtube.com/watch?v=l6i-gYRAwM0\">Dean Scream</a> that might have saved the campaign. They were trying to make the story go away. As we know the story didn't go away. ",
            "created": "Fri, 12 Jan 2024 14:28:32 GMT",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"http://scripting.com/stories/2008/03/22/iWasAtDeanHqTheNightTheyDi.html\">2008</a>: \"The campaign had video that showed clearly that the press was actively trying to kill his candidacy. They had a website, and they had enough money to pay for the bandwidth to run it. They knew what the press was trying to do. They could have fought it. But they didn't.\"",
            "created": "Fri, 12 Jan 2024 15:16:57 GMT",
            "flInCalendar": true
        },
        {
            "text": "That night I became friends with Nicco Mele, he was the webmaster at Dean who <a href=\"http://scripting.com/stories/2010/10/28/itsAWrap.html#remindsMeOfAStory\">gave</a> me the power. I was in their Burlington headquarters at the moment the whole thing imploded, the night of the Iowa caucus. I've also become friends with Joe Trippi, the campaign manager for Dean in 2008. They probably accelerated the adoption of online media in American politics by a decade or more. However, a lot of the ideas from that time are gone, but hopefully not forever.",
            "created": "Fri, 12 Jan 2024 14:28:55 GMT",
            "image": "https://imgs.scripting.com/2020/12/15/deanForAmericaBumperSticker.png",
            "flInCalendar": true
        },
        {
            "text": "The biggest idea was that it gave people a sense of belonging, that they weren't powerless to influence or even control the US government. We all felt that the war in Iraq was wrong, Dean gave Americans a way to say that clearly, with their own actions. I think if we want to achieve our destiny in the 2024 election, we need to get some of that into the campaign, or democracy won't prevail.",
            "created": "Fri, 12 Jan 2024 14:30:30 GMT",
            "flInCalendar": true
        },
        {
            "text": "There's a story about how Trump makes people feel like they belong in <a href=\"https://wapo.st/3U224ud\">the Washington Post</a> written by Philip Bump that Joe and Nicco should read if they haven't. This is something Trump gets that the Democrats have forgotten they know. People don't vote on policy, they vote to belong to something they believe might fix things, whatever that means to them.",
            "created": "Fri, 12 Jan 2024 14:31:19 GMT",
            "flInCalendar": true
        },
        {
            "text": "PS: I also blogged about my adventure at the Dean campaign headquarters in <a href=\"http://scripting.com/2004/01.html\">January 2004</a> <a href=\"http://www.scripting.com/2004/01/18.html\">before</a> <a href=\"http://scripting.com/2004/01/19.html#When:9:56:50AM\">and</a> <a href=\"http://scripting.com/2004/01/19.html\">during</a> the Iowa caucus and the Dean campaign implosion.  ",
            "created": "Fri, 12 Jan 2024 14:55:35 GMT",
            "flInCalendar": true
        },
        {
            "text": "PPS: A <a href=\"https://web.archive.org/web/20040407155545/http://blogs.law.harvard.edu/jim/2004/01/19#a418\">picture</a> of the blogging room in Burlington the night of the Iowa caucus in 2004.",
            "created": "Fri, 12 Jan 2024 15:26:12 GMT",
            "flInCalendar": true
        },
        {
            "text": "PPPS: In February 2004, I wrote a <a href=\"http://scripting.com/davenet/2004/02/07/howardDeanIsNotASoapBar.html\">piece</a> summing up what we learned from Dean. \"In a virtual sense, the Internet was looking for a candidate, and Howard Dean fit the bill. He was bloggable.\"",
            "created": "Fri, 12 Jan 2024 15:04:50 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}