{
    "text": "Tesla notes",
    "created": "Tue, 30 Nov 2021 14:53:20 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "On Thursday it'll be two weeks since I got the Tesla Model 3. Here are some thoughts. ",
            "created": "Tue, 30 Nov 2021 14:53:26 GMT",
            "flInCalendar": true
        },
        {
            "text": "I haven't been using the autopilot more than just trying it, seeing it veer into a head on collision, I quickly took control. i'm pretty sure it wasn't actually going to kill me, it was a simple situation, Highway 28 from Boiceville to West Hurley, a <a href=\"https://www.google.com/maps/@41.9792245,-74.2513003,3a,75y,117.7h,55.47t/data=!3m8!1e1!3m6!1sAF1QipPO1fyoXuIDtIHcKA4Ip3wRL8bdSc58hv_Qfmlh!2e10!3e11!6shttps:%2F%2Flh5.googleusercontent.com%2Fp%2FAF1QipPO1fyoXuIDtIHcKA4Ip3wRL8bdSc58hv_Qfmlh%3Dw203-h100-k-no-pi-4.4466395-ya52.469-ro-1.6197597-fo100!7i7680!8i3840\">wide road</a>, easy for the autopilot.",
            "created": "Tue, 30 Nov 2021 14:53:26 GMT",
            "flInCalendar": true
        },
        {
            "text": "But here's the thing -- like the self-driving features of the Subaru, the self-driving features of the Tesla are always there, ready to take over if it thinks you're fucking up. It did a thing weird on a drive out my little dirt road, it sounded an alarm that I was driving off the road. loud screeching sound. I was doing no such thing.",
            "created": "Tue, 30 Nov 2021 14:54:52 GMT",
            "flInCalendar": true
        },
        {
            "text": "The thing that really distinguishes the Tesla as far as i'm concerned isn't the power, or battery, those are nice -- but the full integration of the computer system in the experience. The Subaru is a hodgepodge of different systems that don't know about each other. Very confusing. i've gotten to just using <a href=\"https://en.wikipedia.org/wiki/CarPlay\">Car Play</a> for everything and ignoring the rest. ",
            "created": "Tue, 30 Nov 2021 14:56:22 GMT",
            "flInCalendar": true
        },
        {
            "text": "What this says to me is that in a couple of years, there will be a Mercedes EV with a big screen like Tesla's and no dashboard again like Tesla. And the same or better integration. It'll be running Apple, Amazon or Google software. and it will be as good as Tesla's software because they hire out of the same talent pool.  ",
            "created": "Tue, 30 Nov 2021 14:57:12 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}