{
    "text": "My 1988 driver's license",
    "created": "Thu, 11 Apr 2024 22:32:01 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Found this in my desk drawer today. Amazing the things you carry with you over the ages. I lived in an apartment building on top of a hill in the <a href=\"https://www.google.com/maps/place/1100+Sharon+Park+Dr,+Menlo+Park,+CA+94025/@37.424696,-122.2298177,15z/data=!4m6!3m5!1s0x808fa4f7ba716f5d:0x4318060066990628!8m2!3d37.4247727!4d-122.2181447!16s%2Fg%2F11c1343h_f?entry=ttu\">middle of a golf course</a>, smack in the heart of Silicon Valley, if it actually had a heart, and that's debatable. All the Sand Hill Road VCs were on the other side of the hill. And one exit south on 280 was Xerox PARC, and where NeXT had its startup offices. ",
            "created": "Thu, 11 Apr 2024 22:32:10 GMT",
            "flInCalendar": true
        },
        {
            "text": "My 1988 driver's license.",
            "created": "Thu, 11 Apr 2024 22:33:41 GMT",
            "inlineImage": "https://imgs.scripting.com/2024/04/11/driverslicensesmall1988.png",
            "flInCalendar": true
        },
        {
            "text": "This was the place where I started development of what became \"Frontier\". I always wanted to do a great system level scripting thing, based on what I learned from Unix and what I loved about the graphic user interface. ",
            "created": "Thu, 11 Apr 2024 22:34:13 GMT",
            "flInCalendar": true
        },
        {
            "text": "It became a lot bigger than I anticipated. In the beginning it was meant to be a replacement for the Macintosh Finder, with an outliner for a file system browser, and of course a fantastic scripting ability, of the OS and of scriptable apps. I wish Apple had supported this effort but I didn't understand at the time that they couldn't. They weren't set up to let anyone but Bill and Andy make great products, even if their products weren't all that great, imho of course. You have to live with the mythology you create. ",
            "created": "Thu, 11 Apr 2024 22:47:48 GMT",
            "flInCalendar": true
        },
        {
            "text": "A lot of people got their first programming experience with Hypercard. I would have loved if more of them get their first experience with Frontier. Even better would have been if our products worked together, but that wasn't in the cards either. ",
            "created": "Thu, 11 Apr 2024 22:48:14 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}