{
    "text": "Background noise not news",
    "created": "Sun, 11 Jun 2023 03:26:57 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I read a story the other day, sorry I don't remember where, that Netflix tries to produce movies and series that you can put on in the background while you surf the web, or watch TikTok or YouTube or tweet or do other mindless stuff. A friend calls this \"screen lifestyle.\" I am a member of that club. ",
            "created": "Sun, 11 Jun 2023 03:27:05 GMT",
            "image": "http://scripting.com/images/2023/06/10/bear.png",
            "flInCalendar": true
        },
        {
            "text": "I hear complaints about MSNBC and how their shows are just somewhat irritating mindless crap, the same bullshit you pay attention to with a small fraction of your mind to divide your time with other mindless crap. ",
            "created": "Sun, 11 Jun 2023 03:28:29 GMT",
            "flInCalendar": true
        },
        {
            "text": "I once got in trouble at a meeting in a scholarly environment when someone said to me, accusingly, that I listen to NPR to get the best information. I said no -- I listen to it because it relaxes me. ",
            "created": "Sun, 11 Jun 2023 03:29:12 GMT",
            "flInCalendar": true
        },
        {
            "text": "MSNBC gives us what we want. We can be sure if we tune out for 5 minutes or 20, we won't miss anything because they never said anything new while we weren't paying attention. As soon as some news comes out, as it did the other day (Friday?) they revert to the usual mindless nonsense so as not to disturb us tuning out. The run the big headlines -- BREAKING NEWS -- so we can feel justified leaving it on, as if we're part of the news, but the panel is just telling each other jokes and laughing foolishly. ",
            "created": "Sun, 11 Jun 2023 03:29:50 GMT",
            "flInCalendar": true
        },
        {
            "text": "I heard someone say that Friday Night Lights was that kind of show. For me it's the first ten or so seasons of Law and Order. It's the perfect programming for a tuned-out mind. I know the shows so well, I can often recite the lines as the actors speak. ",
            "created": "Sun, 11 Jun 2023 03:31:00 GMT",
            "flInCalendar": true
        },
        {
            "text": "We all know the species is over, we're not planning on doing anything about it, we just want to zone out passing the time waiting for the societal grim reaper to collect us. ",
            "created": "Sun, 11 Jun 2023 03:32:03 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}