{
    "text": "Writers deserve better",
    "created": "Wed, 28 Dec 2022 13:35:27 GMT",
    "type": "outline",
    "description": "It should be easy because it <i>can</i> be easy.",
    "metaImage": "http://scripting.com/images/2022/12/28/deweyDefeatsTruman.png",
    "subs": [
        {
            "text": "One of the reasons I chose Twitter for identity for my apps, a decision made in 2014, is that I hoped that a developer community would grow up around Twitter. I hoped that Twitter would take a chance on co-promoting products. It could still happen, but it seems unlikely now. ",
            "created": "Wed, 28 Dec 2022 13:35:51 GMT",
            "flInCalendar": true
        },
        {
            "text": "I had excellent experience with Apple in this in the 80s when their platform needed apps, and they empowered <a href=\"https://en.wikipedia.org/wiki/Mike_Boich\">Mike Boich</a> and <a href=\"https://en.wikipedia.org/wiki/Guy_Kawasaki\">Guy Kawasaki</a>, et al, to help us deliver, and we, and a lot of other developers did. It was a win-win. ",
            "created": "Wed, 28 Dec 2022 14:05:53 GMT",
            "flInCalendar": true
        },
        {
            "text": "Nothing like that has happened since then, as far as I know. You can try to raise VC money, but that means you become a platform and lock users in, and ultimately sell out and your product disappears. If you want real longevity there is no answer now beyond 1-in-a-million luck.",
            "created": "Wed, 28 Dec 2022 13:36:41 GMT",
            "flInCalendar": true
        },
        {
            "text": "I'm at a personal crossroads. \"FeedLand\" is an excellent product, ground-breaking, imho just what we need. I'd like to continue adding features and fixing bugs and working with users and other developers. But over time as we get more users, my job increasingly becomes administrative and gruntwork. Taking me far away from my personal strengths and where I personally want to go. ",
            "created": "Wed, 28 Dec 2022 13:41:26 GMT",
            "flInCalendar": true
        },
        {
            "text": "Writing on the web could be much better than it is. I have always believed that the web was the ultimate writers platform. But if every means of distribution requires that you use their writing tools, it can't come close to its potential. ",
            "created": "Wed, 28 Dec 2022 13:43:17 GMT",
            "flInCalendar": true
        },
        {
            "text": "Here's a paragraph from a <a href=\"http://scripting.com/2022/12/24/162940.html\">recent piece</a>. I think it concisely explains what's wrong with our world, and how we'll know when it's working properly. It's short, just one sentence. ",
            "created": "Wed, 28 Dec 2022 13:44:58 GMT",
            "collapse": "false",
            "subs": [
                {
                    "text": "<a href=\"https://mastodon.social/@davew/109569601727623937\" style=\"color: inherit\"><i>We'll know it's working if most people feel their best place to write is their blog, where the editing tools work just as they like them to, and there are no boundaries to where those ideas can be published.</i></a>",
                    "created": "Sat, 24 Dec 2022 16:30:48 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "You could substitute <i>blog</i> for any other word you like. The point is writers shouldn't be forced to write in a tiny little box. We should be able to title a story, if it requires one, and leave out the title if it's not needed. I should be able to edit after I publish. We should always be able to link to other stories, or enclose a podcast. Simple styling, <b>bold</b> and <i>italic</i>, standard features of our writing tools since 1984, should be present in all our publishing environments. And publishing should never require the writer to become a clerk. None of this, in 2023, will be hard or even challenging, from a tech standpoint.",
            "created": "Wed, 28 Dec 2022 13:47:35 GMT",
            "flInCalendar": true
        },
        {
            "text": "It should be easy because it <i>can</i> be easy. ",
            "created": "Wed, 28 Dec 2022 14:11:27 GMT",
            "flInCalendar": true
        },
        {
            "text": "We had all this before the web. It's so ironic that with the business models that evolved on the web, which should have been so transformative for writers, that we had to give all this up. And what did we get in return? As far as I can see -- nothing. ",
            "created": "Wed, 28 Dec 2022 13:49:38 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}