{
    "text": "What if Bezos bought Twitter?",
    "created": "Tue, 03 Apr 2018 13:39:32 GMT",
    "type": "outline",
    "description": "'What if Jeff Bezos bought Twitter with the change in his pocket and shut Trump's account?'",
    "subs": [
        {
            "text": "Today on Twitter, former US Attorney <a href=\"https://twitter.com/PreetBharara/status/981015547126140929\">Preet Bharara</a> dreams: \"What if Jeff Bezos bought Twitter with the change in his pocket and shut Trump's account?\" ",
            "created": "Tue, 03 Apr 2018 13:39:38 GMT",
            "urltweet": "https://twitter.com/PreetBharara/status/981015547126140929"
        },
        {
            "text": "Twitter's <a href=\"https://finance.yahoo.com/quote/TWTR/\">market cap</a> is $21 billion, and Bezos or some other very rich person <i>could</i> buy them. But it would be a problem if the new owner interfered with the content of Twitter. Because, as with a trade war, it would invite retaliation. And isn't it good that we can keep tabs on Trump through his public tweetings? Would you rather he only rant privately? I wouldn't. Remember the president has an incredibly powerful podium, with or without Twitter, he will be heard over us. Consider this <a href=\"https://www.washingtonpost.com/opinions/jill-mccabe-the-president-attacked-my-reputation-its-time-to-set-the-record-straight/2018/04/02/e6bbcf66-366b-11e8-8fd2-49fe3c675a89_story.html?utm_term=.b1fb8073404c\">piece</a> by Jill McCabe, an emergency room pediatrician, married to former FBI deputy director Andrew McCabe, as she defends her family from attacks from the president. Consider the power Trump has with or without Twitter to ruin lives. ",
            "created": "Tue, 03 Apr 2018 13:40:05 GMT"
        },
        {
            "text": "I <a href=\"https://twitter.com/davewiner/status/981161916189040645\">responded</a>, on Twitter: \"It's just as easy to imagine the Koch Brothers buying Twitter and shutting down <i>your</i> account. This is a weakness that we all have with Twitter being so vulnerable yet so indispensable.\" ",
            "created": "Tue, 03 Apr 2018 13:43:09 GMT",
            "urltweet": "https://twitter.com/davewiner/status/981161916189040645"
        },
        {
            "text": "PS: I've long wanted Amazon to either buy or create a competitor to Twitter, so we could have <a href=\"http://scripting.com/2016/04/28/1223.html\">Twitter-as-a-service</a>. It would be very nice. ",
            "created": "Tue, 03 Apr 2018 13:50:07 GMT"
        }
    ]
}