{
    "text": "Well, <a href=\"https://www.theverge.com/2023/10/27/23935436/meta-threads-platform-online-public-conversations\">Facebook is aiming to replace Twitter</a> with <a href=\"https://www.threads.net/\">Threads</a>, and while I haven't been using it, it has become more useful. There's now a web client, the lack of which was holding me back, but now it's there and it's good, well-designed, attractive, all the things that Twitter isn't now that Elon Musk as renamed it X and effectively turned off API access. Mastodon is still a maze of federation, which some users still seem to think is a positive thing, but honestly, Facebook (they call themselves Meta now) has a better product, all the <a href=\"https://imgs.scripting.com/2023/10/28/thisIsYourHomeBase.png\">federation michegas</a> on Masto makes it a mess. Facebook <i>will</i> replace Twitter if all the web can muster as an alternative is Masto. Oh but the FB folk say don't worry, we're going to support ActivityPub. The way this works is they can hold off the fear by just saying they'll do something, without explaining how or when it'll work. And they could change their mind, or somehow never get around to shipping. I've been in tech since the 70s, and I've seen this movie a few times. It's like the <a href=\"https://en.wikipedia.org/wiki/The_Godfather\">Godfather</a>, which <a href=\"https://www.youtube.com/watch?v=1zBwKbq02ds\">always ends exactly the same way</a>. If we want to have a social media web that is not dominated by Facebook, it's time to face reality now and get into motion on <a href=\"http://scripting.com/2015/06/24/keyConceptOfTheOpenWebWorkingTogether.html\">working together</a>. Otherwise there will be nothing to celebrate as we face the new boss, as they say, <a href=\"https://www.youtube.com/watch?v=zYMD_W_r3Fg\">same as the old boss</a>. ",
    "created": "Sat, 28 Oct 2023 13:54:27 GMT",
    "type": "outline",
    "image": "https://imgs.scripting.com/2023/10/28/wontGetFooledAgain.png",
    "flInCalendar": true
}