{
    "text": "Selfless?",
    "created": "Sun, 28 May 2023 17:13:36 GMT",
    "type": "outline",
    "description": "A person with no sense of self is not a person. ",
    "subs": [
        {
            "text": "We always assume <a href=\"https://chat.openai.com/share/df64b507-966b-459f-b76a-ddd5845394b8\">selflessness</a> is a good thing, but I'm not sure. In certain situations, telling a lie to save someone's life, that's probably the right thing to do, but lying to spare someone's feelings? They'll be upset if you tell the truth so you don't. ",
            "created": "Sun, 28 May 2023 17:18:02 GMT",
            "image": "http://scripting.com/images/2021/12/24/dontLookUp.png",
            "flInCalendar": true
        },
        {
            "text": "I grew up in a house where you had to manage other people's feelings. It was so dirty and I hated it so much. I had serious stomach issues as a kid, that suddenly went away when I was no longer living in that house. But being selfless meant I had to spare everyone else's feelings, and as result, betray myself, hurt myself, act selfless, as in my \"self\" doesn't exist. But outside the family, I was surprised to find that I actually did have a self.  And that is when I <i>started</i> feeling like a person. Started, I still had a long way to go.",
            "created": "Sun, 28 May 2023 17:18:30 GMT",
            "flInCalendar": true
        },
        {
            "text": "It wasn't until many years later that I discovered these patterns everywhere in my life, just not so suffocating as the ones in my childhood home. I was always clashing against this, because I wanted to do important creative things with my life, and as they say -- you can't lie to a compiler, garbage in, garbage out.",
            "created": "Sun, 28 May 2023 17:19:23 GMT",
            "flInCalendar": true
        },
        {
            "text": "This is a hot topic here because I've listened through the <a href=\"https://500songs.com/podcast/episode-165-dark-star-by-the-grateful-dead/\">500 Songs episode</a> about the Grateful Dead, all four hours 40 minutes of it, and learned how the selflessness  destroyed their gift. The fans and their employees made demands, and the band gave them what they wanted. I had never heard the story of the Dead told this way, but it matches up with the facts I have from living through that period myself, and going to quite a few Dead shows, and being one step removed from people who worked in the Dead company, and almost dying myself from similar kinds of pressure. Ultimately if you want to live, you have to not be selfless. ",
            "created": "Sun, 28 May 2023 19:26:16 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}