{
    "text": "February 1",
    "created": "Sat, 01 Feb 2020 14:58:05 GMT",
    "name": "01",
    "subs": [
        {
            "text": "\"LO2\" v1.8.5 is released. Here are the <a href=\"http://this.how/littleoutliner/versions.opml#1580502471000\">update notes</a> for this version. Cmd-return and Cmd-backspace to split one item in two, and join adjacent paragraphs. New icon toggles HTML code between visible and invisible. Post any bug reports in <a href=\"https://github.com/scripting/Scripting-News/issues/150\">this thread</a>.",
            "created": "Sat, 01 Feb 2020 17:43:48 GMT",
            "type": "outline"
        },
        {
            "text": "It'd be <a href=\"https://twitter.com/davewiner/status/1223706740010733570\">interesting</a> if they broke down the vote in the Senate.",
            "created": "Sat, 01 Feb 2020 20:44:50 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1223706740010733570"
        },
        {
            "text": "I'm reviewing docs and little issues re the \"LO2\" release. Looking for an example of a status center, I found <a href=\"http://scripting.com/status/\">Dave's Dev Status</a>. Forgot I had set this up. <a href=\"http://lo.1999.io/2017/02/02/statusCenters.html\">You can create</a> one with LO2. ",
            "created": "Sat, 01 Feb 2020 15:52:18 GMT",
            "type": "outline"
        },
        {
            "text": "I am gradually switching off Dropbox, and wrote a piece of software called \"Public Folder\" to sync with Amazon S3. Despite its name it works for private stuff too. I use it for all my this.how docs and a few other projects. Works great. ",
            "created": "Sat, 01 Feb 2020 20:42:05 GMT",
            "type": "outline"
        },
        {
            "text": "When I read an article about online \"bernie bros\" -- I wonder if the author remembers not to trust the intent of people who tweet at them. We learned this in 2016. Trolls try to divide us, they enflame both sides. I would never trust a \"bernie bro\" to be an actual person. ",
            "created": "Sat, 01 Feb 2020 15:59:02 GMT",
            "type": "tweet",
            "tweetId": "1223637438163292162",
            "tweetUserName": "davewiner"
        },
        {
            "text": "The monthly ritual. The <a href=\"https://github.com/scripting/Scripting-News/blob/master/blog/opml/2020/01.opml\">OPML</a> for January 2020 is uploaded. ",
            "created": "Sat, 01 Feb 2020 14:58:06 GMT",
            "type": "outline"
        },
        {
            "text": "Wow people really like the <a href=\"https://twitter.com/davewiner/status/1223625244486852608\">Dress Rehearsals for Election Day</a> idea. Proves that there's a right time for an idea. I've been beating this drum for a long time!",
            "created": "Sat, 01 Feb 2020 16:01:16 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1223625244486852608"
        },
        {
            "text": "Voters support candidates who say the things they say the way they say them.",
            "created": "Sat, 01 Feb 2020 16:52:32 GMT",
            "type": "outline"
        },
        {
            "text": "What about the courts?",
            "created": "Sat, 01 Feb 2020 20:17:52 GMT",
            "type": "outline",
            "description": "Soon enough the courts will have to rule on whether the president is a monarch.",
            "subs": [
                {
                    "text": "I was wondering how the courts will incorporate the <a href=\"https://en.wikipedia.org/wiki/Impeachment_trial_of_Donald_Trump\">Senate's decision</a> into their interpretation of the Constitution. ",
                    "created": "Sat, 01 Feb 2020 20:18:07 GMT"
                },
                {
                    "text": "Will they judge the executive as if the president is a monarch now?",
                    "created": "Sat, 01 Feb 2020 20:30:40 GMT"
                },
                {
                    "text": "They can't overrule the Senate, that seems clear from the Constitution.",
                    "created": "Sat, 01 Feb 2020 20:18:24 GMT"
                },
                {
                    "text": "Another question. What will the Repubs in the Senate do if/when Trump pushes the boundaries. For example, suppose he has a journalist killed. Lots of witnesses. He admits it. Assuming the House impeaches him, what does the Senate do? ",
                    "created": "Sat, 01 Feb 2020 20:18:24 GMT"
                },
                {
                    "text": "A less radical hypothetical. What if he arrests Hillary Clinton for interfering with his re-election. Seems likely that will go to court. Say the Supreme Court rules this is illegal or unconstitutional. Will Trump respect that even though the Senate appears to have said it's OK.",
                    "created": "Sat, 01 Feb 2020 20:19:15 GMT"
                },
                {
                    "text": "I imagine the scholars and judges are thinking about this now. This has been a precedent-setting trial. If they actually do acquit him when no one contests the truth, it appears the only part of the government that objects is the House. It seems the question will be raised in the courts as well. It'll appear on Roberts' desk before too long. Is the president really a king?",
                    "created": "Sat, 01 Feb 2020 20:25:38 GMT"
                }
            ]
        }
    ]
}