{
    "text": "February 2",
    "created": "Sun, 02 Feb 2020 15:16:46 GMT",
    "name": "02",
    "subs": [
        {
            "text": "The only football team I've ever been a fan of, the <a href=\"https://en.wikipedia.org/wiki/San_Francisco_49ers\">San Francisco 49ers</a>, is in tonight's SuperBowl. I'm angry and frustrated that the NFL won't hire former Niners quarterback <a href=\"https://en.wikipedia.org/wiki/Colin_Kaepernick\">Colin Kaepernick</a>. I also remember the intellect, wisdom, character, professionalism, talent and luck of the Niners of the 80s and 90s. So just for tonight, I'll be a football fan again. Go Niners! :football:",
            "created": "Sun, 02 Feb 2020 22:32:29 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/02/02/kaepernick.png"
        },
        {
            "text": "New \"Little Outliner\" out <a href=\"http://scripting.com/2020/02/01.html#a174348\">yesterday</a>. Report problems <a href=\"https://github.com/scripting/Scripting-News/issues/150\">here</a>. ",
            "created": "Sun, 02 Feb 2020 15:16:47 GMT",
            "type": "outline"
        },
        {
            "text": "BTW, to tech-savvy users who are regulars here. Please pitch in and help test the new <a href=\"http://scripting.com/2020/02/01.html#a174348\">release</a> of \"LO2\". As you can see from the <a href=\"https://github.com/scripting/Scripting-News/issues/150\">thread</a> on GitHub, the problems tend to be technical, though the typical user of the <a href=\"http://cribsheet.opml.org/\">outliner</a> is not. If you've looked for a way to pitch in, this is where I need the most help. Keep an outline on \"LO2\". When there's a new release try editing it. Do the changes stick when you reload the page? Try creating a new outline. Open an existing one. Log off and log on. Go through the menus and try all the commands. We're looking for breakage, something that used to work but because of changes doesn't work now. A lot of stuff changed in this release. But most of it isn't visible to users. Help me out. This is foundational work. I need LO2 to work for people, smoothly. Thanks.",
            "created": "Sun, 02 Feb 2020 19:20:32 GMT",
            "type": "outline"
        },
        {
            "text": "We have <a href=\"https://github.com/scripting/Scripting-News/issues/150#issuecomment-581178712\">a lot more data</a> on the problem. ",
            "created": "Sun, 02 Feb 2020 21:22:39 GMT",
            "type": "outline"
        },
        {
            "text": "Trump is picking a fight with Michael Bloomberg, re his height. <a href=\"https://twitter.com/ginasmith888/status/1224037007673815040\">Gina Smith</a> points out that Bloomberg is an inch taller than Putin. Heh. And then I read that Bloomberg's spokesperson, Julie Wood (a woman, this is important) said this: \"The president is lying. He is a pathological liar who lies about everything: his fake hair, his obesity, and his spray-on tan.\"  You know, this is the first time in four years Trump has been in presidential politics, talking about people's bodies and demeanor, that someone has come back at him with this line of attack, which is totally valid. When you're being bullied by someone so obviously vulnerable, give it back to him. It's even <s>worse</s> better when a woman says a man is a liar, bald, fat, and wears makeup. Trust me on that. :boom:",
            "created": "Sun, 02 Feb 2020 18:43:57 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/01/31/kingTrumpSmall.png"
        },
        {
            "text": "Bloomberg's campaign manager has a killer idea in <a href=\"https://www.washingtonpost.com/opinions/2019/12/17/michael-bloombergs-campaign-manager-trump-is-winning-race-democrats-dont-realize-it/\">this podcast</a> starting at around 8:30. Here's the spoiler. The first Democratic primaries should be in Pennsylvania, Florida, Wisconsin and Michigan. What an advantage that would be in November",
            "created": "Sun, 02 Feb 2020 15:47:30 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://talkingpointsmemo.com/news/lamar-alexander-impeachment-witness-vote-election-year\">Lamar Alexander's story</a> doesn't add up. If it's up to the voters, can we have the information we need to make a decision. Bolton's testimony is vital. As is the documentary evidence. I've served on a jury all the way to verdict, so I know how this works.",
            "created": "Sun, 02 Feb 2020 15:32:05 GMT",
            "type": "outline"
        },
        {
            "text": "I asked Alexa what time the Superbowl starts. 6:30PM kickoff.",
            "created": "Sun, 02 Feb 2020 15:35:58 GMT",
            "type": "outline"
        },
        {
            "text": "To Amazon. I'd like to be able to say \"Alexa record a podcast.\" When I'm done I say \"Alexa stop.\" She mails a link to the MP3 to me. Bing.",
            "created": "Sun, 02 Feb 2020 15:36:30 GMT",
            "type": "tweet",
            "tweetId": "1223993879315263489",
            "tweetUserName": "davewiner"
        },
        {
            "text": "For everyone who thinks Trump is stained forever by impeachment.",
            "created": "Sun, 02 Feb 2020 16:21:59 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/02/02/historyAndItsJudgment.png"
        },
        {
            "text": "Bojack finale, initial thoughts",
            "created": "Sun, 02 Feb 2020 19:00:35 GMT",
            "type": "outline",
            "description": "Contains spoilers.",
            "subs": [
                {
                    "text": "Quick thoughts on the finale of <a href=\"https://www.metacritic.com/tv/bojack-horseman/season-6\">Bojack</a>. Spoilers follow. I think they planned the second-to-last episode as the actual final episode. Had they done that I would have said who ever thought a comedy like Bojack Horseman would try something so ambitious, and even better, pull it off. But they added one more plot twist, it's really hard to parse, and the rest of the final episode is weird and repetitive, and at the end punts the ending. Still a groundbreaking show that's often LOL funny. I <a href=\"http://scripting.com/2015/08/30/whyYouMustWatchBojackHorseman.html\">wish</a> all my friends would watch it so we can talk about it. Now I'll take some time and read the <a href=\"https://www.metacritic.com/tv/bojack-horseman/season-6\">reviews</a>.",
                    "created": "Sun, 02 Feb 2020 18:56:29 GMT",
                    "image": "http://scripting.com/2015/08/30/bojack.png"
                }
            ]
        }
    ]
}