{
    "text": "February 3",
    "created": "Mon, 03 Feb 2020 15:01:06 GMT",
    "name": "03",
    "subs": [
        {
            "text": "If you get a chance, please listen to <a href=\"https://twitter.com/RepAdamSchiff/status/1224428088953581569\">Adam Schiff's closing speech</a> in the impeachment trial. I have a feeling a lot of people didn't hear this historic, passionate plea for America. The Repubs in Congress aren't listening, but we imho must. It's really right up there with JFK's inauguration speech in <a href=\"https://en.wikipedia.org/wiki/Inauguration_of_John_F._Kennedy\">1961</a>. Thanks to Schiff and the House Democrats for standing up for America.",
            "created": "Tue, 04 Feb 2020 02:23:17 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/RepAdamSchiff/status/1224428088953581569"
        },
        {
            "text": "And then there was <a href=\"https://twitter.com/KejeraL/status/1224495466009841671\">Bernie walking</a> to the tune of <a href=\"https://www.youtube.com/watch?v=I_izvAbhExY\">Stayin Alive</a>. ",
            "created": "Tue, 04 Feb 2020 02:31:59 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=I_izvAbhExY"
        },
        {
            "text": "Complaining that Bloomberg is an <a href=\"https://www.mediaite.com/tv/msnbc-contributor-clashes-with-bernie-campaign-co-chair-nina-turner-after-she-blasts-bloomberg-as-an-oligarch/\">oligarch</a> in the age of Citizens United is like (I was trying to think of an analogy and failed) ridiculous. Of course he's an oligarch. And his ads are good Democratic values ads. He knows how to market. Kick back and thank god someone does. (This was the beginning of a <a href=\"https://twitter.com/davewiner/status/1224522337288171522\">long rant</a> on Twitter. Enjoy!)",
            "created": "Tue, 04 Feb 2020 02:38:45 GMT",
            "type": "outline"
        },
        {
            "text": "I used to call for presidential candidates to try to work with Repubs, but that's changed since Friday's vote re evidence for impeachment. They are complicit, as corrupt as the president. There is no working with any Republican who is in Congress at this time. ",
            "created": "Mon, 03 Feb 2020 16:38:45 GMT",
            "type": "outline"
        },
        {
            "text": "Over on Facebook Terry Heaton <a href=\"http://scripting.com/images/2020/02/03/terry.png\">posted a screed</a> in support of Jennifer Lopez in last night's SuperBowl halftime show. To me it was a big meh. I find those kinds of <a href=\"https://en.wikipedia.org/wiki/List_of_Super_Bowl_halftime_shows#1960s\">shows</a> unimpressive, the music not interesting. I came to watch football, not dance. I'm not kidding. Even Prince, the Stones, Bruce, etc didn't get me off. I was in the kitchen during the <a href=\"https://en.wikipedia.org/wiki/Wardrobe_malfunction\">wardrobe malfunction</a>. But -- Terry's post is noteworthy because he ends it with this line: \"America is facing the destruction of our democracy, and we're worried about this?\" We should make a button out of that. Tatoo it on our forehead so we see it in the mirror. We need to be <i>good</i> to each other, find ways to combine our power, not minimize it. Let's go Mets! and thanks for listening. ",
            "created": "Mon, 03 Feb 2020 16:00:16 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/02/03/jenniferLopez.png"
        },
        {
            "text": "A <a href=\"https://github.com/scripting/Scripting-News/issues/151\">question</a> about how \"LO2\" captures keystrokes. ",
            "created": "Mon, 03 Feb 2020 16:59:26 GMT",
            "type": "outline"
        },
        {
            "text": "It turns out the <a href=\"https://github.com/scripting/Scripting-News/issues/150#issuecomment-581407743\">source</a> of the problem that a user was experiencing with the new version of \"Little Outliner\" was <a href=\"https://www.eff.org/privacybadger\">Privacy Badger</a> from EFF. I gather it's something that a user can disable, so if you have \"LO2\" and you're running Privacy Badger, you should disable their distrust of scripting.com and then LO2 should work as it should. ",
            "created": "Mon, 03 Feb 2020 15:01:07 GMT",
            "type": "outline"
        },
        {
            "text": "What's really sad is that the user doesn't get an <a href=\"http://scripting.com/images/2020/02/03/privacyBadgerMessage.png\">error message</a> that they can pass on to support so we can avoid having the user go to the JavaScript console (an unnatural act for most of our users) to find the error that's causing the app not to load. ",
            "created": "Mon, 03 Feb 2020 15:22:37 GMT",
            "type": "outline"
        },
        {
            "text": "I have to say <a href=\"https://en.wikipedia.org/wiki/Electronic_Frontier_Foundation\">EFF</a> has been a constant bummer and pain in the ass. For an organization that I should be able to support (and have, see below), they are always doing shit like this. When they sued the guy who claimed to have invented podcasting, they didn't respond to my emails or blog posts begging them not to take the approach they took. I felt it's important to get on the record how media types like podcasting come about. They didn't care. So much for being on the electronic frontier. It seems to me we should be on the same side in everything, and when we're not we should listen to each other. I gave the EFF $5K, which was then and is now a lot of money for me, when they were founded by Mitch Kapor, John Gilmor and John Perry Barlow, in 1990. I believe in the mission, but often do not believe in the implementation. Thanks for listening.",
            "created": "Mon, 03 Feb 2020 15:07:37 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/02/02/kaepernick.png"
        },
        {
            "text": "My <a href=\"http://this.how/myTimelineOfText/\">timeline</a> of text-related work. Adding stuff as I remember.",
            "created": "Mon, 03 Feb 2020 20:30:36 GMT",
            "type": "outline"
        },
        {
            "text": "Here's the plan",
            "created": "Tue, 04 Feb 2020 03:11:35 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "1. Let Trump run wild but make sure the election still happens.",
                    "created": "Tue, 04 Feb 2020 03:11:49 GMT"
                },
                {
                    "text": "2. Democrat wins."
                },
                {
                    "text": "3. Disbands Congress and the Supreme Court."
                },
                {
                    "text": "4. Writes a new Constitution."
                },
                {
                    "text": "5. No more bullshit. The cities rule. Country folk can fuck off."
                },
                {
                    "text": "End of story.",
                    "created": "Tue, 04 Feb 2020 03:12:01 GMT"
                }
            ]
        }
    ]
}