{
    "text": "February 21",
    "created": "Fri, 21 Feb 2020 13:53:24 GMT",
    "name": "21",
    "subs": [
        {
            "text": "I buy too many domains. Latest: <a href=\"http://textonrails.com/\">textonrails.com</a>. ",
            "created": "Fri, 21 Feb 2020 19:53:59 GMT",
            "type": "outline"
        },
        {
            "text": "Doc posts a monster thread from \"LO2\" to twitter. Here's the <a href=\"https://twitter.com/dsearls/status/1230970208308858880\">thread</a>, and the <a href=\"http://instantoutliner.com/gx\">outline</a>. I just made a small change to the reader so that when you click on a tweet node, it opens the tweet in Twitter. ",
            "created": "Fri, 21 Feb 2020 22:15:19 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://twitter.com/JoeTrippi/status/1230921062839353347\">Joe Trippi</a>: \"Here’s an idea.  Why not hold House hearings on what every American should watch for and be on guard against in terms of how Russia or any other foreign actor tries to influence our election?   Or maybe a network do a one hour special?  No one knows what meddling means.\"",
            "created": "Fri, 21 Feb 2020 19:14:49 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/JoeTrippi/status/1230921062839353347"
        },
        {
            "text": "Meddlers enhance divisions. Start with a crack, and grow it. Look at how Bloomberg is being invalidated. He's a powerful force in Democratic politics. In whose interest is it to undermine that? They have to be investing in that. The meddlers, whoever they are.",
            "created": "Fri, 21 Feb 2020 19:40:07 GMT",
            "type": "tweet",
            "tweetId": "1230940551505227777",
            "tweetUserName": "davewiner"
        },
        {
            "text": "2019: <a href=\"http://scripting.com/2019/04/14/163655.html\">Instant tech bootcamps for journalism</a>.",
            "created": "Fri, 21 Feb 2020 22:24:47 GMT",
            "type": "outline"
        },
        {
            "text": "Bloomberg, part 3",
            "created": "Fri, 21 Feb 2020 13:53:25 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Bloomberg was NYC mayor after 9/11, during and after the 2008 financial crisis and Hurricane Sandy. The city recovered from all, though we could discuss his mistakes during all.",
                    "created": "Fri, 21 Feb 2020 13:53:42 GMT"
                },
                {
                    "text": "In the debate we should’ve talked about how we’re going to restore Congress, rule of law, the Constitution, courts in the aftermath of Trump, which will be like all three NYC disasters Bloomberg dealt with.",
                    "created": "Fri, 21 Feb 2020 13:53:50 GMT"
                },
                {
                    "text": "I don’t think Bloomberg had any possible response to Warren's attacks, any more than Al Franken could respond to the attacks that forced him to resign.",
                    "created": "Fri, 21 Feb 2020 13:54:06 GMT"
                },
                {
                    "text": "We need all hands on deck to rebuild after the superstorm terrorist attack happening <i>right now</i> in the US. Bloomberg will be part of that, whether or not he's the candidate.",
                    "created": "Fri, 21 Feb 2020 13:54:15 GMT"
                },
                {
                    "text": "The greed and selfishness on that stage was appalling. From Warren and Sanders, who I will vote against every chance I get (except if the other choice is trump of course). ",
                    "created": "Fri, 21 Feb 2020 13:54:22 GMT"
                }
            ]
        }
    ]
}