{
    "text": "February 23",
    "created": "Mon, 24 Feb 2020 00:55:10 GMT",
    "name": "23",
    "subs": [
        {
            "text": "I just finished <a href=\"https://en.wikipedia.org/wiki/Long_Strange_Trip\">Long Strange Trip</a>, a documentary about the Grateful Dead. Beautifully done. I went to a lot of Dead shows, going back to the early 70s, on both coasts and in Madison, but never considered myself a Deadhead. I liked a lot of other bands. But I keep coming back to the Dead. Their songs are anthems for my life and work. I think we should play <a href=\"https://www.youtube.com/watch?v=rdPOAhBp2Ag\">US Blues</a> at baseball games and Fourth of July picnics. That's the America I come from. And of course the incredibly versatile slogan of this blog is from Touch of Grey. That one line is full of so much meaning, but yet so are many lines from many Dead songs. ",
            "created": "Mon, 24 Feb 2020 00:55:11 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/02/23/stealYourFace.png",
            "urlvideo": "https://www.youtube.com/watch?v=rdPOAhBp2Ag"
        },
        {
            "text": "Maybe Twitter should offer the option of no-replies on a message by message basis. You can RT my post if you want, but I'm not interested in spam. ",
            "created": "Mon, 24 Feb 2020 01:10:11 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"bangbangcon.com/index.html\">!!Con 2020</a> -- The joy, excitement and surprise of computing.  ",
            "created": "Mon, 24 Feb 2020 01:09:04 GMT",
            "type": "outline"
        },
        {
            "text": "I watched the MSNBC segment where Chris Matthews and Joy Reid talked about the disaster that Sanders is as a candidate. I thought it was fine. I think they should do more of that. I want to hear what they think out in the open instead of between the lines. ",
            "created": "Mon, 24 Feb 2020 01:16:44 GMT",
            "type": "outline"
        },
        {
            "text": "Also I'm not sure <a href=\"https://twitter.com/AnandWrites/status/1231622488204959744\">Anand Giridharadas</a> is right. We've been through this before. Eugene McCarthy, George McGovern, Jimmy Carter, John Anderson, Barack Obama. All these candidates had Sanders-like pitches. I'm transformative, they said. When I am president, everything will change. Problem is if they actually believe it and are elected, they and we are fucked. They turn out most definitely not to be transformative. The United States is a huge ship and it takes a lot of compromise and time to get it to turn. Giridharadas points out that Sanders is the son of a Holocaust survivor, well, so am I, and I don't like <a href=\"https://en.wikipedia.org/wiki/Hail_Mary_pass\">Hail Mary passes</a> unless that's the only option left. This is not a normal election, and Sanders is way too risky. We need to get solidly off the path we're on, bringing as many people as possible along with us. Then let's go for a Sanders-like candidate, maybe when <a href=\"https://twitter.com/AOC\">AOC</a> is old enough to run for president. ",
            "created": "Mon, 24 Feb 2020 01:10:02 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/02/23/ronaldMcDonaldWithBomb.png"
        }
    ]
}