{
    "text": "February 24",
    "created": "Mon, 24 Feb 2020 15:01:26 GMT",
    "name": "24",
    "subs": [
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=LJiNeNestYo\">Video demo</a> of a feature coming soon in \"LO2\", probably tomorrow. You can load in all your tweets for the day. Makes it easy to use Twitter as a place to record ideas that then flow through your outline.",
            "created": "Mon, 24 Feb 2020 18:22:55 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=LJiNeNestYo"
        },
        {
            "text": "We’ve been working on news on the web for 25 years, and given the bandwidth of the network, the power and capacity of servers, and the incredible devices we carry with us, that news on the net is such a miserable experience. Clearly something is very wrong. ",
            "created": "Tue, 25 Feb 2020 01:07:23 GMT",
            "type": "tweet",
            "tweetId": "1232110152834330624",
            "tweetUserName": "davewiner"
        },
        {
            "text": "I've long felt that the niche occupied by <a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+heroku&t=h_&ia=web\">Heroku</a> is under-explored. It looks like <a href=\"https://glitch.com/coming-soon\">Glitch is going there</a>. Good. ",
            "created": "Mon, 24 Feb 2020 16:16:52 GMT",
            "type": "outline"
        },
        {
            "text": "Since socialism is going to be a big \"issue\" for the foreseeable future, let me offer two pieces I wrote on the subject. First, <a href=\"http://scripting.com/stories/2011/01/01/theWorldIsSocialist.html\">The world is socialist</a> in 2011. \"Ayn Rand's philosophy might have worked in an agrarian society when people lived far apart, and couldn't pool their resources. When there wasn't much technology, so there wasn't much point in trying to fight disease or keep the trains running, because there was no medicine or trains.\" And <a href=\"http://scripting.com/2017/03/08/theWorldIsSocialistPartIi.html\">Health care is socialist</a> in 2017. \"We don't know who will get sick, or when. So rather than take a risk that you'll be the one who gets the expensive disease, we pool our resources to pay a share of what the treatment would cost each year.\" I put \"issue\" in quotes because it isn't a real issue. Everything is socialist, it has to be, there is no other way. So it's redundant to say someone is a socialist. We all are. ",
            "created": "Mon, 24 Feb 2020 20:17:53 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/03/17/amyKlobuchar.png"
        },
        {
            "text": "Is it any wonder that the presidential nominating process has become a weekly reality show, in every way. ",
            "created": "Mon, 24 Feb 2020 16:42:36 GMT",
            "type": "tweet",
            "tweetId": "1231982809557893120",
            "tweetUserName": "davewiner"
        },
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=gq7nxvAPS-c\">Ladies and gentlemen</a>, Rush Limbaugh!",
            "created": "Mon, 24 Feb 2020 19:58:26 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=gq7nxvAPS-c"
        },
        {
            "text": "Maybe the NYT was always <a href=\"https://twitter.com/joanwalsh/status/1231907067516067842\">this</a> stupid, and we were too young and stupid ourselves to notice?",
            "created": "Mon, 24 Feb 2020 16:41:25 GMT",
            "type": "outline"
        },
        {
            "text": "The seatbelt on my Subaru",
            "created": "Mon, 24 Feb 2020 15:01:27 GMT",
            "type": "outline",
            "description": "The seatbelt gets stuck in the door, the battery dies, and the dealer wants me to pay to fix it.",
            "subs": [
                {
                    "text": "I bought a new 2019 Subaru Forester about a year ago. It works pretty well. There are things that could work better, but I like it. It's a good car for where I live, in the mountains north of NYC. But it's not perfect. About the half the time the driver seatbelt gets stuck in the door. It was a hassle until now, but all the buckle slamming has broken a sensor built into the door. The car's electronics thinks the door is always open even when it's closed. ",
                    "created": "Mon, 24 Feb 2020 15:01:35 GMT",
                    "image": "http://scripting.com/images/2020/02/24/subaruForester.png"
                },
                {
                    "text": "Now the battery runs down overnight and the car requires a jump start. And all the alarms are ringing when I'm driving. ",
                    "created": "Mon, 24 Feb 2020 15:07:30 GMT"
                },
                {
                    "text": "I took the car in for service. It's still under warranty, but Subaru wants me to pay for the repair. Estimate $500. ",
                    "created": "Mon, 24 Feb 2020 15:04:20 GMT"
                },
                {
                    "text": "I can't imagine what they think I'm doing. ",
                    "created": "Mon, 24 Feb 2020 15:10:11 GMT"
                },
                {
                    "text": "They say they can't reproduce the problem. ",
                    "created": "Mon, 24 Feb 2020 15:05:17 GMT"
                },
                {
                    "text": "Seems to me it's a design flaw. ",
                    "created": "Mon, 24 Feb 2020 15:05:30 GMT"
                },
                {
                    "text": "This is where we're stuck.",
                    "created": "Mon, 24 Feb 2020 15:05:31 GMT"
                }
            ]
        }
    ]
}