{
    "text": "February 25",
    "created": "Tue, 25 Feb 2020 15:12:59 GMT",
    "name": "25",
    "subs": [
        {
            "text": "<a href=\"http://this.how/littleoutliner/versions.opml#1582640454000\">Change notes</a> for Little Outliner v1.8.9. New Tools menu. <i>Get my tweets</i> command. Defends against multiple instances of \"LO2\" open at the same time. ",
            "created": "Tue, 25 Feb 2020 15:33:54 GMT",
            "type": "outline"
        },
        {
            "text": "Does <a href=\"http://isrssdead.com/\">RSS</a> need a song? Maybe <a href=\"https://www.youtube.com/watch?v=3aeQ3DmKU7A\">this one</a>. ",
            "created": "Tue, 25 Feb 2020 16:23:52 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=3aeQ3DmKU7A"
        },
        {
            "text": "How about a <a href=\"https://twitter.com/BritVoxUS/status/1232342925092081664\">puppy</a> playing with an ice cube?",
            "created": "Tue, 25 Feb 2020 17:04:05 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/BritVoxUS/status/1232342925092081664"
        },
        {
            "text": "If your strategy is that young voters will take you to victory there's a problem with that because young voters don't actually vote.",
            "created": "Tue, 25 Feb 2020 17:02:09 GMT",
            "type": "outline"
        },
        {
            "text": "Why didn't the NYT when it started on the web in the 90s try to do what Wikipedia has done? I have to admit, I didn't think of it at the time either, to me the function of a news org was to start fresh once a day. But this was always part of the potential of the web, create a base of info at the same time as flowing the new stuff. That's actually where we went with <a href=\"https://www.google.com/search?q=site%3Ascripting.com+lbbs\">LBBS</a> in the 80s. Did you know I was doing BBS software then? I was. Today I wish we had software that made it easy to build an index as we go. It's always in the back of my mind. I remember when we were publishing books (also in the 80s) we learned how to do indexes of paper books. The same approach would work for blogs or news.  ",
            "created": "Tue, 25 Feb 2020 16:02:46 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/02/25/starTrekCharacter.png"
        },
        {
            "text": "<a href=\"https://twitter.com/owillis/status/1232335978339143680\">Senator Kennedy</a>, I am the actor they hired to play the DHS secretary. I say nice things about the president, and that's about it.",
            "created": "Tue, 25 Feb 2020 16:19:08 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/owillis/status/1232335978339143680"
        },
        {
            "text": "Maybe when Coronavirus comes to our town we should all just get it, and take our chances. Get it over with quickly. If you die, you die.   Then we can go back to committing suicide in all our other ways.",
            "created": "Tue, 25 Feb 2020 15:44:09 GMT",
            "type": "outline"
        },
        {
            "text": "A drum I keep beating:  When a campaign wants to break through, start doing good now, don't wait until you're elected. Now there's a chance to do just that. Use your advertising, rallies, interviews and debates to sound the alarm for <a href=\"https://www.who.int/health-topics/coronavirus\">coronavirus</a>. Demand that Trump protect the citizens.  Explain what Trump has done to put us at greater risk.  Explain how a real government functions for the benefit of its citizens.  PS: Puerto Rico.",
            "created": "Tue, 25 Feb 2020 15:13:00 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/12/24/drummer.png"
        }
    ]
}