{
    "text": "February 26",
    "created": "Wed, 26 Feb 2020 14:28:15 GMT",
    "name": "26",
    "subs": [
        {
            "text": "Today's <a href=\"http://scripting.com/2020/02/26/weAreDeepInFascistShit.m4a\">podcast</a> is entitled We Are Deep In Fascist Shit. This is what no one wants to talk about. Even MSNBC is switching away from it. Our last chance imho is to create a new Democratic Party where the only thing we all have in common is we believe in the rule of law. Until we can reboot our democracy, create Marshall Plan for ourselves, <i>and do it quickly, </i>with every hand on deck, we're going to where India is now. We are probably the last hope. So no it doesn't matter what anyone said 10 years ago, it doesn't even matter what they said yesterday. What matters is that we create a big enough a movement now to be noticed when the government shuts it down. As I said earlier, things are so bad now that Trump might not even have to cheat to win. And then we are lost. Far more lost than we are now. We don't want to look at this, I get it, but we have to. We have to support each other, not fear each other. We might not have another chance, but if we're going to survive we can't keep going the way we're going. ",
            "created": "Wed, 26 Feb 2020 15:34:34 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2020/02/26/weAreDeepInFascistShit.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "10032719",
            "image": "http://scripting.com/images/2020/02/26/jfkHalfDollar.png"
        },
        {
            "text": "A couple of days after my <a href=\"http://scripting.com/stories/2009/10/03/fathersDay.html\">father</a> died in 2009, I was at the house in Flushing, we were all sitting around the kitchen table and there was a knock on the door. I answered it. It was a rep from Verizon wanting to know if we wanted <a href=\"https://en.wikipedia.org/wiki/Verizon_Fios\">FIOS</a>. I said yes! Yes! We do! So I signed them up. Went back to the kitchen and we realized how weird it was, after many years of putting up with shitty DSL, just after he dies, all of a sudden there's the FIOS guy. We figured that it was probably the first thing Dad took care of when he got to the afterlife, order FIOS for the house. He would have loved it. My dad was a real internet activist. I often wonder what he would think of American politics of 2020. I know he would have hated Trump. But Sanders? I don't know. He really liked Hillary Clinton, and as far as he was concerned Israel could do no wrong. His first born son (me) did not agree with all of that, though he might have been surprised that I came around to HRC in 2016. ",
            "created": "Wed, 26 Feb 2020 22:21:45 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/02/26/leonWiner.png"
        },
        {
            "text": "I thought the best point made in the debate last night was from Buttigieg where he said what torture it would be to have to endure a campaign of Trump versus Sanders. Up to that point I hadn’t thought of it that way but it’s true, can’t imagine how exhausting that will be.",
            "type": "tweet",
            "created": "Wed Feb 26 13:10:00 +0000 2020",
            "tweetId": "1232654046001012737",
            "tweetUserName": "davewiner"
        },
        {
            "text": "Maybe Facebook, Twitter et al have better business models because they allow users to write on a level playing field with the pros. ",
            "created": "Wed, 26 Feb 2020 14:28:16 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1232672647089135616"
        },
        {
            "text": "The last few days there's been a change on MSNBC. The only show I regularly watch, Ari Melber, has opened the last two shows with a recital of the number of delegates each of the candidate has. I'm sure Sanders supporters hear that as good news, but I hear a lecture, get with the program dear MSNBC user, this is where we, and you, are going. I suppose after Super Tuesday this might be inevitable, but it isn't yet. Anyway, no matter, I'm not going along for the ride. I think we're deep in fascist shit in this country, and there's no sign of us digging out. I don't like Sanders. He yells slogans, and every attempt to get him to talk about his ideas in any detail just gets more slogans. I can't read his mind, but all evidence says he's as shallow as Trump. I wouldn't worry about death camps with Sanders (as I do with Trump), but I also think there's a very good chance we lose with him. Even with a perfect candidate it's a long shot because Trump is cheating. But with Sanders, he might not have to. So count me out, I'm not going along for this ride. I'll put my time between six and seven every night to better use. ",
            "created": "Wed, 26 Feb 2020 14:28:58 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/02/26/sanders.png"
        }
    ]
}