{
    "text": "February 28",
    "created": "Fri, 28 Feb 2020 14:04:32 GMT",
    "name": "28",
    "subs": [
        {
            "text": "Here's the <a href=\"https://www.uspresidentialelectionnews.com/2020/02/full-video-cnn-south-carolina-town-hall-with-bloomberg-biden-klobuchar-and-warren-feb-26/\">full video</a> of the Bloomberg town hall on Wednesday that <a href=\"http://scripting.com/2020/02/27/154118.html?title=bloombergWouldBeGood\">impressed</a> me so. ",
            "created": "Fri, 28 Feb 2020 21:42:51 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://en.wikipedia.org/wiki/Geneva_Summit_(1985)\">Reagan</a> famously asked Gorbachev if they could set aside their differences if the world was invaded by aliens. Gorbachev said hell yes. I wonder if the Repubs could be so kind and temporarily pause their war on the American people. ",
            "created": "Fri, 28 Feb 2020 15:29:59 GMT",
            "type": "outline"
        },
        {
            "text": "Now would be a really good time to get in touch with our Senators and Reps and tell them the CDC and NIH have to be free to communicate with the public. <a href=\"https://thehill.com/homenews/media/485147-rep-garamendi-nih-director-fauci-cancelled-on-five-sunday-talk-shows-after\">This</a> is unacceptable. Your constituents lives are at stake, all of them.",
            "created": "Fri, 28 Feb 2020 22:49:28 GMT",
            "type": "outline"
        },
        {
            "text": "We are now having an extended heckuva job <a href=\"https://www.cnn.com/videos/politics/2017/10/26/george-w-bush-hurricane-katrina-fema-michael-brown.cnn/video/playlists/president-george-w-bush/\">Brownie</a> moment, only this time it isn't just New Orleans, it's the entire world. ",
            "created": "Fri, 28 Feb 2020 15:26:27 GMT",
            "type": "outline"
        },
        {
            "text": "President Bush learning that New Orleans had drowned.",
            "created": "Fri, 28 Feb 2020 15:27:33 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/02/28/bushRealizingNewOrleansDrowned.png"
        },
        {
            "text": "With politics so compelling these days I'm having a lot of trouble focusing on my development work. My next project is really interesting. I'm posting this here as a reminder to myself that forward motion is good, even if the world seems to be falling apart before our eyes. ",
            "created": "Fri, 28 Feb 2020 14:04:33 GMT",
            "type": "outline"
        },
        {
            "text": "I was typing a <a href=\"https://twitter.com/davewiner/status/1233389598031650816\">reply</a> to Miguel de Icaza on Twitter and went over the 280 char limit. Their thread editor doesn't work with replies, so I just kept typing, and at the end I posted a <a href=\"http://scripting.com/images/2020/02/28/tweetScreenShot.png\">screen shot</a> of what I wrote. Twitter please, the 280 char limit is bullshit. Let's go to infinite length tweets. Facebook manages to do this. It's time. Thanks. ",
            "created": "Fri, 28 Feb 2020 14:05:41 GMT",
            "type": "outline"
        },
        {
            "text": "Why Warren freaks me out",
            "created": "Fri, 28 Feb 2020 21:47:33 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "This came up in a Twitter conversation with Miguel de Icaza, earlier today, mentioned <a href=\"http://scripting.com/2020/02/28.html#a140541\">above</a>. I said that Sanders and Warren freak me out. Warren is his candidate, so he asked why. I said I didn't want to discuss it on Twitter. After giving it a few hours thought I decided to try it on my blog, here, now. ",
                    "created": "Fri, 28 Feb 2020 21:59:32 GMT",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "As a man when I see another man cornered, in public, on a #metoo issue, I know that he has very little room to respond. There isn't much you can say. And it is almost as uncomfortable for other men watching it. When men get together in a #metoo charged environment, we talk with each other about how scared we are that we will be wrongly accused, precisely because there is nothing you can do or say. The classic example is Al Franken. It came out later, as was pretty obvious to me at the time, that the woman he supposedly abused was part of the play. Franken is a genuinely good person, and if he can be taken down by this, so easily, without any process, anyone can. ",
                            "created": "Fri, 28 Feb 2020 21:47:46 GMT",
                            "image": "http://scripting.com/images/2019/08/07/elizabethWarrenActionFigure.png"
                        },
                        {
                            "text": "If you think about it, Warren and her team had a problem to solve after a previous debate where she was almost silent. She needed to make a splash in this debate. They probably had a list of options, probably even focus group tested them, to see which would get the most attention, and she almost certainly planned and rehearsed how she would do it, and how she would react to various Bloomberg responses. That's #metoo being used as a political tool. Very calculating. And it worked, how well it worked, we'll find out on Tuesday. ",
                            "created": "Fri, 28 Feb 2020 21:47:54 GMT"
                        },
                        {
                            "text": "But there's a third paragraph to this. It's true that men can't respond in public, but we can express our anger privately -- with our vote. I can vote for anyone I like. And in my gut I believe this is why Democrats do poorly with men. Democrats push this button too easily. Watching Bloomberg on stage, taking it, with no way to respond that preserves his dignity, that makes me angry. For me, it isn't enough to cause me to vote against the Democratic candidate, even if it was Warren. But I believe we lose because many men are <i>justifiably</i> angry at the Democrats and can't express that anger publicly. So they do it privately, by voting for Republicans.",
                            "created": "Fri, 28 Feb 2020 21:50:05 GMT"
                        }
                    ]
                },
                {
                    "text": "PS: Here's a <a href=\"https://www.google.com/search?q=site%3Ascripting.com+elizabeth+warren\">Google search</a> for Elizabeth Warren on my blog, so you can see how I've written about her in the past. ",
                    "created": "Fri, 28 Feb 2020 22:02:28 GMT"
                }
            ]
        }
    ]
}