{
    "text": "Dreaming of the super-Democrat",
    "created": "Sat, 20 Jul 2024 12:41:09 GMT",
    "type": "outline",
    "metaImage": "http://scripting.com/images/2024/07/20/ricks.png",
    "description": "The dream-Dem is imho Rick from Casablanca?",
    "subs": [
        {
            "text": "Some coffee notes for a Saturday morning.",
            "created": "Sat, 20 Jul 2024 12:41:16 GMT",
            "flNumberedSubs": "true",
            "subs": [
                {
                    "text": "This election is a total mess.",
                    "created": "Sat, 20 Jul 2024 12:41:38 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Trump is extremely beatable.",
                    "created": "Sat, 20 Jul 2024 12:41:42 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Biden is extremely beatable too. ",
                    "created": "Sat, 20 Jul 2024 12:41:44 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "We've all had a chance to live in an America with Trump as president, and Biden. I know which one was better for all of us. (Evidence: our response to Covid, S&P 500 price.)",
                    "created": "Sat, 20 Jul 2024 12:41:46 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Biden's health is not good and it of course will get worse in the coming four years.",
                    "created": "Sat, 20 Jul 2024 12:41:48 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Trump's health isn't good either and it also will get worse. He doesn't care for himself. He's 77. He's near the end of the decade most <a href=\"https://www.verywellhealth.com/how-to-live-longer-for-men-2223908#:~:text=As%20of%202021%2C%20the%20average,%2D19%20infection%2C%20and%20stroke.\">people die</a>.",
                    "created": "Sat, 20 Jul 2024 12:41:50 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The Dems can run the show without Biden.",
                    "created": "Sat, 20 Jul 2024 12:41:52 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The Repubs plan to run the show without Trump, he's just a figurehead, I hope you know that. An actor they put on stage to distract you from the nasty shit they are already doing (evidence, the Supreme Court). When he says Project 2025 isn't his, he's telling the truth. He has no idea what's in it and doesn't care. All he wants is to stand up at rallies and vent, and have his own Rick's Cafe in <a href=\"https://en.wikipedia.org/wiki/Casablanca_(film)\">Casablanca</a> and be Rick. It's the quieter, less showy folk that use him that you should be scared of. ",
                    "created": "Sat, 20 Jul 2024 12:41:54 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Even if Biden wanted to step aside, and he clearly doesn't, the mess that would follow can't be unraveled before the election, so if you push Biden out we lose, pretty sure of that. This is why I think Nate Silver lost his way, he's a sports fan, as am I. What's your next move after taking out the pitcher. You better have a good reliever warmed up in the bullpen, right? We don't even have a freaking bullpen Nate (hope he reads this). ",
                    "created": "Sat, 20 Jul 2024 12:41:57 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "But it's fun to dream of the super-Democrat, the candidate who would totally clean Trump's clock, win in a landslide, and when they take office would clear out the junk on the Supreme Court, bring back Roe v Wade, slam the brakes on climate change, and then kick Putin's ass and restore America to greatness for real, and also prepare us to survive the next pandemic. But it's just a dream. It can't happen. Any good candidate will stay out of the mess that will follow a Biden step-aside. No one would want their future tied up in the mess-to-come. ",
                    "created": "Sat, 20 Jul 2024 12:42:00 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Remember, your vote is a chess move not a love letter. ",
                    "created": "Sat, 20 Jul 2024 12:55:38 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://en.wikipedia.org/wiki/Casablanca_(film)#Plot\">Rick Blaine</a> owns a nightclub and gambling den in Casablanca.",
            "created": "Sat, 20 Jul 2024 13:42:49 GMT",
            "inlineImage": "https://imgs.scripting.com/2024/07/20/rickstanding.png",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}