{
    "text": "Morning coffee notes",
    "created": "Sun, 05 Nov 2023 14:41:16 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "When professionals look at ChatGPT they see someone stealing their ideas. When I look at it, as an amateur in everything but what I specialize in, I see new ways to express myself. This is what technology has been doing since our species started thinking and sharing ideas, thus creating our civilization. So which should I value more, the new ideas I'll be able to send and receive, or protecting the cash flow of others. I get it, I used to depend on the cash generated from my software. But it's funny almost none of that money came from individual sales of software. And value is manifested in many other ways than dollars. ",
            "created": "Sun, 05 Nov 2023 14:48:28 GMT",
            "image": "https://imgs.scripting.com/2021/12/24/dontLookUp.png",
            "flInCalendar": true
        },
        {
            "text": "The last month for me has been a revelation, as I can talk with ChatGPT and get it to express my wishes to DALL-E in a language it understands better than I do, and the net result is I can show you visually how I think about things I write about here. For example, I've been trying to come up with a way to visualize RSS. Not as some dead thing as Google and others tried to make you see it as. Rather as a bunch of balloons on a perfect day in the high desert of New Mexico. I asked that every balloon say RSS, but it could only manage one. Still the point gets through. ",
            "created": "Sun, 05 Nov 2023 14:48:24 GMT",
            "flInCalendar": true
        },
        {
            "text": "RSS as balloons in the New Mexico high desert.",
            "created": "Sun, 05 Nov 2023 15:04:10 GMT",
            "inlineImage": "https://imgs.scripting.com/2023/11/05/rssBalloons.png",
            "flInCalendar": true
        },
        {
            "text": "You should feel proud of RSS because it was something created by you, not by the tech industry. We can do a lot more stuff like that if we choose to work together. It's one of those weird things like making a balloon lighter than air so you, a flightless animal, can fly around in the wind on a gorgeous day with other humans. ",
            "created": "Sun, 05 Nov 2023 15:16:13 GMT",
            "flInCalendar": true
        },
        {
            "text": "With the ChatGPT and DALL-E connection we're finally somewhere I honestly never thought we'd get, at least not in my lifetime -- you will be able to write your own software by telling a computer what you want. And it will be infinitely better at listening to you, with its full attention, its mind engaged 100 percent, able to talk with you at whatever level you are able to. With that, you can certainly create software, and through trial and error that used to take decades of experience,  you can get results -- in weeks and months.  I don't want to scare you, my programmer colleagues, but our craft is being reformed by this too. ",
            "created": "Sun, 05 Nov 2023 14:49:12 GMT",
            "flInCalendar": true
        },
        {
            "text": "I tried an experiment a few days ago. I got a random question that made no sense, about RSS and local files and seemed to depend on magic. I get these all the time and I don't have the intellectual ability or patience to understand what they're saying. So I pasted the email verbatim <a href=\"https://chat.openai.com/share/5eaed401-dec7-44cd-a2a4-9725c4d99e65\">into ChatGPT</a> and it answered the question. I sent the person a link to the answer, and he responded, cryptically as before, but apparently ChatGPT understood what he was asking for, where I did not. Now we're getting a glympse at the future. ",
            "created": "Sun, 05 Nov 2023 14:51:55 GMT",
            "flInCalendar": true
        },
        {
            "text": "There's this Silicon Valley expression -- A’s hire A’s and B’s hire C’s. Here we are presented with that conundrum, but we're the B and we could hire an A. I guess that's the question. \n",
            "created": "Sun, 05 Nov 2023 14:54:17 GMT",
            "flInCalendar": true
        },
        {
            "text": "BTW, Andrew Hickey, who has opened my mind to <a href=\"https://500songs.com/\">music</a> over the last year, has made a <a href=\"https://www.patreon.com/posts/thoughts-on-now-92258652\">mistake</a> in <a href=\"https://imgs.scripting.com/2023/11/05/hickeyQuote.png\">saying</a> that the same people who promoted  NFTs and Bitcoin are the ones promoting AI. I saw <i>Web 3</i> as a cheap exploitation of something open and wonderful, the Web, purely for greed. Like Exxon laying waste to the Arctic for more oil profits. Or if I started a band and called it Beatles II, and journalists went along with the con. ",
            "created": "Sun, 05 Nov 2023 14:56:06 GMT",
            "flInCalendar": true
        },
        {
            "text": "AI is more challenging, not as clear-cut, and at the same time incredibly useful even seductive, and we need minds like Hickey's to look at this carefully and think, and use it as a tool, so he can help us understand what's going on. I've seen this many times, people I admire who have dismissed AI, but when I tell them not to, and they try to use it, they immediately get it. Hickey will be one of those people, I'm sure of it. ",
            "created": "Sun, 05 Nov 2023 15:15:08 GMT",
            "flInCalendar": true
        },
        {
            "text": "PS: BTW, the future never ends up looking like you thought it would. ",
            "created": "Sun, 05 Nov 2023 15:22:22 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}