{
    "text": "Radical ideas for political pubs",
    "created": "Sun, 03 Oct 2021 16:57:38 GMT",
    "type": "outline",
    "metaImage": "http://scripting.com/images/2021/10/03/wineCellar.png",
    "description": "Make an effort to discover and promote unique ways of thinking about the issues of the day.",
    "subs": [
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1444705859582533635\">Idea</a>. For a few weeks, assign a reporter to read the Twitter comments for all the stories, but don't announce anything. Look for people who write intelligent comments with new ideas that people in your circle never come up with. ",
            "created": "Sun, 03 Oct 2021 16:57:46 GMT",
            "image": "http://scripting.com/images/2021/10/03/bottleOfFineWine.png",
            "flInCalendar": true
        },
        {
            "text": "They are out there, might take some effort to find them. Recruit new ideas. We need you to do that. Be a contrarian. In journalism the assumption is that comments are disgusting. Take an opposite view for a short period of time, and see objectively if there aren't some diamonds out there in the middle of all the crap.",
            "created": "Sun, 03 Oct 2021 18:54:01 GMT",
            "flInCalendar": true
        },
        {
            "text": "Another radical idea for political pubs. ",
            "created": "Sun, 03 Oct 2021 18:46:02 GMT",
            "flInCalendar": true
        },
        {
            "text": "Did you hear blogs are back? They call them newsletters now. They all have RSS feeds, of course. How about gathering a list of all the newsletters people on your staff read, publish the list, and run a river of all their letters, when they come out. A way of revealing your sources in a new dimension. ",
            "created": "Sun, 03 Oct 2021 18:55:06 GMT",
            "flInCalendar": true
        },
        {
            "text": "Build relationships with the smartest of them. Become known as <a href=\"https://en.wikipedia.org/wiki/Connoisseur\">connoisseurs</a> of political thought. How could that hurt your pub? Pay special attention to ones that criticize your specific publication. Always listen to your most passionate users, that's how you improve over time. ",
            "created": "Sun, 03 Oct 2021 18:55:20 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}