{
    "text": "I've been watching <a href=\"https://tv.bingeworthy.org/?id=https%3A%2F%2Fwww.metacritic.com%2Ftv%2Fthe-dropout%2F\">The Dropout</a> on Hulu. It's hard to watch at times, because the <a href=\"https://en.wikipedia.org/wiki/Elizabeth_Holmes\">main character</a> of the show, a Silicon Valley entrepreneur, is such a horrible person. She lies to everyone about everything, but she's cute and the VCs like her, so they pump hundreds of millions of dollars into her startup, <a href=\"https://en.wikipedia.org/wiki/Theranos\">Theranos</a>, which was a real company, and made a product that never worked, but she doesn't get around to telling anyone that, including the board of directors, until long after it's too late. I haven't reached the end yet, but I know how it ends, because it's based on a true story. She ends up in the same <a href=\"https://en.wikipedia.org/wiki/Federal_Prison_Camp,_Bryan\">prison</a> that <a href=\"https://en.wikipedia.org/wiki/Ghislaine_Maxwell\">Ghislaine Maxwell</a> is in, in Texas. The only reason I mention it is that in my tenure in Silicon Valley, about 30 years worth, I saw everything she did, done by other entrepreneurs and VCs, in real life. Only now, in the second Trump administration, its craptitude is maxed out far beyond anything I saw personally. They're selling the biggest lie yet, that they've invented machines that think. This is not true, and it's so big a lie, its too-big-to-fail quotient is far higher than anything we've seen before. ChatGPT should stop pretending to be human because that will destroy real humans who believe it. But the euphoria is so great, they're probably going to continue to insist it is capable of thought, and that leads to something far worse than Theranos, or any of the other billion-dollar scams they have foisted on us previously. ",
    "created": "Mon, 18 Aug 2025 12:49:16 GMT",
    "type": "outline",
    "image": "https://imgs.scripting.com/2019/10/09/mrBurns.png",
    "flInCalendar": true
}