{
    "text": "Axios has it right",
    "created": "Thu, 29 Mar 2018 14:33:32 GMT",
    "type": "outline",
    "description": "On this blog, I've been writing about how Facebook is screwing all of us, Google too, but of course the press just sees how Facebook screws journalism. We all see the world through our own eyes, that's why it's so important to have a variety of different perspectives in the news. Today's journalism is a disaster in that way. ",
    "subs": [
        {
            "text": "I am a big fan of Axios, as I've <a href=\"http://scripting.com/2017/06/14.html\">written</a> in the past. They continue to impress. And they have something very important right today in this <a href=\"https://www.axios.com/media-vs-facebook-this-time-its-personal-1522183448-542df9fc-f4a5-41fe-964f-7c955bbb96c9.html\">piece</a> by Scott Rosenberg. ",
            "created": "Thu, 29 Mar 2018 14:33:37 GMT",
            "image": "http://scripting.com/2015/10/26/mrmet.png"
        },
        {
            "text": "As a user of news, who pretty regularly gets condescended to by press people, I'm fed up with them for not at least disclosing their conflict re Facebook. Just because it's huge, doesn't make it okay to ignore it.",
            "created": "Thu, 29 Mar 2018 14:46:15 GMT"
        },
        {
            "text": "To be clear, the press obsession with Hillary's email server, covering Trump for his entertainment value, and broadcasting the hacked Democratic emails, were all examples of press malpractice during the 2016 election. I'm pretty sure all of this <i>swamps</i> any mistakes Facebook might have made in throwing the election to Trump. ",
            "created": "Thu, 29 Mar 2018 14:34:05 GMT"
        },
        {
            "text": "Scott leaves bloggers out of his analysis, btw. We don't worry about access, nor do we care what the press thinks of us (other than in a personal way). On this blog, I've been writing about how Facebook is screwing all of us, Google too, but of course the press just sees how Facebook screws journalism. We all see the world through our own eyes, that's why it's so important to have a variety of different perspectives in the news. Today's journalism is a disaster in that way.  :boom:",
            "created": "Thu, 29 Mar 2018 14:49:39 GMT"
        },
        {
            "text": "Finally, congrats to Scott and <a href=\"https://www.axios.com/\">Axios</a> on hooking up. We know Scott from his pioneering work at Salon in the <a href=\"http://essaysfromexodus.scripting.com/stories/storyReader$2106#scottros\">early days</a> of the web. Finally one of the new media pubs has depth in their coverage of tech issues. They all still need depth in the technology itself, the lack of which makes a lot of their coverage laughably wrong.",
            "created": "Thu, 29 Mar 2018 14:35:03 GMT"
        }
    ]
}