{
    "text": "The next patriotic kitten",
    "created": "Wed, 19 Jun 2024 12:55:00 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I loved being my own DJ with Napster, and none of the execs or journalists figured out that this was the appeal of getting all the music out from behind the incredibly obsolete and brutal paywall that the music industry had concocted. They didn't give a shit about the users except they wanted our money, there was no love in the connection between the creativity of the artists and the creativity of the users. We supposedly didn't have any. ",
            "created": "Wed, 19 Jun 2024 12:55:11 GMT",
            "flInCalendar": true
        },
        {
            "text": "I'm like <a href=\"https://en.wikipedia.org/wiki/Emmett_Chapman\">Emmett Chapman</a>, an accomplished musician who created a new kind of <a href=\"https://en.wikipedia.org/wiki/Chapman_Stick\">musicial instrument</a> for himself and others to use. That's what I do with software. I play the tools I make. But what I really get off on is the music the users make. I was thinking about my father yesterday, it would have been his 95th birthday. He died at 80, so there's been plenty of time to process his life as I knew it. The best connection he and I had was silent. I inherited my love for outliners from him, yet that love was latent probably for hundreds of generations in our family. I had the skill and creativity to create such a tool, and finally the <a href=\"https://en.wikipedia.org/wiki/IBM_Personal_Computer\">technology</a> existed, and he let his son turn his mind upside down and inside out. For that he would say Every day is Father's Day. That may be my greatest accomplishment.",
            "created": "Wed, 19 Jun 2024 12:56:41 GMT",
            "flInCalendar": true
        },
        {
            "text": "I was chatting with my brother yesterday, ChatGPT came up, and I thought (and said) I bet dad would have loved ChatGPT. Then I thought of our uncle Ken, on my mother's side, and said he would have shit his pants over ChatGPT. Ken spent literally hours every day with the meager reference tools he owned in his off the grid cottage near St Augustine. The way I love ChatGPT is the way he would have loved it. I'm absolutely sure of it. My paternal grandfather would have loved it, and I expect my great uncle <a href=\"https://en.wikipedia.org/wiki/Arno_Schmidt\">Arno</a> who was a pioneer of <a href=\"https://en.wikipedia.org/wiki/Zettelkasten\">zettlekasten</a> would have also lost his shit over ChatGPT.",
            "created": "Wed, 19 Jun 2024 13:00:44 GMT",
            "flInCalendar": true
        },
        {
            "text": "Which leads me to the art of a user of ChatGPT (which really needs a shorter name). People's first reaction is that by creating art with ChatGPT I'm stealing. Bollocks. I'm creating. I'm not even going to validate that with a rebuttal. I am proving it with the <a href=\"https://www.google.com/search?q=%22Patriotic+Kitten%22\">Patriotic Kitten</a> thread, the next of which I will now entertain you with. ",
            "created": "Wed, 19 Jun 2024 13:03:22 GMT",
            "flInCalendar": true
        },
        {
            "text": "The second patriotic kitten. ",
            "created": "Wed, 19 Jun 2024 13:04:48 GMT",
            "inlineImage": "https://imgs.scripting.com/2024/06/19/patrioticKitten2.png",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}