{
    "text": "A great political ad",
    "created": "Fri, 14 Jun 2024 17:52:00 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Okay it's not the best political ad ever but it's pretty freaking good.",
            "created": "Fri, 14 Jun 2024 17:52:19 GMT",
            "flInCalendar": true
        },
        {
            "text": "We love America and the flag stands for the good in us, in all of us. And our president not only gets that, he is doing what presidents are supposed to do, unite us. To the extent that we can at this time be united. But even a MAGA, viewing this ad, is going to have to swell up with pride for what this country means. ",
            "created": "Fri, 14 Jun 2024 17:52:37 GMT",
            "flInCalendar": true
        },
        {
            "text": "<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/VC2SshZ373M?si=CV1-O9liPDmIhQRN\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe><br>But I have a question for my campaign friend and politics rabbi -- <a href=\"https://podcasts.apple.com/us/podcast/that-trippi-show/id1523896927\">Joe Trippi</a>. Joe, why don't they ask for a contribution at the end? I'd pay money specifically to have that ad run everywhere, even in states we have no chance of winning. Because there are people in every state that deserve encouragement, and if we want to really win we need them to feel part of our great country as much as anyone in a swing state. And there's always value in forcing the opposition to campaign in states they otherwise feel are safe. ",
            "created": "Fri, 14 Jun 2024 17:53:56 GMT",
            "flInCalendar": true
        },
        {
            "text": "So let me -- a regular citizen -- earmark a contribution for <i>this</i> message. It gives me another way to vote, a sense I'm participating. ",
            "created": "Fri, 14 Jun 2024 17:55:23 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}