{
    "text": "Could a Musk buy Bluesky?",
    "created": "Sun, 03 Nov 2024 14:53:56 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "<a href=\"https://pluralistic.net/2024/11/02/ulysses-pact/#tie-yourself-to-a-federated-mast\">Cory Doctorow</a>: \"I will never again devote my energies to building up an audience on a platform whose management can sever my relationship to that audience at will.\" It's a good practice, and while I completely support it, I am part of several communities that could remove me without recourse. I do it because I value the people in the community, and feel that life is too short to wait for everyone to get it right. ",
            "created": "Sun, 03 Nov 2024 14:39:11 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Doctorow was writing about Bluesky, and once again, on Bluesky a <a href=\"https://bsky.app/profile/scripting.com/post/3l7ygxnh7ce2a\">discussion</a> starts on what it would take for Bluesky to attract developers, and each time I am told that they have done enough, and I go away thinking that their pitch is a scam, and they're building value in a user base that they will sell. They certainly could do it, and for all we know the founders may have already sold some of their stock in the <a href=\"https://bsky.social/about/blog/10-24-2024-series-a\">latest investment round</a> which valued the company at $x billion. (I did a <a href=\"https://www.google.com/search?q=bluesky+investment+round+%2415m\">search</a> to find the evaluation but it appears to have not been announced.) ",
            "created": "Sun, 03 Nov 2024 14:54:29 GMT",
            "flInCalendar": true
        },
        {
            "text": "I gave them a roadmap, again, of how to demonstrate that they're open, and finally <a href=\"https://bsky.app/profile/scripting.com/post/3l7zvw43d752a\">concluded</a> that the only way to <i>really</i> do it is to \"provide a download that you can install on any popular operating system to get an instant blue sky network, running on its own without any help from anyone else. Then you can claim to be really open and until then there will be a lot of confusion.\" (And I was generous at that. More accurately, people with experience in tech will be certain this is yet another deal where the founders get rich, where the users are the product and have read too much into their promise of being open.) ",
            "created": "Sun, 03 Nov 2024 14:55:10 GMT",
            "flInCalendar": true
        },
        {
            "text": "I'm still on Bluesky but I expect them to be another Twitter, which btw had an open API too, and it's pretty good, but they never offered the option of people running their own twitters. That would have been good protection against a Musk buying them out and turning us into pawns in his plan for world domination. Do we really want to help someone else build one of those? ",
            "created": "Sun, 03 Nov 2024 14:55:24 GMT",
            "flInCalendar": true
        },
        {
            "text": "In early 2017 I <a href=\"http://scripting.com/2017/01/14/whatIfTwtrIsBoughtByARepub.html\">observed</a> that Twitter had just been used to route around journalism and elect a president. This value wasn't on their balance sheet as an asset. I felt its stock was vastly underpriced. Exactly as it turned out when Musk bought it. Everyone still thinks he paid too much, at this moment it could possibly gain him control of part of the US government's $6 trillion per year budget early next year, and if they start selling the assets of the government he could be in the best position to buy them at pennies on the dollar, or take a percentage of each sale. He could probably start borrowing against it the day after the election is called for Trump.",
            "created": "Sun, 03 Nov 2024 14:56:11 GMT",
            "flInCalendar": true
        },
        {
            "text": "In the title I ask if a Musk could buy Bluesky, it's possible they have a way to prevent that in the design of their corporation, that's why it's a question. But if the price were right maybe the founders would sell out even if they didn't have to. ",
            "created": "Sun, 03 Nov 2024 14:59:37 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}