{
    "text": "Morning dream notes",
    "created": "Wed, 30 Oct 2019 14:52:41 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Dreams are so funny. One of my recurring dreams all through my life is not being able to find my way home. I'd start going there, but realize I wasn't getting anywhere. It would go on and on, and I'd never get there. Well last night I had a weird variant on that. I was still trying to get home. I had parked my car somewhere, and was trying to get there, so I could begin my journey, but first I had to call my mother. I couldn't find the phone feature on my <a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+iphone&t=h_&ia=web\">iPhone</a>. I'd keep navigating through the menus thinking I was on the way to the phone, but I'd get lost and have to start over. It seems my subconscious has completely absorbed the UI of computers as reality. And even though I'm an adult and my mother is gone, I still feel the need to call her. And of course all this is going on inside me even when I'm wide awake. :boom:",
            "created": "Wed, 30 Oct 2019 13:06:12 GMT",
            "image": "http://scripting.com/2015/06/24/davescoffee.png"
        },
        {
            "text": "Also in my dreams last night, since I'm on the topic, <a href=\"https://en.wikipedia.org/wiki/Craig_Newmark\">Craig Newmark</a> was partying. Dancing, telling jokes, introducing people to other people, being <a href=\"http://thesaurus.land/?word=gregarious\">gregarious</a>. I was surprised because this is out of character for him. He's a very nice, considerate person, in real life. But he seems a bit reserved. I find him hard to read. I've known him since the early days of the web in the Bay Area. I defended him when the press took what I felt were unfair <a href=\"https://duckduckgo.com/?q=%22craigslist+killer%22&t=h_&ia=web\">shots</a>, taking advantage of the fact that his product had his name in it, blaming him personally for the demise of print news. Ridiculous. So, I was happy to see Craig let go in my dreams. I sometimes say things that might have offended him, but he's never complained. Once I remarked, riding in the back seat of a car with him next to me that it was like being in a car with <a href=\"https://en.wikipedia.org/wiki/Aunt_Jemima\">Aunt Jemima</a>. I had gotten the idea from <a href=\"https://en.wikipedia.org/wiki/Peter_Norton\">Peter Norton</a>, who like Craig, had personally become a famous brand. He once said he was the Aunt Jemima of software. I thought that was clever. But of course Craig may not see it the same way. I tend to do that, take risks, I probably offend people from time to time, not meaning to, I assure you. I'm nowhere near as rich as Craig. Maybe that's why? :smile:",
            "created": "Wed, 30 Oct 2019 13:13:29 GMT",
            "image": "http://scripting.com/images/2019/10/30/craigNewmark.png"
        }
    ]
}