{
    "text": "El Camino was unnecessary",
    "created": "Sat, 12 Oct 2019 12:28:44 GMT",
    "type": "outline",
    "description": "There's a lot to be said for an edgy show like Breaking Bad leaving you at the edge.",
    "subs": [
        {
            "text": "Of course I watched <a href=\"https://www.metacritic.com/movie/el-camino-a-breaking-bad-movie\">El Camino</a>, the new Breaking Bad movie on <a href=\"https://www.netflix.com/title/81078819\">Netflix</a>. It wasn't really a movie or an episode of Breaking Bad. It was more like a few scenes from a Breaking Bad episode with brief appearances by many of the characters from the series, looking much older than they did at the end of the last episode (which aired six years ago).   ",
            "created": "Sat, 12 Oct 2019 12:28:54 GMT",
            "image": "http://scripting.com/images/2019/10/12/jessePinkman.png"
        },
        {
            "text": "It was a lot like the <a href=\"https://www.metacritic.com/tv/deadwood-the-movie\">Deadwood movie</a>, a series that was cut short and should have been allowed to finish. The real <a href=\"https://en.wikipedia.org/wiki/Deadwood,_South_Dakota#19th_century\">town</a> of Deadwood had a climax that was never part of the TV series. The movie was basically plotless, it was a series of cameos by the stars of the original series, the actors looking much older, in some cases not recognizable, saying a few things, not to be seen again. For a show that had such gravitas, was so daring and unprecedented, it was a kind of humiliation. Yet it got good reviews. I don't understand why.",
            "created": "Sat, 12 Oct 2019 12:29:13 GMT"
        },
        {
            "text": "Spoiler alert -- yes there are spoilers below. ",
            "created": "Sat, 12 Oct 2019 12:51:07 GMT"
        },
        {
            "text": "Nothing much happens in El Camino. As we know from the end of the series, the protagonist, Jesse Pinkman, survives and escapes. He hooks up with his old friends, remembers some scenes from the past, has to solve a problem, kills a few people and rides off into the sunset. ",
            "created": "Sat, 12 Oct 2019 12:31:22 GMT"
        },
        {
            "text": "Okay it was fun to watch, but I hoped for much more. If you loved Breaking Bad as I did, you should watch it. But all this show does, imho, is set the stage for yet another pointless encore. There's a lot to be said for an edgy show like Breaking Bad leaving you at the edge without telling you what happens next.  ",
            "created": "Sat, 12 Oct 2019 12:33:20 GMT"
        }
    ]
}