{
    "text": "Why I like my Model Y",
    "created": "Sat, 07 Dec 2024 14:23:29 GMT",
    "type": "outline",
    "description": "A few people asked what I liked about the Model Y that I'm not finding in non-Tesla EVs.",
    "metaImage": "http://scripting.com/images/2024/12/07/modelY.png",
    "subs": [
        {
            "text": "Yesterday I <a href=\"http://scripting.com/2024/12/06.html#a150415\">wrote</a> that I'd trade in my Model Y if an non-Tesla EV came along that equaled it. A few people asked what I liked about the Model Y that I'm not finding in alternatives. Here's the list. ",
            "created": "Sat, 07 Dec 2024 14:22:06 GMT",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "I love the handling of the Tesla. It's a <a href=\"https://en.wikipedia.org/wiki/Muscle_car\">muscle car</a> like the 2007 <a href=\"https://www.kbb.com/bmw/5-series/2007/\">BMW 535i</a> I used to drive, great acceleration, but handles like the 1993 <a href=\"https://www.cars.com/research/mazda-mx_5_miata-1993/\">Miata</a> another car I owned and loved. I've also owned really sloppy cars like a <a href=\"https://www.caranddriver.com/subaru/forester-2022\">Subaru Forester</a> or a <a href=\"https://www.cars.com/research/toyota-sienna-2004/\">Toyota Sienna</a> minivan, even a <a href=\"https://en.wikipedia.org/wiki/Plymouth_Voyager#Full-size_van_(AB;_1974%E2%80%931983)\">1974 Plymouth Voyager</a>, the largest American passenger car ever made. I'm never going back to a car that doesn't have the authority of a Model Y. ",
                    "created": "Sat, 07 Dec 2024 14:22:58 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The Model Y has lots of headroom, which my long torso needs, so I don't bruise my head each time I get in the freaking car. ",
                    "created": "Sat, 07 Dec 2024 14:22:52 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I have a Tesla charger at home, so whatever I buy has to be compatible with or adaptable to it.",
                    "created": "Sat, 07 Dec 2024 14:22:56 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "4WD is important because where I live it snows in winter, and I drive on dirt roads a lot too.",
                    "created": "Sat, 07 Dec 2024 14:23:05 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It's a computer. It's going to be hard for a competitor to offer the integration with a network that Tesla offers, they're a computer company as much as they're a car company. Their connection to Starlink (assumed to be coming) is going to be hard to compete with too. ",
                    "created": "Sat, 07 Dec 2024 14:23:12 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Calling it <i>self-driving</i> should get them in trouble with the FTC, there's no way anyone should trust it to drive itself, and the car's OS enforces that view, so I guess they have lawyers at Tesla. That said, I like having access to this technology. I've been an innovative software developer for a long time, and I like using tech that pushes the leading edge. The marketing (a Musk feature presumably) is what I don't like. ",
                    "created": "Sat, 07 Dec 2024 14:32:34 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Charging network. I occasionally take trips that are out of range of my home charger, to Boston, or NYC sometimes leave me needing a charge on the way home. I'd like to have the option of driving cross-country as well. The Tesla charging network is a big plus. I honestly don't know how good the charging situation is for other brands. This would be something for car magazines to rate, to have a way of measuring it, as people who are put off by Musk's politics (about 1/2 of American voters) look for ways to drive something other than a Tesla. ",
                    "created": "Sat, 07 Dec 2024 14:24:27 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "So this turned into an ad for Tesla. Heh. ",
            "created": "Sat, 07 Dec 2024 14:32:15 GMT",
            "flInCalendar": true
        },
        {
            "text": "There are <i>reasons</i> we love it so much. ",
            "created": "Sat, 07 Dec 2024 15:01:15 GMT",
            "flInCalendar": true
        },
        {
            "text": "Just separate from Musk and all's well. ",
            "created": "Sat, 07 Dec 2024 15:01:51 GMT",
            "flInCalendar": true
        },
        {
            "text": "I've been thinking Tesla drivers who love America should have some kind of demonstration. We all park our cars around local Tesla dealers, let the police tow our cars, only to be replaced by other Teslas. We're all computer nerds, we could probably even figure out the scheduling. We probably have nearly as much money as they do. Just sayin. ",
            "created": "Sat, 07 Dec 2024 14:44:05 GMT",
            "flInCalendar": true
        },
        {
            "text": "Tired of companies that push us around politically and Tesla is one of the worst. So far they've managed to convince us they aren't Elon Musk, but that's a mirage, he is the company and the company is him. They are completely one and the same. ",
            "created": "Sat, 07 Dec 2024 14:45:27 GMT",
            "flInCalendar": true
        },
        {
            "text": "Like the <a href=\"https://en.wikipedia.org/wiki/Mike_Lindell\">My Pillow guy</a> and his <a href=\"https://www.youtube.com/watch?v=FCHDCNvC_NE\">pillows</a>. :smile:",
            "created": "Sat, 07 Dec 2024 14:47:24 GMT",
            "flInCalendar": true
        },
        {
            "text": "\"curly\"",
            "created": "Sat, 07 Dec 2024 14:43:33 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}