{
    "text": "I woke up in the middle of the night, as I often do. I always get out the iPad, check the nightly email. Make sure it went out at midnight. Noticed that the mail-sender's clock is drifting, have to do something about that. Every few days it sends the mail one second later. This is cumulative, leading to drift. So last night's mail went out at 12:00:21 AM. There is definitely a way around it. I'll let you know when I write the code. Next I started <a href=\"https://www.urbandictionary.com/define.php?term=doomscrolling\">doomscrolling</a> through Twitter, only tonight I'm seeing clever women putting down men. Some of them are really funny. A woman listening to a neighbor playing the <a href=\"https://www.youtube.com/watch?v=jBupII3LH_Q\">theme</a> for <a href=\"https://en.wikipedia.org/wiki/The_Pink_Panther\">The Pink Panther</a> on his sax over and over, poorly. Next up, a woman sings an Irish ditty a cappella telling a man to stop explaining things to her. Then a NYT reporter who's been attacked the way only a woman can be attacked, to which I say, no -- men really do get attacked on the net too, in more horrific ways than you describe, sometimes involving police with weapons drawn, with all the fire trucks in Berkeley, lights flashing and sirens blazing. Other times, knocks at the front door in the middle of the night at your real actual house, the place you sleep. Also people who stalk your friends, so you have to have a conversation with your friends about this. Anyway, long story, sorry, I know I suck. Then I came across <a href=\"https://twitter.com/paramountplus/status/1357395624874835969\">this ad</a> for Paramount+ -- a new ridiculously unwelcome expensive streaming service. But the <a href=\"https://twitter.com/paramountplus/status/1357395624874835969\">ad</a> was <i>perfect</i> for my mood. You have to <a href=\"https://twitter.com/paramountplus/status/1357395624874835969\">watch it</a>, I'm not going to narrate it, for fear of being excoriated online. But sometimes <a href=\"https://en.wikipedia.org/wiki/Beavis_and_Butt-Head\">Beavis and Butthead</a> just nail it. Amazing. :heart:",
    "created": "Tue, 09 Feb 2021 15:13:30 GMT",
    "type": "outline",
    "image": "http://scripting.com/images/2020/03/29/beavis.png",
    "flInCalendar": true
}