{
    "text": "All the people on Patel's list",
    "created": "Tue, 03 Dec 2024 19:02:02 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "In <a href=\"https://www.amazon.com/s?k=government+gangsters&hvadid=676936599591&hvdev=c&hvlocphy=1023511&hvnetw=g&hvqmt=e&hvrand=10163969034705884545&hvtargid=kwd-1905190322044&hydadcr=22167_13517494&tag=googhydr-20&ref=pd_sl_1ktex8f0as_e\">Government Gangsters</a>, Kash Patel identifies 60 individuals he alleges are part of a Deep State undermining the US government. \n",
            "created": "Tue, 03 Dec 2024 19:02:20 GMT",
            "flNumberedSubs": "true",
            "subs": [
                {
                    "text": "Michael Atkinson: Former Inspector General of the Intelligence Community.",
                    "created": "Tue, 03 Dec 2024 19:02:50 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Lloyd Austin: Defense Secretary under President Joe Biden.",
                    "flInCalendar": true
                },
                {
                    "text": "Brian Auten: Supervisory Intelligence Analyst, FBI.",
                    "flInCalendar": true
                },
                {
                    "text": "James Baker: Former General Counsel for the FBI and former Deputy General Counsel at Twitter.",
                    "flInCalendar": true
                },
                {
                    "text": "Bill Barr: Former Attorney General under Trump.",
                    "flInCalendar": true
                },
                {
                    "text": "John Bolton: Former National Security Adviser under Trump.",
                    "flInCalendar": true
                },
                {
                    "text": "Stephen Boyd: Former Chief of Legislative Affairs, FBI.",
                    "flInCalendar": true
                },
                {
                    "text": "Joe Biden: President of the United States.",
                    "flInCalendar": true
                },
                {
                    "text": "John Brennan: Former CIA Director under President Barack Obama.",
                    "flInCalendar": true
                },
                {
                    "text": "John Carlin: Acting Deputy Attorney General, previously led DOJ’s National Security Division under Trump.",
                    "flInCalendar": true
                },
                {
                    "text": "Eric Ciaramella: Former National Security Council staffer during the Obama and Trump administrations.",
                    "flInCalendar": true
                },
                {
                    "text": "Pat Cipollone: Former White House Counsel under Trump.",
                    "flInCalendar": true
                },
                {
                    "text": "James Clapper: Former Director of National Intelligence under Obama.",
                    "flInCalendar": true
                },
                {
                    "text": "Hillary Clinton: Former Secretary of State and presidential candidate.",
                    "flInCalendar": true
                },
                {
                    "text": "James Comey: Former FBI Director.",
                    "flInCalendar": true
                },
                {
                    "text": "Elizabeth Dibble: Former Deputy Chief of Mission, U.S. Embassy, London.",
                    "flInCalendar": true
                },
                {
                    "text": "Mark Esper: Former Secretary of Defense under Trump.",
                    "flInCalendar": true
                },
                {
                    "text": "Alyssa Farah: Former Director of Strategic Communications under Trump.",
                    "flInCalendar": true
                },
                {
                    "text": "Evelyn Farkas: Former Deputy Assistant Secretary of Defense for Russia, Ukraine, Eurasia under Obama.",
                    "flInCalendar": true
                },
                {
                    "text": "Sarah Isgur Flores: Former DOJ Head of Communications under Trump.",
                    "flInCalendar": true
                },
                {
                    "text": "Merrick Garland: Attorney General under Biden.",
                    "flInCalendar": true
                },
                {
                    "text": "Stephanie Grisham: Former Press Secretary under Trump.",
                    "flInCalendar": true
                },
                {
                    "text": "Kamala Harris: Vice President under Biden; former presidential candidate.",
                    "flInCalendar": true
                },
                {
                    "text": "Gina Haspel: CIA Director under Trump.",
                    "flInCalendar": true
                },
                {
                    "text": "Fiona Hill: Former staffer on the National Security Council.",
                    "flInCalendar": true
                },
                {
                    "text": "Curtis Heide: FBI Agent.",
                    "flInCalendar": true
                },
                {
                    "text": "Eric Holder: Former Attorney General under Obama.",
                    "flInCalendar": true
                },
                {
                    "text": "Robert Hur: Special Counsel who investigated Biden over mishandling of classified documents.",
                    "flInCalendar": true
                },
                {
                    "text": "Cassidy Hutchinson: Aide to Trump Chief of Staff Mark Meadows.",
                    "flInCalendar": true
                },
                {
                    "text": "Nina Jankowicz: Former Executive Director, Disinformation Governance Board under Biden.",
                    "flInCalendar": true
                },
                {
                    "text": "Lois Lerner: Former IRS Director under Obama.",
                    "flInCalendar": true
                },
                {
                    "text": "Loretta Lynch: Former Attorney General under Obama.",
                    "flInCalendar": true
                },
                {
                    "text": "Charles Kupperman: Former Deputy National Security Adviser under Trump.",
                    "flInCalendar": true
                },
                {
                    "text": "General Kenneth McKenzie, Ret.: Former Commander of United States Central Command.",
                    "flInCalendar": true
                },
                {
                    "text": "Andrew McCabe: Former FBI Deputy Director under Trump.",
                    "flInCalendar": true
                },
                {
                    "text": "Ryan McCarthy: Former Secretary of the Army under Trump.",
                    "flInCalendar": true
                },
                {
                    "text": "Mary McCord: Former Acting Assistant Attorney General for National Security under Obama.",
                    "flInCalendar": true
                },
                {
                    "text": "Denis McDonough: Former Chief of Staff for Obama, Secretary of Veterans Affairs under Biden.",
                    "flInCalendar": true
                },
                {
                    "text": "General Mark Milley, Ret.: Former Chairman, Joint Chiefs of Staff.",
                    "flInCalendar": true
                },
                {
                    "text": "Lisa Monaco: Deputy Attorney General under Biden.",
                    "flInCalendar": true
                },
                {
                    "text": "Sally Moyer: Former Supervisory Attorney, FBI.",
                    "flInCalendar": true
                },
                {
                    "text": "Robert Mueller: Former FBI Director, Special Counsel for Russiagate.",
                    "flInCalendar": true
                },
                {
                    "text": "Bruce Ohr: Former Associate Deputy Attorney General under Obama and Trump.",
                    "flInCalendar": true
                },
                {
                    "text": "Nellie Ohr: Wife of Bruce Ohr and former CIA employee.",
                    "flInCalendar": true
                },
                {
                    "text": "Lisa Page: Former Legal Counsel for Deputy Director Andrew McCabe at FBI; exchanged texts about Trump with Peter Strzok.",
                    "flInCalendar": true
                },
                {
                    "text": "Pat Philbin: Former Deputy White House Counsel under Trump.",
                    "flInCalendar": true
                },
                {
                    "text": "John Podesta: Former Counselor to Obama; Senior Adviser to Biden on Climate Policy.",
                    "flInCalendar": true
                },
                {
                    "text": "Samantha Power: Former Ambassador to the United Nations under Obama, Administrator of USAID under Biden.",
                    "flInCalendar": true
                },
                {
                    "text": "Bill Priestap: Former Assistant Director for Counterintelligence, FBI under Obama.",
                    "flInCalendar": true
                },
                {
                    "text": "Susan Rice: Former National Security Adviser under Obama, Director of the Domestic Policy Council under Biden.",
                    "flInCalendar": true
                },
                {
                    "text": "Rod Rosenstein: Former Deputy Attorney General under Trump.",
                    "flInCalendar": true
                },
                {
                    "text": "Peter Strzok: Former Deputy Assistant Director for Counterintelligence, FBI; exchanged texts about Trump with Lisa Page.",
                    "flInCalendar": true
                },
                {
                    "text": "Jake Sullivan: National Security Adviser under President Joe Biden.",
                    "flInCalendar": true
                },
                {
                    "text": "Michael Sussmann: Former Legal Representative, Democratic National Committee.",
                    "flInCalendar": true
                },
                {
                    "text": "Miles Taylor: Former DHS Official under Trump; penned New York Times op-ed critical of Trump under the byline “Anonymous.”",
                    "flInCalendar": true
                },
                {
                    "text": "Timothy Thibault: Former Assistant Special Agent, FBI.",
                    "flInCalendar": true
                },
                {
                    "text": "Andrew Weissmann: Mueller’s Deputy in Russiagate probe.",
                    "flInCalendar": true
                },
                {
                    "text": "Alexander Vindman: Former National Security Council Director for European Affairs.",
                    "flInCalendar": true
                },
                {
                    "text": "Christopher Wray: FBI Director under Trump and Biden.",
                    "flInCalendar": true
                },
                {
                    "text": "Sally Yates: Former Deputy Attorney General under Obama and, briefly, Acting Attorney General under Trump.",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}