{
    "text": "Childless vs childful",
    "created": "Tue, 30 Jul 2024 15:45:18 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Notes accumulated during the day -- not in any particular order. :smile:",
            "created": "Tue, 30 Jul 2024 16:20:32 GMT",
            "flInCalendar": true
        },
        {
            "text": "I keep a solid line between my personal life and blogging, learned the hard way. When I started blogging in 1994, I didn't have such a solid line, and found that I couldn't have a personal life if I made it public. But now I want to reveal something. I am \"childless\" which is a term I find pretty insulting, as if being child<i>ful</i> is the only normal state of being. ",
            "created": "Tue, 30 Jul 2024 15:23:03 GMT",
            "flInCalendar": true
        },
        {
            "text": "I find, in general childful people are not great friends or family members. They want special privileges and they often get them. If childful vs childless is going to be an issue in this campaign, I say -- bring it on. We should have this discussion. ",
            "created": "Tue, 30 Jul 2024 16:12:12 GMT",
            "flInCalendar": true
        },
        {
            "text": "I'm often tempted to offer advice to the parents, but I won't offer it unless asked, except this. If you have children, there's a good chance one or more of them will not have children, and you should love them the same, and provide models of acceptance while they're growing up, by bringing childless people into your home, so the kids know that this is one of the legitimate choices in life, offering proof that you won't love them any less if they go down that path. And here's the hard part, imho, for people with children -- <i>keep that promise. </i>",
            "created": "Tue, 30 Jul 2024 15:47:03 GMT",
            "flInCalendar": true
        },
        {
            "text": "BTW, people say it's seflish to not have children, but I don't agree, in fact I think it's the opposite. There was a point in human evolution where the struggle to survive for our species was fed by procreation, but some time in the last hundred years we crossed a line, where increasing human population worked against species survival. Our understanding of the meaning of procreating, like so much else about our civilization, has not yet caught up with the current reality. ",
            "created": "Tue, 30 Jul 2024 15:47:34 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}