{
    "text": "How to get important tech ideas reviewed?",
    "created": "Sat, 22 Jul 2017 14:25:06 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Personal emails still work the best. Of course this makes sense. When I have a project of some importance, sending an email directly to someone who I want to review it elicits the most responses. But it's inefficient. And the more you do it, the less power each email has. ",
            "created": "Sat, 22 Jul 2017 14:25:23 GMT",
            "image": "http://scripting.com/images/2017/07/22/sansaStark.png",
            "testatt": "this is a test",
            "permalink": "http://scripting.com/2017/07/22.html#a102523"
        },
        {
            "text": "Suppose I had an Node package in development that I think represents a basic technology for news distribution. Do I have to send emails to the people I think of to get access to their minds? And what about the creative thinkers who I either don't know, or didn't think to send an email to?",
            "created": "Sat, 22 Jul 2017 14:25:57 GMT",
            "permalink": "http://scripting.com/2017/07/22.html#a102557"
        },
        {
            "text": "Our idea distribution system is non-existent. <a href=\"https://news.ycombinator.com/\">Hacker News</a> is like a nuclear shotgun, there's so much there how do you find the stuff that's relevant. Wait for a reporter to write about it? Well that never happens. ",
            "created": "Sat, 22 Jul 2017 14:26:58 GMT",
            "permalink": "http://scripting.com/2017/07/22.html#a102658"
        },
        {
            "text": "I guess this is the technical side of the Mike Arrington-style product blog I <a href=\"http://scripting.com/2017/07/10.html#a064914\">asked</a> for. ",
            "created": "Sat, 22 Jul 2017 14:29:45 GMT",
            "xref": "http://scripting.com/2017/07/10.html#a064914",
            "permalink": "http://scripting.com/2017/07/22.html#a102945"
        },
        {
            "text": "I'd like to have a channel that's for serious releases only. If something is a maintenence release, or just the beginning of an idea, it wouldn't be thought of as important. However, when a technology has matured and is ready for other minds to consider it, there ought to be a way to get it looked at. ",
            "created": "Sat, 22 Jul 2017 14:27:35 GMT",
            "permalink": "http://scripting.com/2017/07/22.html#a102735"
        },
        {
            "text": "I guess this is the equivalent of peer review in academia, but it's <i>concept and code review</i> that I want. ",
            "created": "Sat, 22 Jul 2017 14:31:14 GMT",
            "permalink": "http://scripting.com/2017/07/22.html#a103114"
        }
    ],
    "permalink": "http://scripting.com/2017/07/22.html#a102506"
}