{
    "text": "Site licenses",
    "created": "Mon, 18 Apr 2022 21:14:12 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "In 1986, my little software company was in a weird place. ",
            "created": "Mon, 18 Apr 2022 21:14:20 GMT",
            "flInCalendar": true
        },
        {
            "text": "We had a great product almost ready to ship for the Mac. Everyone was psyched, MacUser and MacWorld, the people inside Apple, the people we leaked it to in the industry. But we were broke, couldn't make payroll. ",
            "created": "Mon, 18 Apr 2022 21:14:38 GMT",
            "flInCalendar": true
        },
        {
            "text": "My board was tired of the roller coaster, they told me to shut the company down. I told them they were crazy, we're sitting on the best product anyone has ever made, and the market is totally ready for it. The Mac was finally selling in huge numbers, after they fixed all the problems, and most other software devs were shutting down their mac development in the year before, we were going to have the booming mac software market virtually to ourselves. ",
            "created": "Mon, 18 Apr 2022 21:15:30 GMT",
            "flInCalendar": true
        },
        {
            "text": "No deal. The board wouldn't put up the $400K we needed to get to shipping the product. So I went to my best friend at Apple, and told him what was going on. We were going to have to shut down before shipping the product you want so badly. I begged for their help. Man did they help us. ",
            "created": "Mon, 18 Apr 2022 21:16:15 GMT",
            "flInCalendar": true
        },
        {
            "text": "First they gave us the money we needed to stay open as a loan. We had to put the source code to the product in escrow. We also did a second deal. They bought a site license for the product, everyone at Apple would get a copy, and in return they'd give us 40 new Mac systems with lots of memory, printers, networking. And they gave us 10 more Macs to give to our board members, which was also really smart. None of them had Macs.",
            "created": "Mon, 18 Apr 2022 21:16:30 GMT",
            "flInCalendar": true
        },
        {
            "text": "The reason I told this story is the power of the site license. I would have paid them all to use the product, because once the hardware company is standardizing on your product, you'll never go out of business as long as they're in business. And the inverse was true too. If we all had Macs maybe we'd stop thinking about making software for PCs. Back then Apple had guts and smarts. Quite a combo. Probably because they too had gone through tough times and were emerging from them. ",
            "created": "Mon, 18 Apr 2022 21:17:43 GMT",
            "flInCalendar": true
        },
        {
            "text": "It was the best year of my life in the software world, and I've had some good years. ;-)",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}