{
    "text": "Why I feel bad about Biden",
    "created": "Thu, 22 Aug 2024 13:36:14 GMT",
    "type": "outline",
    "enclosure": "https://s3.amazonaws.com/scripting.com/2024/08/22/whyIFeelBadAboutWhatHappenedToPresidentBidenInAPersonalWay.m4a",
    "enclosureType": "audio/mpeg",
    "enclosureLength": "6309090",
    "link": "http://scripting.com/2024/08/22/133614.html",
    "subs": [
        {
            "text": "Podcast: <a href=\"https://s3.amazonaws.com/scripting.com/2024/08/22/whyIFeelBadAboutWhatHappenedToPresidentBidenInAPersonalWay.m4a\">17 minutes</a>.",
            "created": "Thu, 22 Aug 2024 13:57:05 GMT",
            "flInCalendar": true
        },
        {
            "text": "Note: You can skip the first five minutes, it's a long preamble on a different subject. I left it in because it's interesting imho. ",
            "created": "Thu, 22 Aug 2024 13:57:36 GMT",
            "flInCalendar": true
        },
        {
            "text": "It's possible that what happened to Joe Biden in the debate is like something that happened to me almost ten years ago when I was turning 60. I tell the story in this podcast. It's still possible he was the best choice to go against Trump. We'll know soon enough. But there's something to learn here. No one wants their life to be over. No one wants to be thanked. They want you to let them keep going. The thing is that all through life people say you can't do what you then go on to do. It happens over and over. One day, after a life of accomplishment, you realize everyone refers to you in the past tense, but you're still here, you want to keep doing the stuff you do so well. But they won't let you. That's why I feel bad about what happened with President Biden, because I've had the experience myself. Anyway what's done is done, we all have to get behind soon-to-be President Harris. And stand behind her as she is attacked, and they try to get rid of her. ",
            "created": "Thu, 22 Aug 2024 13:36:35 GMT",
            "flInCalendar": true
        },
        {
            "text": "Anyway, the substance of this podcast, which I recorded yesterday, doesn't start until 5:25. Up until then it's a rambling story about Fox News and how a little truth slipped out when they covered the assassination attempt on Trump a few weeks ago. You can skip over that part if you don't find it interesting, but I hope you do listen to the part when I had an experience that may have been like Biden's at the debate, and how it was probably just a panic attack -- these things happen -- our candidates are people, and they have bodies that do strange things sometimes. No matter what I feel for Biden and that's the story I wanted to tell here. ",
            "created": "Thu, 22 Aug 2024 13:51:12 GMT",
            "flInCalendar": true
        },
        {
            "text": "Thanks for listening. :smile:",
            "created": "Thu, 22 Aug 2024 13:53:26 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}