{
    "text": "Ignore the NYT, part 2",
    "created": "Thu, 22 Aug 2024 17:00:29 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I have a feeling this thread is going to go a long way, maybe all the way. Maybe the last Ignore the NYT note will be \"The NYT has been put out of its misery\" in which case \"Ignore the NYT\" will be what everyone does, 7 days a week, 24 hours a day. Or maybe the last one will be when the owners of the NYT remember that the function of news is to simply report on what happened, and stop trying to control events. ",
            "created": "Thu, 22 Aug 2024 17:00:35 GMT",
            "flInCalendar": true
        },
        {
            "text": "Anyway -- today's ITNYT story goes like this. ",
            "created": "Thu, 22 Aug 2024 17:02:03 GMT",
            "image": "https://imgs.scripting.com/2024/06/11/nakedJenToday.png",
            "flInCalendar": true
        },
        {
            "text": "I'm pretty sure Trump has a negative net worth. That's what the trial in NY was about, the one which he was convicted on 34 counts of fraud which included lying to creditors about the value of collateral for loans.",
            "created": "Thu, 22 Aug 2024 17:02:16 GMT",
            "flInCalendar": true
        },
        {
            "text": "Trump borrows money to pay off creditors he borrowed money from to pay off other creditors. This has been going on for many years. It's probably why he's such close friends with Putin (or wishes he was) because a daddy like Putin can play the role of Trump's actual daddy used to play, ie bailing him out from his <a href=\"https://en.wikipedia.org/wiki/Trump:_The_Art_of_the_Deal\">bullshit deals</a>. ",
            "created": "Thu, 22 Aug 2024 17:02:37 GMT",
            "flInCalendar": true
        },
        {
            "text": "It's a Ponzi type pyramid. He's probably been filing fraudulent statements about the value of various real estate he owns for a lot longer than we know. But he got caught and now hopefully he will go to jail for what he's been doing because it's quite illegal. ",
            "created": "Thu, 22 Aug 2024 17:03:19 GMT",
            "flInCalendar": true
        },
        {
            "text": "The NYT in <a href=\"https://www.nytimes.com/live/2024/08/20/us/dnc-fact-check/take-it-from-an-actual-billionaire-trump-is-rich-in-only-one-thing-stupidity?smid=url-share\">this fact-check</a>, relies on Forbes' opinion of Trump's net worth -- which is based on the value of his Truth Social stock (good for them for not falling for the same bullshit the banks did). But that's a pretty weak foundation, too, btw -- given that Trump probably couldn't squeeze a billion dollars out of that stock without crashing the value of the stock, in other words, come on -- that's \"bullshit\". ",
            "created": "Thu, 22 Aug 2024 17:04:23 GMT",
            "flInCalendar": true
        },
        {
            "text": "In any case, there's a good argument to be made that Trump's negative net worth in everything but Truth Social stock on a balance sheet would negate even the full value of his stock. ",
            "created": "Thu, 22 Aug 2024 17:10:08 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}