{
    "created": "2024-07-05T04:00:00.000Z",
    "flInCalendar": true,
    "name": "05",
    "path": "2024/07/05",
    "text": "July 05",
    "type": "calendarDay",
    "subs": [
        {
            "text": "You say you want Biden to step down. You've been heard. This is the President of the United States. If you don't respect the man at least respect the office. ",
            "created": "Sat, 06 Jul 2024 00:15:31 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2024/05/05/marchOnWashington.png",
            "flInCalendar": true
        },
        {
            "text": "Congrats to Threads on a good first year. Looks like I <a href=\"https://www.threads.net/@davew\">signed in</a> on opening day, <a href=\"http://scripting.com/2023/07/05.html\">July 5, 2023</a>. They have done a good job of slipping into the spot previously occupied exclusively by Twitter.",
            "created": "Fri, 05 Jul 2024 14:06:32 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Threads gives you a virtual <a href=\"https://imgs.scripting.com/2024/07/05/stub.png\">ticket stub</a> for when you join, nice touch.",
            "created": "Fri, 05 Jul 2024 18:53:00 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://www.threads.net/@davidhowardthornton/post/C9Du3-hyguy\">Threads</a>: \"The reason people are finally talking about Project 2025 is because an actress used her platform to bring attention to it when the media failed to.\"",
            "created": "Sat, 06 Jul 2024 00:46:13 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "This year I'm thinking how we can boot up a source of news that has the balance we deserve. Now that the Supreme Court is no longer keeping up any pretense of respecting the Constitution, and journalism is either colluding, or preparing for their meeting with a military tribunal in March next year, followed by, if lucky, a re-education camp, we need help knowing what's real and what's <a href=\"http://scripting.com/2024/07/04/bullshit2.m4a\">not</a>. ",
            "created": "Fri, 05 Jul 2024 14:08:02 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I hear that cancelling a NYT subscription is wicked hard. That <a href=\"http://scripting.com/2024/07/04/bullshit2.m4a\">alone</a> makes me feel like cancelling. I cancelled their morning email of things I need to know about. It's one thing for them to exclusively report on Biden's age in their space, but my mailbox is mine. Get the F out of my mailbox. ",
            "created": "Fri, 05 Jul 2024 14:12:07 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}