{
    "created": "2024-07-06T04:00:00.000Z",
    "flInCalendar": true,
    "name": "06",
    "path": "2024/07/06",
    "text": "July 06",
    "type": "calendarDay",
    "subs": [
        {
            "text": "We should try <a href=\"https://github.com/scripting/opml.org/issues/22#issuecomment-2211828371\">this</a> someday: A twitter-like system built with feeds, with all their limits. People can link to my posts, but not attach themselves to my flow. Goodbye spam and the motive for abuse, attention. Something I'd like to try someday, but first you need people who are interested. It's a chicken and egg thing.  ",
            "created": "Sat, 06 Jul 2024 18:03:23 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I wonder if people remember what a divided Democratic party is like. Obama had Hillary. Hillary had Bernie. Gore had Nader. Bill Clinton had Perot. I guess Mondale and Dukakis unified the party? Before that, Ted Kennedy and Jimmy Carter, that was something. open war. Probably we'll all be wishing for Joe Biden if you all succeed at getting him to resign. BTW he's just one person, there's a limit to how much <a href=\"http://scripting.com/2024/07/04/bullshit2.m4a\">bullshit</a> one person can absorb.",
            "created": "Sat, 06 Jul 2024 17:44:24 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2022/02/16/gaslight.png",
            "flInCalendar": true
        },
        {
            "text": "Journalists don't give the orders. That's what's out of whack. ",
            "created": "Sat, 06 Jul 2024 14:23:15 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I cancelled my NYT subscription. They can't hear their readers. It's time for a new journalism, and we're going to have to do it without them. I haven't cancelled my Washington Post subscription yet, but I'm pretty sure that's coming soon enough.",
            "created": "Sat, 06 Jul 2024 13:56:42 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The SF newspaper strike of 1994",
            "created": "Sat, 06 Jul 2024 15:39:11 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2024/07/06/theSanFranciscoNewspaperStrikeOf1994.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "8371998",
            "subs": [
                {
                    "text": "In this <a href=\"http://scripting.com/2024/07/06/theSanFranciscoNewspaperStrikeOf1994.m4a\">podcast</a> I tell the story of the move from print to the web in 1994 when the San Francisco newspapers went on strike. I was part of that process, a step in the bootstrap that led to the social web. ",
                    "created": "Sat, 06 Jul 2024 15:39:27 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I'm thinking about that process as journalism system is losing its mind, like everything else, and we need to find a way to flow intelligent news to people who need it, so we can start to organize, and we need to do it <i>now. </i>",
                    "created": "Sat, 06 Jul 2024 15:56:19 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The flow are out there, smart people who know stuff and have ideas, but they aren't getting heard amidst the mindlessness of the NYT, CNN, MSNBC et al. ",
                    "created": "Sat, 06 Jul 2024 15:40:44 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It's a long story, and it starts off crisp like most of my stories and then rambles out. ",
                    "created": "Sat, 06 Jul 2024 15:41:18 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "16 minutes.",
                    "created": "Sat, 06 Jul 2024 15:43:41 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}