{
    "created": "2024-07-19T04:00:00.000Z",
    "flInCalendar": true,
    "name": "19",
    "path": "2024/07/19",
    "text": "July 19",
    "type": "calendarDay",
    "subs": [
        {
            "text": "An eye-opening <a href=\"https://www.wnyc.org/story/leader-jeffries-talks-biden-politics/\">segment</a> on Brian Lehrer's <a href=\"https://feedland.com/?river=https%3A%2F%2Ffeeds.simplecast.com%2FC8a1jmw4\">show</a> today. The first half is an interview with <a href=\"https://en.wikipedia.org/wiki/Hakeem_Jeffries\">Hakeem Jeffries</a>, you can skip that part, pretty standard stuff. It gets interesting at 17:50 when they take calls from listeners. A lot of different points of view from people of all ages, they're incredibly passionate, well thought-out, coherent. This is way better than the punditry you hear on news. The real crime here is that the insiders of the Democratic Party are taking control, after they were manipulated by the press. A total insider's route-around of the democratic process, it's just as bad imho as what the Repubs are planning around Election Day. The press did the same thing to NY governor Andrew Cuomo, who was elected by the people, and forced out without any legal process, and certainly not a vote. That experience argues in favor of when you're in doubt, do the thing the voters said to do. Anything else is very very questionable. Why are you taking control? Where are you authorized to do that? I think perhaps some of the Dems forget how huge an issue this was in the 2016 process. ",
            "created": "Fri, 19 Jul 2024 20:10:20 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2012/09/15/sorryWeHaveOurHeadUpOurButt.gif",
            "flInCalendar": true
        },
        {
            "text": "Historically it's unjustifiable. The NYT et al are grievously wrong, and that should be reflected on their op-ed pages. We've been here before, this is as much a hack as Hillary's Emails. Maybe you can't see it now, but win or lose, people are going to look at this period when we all lost our minds.",
            "created": "Fri, 19 Jul 2024 20:44:12 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I posted the above piece around the social web, I like the way it looks <a href=\"https://www.threads.net/@davew/post/C9njHDMJyo8\">on Threads</a> the best. ",
            "created": "Fri, 19 Jul 2024 20:43:15 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://ma.tt/2024/07/6-6/\">Matt says</a> some interesting new stuff is coming from Automattic now that <a href=\"https://wordpress.org/news/2024/07/dorsey/\">WordPress 6.6</a> is out. Something for writers? Perhaps something that moves WordPress into a space adjacent to twitter-like systems? They just added support for <a href=\"https://www.threads.net/@davew\">Threads</a> to WordPress, so now you can <a href=\"https://jetpack.com/social/\">crosspost</a> from a blog to a thread. Haven't tried it yet. They also have a new <a href=\"https://blog.gravatar.com/2024/06/03/profiles-as-a-service/\">identity system</a> built around Gravatar, announced in early June. It'll be interesting to see what they come out with. I wonder if there is a developer ecosystem building on this, and if they have an evangelism program. I have my own vision of how these things should work. ",
            "created": "Fri, 19 Jul 2024 13:09:45 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Now that <a href=\"https://slate.com/business/2024/07/elon-musk-donald-trump-donation-republican-twitter-troll-meme-posts.html\">Elon Musk</a> is giving so generously, dollars and <a href=\"https://imgs.scripting.com/2024/07/19/ohTheBullshit.png\">flow</a>, to the fascists, he's encouraging more of us to use Zuckerberg's twitter-like system, aka <a href=\"https://www.threads.net/@davew\">Threads</a>. But Zuck isn't making it go down easy. There's a piece in <a href=\"https://www.bloomberg.com/news/articles/2024-07-19/mark-zuckerberg-calls-donald-trump-badass-without-endorsing-for-president\">Bloomberg</a> (paywall) that says Trump is <a href=\"https://www.theguardian.com/us-news/live/2024/jul/19/trump-biden-rnc-democrats-election-updates\">badass</a> but isn't supporting either candidate. What could possibly go wrong? ",
            "created": "Fri, 19 Jul 2024 13:28:57 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Wordle Kitty partied hearty",
            "created": "Fri, 19 Jul 2024 20:52:26 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "She had to sleep it off. Still very cute!",
                    "created": "Fri, 19 Jul 2024 20:52:40 GMT",
                    "inlineImage": "https://imgs.scripting.com/2024/07/19/wordleKittySleptItOff.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}