{
    "created": "2024-07-25T04:00:00.000Z",
    "flInCalendar": true,
    "name": "25",
    "path": "2024/07/25",
    "text": "July 25",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Biden's speech might turn out to be a <a href=\"https://en.wikipedia.org/wiki/Gettysburg_Address\">Gettysburg</a> type speech. I hope it does. ",
            "created": "Thu, 25 Jul 2024 19:30:40 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2024/02/14/bidenActionFigure.png",
            "flInCalendar": true
        },
        {
            "text": "We're at a huge fork in the road. One fork -- goodbye USA, the other way, we're stronger than ever. We're in a good spot because Trump's tank is empty. He's old, tired, fat, addled, fetid, rotten. You have to work really hard not to see that. If it works, Biden will have stabilized the country, and Harris will erect the guardrails that make sure no one follows in Trump's path, and the Supreme Court gets back into its proper place. They've been overthrowing our society, economy and political system. That all has to be reversed before it does too much damage, and prevented in the future. I want to know why the court can't be expanded, and if Harris will put that in her platform. ",
            "created": "Thu, 25 Jul 2024 20:04:42 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I almost used <a href=\"https://www.google.com/search?q=site%3Ascripting.com+enshitification\">enshitification</a> in a post yesterday. ",
            "created": "Thu, 25 Jul 2024 19:05:17 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "It's weird that JD Vance goes out with the insults before most people have any idea who he is. Instead of <a href=\"https://www.bbc.com/news/articles/cpe3pz2pz8no\">childless cat ladies</a> sticking to Kamala, it's sticking to him, which I'm pretty sure wasn't his intent. ",
            "created": "Thu, 25 Jul 2024 19:03:04 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Pretty remarkable how abusive the bots on Twitter have become. Makes discourse there seem pretty silly. Might as well turn it into a one-way medium, for all practical purposes that's what it is.",
            "created": "Thu, 25 Jul 2024 19:02:45 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I want a Masto-clone that does not do replies. You can't insert anything under my idea, but you can if you like include my idea, as a link, in yours. This model works. I think by now we know the other way does not work. BTW I use the term Masto-clone interchangeably with Twitter-like. Let's spread the love around. ",
            "created": "Thu, 25 Jul 2024 19:16:05 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Software-wise I realized recently that everything that takes me away from creating really nice writing and publishing tools is a waste. I have to get off track because there are huge holes in the web as a runtime platform. And every year it gets worse as new incompatible languages are added, new incompatible stacks built. As a result we have to re-do everything all the time, and never get a chance to create new user experience. The market fragments, which is exactly what the tech companies want. It keeps their products from becoming commodities. And like it or not, the politicians and corporations don't want us writing too much, they just want us working, donating to their campaigns, paying taxes, buying their crap, and not getting all agitated about things they don't care about. ",
            "created": "Thu, 25 Jul 2024 19:23:11 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Optimisim",
            "created": "Thu, 25 Jul 2024 19:18:35 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I am optimistic that Trump is headed for the graveyard of history, shortly. ",
                    "created": "Thu, 25 Jul 2024 19:18:40 GMT",
                    "image": "https://imgs.scripting.com/2020/11/27/kamala.png",
                    "flInCalendar": true
                },
                {
                    "text": "First time I've felt like this in a long time. ",
                    "created": "Thu, 25 Jul 2024 20:11:29 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "When (if) that happens, we can use Cory Doctorow's excellent concept \"enshitification\" to describe what he did to the American political system.",
                    "created": "Thu, 25 Jul 2024 19:18:56 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "He also stress tested it, and we would be the greatest fools imaginable if we didn't add some seriously enforceable guardrails to prevent this kind of attack happening in the future. ",
                    "created": "Thu, 25 Jul 2024 19:20:52 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Might work out well to have a <a href=\"https://en.wikipedia.org/wiki/Kamala_Harris\">lawyer</a> in the White House. ",
                    "created": "Thu, 25 Jul 2024 20:13:25 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "JD Crank goes to Mardi Gras",
            "created": "Thu, 25 Jul 2024 19:12:17 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "JD goes as a childless cat lady in the Cretins of Trumpland <a href=\"https://en.wikipedia.org/wiki/Krewe\">krewe</a>.",
                    "created": "Thu, 25 Jul 2024 19:12:34 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Hey Mister throw me a kitten!",
                    "created": "Thu, 25 Jul 2024 19:13:23 GMT",
                    "inlineImage": "https://imgs.scripting.com/2024/07/25/cretinsOfTrumpland.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}