{
    "created": "2024-07-30T04:00:00.000Z",
    "flInCalendar": true,
    "name": "30",
    "path": "2024/07/30",
    "text": "July 30",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I said on <a href=\"http://scripting.com/2024/07/25.html\">Thursday</a> that Biden's speech last Wednesday had the potential to be a <a href=\"https://en.wikipedia.org/wiki/Gettysburg_Address\">Gettysburg</a> address, if it the United States turns back toward democracy and government of the people, by the people and for the people. Biden has the potential of being as great a president as Lincoln. Let that settle in for a moment. I get goosebumps when I think about it. If he hadn't taken that stand, he could have become known as the US equivalent of <a href=\"https://en.wikipedia.org/wiki/Wilhelm_II#Life_in_exile\">Kaiser Wilhelm</a>.",
            "created": "Tue, 30 Jul 2024 15:52:57 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The \"Podcast0\" project is teaching me how to read the archive of my own blog. Until now I had not carefully read the story I tell on my blog more than a few days after it happened. Here's I'm learning to reconstruct the summer of 2004, one of the most creative periods of my life, at least that's viewable in such a public and preserved way. Am I the first to do this for any blog? If you know of an example of historic research done using the archive of a blog, please send me a note. I'd love to learn about what you learned! Also because of its longevity and continuity, I offer <a href=\"http://scripting.com/2024/07/25.html\">this blog</a> as some kind of record of what happened in the last 30 years or so. I see it as a complete work of writing, a kind of <a href=\"https://en.wikipedia.org/wiki/Fresco\">fresco</a> writing. ",
            "created": "Tue, 30 Jul 2024 15:57:28 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Like 193K others I tuned into <a href=\"https://apnews.com/article/harris-supporters-by-ethnic-background-white-dudes-b474af62f6b225c71cde16be7e9eb077\">White Dudes For Harris</a> last night. Please, let that be the last time we do that. I felt like it might as well have been <i>Slave Owners for Harris</i> or <i>Reformed Republicans for Harris.</i> I don't have anything against people of my gender and approximate race, but I also am a child of Holocaust survivors, and I happen to be one of the elites the Repubs claim to hate, and also am one of at least two castes that Democrats tend to blame for all our problems (other than White Dudes). I think we've done enough segregation for one campaign, now please please I beg you, let's <i>work together,</i> regardless of labels, to save the country we all love. I have a philosophy, I don't care how you got to the party, if you took a subway, walked, rode a bike, or came by Uber or a Cadillac limousine. We all got here, and have a common purpose, so lets all love each other and party our way to victory. Regardless of race, creed, color or whatever. ",
            "created": "Tue, 30 Jul 2024 12:39:18 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2024/06/18/patrioticKitty.png",
            "flInCalendar": true
        },
        {
            "text": "Childless vs childful",
            "created": "Tue, 30 Jul 2024 15:45:18 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Notes accumulated during the day -- not in any particular order. :smile:",
                    "created": "Tue, 30 Jul 2024 16:20:32 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I keep a solid line between my personal life and blogging, learned the hard way. When I started blogging in 1994, I didn't have such a solid line, and found that I couldn't have a personal life if I made it public. But now I want to reveal something. I am \"childless\" which is a term I find pretty insulting, as if being child<i>ful</i> is the only normal state of being. ",
                    "created": "Tue, 30 Jul 2024 15:23:03 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I find, in general childful people are not great friends or family members. They want special privileges and they often get them. If childful vs childless is going to be an issue in this campaign, I say -- bring it on. We should have this discussion. ",
                    "created": "Tue, 30 Jul 2024 16:12:12 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I'm often tempted to offer advice to the parents, but I won't offer it unless asked, except this. If you have children, there's a good chance one or more of them will not have children, and you should love them the same, and provide models of acceptance while they're growing up, by bringing childless people into your home, so the kids know that this is one of the legitimate choices in life, offering proof that you won't love them any less if they go down that path. And here's the hard part, imho, for people with children -- <i>keep that promise. </i>",
                    "created": "Tue, 30 Jul 2024 15:47:03 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "BTW, people say it's seflish to not have children, but I don't agree, in fact I think it's the opposite. There was a point in human evolution where the struggle to survive for our species was fed by procreation, but some time in the last hundred years we crossed a line, where increasing human population worked against species survival. Our understanding of the meaning of procreating, like so much else about our civilization, has not yet caught up with the current reality. ",
                    "created": "Tue, 30 Jul 2024 15:47:34 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}