{
    "text": "What's wrong with Facebook",
    "created": "Mon, 05 Oct 2020 15:03:32 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Yesterday I <a href=\"http://scripting.com/2020/10/04/135949.html?title=checkingInOnTwitter\">wrote</a> about what's right with Twitter these days. ",
            "created": "Mon, 05 Oct 2020 15:03:38 GMT"
        },
        {
            "text": "Today -- Facebook. ",
            "created": "Mon, 05 Oct 2020 15:03:49 GMT"
        },
        {
            "text": "One thing overshadows all other considerations. They swapped out the old user interface in favor of a new more modern-looking one. It is more attractive, better use of fonts, the text is generally more readable, and it has a brighter look. ",
            "created": "Mon, 05 Oct 2020 15:03:54 GMT"
        },
        {
            "text": "But that's all that I can say about it that's good.",
            "created": "Mon, 05 Oct 2020 15:04:52 GMT"
        },
        {
            "text": "What's bad? The product is depressing. Almost everything it shows you is junk. They must be trying to get us to stop using Facebook. ",
            "created": "Mon, 05 Oct 2020 15:05:02 GMT"
        },
        {
            "text": "This isn't the usual thing, users hate redesigns, but get used to them and after a while see that it's better in some ways, worse in others. I've been using it for a while, and it's every bit as ridiculous today as it was a few weeks ago. ",
            "created": "Mon, 05 Oct 2020 15:20:32 GMT"
        },
        {
            "text": "First all the spam friend requests are treated as super important, higher priority than anything else.",
            "created": "Mon, 05 Oct 2020 15:09:55 GMT"
        },
        {
            "text": "It's like opening your real-world mailbox and all you get are catalogs, mailers, special offers, political ads, notices, most of it goes in the garbage, but you have to look at everything, because there will be things you have to pay attention to. ",
            "created": "Mon, 05 Oct 2020 15:12:14 GMT"
        },
        {
            "text": "How can their code fail to see that all the friend requests I get are spam? ",
            "created": "Mon, 05 Oct 2020 15:06:31 GMT"
        },
        {
            "text": "No one with any influence inside Facebook is using the version of the software we are using or they'd revert it immediately and then fix it. I've seen companies ship upgrades so bad the company failed, and this one is right up there. ",
            "created": "Mon, 05 Oct 2020 15:07:46 GMT"
        }
    ]
}