{
    "text": "The military is split",
    "created": "Sat, 21 Oct 2017 15:37:17 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "We found out something pretty horrifying in the last couple of days, and it's important to absorb it before it passes in whatever controversy comes up next. ",
            "created": "Sat, 21 Oct 2017 15:37:25 GMT",
            "image": "http:///scripting.com/images/2017/10/21/beeltlejuice.png"
        },
        {
            "text": "<a href=\"https://www.nytimes.com/2017/10/19/us/politics/statement-kelly-gold-star.html?_r=0\">We saw</a> the actual personality of the White House Chief of Staff for the first time. He's a general. And he's one of the most powerful people in civilian oversight of the military. Maybe second only to the president. And he doesn't believe in the Constitution. ",
            "created": "Sat, 21 Oct 2017 15:43:46 GMT"
        },
        {
            "text": "He walked all over the First Amendment in his presser. There must be others in the military that see this (they watch TV too). So now we have two factions, one that believes in the Constitution and civilian oversight, and the other that doesn't. And it appears that the one that doesn't has vastly more power than the others. It's in the White House. ",
            "created": "Sat, 21 Oct 2017 15:43:11 GMT"
        },
        {
            "text": "Kelly is not a stupid man. He couldn't be where he is if he was. He knows what he said and did, and the message not only went out to the public, it went out to the military. It signaled in ways that can't be signaled through the chain of command, how the country is now being governed. So there's a pretty good chance we're on the other side of a military takeover. Seems almost tautological. It's visible now, if you believe what you saw on TV, and is likely to become <a href=\"https://www.youtube.com/watch?v=Ot11DMJKhj8\">more visible</a>. ",
            "created": "Sat, 21 Oct 2017 15:43:22 GMT"
        },
        {
            "text": "BTW, I also don't think it's a coincidence that both Obama and Bush spoke yesterday, saying basically the same thing. We are not a fascist country. I suspect they were also talking to the military.",
            "created": "Sat, 21 Oct 2017 15:42:23 GMT"
        }
    ]
}