{
    "text": "Democratic resurrection plan",
    "created": "Fri, 13 Jun 2025 16:27:09 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Having a <a href=\"http://scripting.com/2020/07/01/152316.html?title=whatWouldCuomoDo\">Democrat</a> rise from the ashes of <a href=\"https://daytona.scripting.com/search?q=metoo\">metoo</a> is just what the doctor ordered. It could cure the revulsion some voters feel for Democratic wokeness. <a href=\"https://daytona.scripting.com/search?q=cuomo\">Cuomo</a> was never tried or convicted of any crime, or voted out of office by the state assembly or senate in Albany. Or the people of the State of New York. Al Franken wasn't allowed to have his case adjudicated by a committee of Congress. Both were pushed from office by journalism, which imho needs to be put in their place, they've been sloshing into lanes they weren't elected to. Let me try to make this clear. Journalism's role is to inform us of events. Once informed, it's their responsibility to stop. Anything past that is campaigning, not news. Step back and let the process run its course. Ultimately it's the people who will decide. Now, if Cuomo wins, this is the best outcome possible because the NYT et al will complain endlessly about how the Democrats just elected someone who they <a href=\"https://www.youtube.com/watch?v=4gi9zFRBCIM\">don't approve of</a>. This will probably get the Dems more votes in coming elections, because there are a lot of people who legitimately are disgusted by the NYT trying to run the show. If you want to govern, run for office. If you want to be a journalist, know when it's time to shut up.",
            "created": "Fri, 13 Jun 2025 12:47:08 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2024/07/04/butHerEmails.png",
            "flInCalendar": true
        },
        {
            "text": "BTW isn't it amazing that when you say something counter to Democratic dogma, their first impulse is to try to destroy you? If the Dems were a healthy political party and not a religion, their first impulse would be to try to work with you not destroy you.",
            "created": "Fri, 13 Jun 2025 13:01:18 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "\"Who me?\" asks the Democrat. Yes, you. ",
            "created": "Fri, 13 Jun 2025 13:24:11 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "You'll know who the next leader of the Democratic Party is because they will be campaigning against the Democratic Party. Talking about things that actually happened rather than the hallucinations the Trumpies indulge in. ",
            "created": "Fri, 13 Jun 2025 13:17:02 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}