{
    "text": "On Tesla, Nazis, X and the Macintosh of cars",
    "created": "Tue, 09 Apr 2024 16:03:39 GMT",
    "type": "outline",
    "description": "Tesla is like the Macintosh of cars.",
    "subs": [
        {
            "text": "I'm not sure I'd buy a Tesla today because of Musk's politics which he puts in our face, thus influencing other people to inflict their nightmares on us. I bet in the end Musk will be responsible for a lot of people dying. ",
            "created": "Tue, 09 Apr 2024 15:46:57 GMT",
            "flInCalendar": true
        },
        {
            "text": "On the other hand, I love the car, and thus love the people who developed it, who I don't know. I hope they're not Nazis. I don't see how someone who could design such a thing as a Tesla Model Y, in <a href=\"http://scripting.com/2021/11/19/140204.html?title=myNewTesla\">2021</a>, the year I bought mine, could be anything like that. ",
            "created": "Tue, 09 Apr 2024 16:09:52 GMT",
            "flInCalendar": true
        },
        {
            "text": "This car is going to be copied. There will be a generation of cars that comes along, some that have not arrived yet, that will have to stand up to a comparison to a Tesla. This is the original. ",
            "created": "Tue, 09 Apr 2024 16:10:09 GMT",
            "flInCalendar": true
        },
        {
            "text": "To be alive when such a product comes out and not own one, that would be hard for me to do. I don't think my \"support\" of Tesla could mean that much. The money is already spent. It costs nothing to maintain the car (one of its innovations). ",
            "created": "Tue, 09 Apr 2024 16:10:45 GMT",
            "flInCalendar": true
        },
        {
            "text": "It's like the Macintosh of cars. I would have owned a Macintosh in 1984 even if I wasn't one of Apple's top developers. I also know that Steve Jobs didn't design the machine, he stole it from people at Xerox who did. Apple refined the idea, made it practical, like a Tesla, commercial. That's a huge accomplishment, commercializing and humanizing a concept like the Mac was harder than inventing, imho. I have a feeling that Tesla must stand on the shoulders of giants in a similar way. ",
            "created": "Tue, 09 Apr 2024 16:11:09 GMT",
            "image": "https://imgs.scripting.com/2024/04/09/word.png",
            "flInCalendar": true
        },
        {
            "text": "Tesla is always sending me emails, which I usually read, but last week I got one urging me to join X. I thought what bullshit. I don't want these products connected. There was a time, not that long ago, that I would have thought a car hooked up to Twitter as a fantastic and futuristic idea, but now, I think it means no one of principle, certainly no one who is a target of Nazis could work at Tesla in the future. And those are some of the brightest people out there. ",
            "created": "Tue, 09 Apr 2024 16:06:43 GMT",
            "flInCalendar": true
        },
        {
            "text": "Meanwhile I'm looking at other company's EVs with lust. I might like a Kia or a BMW. If you're making a consumer product, Nazi branding is not a good look. And X is becoming a stinker too. ",
            "created": "Tue, 09 Apr 2024 16:13:08 GMT",
            "flInCalendar": true
        },
        {
            "text": "PS: I was inspired to write this piece by one written by <a href=\"https://werd.io/\">Ben Wurdmuller</a> <a href=\"https://werd.io/2024/i-tried-tesla-fsd\">posted yesterday</a>. I've had much the same feeling about <a href=\"https://www.tesla.com/ownersmanual/modely/en_us/GUID-2CB60804-9CEA-4F4B-8B04-09B991368DC5.html\">FSD</a>. This piece started out to be about FSD, but the preamble, like the one in his piece, got so long I decided to post it first as its own piece. ",
            "created": "Tue, 09 Apr 2024 16:21:47 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}