{
    "text": "Amazon is ditching Queens",
    "created": "Thu, 14 Feb 2019 19:08:27 GMT",
    "type": "outline",
    "description": "I don't think importing the kind of growth seen in Seattle or San Francisco is in the city's interest. #",
    "subs": [
        {
            "text": "Is it bad news that <a href=\"https://www.techmeme.com/190214/p16#a190214p16\">Amazon has decided</a> not to grow in Queens? As someone who was raised in Queens, I think it's <i>not</i> bad news.  ",
            "created": "Thu, 14 Feb 2019 19:08:56 GMT",
            "image": "http://scripting.com/2015/10/26/mrmet.png"
        },
        {
            "text": "There are considerations other than jobs -- primary among them is affordable housing. Manhattan is out of reach for most, and Brooklyn is getting gentrified at a huge rate, and it's now moving into Queens in exactly the <a href=\"https://en.wikipedia.org/wiki/Long_Island_City\">area</a> Amazon wants to build.",
            "created": "Thu, 14 Feb 2019 19:08:35 GMT"
        },
        {
            "text": "Having been through the boom in the Bay Area, I can tell you there is definitely a downside to all the high paying jobs. It means people of average means are pushed out of their neighborhoods. And everything that made the neighborhoods special goes with them.",
            "created": "Thu, 14 Feb 2019 19:09:49 GMT"
        },
        {
            "text": "Queens is an amazing melting pot. Probably the most ethnically diverse county in the country. If you own real estate in Queens then of course you want Amazon, because it will make the value of your property go up. But if you live there and want to keep living there, and are of modest means, it's not such a great deal for you.",
            "created": "Thu, 14 Feb 2019 19:10:11 GMT"
        },
        {
            "text": "The Queens melting pot with immigrant families building new lives in the US is the kind of growth New York has always built on, generation after generation. I don't think importing the kind of growth seen in Seattle or San Francisco is in the city's interest. ",
            "created": "Thu, 14 Feb 2019 19:16:25 GMT"
        }
    ]
}