{
    "text": "Watched <a href=\"https://www.metacritic.com/movie/oppenheimer/\">Oppenheimer</a> last night. Very good movie. I like the artistic flourishes, reminds me of another movie I watched recently and liked, a lot, <a href=\"https://www.metacritic.com/movie/spencer/\">Spencer</a>. I wasn't really interested in the life and death of Lady Di, but I also got through the latest episodes of The Crown, which I had resisted when the newest Queen was <a href=\"https://en.wikipedia.org/wiki/The_Crown_(season_5)\">introduced</a>. I find it hard to make the adjustment to new actors playing the roles of characters I had come to love, esp <a href=\"https://en.wikipedia.org/wiki/Claire_Foy\">Claire Foy</a> as young Queen Elizabeth, a fantastic actress who played in one of the most spectacular dramatic <a href=\"https://www.youtube.com/watch?v=rBwQICiGRmw\">scenes</a> anywhere anytime. The <a href=\"https://en.wikipedia.org/wiki/The_Crown_(season_6)\">latest episodes</a> of The Crown were about Diana mostly, and were fantastic. Back to Oppenheimer. I'll try not to spoil it too much, but the drama is puzzling, why are they going after Oppenheimer when he miraculously put together the <a href=\"https://en.wikipedia.org/wiki/Manhattan_Project\">Manhattan Project</a> which created, in a race with Germany and the USSR, the bomb that ended World War II. The final scene, a flashback to an earlier scene where we didn't hear the dialog, between Oppenheimer and his colleague at Princeton, <a href=\"https://en.wikipedia.org/wiki/Albert_Einstein\">Albert Einstein</a>, about what happens when you create something that changes the direction of humanity. What happens is this -- they push you aside. I'm not comparing myself to these two giants, but I have had the same question about how tech reacted to my contributions. My conclusion was that our culture has reason to erase the accomplishments of outliers. We prefer innovation to come in nice predictable packages, with a PR person on top, and when that's disturbed, we close ranks to make it all appear very ordinary. Anyway, all of this is very good holiday entertainment and thought provoking. My next adventure in video is <a href=\"https://www.metacritic.com/tv/pachinko/\">Pachinko</a> on Apple TV, which is somewhat confusing, but keeps me coming back, it's so compelling. I still have the last seasons of <a href=\"https://www.metacritic.com/tv/ted-lasso/\">Ted Lasso</a> and <a href=\"https://www.metacritic.com/tv/reservation-dogs/\">Reservation Dogs</a> in the queue. And of course there's a new season of <a href=\"https://en.wikipedia.org/wiki/Fargo_(season_5)\">Fargo</a>, which I'm sure I'll love. Right now my plan is to wait for the series to end and watch it all in a binge. ",
    "created": "Sun, 26 Nov 2023 14:18:22 GMT",
    "type": "outline",
    "image": "https://imgs.scripting.com/2023/11/26/oppenheimer.png",
    "flInCalendar": true
}