{
    "text": "Wikipedia vs ChatGPT",
    "created": "Sun, 09 Jun 2024 14:40:26 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "<i>I started replying to a <a href=\"https://mastodon.social/@timbray@cosocial.ca/112582969576496746\">post by Tim Bray</a> in a thread on Mastodon, but quickly hit the character limit, so I moved my act over here. </i>",
            "created": "Sun, 09 Jun 2024 14:40:37 GMT",
            "flInCalendar": true
        },
        {
            "text": "ChatGPT gets rid of a huge problem with Wikipedia. ",
            "created": "Sun, 09 Jun 2024 14:41:24 GMT",
            "flInCalendar": true
        },
        {
            "text": "It often only represents a story from one point of view.",
            "created": "Sun, 09 Jun 2024 16:19:47 GMT",
            "flInCalendar": true
        },
        {
            "text": "So the story of the Mac is a story of Apple, not the developers.",
            "created": "Sun, 09 Jun 2024 14:42:44 GMT",
            "flInCalendar": true
        },
        {
            "text": "Same with the story of RSS. I'm sure you know the story they tell, but there's a whole other story, about how Netscape and blogging got together with Salon, Wired, Red Herring and  Motley Fool, and eventually brought the NYT and NPR on board, and that created a powerful standard supported by the entire publishing industry, that led to social media and podcasting. It really has very little do with the attempts of the tech industry to undermine it, other than their attempts failed to do that, yet if you read the Wikipedia page you'd get the idea that the bigco's heroically fought back against what exactly it's not clear. ",
            "created": "Sun, 09 Jun 2024 14:42:54 GMT",
            "flInCalendar": true
        },
        {
            "text": "I can't contribute to that page, based on the rules of Wikipedia, so your idea that I could just work harder to get the story right, well it's not ethical for me to do that. The best I can do is write about it on my blog (as I'm doing now) and hope that someone goes in there and fights with whoever is in charge of keeping the story as it is. (Although Tim, not you, it would be unethical for you too.)",
            "created": "Sun, 09 Jun 2024 14:56:51 GMT",
            "flInCalendar": true
        },
        {
            "text": "Wikipedia also has served as a way for people to take credit for things other people did. Notoriously, Ben Hammersley claiming he chose the name for podcasting, for which there is absolutely no support. If ChatGPT made a mistake like that people would be howling. I'm sure Wikipedia is filled with junk like that. Why wouldn't it be. ",
            "created": "Sun, 09 Jun 2024 14:58:55 GMT",
            "flInCalendar": true
        },
        {
            "text": "And btw, I still point to Wikipedia pages from my blog posts over all other sources, because it has the potential of getting better, while other sources don't. ",
            "created": "Sun, 09 Jun 2024 14:52:21 GMT",
            "flInCalendar": true
        },
        {
            "text": "But ChatGPT is Wikipedia plus everything else and it has software far in advance of search engines for uncovering alternate angles. ",
            "created": "Sun, 09 Jun 2024 14:52:51 GMT",
            "flInCalendar": true
        },
        {
            "text": "ChatGPT gets all angles of a story, if they have been covered on the open web. I don't know why it's better at finding stuff, and also understanding my queries even though they're not rigorously specified, my understanding of the technology is nil, but as a user, I love the way I can explore history, and get a lot more than just the result of a weird culture that you have to spend years politicing through to be able to contribute. ChatGPT has managed to route around that outage.",
            "created": "Sun, 09 Jun 2024 14:46:20 GMT",
            "flInCalendar": true
        },
        {
            "text": "It's also an amazing programming partner, and I imagine that it would work just as well for visual artists if they used it to try out prototypes of ideas, esp if new ways of training it are explored, which of course they are being. ",
            "created": "Sun, 09 Jun 2024 14:48:08 GMT",
            "flInCalendar": true
        },
        {
            "text": "Having known each other for 20+ years, I suppose that's a big difference between us, you seek out those kinds of political frays, I get very impatient with them and move on. ",
            "created": "Sun, 09 Jun 2024 14:46:48 GMT",
            "flInCalendar": true
        },
        {
            "text": "Also, I'm not here to debate. I don't like online debates. :smile:",
            "created": "Sun, 09 Jun 2024 14:49:06 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}