{
    "text": "Why I mostly develop for myself these days",
    "created": "Wed, 05 Jul 2017 14:32:41 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Mostly I hear from users of my free products when things break. At that time I am playing the role of a support person. I don't mind doing it, but when I think about whether or not I want to create products for others to use, the totality of my personal experience with users is the biggest factor. ",
            "created": "Wed, 05 Jul 2017 14:32:50 GMT",
            "image": "http://scripting.com/images/2017/07/05/marinaraSauce.png",
            "permalink": "http://scripting.com/2017/07/05.html#a100750"
        },
        {
            "text": "If most of what I get back are requests to do <i>more</i> for them, a perspective that says \"I am the customer and you are here to serve me,\" without anything coming back, well these days I don't bother shipping the product. I just create stuff for my own use. I've actually come to like that. Then I don't have to worry about what will users who pay no attention be able to figure out. ",
            "created": "Wed, 05 Jul 2017 14:33:42 GMT",
            "permalink": "http://scripting.com/2017/07/05.html#a100742"
        },
        {
            "text": "Making software is very labor intensive hard stressful work. And the system is totally falling apart. Has been for a long time. If you want people to make new software for you, you should find ways to show appreciation and to help. These days users apply all the intellect our president applies to his job. If a mindless person can't understand your product, then don't bother. So I often don't bother.  No surprise there, right? If there's no reward, why keep banging your head against the wall?",
            "created": "Wed, 05 Jul 2017 14:35:01 GMT",
            "permalink": "http://scripting.com/2017/07/05.html#a100701"
        },
        {
            "text": "Many developers say the same thing. Maybe what's needed is a better network of software developers. Maybe we should use each others' products so we can work to make them compatible? Maybe users can help spread the word about products they love so the size of the user bases can justify continued development? So there's some hope of some day getting compensation for the hard work we do?",
            "created": "Wed, 05 Jul 2017 14:37:40 GMT",
            "permalink": "http://scripting.com/2017/07/05.html#a100740"
        }
    ],
    "permalink": "http://scripting.com/2017/07/05.html#a100741"
}