{
    "text": "Our Banana Republic",
    "created": "Wed, 12 Feb 2020 14:32:30 GMT",
    "type": "outline",
    "description": "However cynical you may be about justice in the US, the system we've lived with has rules that limit abuse, but those rules appear to be slipping away now. ",
    "subs": [
        {
            "text": "What's going on with the DoJ is serious, the news has captured that, but the reporting misses a few important things.",
            "created": "Wed, 12 Feb 2020 14:32:55 GMT",
            "flNumberedSubs": "true",
            "subs": [
                {
                    "text": "Why we don't want justice to be partisan. The reports assume people understand, but I think a lot of people may not put two and two together. If justice is applied not based on evidence but on whether you're in favor with the president, the inverse will happen too, people are prosecuted because they're enemies of the president. Expect Comey to be arrested soon, and perhaps Schiff, Pelosi, Romney and others who have crossed Trump in more powerful ways that poor Colonel Vindman. You may say, oh well, the president is just one person, how much damage can he do, but he is the top person, and people below will look for signals and will inevitably try please him. You end up with justice being bought and paid for in favors to the top guy and his capos. A government not of laws, but of organized crime. However cynical you may be about justice in the US, the system we've lived with has rules that limit abuse, but those rules appear to be slipping away now. ",
                    "created": "Wed, 12 Feb 2020 14:33:10 GMT"
                },
                {
                    "text": "This isn't the first time \"crony justice\" has happened in the last few months, or even the biggest travesty. Recall that the DoJ refused to investigate the accusations of the Ukraine whistleblower that led to Trump's impeachment. So the House had to do its own investigating. The congressional Republicans made an issue of how the Democrats did the investigating, but the press for the most part overlooked that they shouldn't have had to do the investigating in the first place. That's why we have a DoJ. When the government is properly functioning it would have been routine, but Barr is acting as the president's attorney, not the US's attorney, therefore of course he didn't investigate.",
                    "created": "Wed, 12 Feb 2020 14:33:24 GMT"
                },
                {
                    "text": "The various departments may report to the president but they work for Congress as much as they do the president. No longer true. That's why the second article of impeachment, the one Romney didn't vote for, was so important. ",
                    "created": "Wed, 12 Feb 2020 14:35:46 GMT"
                },
                {
                    "text": "Also while it's honorable for a DoJ lawyer to resign a case, or resign from the department, and something we should applaud (as opposed to standing by and accepting the malpractice), also note that it serves Barr's purposes to get rid of the ethical people who remain, and once gone they can no longer sound the alarm. ",
                    "created": "Wed, 12 Feb 2020 14:36:26 GMT"
                }
            ]
        }
    ]
}