{
    "created": "2024-02-06T05:00:00.000Z",
    "flInCalendar": true,
    "name": "06",
    "path": "2024/02/06",
    "text": "February 06",
    "type": "calendarDay",
    "subs": [
        {
            "text": "This is the <a href=\"https://www.threads.net/@kteare/post/C2-MHcJL1L5\">first pitch</a> I’ve heard for the Apple goggles that actually makes me want to buy a pair. If there were an Apple Store nearby I probably would have already gotten it.",
            "created": "Tue, 06 Feb 2024 21:20:13 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I'm reading <a href=\"https://www.amazon.com/Oath-Honor-Warning-Liz-Cheney/dp/0316572063\">Liz Cheney's book</a>, and forgot something I had guessed during the insurrection. While it was going on Trump was calling Congresspeople saying if you stop the count I'll call off the attack. In other words, trade your life for a vote. I suspected it before, but they have testimony that verifies it.",
            "created": "Tue, 06 Feb 2024 15:32:01 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I asked ChatGPT to <a href=\"http://scripting.com/2024/01/06/040838.html\">draw</a> a \"social network for writers.\" :heart:",
            "created": "Tue, 06 Feb 2024 14:45:21 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I'm doing some writing about writing and finding the phrase \"RSS, Atom and RFD\" too cumbersome. Most people don't care and see the distinctions as unnecessary. But I want to be accurate, and recognize that while RSS is the most-used kind of feed, there are others, and our software works with them. I'm trying this construction: \"RSS-compatible.\" I think that expresses the most important point, the choice of format is up to you, but now, by 2024, they all work pretty much the same way. ",
            "created": "Tue, 06 Feb 2024 14:38:30 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Good morning. The main static server I <a href=\"http://scripting.com/2024/02/05.html#a143645\">mentioned</a> yesterday has been relocated to a fresh, new and apparently healthy server to perform its past duties. We're off to a good start this Tuesday morning. ",
            "created": "Tue, 06 Feb 2024 14:09:36 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}