{
    "created": "2024-02-09T05:00:00.000Z",
    "flInCalendar": true,
    "name": "09",
    "path": "2024/02/09",
    "text": "February 09",
    "type": "calendarDay",
    "subs": [
        {
            "text": "The US government is incapable of defending itself. The tools are in the Constitution. Clearly, even if Trump loses, we're going to go through the same insurrection bullshit only this time around they'll be more practiced and determined. Our ancestors foresaw this event and provided for it. Speaking for them, after listening to the audio from yesterday's Supreme Court hearing, how could it be any more obvious this guy can't be given a second chance. You (Supreme Court) have a job to do. You're the only ones who can judge whether the former President violated his oath, the one you gave him if you recall (<a href=\"https://imgs.scripting.com/2024/02/09/robertsTrump.png\">John Roberts</a>).  I think it was set up that way so you'd get the point that you're the one who has to hold him to his oath. Now if you won't do it, step aside, and you all keep stepping aside until someone has the guts to stand up for the country and its Constitution. Tell the Repubs to nominate someone else because this dude broke his oath and as the 14th Amendment says so freaking clearly, <i>he can't serve again.</i> How does it make sense to give him the same oath again when he violated it in such a craven way last time. If we as a country can't come together for this, then we don't deserve to survive.",
            "created": "Fri, 09 Feb 2024 20:58:10 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2020/11/26/uncleSam.png",
            "flInCalendar": true
        },
        {
            "text": "If you have a new trend in tech, the absolute <a href=\"https://www.citationneeded.news/review-read-write-own-by-chris-dixon/\">worst way</a> to promote it is as a replacement for existing layers of tech with huge <a href=\"https://en.wikipedia.org/wiki/Installed_base#:~:text=Installed%20base%20of%20a%20product,a%20particular%20product%20or%20technology.\">installed bases</a>. You can't win that kind of comparison. Installed bases generally don't disappear, and if they do, it happens very slowly. You almost certainly don't have the replacement, but you might have a useful product that would appeal to people, so be smart and explain it that way, if you just happen to <a href=\"https://chat.openai.com/share/2ba3a8fb-8951-4c23-b955-b32199f3ebe6\">boil the ocean</a> with it, you can thank your luck because that's what actually happened. ",
            "created": "Fri, 09 Feb 2024 18:22:15 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "In other words you can't just wish something like the web into existence, you can't plan it, or architect it or envision it. It happens on its own. Look at all the time and energy TBL put into reinventing the web. Never happened, and he's the guy who got the web started in the first place. I've been there when something small became huge and real, twice actually. But I couldn't tell you why, I just have theories. I called it \"media hacking\" at the time. Create a new media type and put it out there to see if it would stick. After a while nothing would stick because the pipes were controlled by Twitter, Google and Facebook and they weren't sharing. Now we're kind of letting Facebook own the pipes Twitter used to own. Maybe. So many people appear to be fooled into thinking FB is doing something open. They should learn the rules of tech, it's nowhere near as complicated as football or basketball. If everyone wants to interop with one company, nothing open can come out of that. Threads became the thing people wanted to interop with a couple of days after it came into existence. Now it must be orders of magnitude greater than Mastodon, and it's not going to hit any scaling walls because they've already scaled it, in every way. There's still time, I think, for new ideas, but maybe not much time. We'll see. ",
            "created": "Fri, 09 Feb 2024 19:34:43 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}