{
    "created": "2024-02-14T05:00:00.000Z",
    "flInCalendar": true,
    "name": "14",
    "path": "2024/02/14",
    "text": "February 14",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I've taken to cross-posting to various social media accounts, by opening a new window, creating the post in one service's <a href=\"http://scripting.com/2024/01/14/031201.html\">little text box</a>, and then opening tabs for each of the others and copy-pasting. <a href=\"https://twitter.com/davewiner/status/1757524645773754675\">Twitter</a>, <a href=\"https://mastodon.social/@davew/111926409460785756\">Mastodon</a>, <a href=\"https://bsky.app/profile/did:plc:oety7qbfx7x6exn2ytrwikmr/post/3klddy3d2ps2k\">Bluesky</a>, <a href=\"https://www.threads.net/@davew/post/C3TbfkspurD\">Threads</a>, <a href=\"https://www.facebook.com/photo/?fbid=2188904567983603&set=a.113966572144090&notif_id=1707865039746710&notif_t=feedback_reaction_generic&ref=notif\">Facebook</a>. I'm getting good at it. Yesterday I did that with the <a href=\"http://scripting.com/2024/02/13.html#a214721\">piece</a> about President Biden and how he probably would rather be doing anything than be President, for a mostly thankless country, at age 81. I imagine he has great-grandchildren he'd like to get to know. Maybe a book or two to read, maybe one to write. To get his affairs in order. At age 68 I'm trying to shed responsibility as much as possible. It's prudent, and has a point. When I was 25 I wanted to take over the world. Now I'd just like to feel good. As you get older you are capable of more depth of feeling, in some ways, and grow more numb in others. I spent time with my father at 80, his last year. He was always a curious man, wanting to learn about anything new, but in his last days he wasn't curious. No ambition. But he seemed okay with it, even happy at times (possibly due in part to the morphine he was allowed). Anyway, it's always interesting to see where people react to what among the different social web networks. And in this case, the most flow came from <a href=\"https://mastodon.social/@davew/111926409460785756\">Mastodon</a>, by far. I would not have predicted that. And it's good to see, that interesting ideas and perspective may have more of a future outside the networks operated by the billionaire tech companies. ",
            "created": "Wed, 14 Feb 2024 15:11:21 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2024/02/14/bidenActionFigure.png",
            "flInCalendar": true
        }
    ]
}