{
    "created": "2024-02-20T05:00:00.000Z",
    "flInCalendar": true,
    "name": "20",
    "path": "2024/02/20",
    "text": "February 20",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Journalists like everyone in America should pray President Biden stays healthy, because our only alternative is Putin. And btw in Russia, the non-government-owned news people had to leave, to go into exile. The journalists are playing with fire not just for us, but for themselves too. It's not ridiculous to ring the bells really loud about this because we've already lived through <a href=\"https://en.wikipedia.org/wiki/2016_United_States_presidential_election#Results\">this nightmare</a> once. ",
            "created": "Tue, 20 Feb 2024 18:38:55 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2022/05/05/butheremails.png",
            "flInCalendar": true
        },
        {
            "text": "Surely there must be people inside the NYT that find <a href=\"https://imgs.scripting.com/2024/02/20/exhaustedPeopleAtNYTimes.png\">this</a> as exhausting as we do. How can we set up a receptacle for leaks from inside the NYT and WP so we can get the truth about who's selling us out to Trump and Putin inside those supposedly great public-serving news orgs? ",
            "created": "Tue, 20 Feb 2024 13:30:56 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I don't like Twitter/X -- it's stupid, it already had a perfectly good name. It is what it is. I use Twitter, I don't imagine stopping, certainly not as some kind of demonstration. But it isn't X or Twitter/X. It's just stupid old fucked up Twitter, only now it's fucked for a different reason. I might go for Twitter/F as in Twitter is Fucked thank you very much. And have a nice day. :smile:",
            "created": "Tue, 20 Feb 2024 17:27:29 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2023/07/30/birdAndHBO.png",
            "flInCalendar": true
        },
        {
            "text": "Ski boot sizing",
            "created": "Tue, 20 Feb 2024 15:29:34 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "One thing that's great about ChatGPT is they can help you make a decision in an area you lack expertise and where there is no human you can ask for help making the decision. It's making this human smarter, and it's hard to see the downside of that. ",
                    "created": "Tue, 20 Feb 2024 15:24:11 GMT",
                    "type": "outline",
                    "flInCalendar": true
                },
                {
                    "text": "Here's an <a href=\"https://chat.openai.com/share/be9ca3a4-4e74-4fe0-a778-d5595fe8482d\">example</a>. I'm trying to decide whether I should get size 11 rental ski boots or size 11.5. The person behind the counter at the rental place isn't capable of having a long conversation about this, where I get to ask two follow-up questions. ",
                    "created": "Tue, 20 Feb 2024 15:35:52 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Instead they would say sorry, what size did you say you wanted sir? ",
                    "created": "Tue, 20 Feb 2024 15:36:48 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The kid isn't thinking about the old dude. :smile: ",
                    "created": "Tue, 20 Feb 2024 15:29:47 GMT",
                    "inlineImage": "https://imgs.scripting.com/2024/02/20/skibootsizing.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}