{
    "created": "2024-02-22T05:00:00.000Z",
    "flInCalendar": true,
    "name": "22",
    "path": "2024/02/22",
    "text": "February 22",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I have the motto for the Biden campaign: <i>Old enough to know better.</i> Uncle Joe, sit down with a reporter you can relate to, and explain what aging is about. How there's good and bad that come with getting on, and Repubs (of course) have been focusing on the bad but the journalists aren't getting the other side. One thing is for sure, it's hard to put one over on someone who's been in politics at the highest level for as long as President Joe has been. That's what the \"know better\" part is about. Whatever you can say about him, he knows a lot about being president. I've been using this motto as my own tagline for a while. But in the interest of protecting our democracy, I think the president should use it for his re-election campaign. No charge. :smile:",
            "created": "Fri, 23 Feb 2024 03:19:07 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2024/02/14/bidenActionFigure.png",
            "flInCalendar": true
        },
        {
            "text": "Another Beatles post ",
            "created": "Thu, 22 Feb 2024 13:58:18 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Even though they are, for me, the biggest band ever, I've never been able to see the connection to the John Lennon of the early Beatles, and the long-haired bespectacled wild John Lennon that came later. I don't <a href=\"https://www.google.com/search?sca_esv=a2fe021a8e3ee580&rlz=1C5CHFA_enUS743US747&sxsrf=ACQVn09xZcYYO14qGpQ6FPXz7LE5WADxEw:1708610594208&q=john+lennon&tbm=isch&source=lnms&prmd=ivnhsmbtz&sa=X&ved=2ahUKEwjPwJu8jr-EAxVoGtAFHWOfBiQQ0pQJegQIDRAB&biw=1511&bih=1029&dpr=2\">see them</a> as the same person. Not the other Beatles, they all make sense to me. Sometimes they have longer hair or a beard or whatever, but it's still the same face as before. Also I have trouble figuring out which Beatle is singing sometimes. On some songs it's perfectly obvious, others I have no clue. For example Norwegian Wood, Come Together, Strawberry Fields and Lucy in the Sky, that's John of course. Right? Hey Jude, that's clearly Paul, as is Let it Be, Yesterday. But for years I didn't know who sang Lady Madonna. Martha My Dear? Paul could sing so many different kinds of music. John, not so much. I guess. I'm still pretty unsure. ",
                    "created": "Fri, 23 Feb 2024 03:25:39 GMT",
                    "image": "https://imgs.scripting.com/2024/02/22/youngLennon.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "ChatGPT designed a civilization",
            "created": "Thu, 22 Feb 2024 19:12:11 GMT",
            "type": "outline",
            "description": "No rule of law for you! You are the law. ",
            "metaImage": "https://imgs.scripting.com/2024/02/22/simsGPTCity.png",
            "subs": [
                {
                    "text": "What I asked for: Imagine a version of The Sims or SimCity that had ChatGPT integrated,. You could create whole civilizations and then explore them, and if there was something you didn't like, you could have your way. No rule of law for you! You are the law. I wonder if you could draw me a Sims-like community as ChatGPT would design it.",
                    "created": "Thu, 22 Feb 2024 19:12:22 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "\"Here's a visual representation of a vibrant, utopian community as imagined with the integration of ChatGPT's design principles. This community blends futuristic architecture harmoniously with nature, featuring energy-efficient homes, community centers, and public spaces all connected by pedestrian pathways and lush gardens. Solar panels and wind turbines integrate seamlessly into the buildings, and the central plaza acts as a hub for gatherings, surrounded by parks, sports fields, and a lake for water activities. This illustration embodies an ideal balance between technology and nature, promoting health, well-being, and environmental stewardship.\"",
                    "created": "Thu, 22 Feb 2024 19:13:02 GMT",
                    "inlineImage": "https://imgs.scripting.com/2024/02/22/simsGPTCity.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "I don't care if you're at a BigCo",
            "created": "Thu, 22 Feb 2024 15:12:40 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I don't care if you work at a big company or are an individual developer. ",
                    "created": "Thu, 22 Feb 2024 15:13:05 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I care if you can make a contribution toward interop on the open web.  ",
                    "created": "Thu, 22 Feb 2024 15:13:11 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I've found over the years that sometimes devs at bigco's can help enormously (eg microsoft, netscape, automattic) but more often they are harmful (apple, ibm, sun, google stand out as the worst). Sometimes companies play both roles (apple).",
                    "created": "Thu, 22 Feb 2024 15:13:25 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "But i also know that bigco's because they are big, have lots of different ideas how the world should work. And that can help.",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Twitter's big competitive advantage",
            "created": "Thu, 22 Feb 2024 15:11:30 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "<i>I wrote this <a href=\"https://twitter.com/davewiner/status/1760681139407360255\">on Twitter</a> this morning. Re-posted here with minimal editing. The fact that I could write it on Twitter was the point.</i>",
                    "created": "Thu, 22 Feb 2024 15:11:40 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Twitter has one advantage over all the other social webs. no character limit. ",
                    "created": "Thu, 22 Feb 2024 15:14:11 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I started typing a post on Threads which has a large character limit compared to the others, but ran out of space and decided to write it over here in twitter instead. ",
                    "flInCalendar": true
                },
                {
                    "text": "yes they charge me $8 a month for it, but it's worth it. ",
                    "flInCalendar": true
                },
                {
                    "text": "we have to get used to the idea of paying for value, it's how we avoid the messes of the last 20 years. esp if we can make sure we retain copies of everything we write (guaranteed by using our own writing tools, btw) which is another requirement for the new blogosphere. ",
                    "flInCalendar": true
                },
                {
                    "text": "btw, i'm having a blast these days. it's like tinkerbell in peter pan. all the open web needed was people to believe it exists for it to come (back) into existence.",
                    "flInCalendar": true
                },
                {
                    "text": "still diggin. ",
                    "flInCalendar": true
                },
                {
                    "text": "ps: i also like they have simple styling, but where are the freaking links, twitter. do I have to pay another $8 to get those??",
                    "flInCalendar": true
                },
                {
                    "text": "pps: the worst character limit is bluesky, i can't write anything there. too bad, it's a really nice system otherwise.",
                    "flInCalendar": true
                },
                {
                    "text": "ppps: it would be nice to give something like this a title so you don't have to read pgf after pgf to try to figure out where i'm going and if you're interested. so i gave it a title, using markdown syntax. maybe they could just support markdown. hmmm.",
                    "flInCalendar": true
                },
                {
                    "text": "pppps: i asked chatgpt to draw an illustration. that light in the middle of the room is the open social web. it's a vision of self-reliance, empowerment and cooperation. I asked for the light to be <a href=\"https://en.wikipedia.org/wiki/Tinker_Bell\">tinkerbell</a>, but i guess they were concerned the image might belong to someone. creeping shitification. ",
                    "created": "Thu, 22 Feb 2024 15:15:33 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "This is not a picture of Tinkerbell.",
                    "created": "Thu, 22 Feb 2024 15:15:35 GMT",
                    "inlineImage": "https://imgs.scripting.com/2024/02/22/tinkerbellAndKids.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}