{
    "text": "The other side of Agile",
    "created": "Sun, 10 Oct 2021 15:51:54 GMT",
    "type": "outline",
    "description": "Users can learn to communicate more effectively with devs to get what they want and more.",
    "subs": [
        {
            "text": "My longtime friend and sometime collaborator Andrew Shell is part of a program to write 30 posts in 30 days. Yesterday he wrote a piece about his career, and I got an idea for him, that I initially posted in a comment on Facebook, but wanted to include here. ",
            "created": "Sun, 10 Oct 2021 15:52:02 GMT",
            "subs": [
                {
                    "text": "Andrew -- i had an idea for you. ",
                    "created": "Sun, 10 Oct 2021 15:20:37 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "First imho it would be a shame to ignore all the experience you have with software, both as a developer and a user.",
                    "created": "Sun, 10 Oct 2021 15:53:40 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "You could do something great by focusing on the interface between users and developers. A lot has been done about how programmers can be more effective when they listen to users (<a href=\"https://en.wikipedia.org/wiki/Agile_software_development\">agile</a>), but as far as I know nothing about the other direction -- how users can learn to communicate more effectively with devs to get what they want and to influence the future.",
                    "created": "Sun, 10 Oct 2021 15:53:59 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It's a branch off what I keep <a href=\"https://twitter.com/davewiner/status/1447084856962424832\">coming back to</a> -- we don't teach how to write great <a href=\"https://www.google.com/search?q=site%3Ascripting.com+bug+reports\">bug reports</a>. It can be an incredible literary form, different from any other and they can be very human, because imho it's all about empathy. The user wants the dev to be empathetic with them, and the devs want empathy too, not just because it's more economical, but because it's because programmers are people too! A fact sometimes overlooked, perhaps. ",
                    "created": "Sun, 10 Oct 2021 15:54:55 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Anyway, best of luck with your exploration Andrew.",
                    "created": "Sun, 10 Oct 2021 15:55:55 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "BTW, as far as I know Andrew is posting these ideas on FB and Twitter, as screen shots, but I don't see where they're posted on the web. If they are, I'll add a link here. :smile:",
            "created": "Sun, 10 Oct 2021 15:53:03 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}