{
    "text": "Innovating in journalism",
    "created": "Sat, 02 Nov 2019 13:41:52 GMT",
    "type": "outline",
    "description": "The innovator goes ahead. The non-innovator doesn't.",
    "subs": [
        {
            "text": "You know the <a href=\"https://www.youtube.com/watch?v=8rwsuXHA7RA\">Steve Jobs ad</a> about how geniuses think differently. He was on to something. There is a big difference between the way innovators think and everyone else. And I think I can finally put the difference in words.  ",
            "created": "Sat, 02 Nov 2019 13:42:08 GMT",
            "urlvideo": "https://www.youtube.com/watch?v=8rwsuXHA7RA"
        },
        {
            "text": "If you're going to innovate you do it first, and look for funding when you've got something working. You don't wait for anyone's approval, or investors nagging you about when you're going to finish, because if your idea is innovative enough you'll never be able to explain it in words, and you'll learn so much in the process, the idea will sound very different very quickly if it's new enough. People will want to invest when it's up and running. You have to get there first. The innovator goes ahead. The non-innovator doesn't.",
            "created": "Sat, 02 Nov 2019 13:44:47 GMT"
        },
        {
            "text": "I have several friends who are former journalists who are so driven by what they do they write publicly, even though no one is paying them. What they do is exciting. Their ideas are different and valuable. They get me, their reader, thinking, which imho is the best kind of journalism. They may not know it but they are innovating, and if they keep at it, I think there's a good chance they will have such obvious success that people will want to invest. ",
            "created": "Sat, 02 Nov 2019 13:46:04 GMT"
        },
        {
            "text": "I would invest myself if we could put it together as something investible. By that I mean it has a way to grow. That it's not just investing in a few outside-the-box thinkers, but if it could become a place where such thinkers could start, follow their idea, develop their own following, and inspire other thinkers to do what they do. I wouldn't burden it with advertising. I'd let it run for a while, the way they let software developers run without a business model these days, while they test their ideas. ",
            "created": "Sat, 02 Nov 2019 13:49:59 GMT"
        },
        {
            "text": "Just thinking out loud here. I am sure there's a new journalism out there, that it's not the journalism that gets so much acclaim, the <a href=\"https://www.theguardian.com/us-news/2018/aug/12/woodward-bernstein-watergate-donald-trump-era\">reinvention</a> of Woodward and Bernstein, the two Washington Post innovators who brought down Nixon. We should be way ahead of that by now. We need to be, because the forces opposing democracy, the equivalent of 1974's plumbers, are moving much faster. We're erecting <a href=\"https://en.wikipedia.org/wiki/Maginot_Line\">Maginot Lines</a> now, getting ready to fight the Battle of 2016, ignoring that <i>the enemy already controls our capital. </i>They've been innovating. We haven't seen the results of their most recent innovations, yet. ",
            "created": "Sat, 02 Nov 2019 13:51:59 GMT"
        }
    ]
}