{
    "text": "Hallucinating myths into fact",
    "created": "Sat, 28 Jun 2025 11:51:46 GMT",
    "type": "outline",
    "metaImage": "https://imgs.scripting.com/2025/06/28/classroom.png",
    "subs": [
        {
            "text": "I have a Google Alerts query for my own name, just to see if any journalism outlets mention me. When it happens, it's often to give me credit for co-creating an app called iPodder, which they say was where podcasting started. None of that is true. But that's what journalism says about me.",
            "created": "Sat, 28 Jun 2025 11:52:04 GMT",
            "image": "https://imgs.scripting.com/2023/06/10/bear.png",
            "flInCalendar": true
        },
        {
            "text": "On the other hand if you ask ChatGPT what role I played in developing podcasting it gives a more accurate answer. ",
            "created": "Sat, 28 Jun 2025 11:52:19 GMT",
            "flInCalendar": true
        },
        {
            "text": "So tell me what the role of journalism is. Hallucinating myths into fact? That would be my estimate.",
            "created": "Sat, 28 Jun 2025 12:02:07 GMT",
            "flInCalendar": true
        },
        {
            "text": "Here's <a href=\"https://imgs.scripting.com/2025/06/28/chatgpt.png\">the ChatGPT result</a>. I actually did a bit more than that, but what they say is closer to the truth and gives an idea of how things like podcasting come into existence. A lot of work and struggle against people's disbelief, and most of the time it doesn't work -- podcasting is one of the successes.",
            "created": "Sat, 28 Jun 2025 11:52:31 GMT",
            "flInCalendar": true
        },
        {
            "text": "BTW, the second item in ChatGPT's list is not true. Adam's <i>Daily Source Code</i> came after my own podcast <i><a href=\"https://morningcoffeenotes.com/\">Morning Coffee Notes</a>. </i>I was urging him to do a podast but he didn't get one going until after I went first, proving the old adage \"People don't listen to their friends, they listen to their competitors.\" So somewhere along the line it got confused and it hallucinated just like the journalists. The actual first podcast was a Grateful Dead song in 2001 which I used to test Radio UserLand which was the first software to implement podcasting. There's a documentary coming out soon and I believe they have a bit about that, so maybe that'll get on the record. ",
            "created": "Sat, 28 Jun 2025 11:53:01 GMT",
            "flInCalendar": true
        },
        {
            "text": "If this is how history is written btw, I wouldn't trust <i>anything</i> in the history books. ;-) ",
            "created": "Sat, 28 Jun 2025 12:01:33 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}