{
    "text": "June 2",
    "created": "Fri, 02 Jun 2017 12:04:39 GMT",
    "name": "02",
    "subs": [
        {
            "text": "Good morning climate-change-deniers! ;-)",
            "created": "Fri, 02 Jun 2017 12:05:28 GMT",
            "type": "outline"
        },
        {
            "text": "Maybe it's fair that other countries are able to influence our elections. Maybe next time France and Germany can get involved. No sarcasm. ",
            "created": "Sat, 03 Jun 2017 03:44:50 GMT",
            "type": "tweet",
            "tweetId": "870848903104442368",
            "tweetUserName": "davewiner"
        },
        {
            "text": "The root of tech is that users are creators. That's why every Apple II was also a developer machine. Why publishing is easy on the web.",
            "created": "Fri, 02 Jun 2017 20:02:58 GMT",
            "type": "outline"
        },
        {
            "text": "The Russian says something that makes no sense. When you ask for an explanation, the answer makes no sense either.",
            "created": "Fri, 02 Jun 2017 15:54:32 GMT",
            "type": "tweet",
            "url": "http://www.haaretz.com/us-news/1.793360?utm_source=dlvr.it&utm_medium=twitter",
            "tweetId": "870670269353938944",
            "tweetUserName": "davewiner"
        },
        {
            "text": "Here's the <a href=\"https://github.com/scripting/Scripting-News/issues/7#issuecomment-305767622\">postscript</a> on my efforts to get Dropbox running on a Windows 10 instance on AWS. Bottom line, I backed off that idea, and will eventually convert the app to Node. ",
            "created": "Fri, 02 Jun 2017 12:04:40 GMT",
            "type": "outline"
        },
        {
            "text": "Trump has a <i>lot</i> of power he hasn't used yet",
            "created": "Fri, 02 Jun 2017 20:13:06 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "There seems to some <a href=\"https://twitter.com/joshtpm/status/870732550238502913\">wishful thinking</a> going on. Fact is Trump is president. No guarantees there will be a <a href=\"https://en.wikipedia.org/wiki/Impeachment_in_the_United_States\">correction</a>. He has power he hasn't yet figured out that he has, or only recently has figured out. Power that no honorable president would use. But maybe that's not a problem for him. ",
                    "created": "Fri, 02 Jun 2017 20:13:40 GMT",
                    "image": "http://scripting.com/images/2017/05/18/trumpHead.png"
                },
                {
                    "text": "For example, the <a href=\"https://www.google.com/search?q=debt+ceiling+trump&rlz=1C5CHFA_enUS743&oq=debt+cei&aqs=chrome.0.69i59j0j69i57j0l3.1975j0j4&sourceid=chrome&ie=UTF-8#q=debt+ceiling+trump&safe=off&tbm=nws\">debt ceiling</a> is due to be increased. In the past the Repubs have played at brinksmanship, extracting concessions from the president, who was a Democrat. The assumption was the president would act responsibly. But now we have a bomb thrower in the White House. What if he was the one who blackmailed the rest of us? ",
                    "created": "Fri, 02 Jun 2017 20:13:48 GMT"
                },
                {
                    "text": "And what if, as a show of power, he decided to let the US default. He will certainly threaten to do it. And in a few months we'll be wondering if he will. And that imho will feel a lot like it felt on Nov 7. And if we know anything now we know that the impossible is possible. ",
                    "created": "Fri, 02 Jun 2017 20:18:10 GMT"
                }
            ]
        },
        {
            "text": "Frontier's object database on GitHub",
            "created": "Fri, 02 Jun 2017 14:32:01 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Thinking out loud...",
                    "created": "Fri, 02 Jun 2017 14:35:37 GMT"
                },
                {
                    "text": "I'm working with Brent and Ted Howard on a reboot of Frontier. ",
                    "created": "Fri, 02 Jun 2017 14:32:11 GMT"
                },
                {
                    "text": "Brent has been writing about it on inessential.com. Have a <a href=\"https://www.google.com/search?q=site%3Ainessential.com+frontier&rlz=1C5CHFA_enUS743&oq=site%3Ainessential.com+frontier&aqs=chrome..69i57j69i58.11687j0j4&sourceid=chrome&ie=UTF-8\">look</a>. ",
                    "created": "Fri, 02 Jun 2017 14:32:23 GMT"
                },
                {
                    "text": "One of the jobs I've taken on is figuring out how to make Frontier object database scripts available on GitHub. I want to do it so that it's easy to restore a bit of functionality that didn't make it into the new Frontier.root. I want it all to be at most one click away.  ",
                    "created": "Fri, 02 Jun 2017 14:32:36 GMT",
                    "image": "http://scripting.com/images/2017/06/02/frontierBox.png"
                },
                {
                    "text": "So this means storing the objects in multiple forms.",
                    "created": "Fri, 02 Jun 2017 14:33:43 GMT",
                    "subs": [
                        {
                            "text": "1. A human-readable form. One of the nice things about GitHub is that there's a web interface, and you can click around and look at stuff. It's a nice way to view code. ",
                            "created": "Fri, 02 Jun 2017 14:33:57 GMT"
                        },
                        {
                            "text": "2. A \"binary\" representation, in quotes because Frontier doesn't actually emit objects in binary. The most obfuscated format is a base64-encoded text file which we called <a href=\"http://scripting.com/fatpages/faq.html\">Fat Page</a> format.",
                            "created": "Fri, 02 Jun 2017 14:34:27 GMT"
                        },
                        {
                            "text": "3. An OPML version. Many of the objects in the database are outlines. All the scripts are, for example. And menubars. The main things that aren't are tables which are what Frontier calls hashes. But the table structure will be represented as folders on GitHub.",
                            "created": "Fri, 02 Jun 2017 14:35:47 GMT"
                        },
                        {
                            "text": "4. What else?",
                            "created": "Fri, 02 Jun 2017 14:36:46 GMT"
                        }
                    ]
                },
                {
                    "text": "How to proceed",
                    "created": "Fri, 02 Jun 2017 14:37:10 GMT",
                    "subs": [
                        {
                            "text": "I'm going to do a prototype of a small section of the object database. First thought is to use workspace.userlandSamples. This is the place where I've been putting sample scripts over the years. ",
                            "created": "Fri, 02 Jun 2017 14:37:13 GMT"
                        }
                    ]
                }
            ]
        },
        {
            "text": "Forgive Twitter",
            "created": "Fri, 02 Jun 2017 13:30:29 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I've been hanging out online with a group of Mac influentials, and it's nice, but there's a problem (for me). They don't like Twitter and Facebook, and don't use them, and there's resistence to building tools that connect with them. I think this not a good thing. It bothered me. And then I finally figured out the source of the bother.",
                    "created": "Fri, 02 Jun 2017 13:30:34 GMT"
                },
                {
                    "text": "First, I've asked, and the reason they don't like Twitter is that they fucked over their developers. It's true. I was one of them. I had a sizable base of Twitter software. But I expected it. So when it came I was neither surprised nor unprepared. What prepared me for it so well? The company whose products my friends are devoted to. ",
                    "created": "Fri, 02 Jun 2017 13:31:43 GMT"
                },
                {
                    "text": "Apple taught me very well. There was a day in 1997 or 1998 when Steve Jobs got up on a very small stage in Cupertino and introduced the products that would replace us. It was as thorough a betrayal as ever has been done in the tech world. ",
                    "created": "Fri, 02 Jun 2017 13:32:48 GMT"
                },
                {
                    "text": "Yet today I am writing this on a Mac. I have an iPhone hooked into the Mac, and an iPad charging in the living room. I've bought tens of thousands of dollars of Apple products. I also own a bit of Apple stock, bought in the aftermath of the betrayal. I wanted some upside from all the losses. I still hold the stock today, the profits on paper have been substantial. ",
                    "created": "Fri, 02 Jun 2017 13:34:25 GMT",
                    "image": "http://scripting.com/images/2017/06/02/twittergram.png"
                },
                {
                    "text": "I use Apple's products because they work the best for me. After spending a proper amount of time being pissed and being proud of my independence, I realized that I was the loser here, twice. First with the business and creative loss. And second because I had to use malware-infested Windows machines. Once I saw that I could be happy using a Mac, I said fuck it to my refusal and got on board, as a user this time, not a developer.",
                    "created": "Fri, 02 Jun 2017 14:29:35 GMT"
                },
                {
                    "text": "Twitter today is different from the company that was so mean to its developers. That was pre-IPO Twitter. They were desperately trying to get in position to go public. They felt that developers were a problem. They behaved like all tech companies do. Selfish and short-sighted. Lots to not like there. ",
                    "created": "Fri, 02 Jun 2017 13:35:40 GMT"
                },
                {
                    "text": "They <i>can</i> do it again. I assume they will. But for the time-being I am using them, because it makes sense to. ",
                    "created": "Fri, 02 Jun 2017 14:14:35 GMT"
                },
                {
                    "text": "Twitter is also the place where news is distributed. I never believed in Facebook as a news place, but Twitter is a important for news flow. ",
                    "created": "Fri, 02 Jun 2017 13:37:21 GMT"
                },
                {
                    "text": "And I think perhaps we can work with them. In the meantime they operate their servers at scale. The president of the United States uses Twitter. It's a fixture. Using Twitter is like flying United or Delta. You have to do it, no matter how much you don't like it. Imho.",
                    "created": "Fri, 02 Jun 2017 13:38:01 GMT"
                }
            ]
        }
    ]
}