{
    "text": "June 9",
    "created": "Fri, 09 Jun 2017 11:52:43 GMT",
    "name": "09",
    "subs": [
        {
            "text": "Good morning sports fans!",
            "created": "Fri, 09 Jun 2017 11:52:44 GMT",
            "type": "outline"
        },
        {
            "text": " If your boss says \"I hope you will do X\" and you don't and the boss fires you it follows that it was an order.",
            "created": "Fri, 09 Jun 2017 18:19:39 GMT",
            "type": "tweet",
            "tweetId": "873243286689001474",
            "tweetUserName": "davewiner"
        },
        {
            "text": "If Trump doesn't have tapes can you imagine him admitting it? Like the team of crack investigators in Hawaii researching Obama's birth certificate.",
            "created": "Fri, 09 Jun 2017 19:14:50 GMT",
            "type": "tweet",
            "tweetId": "873257197505052673",
            "tweetUserName": "davewiner"
        },
        {
            "text": "If you read this blog, consider also <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSczq-JCEHdjxTzE916RImGgv7Zg_vwtsEpmi-IJzapYS2KxGg/viewform?c=0&w=1\">requesting</a> an invite for the associated Slack group. Thinking of using it for a new project. Depends on who's there of course. :cat: ",
            "created": "Fri, 09 Jun 2017 13:36:02 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2012/06/28/pitcher.gif"
        },
        {
            "text": "One good thing that came from all the online craziness of the 2016 election is that it eliminated the pretense that everyone's intentions are good. Also that everyone is who they pretend to be. Also that people who appear to be human actually are. We dealt with that kind of mess in RSS-land in the early 00's. In the end we came through it, and <a href=\"http://cyber.harvard.edu/rss/rss.html\">RSS</a> is still working today. Our experience could contain some lessons for democracy. :smile: ",
            "created": "Fri, 09 Jun 2017 12:23:39 GMT",
            "type": "outline"
        },
        {
            "text": "This is a test post. I'll explain in a bit what it's a test for. (Update: It has an <a href=\"http://scripting.com/2017/06/09/testPodcastForOldSchool.m4a\">enclosure</a>.) ",
            "created": "Fri, 09 Jun 2017 12:51:54 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2017/06/09/testPodcastForOldSchool.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "542958"
        },
        {
            "text": "Why this year's NBA Playoffs are such a dud",
            "created": "Fri, 09 Jun 2017 16:51:18 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "When I'm working on a project and encounter no resistence, it doesn't feel right, and I get lost, distracted easily. It's the challenge that keeps pulling me forward, the potential sense of accomplishment, the growing, the learning. Achieving potential is exciting.",
                    "created": "Fri, 09 Jun 2017 16:51:30 GMT",
                    "image": "http://static.scripting.com/larryKing/images/2014/05/28/arrrrgh.gif"
                },
                {
                    "text": "That's why watching two teams get through the playoffs, one with a perfect record, and the other near-perfect, there's no suspense, no achievement. Nothing interesting, nothing to root for. They've been there before. ",
                    "created": "Fri, 09 Jun 2017 16:52:28 GMT"
                },
                {
                    "text": "But there's hope!",
                    "created": "Fri, 09 Jun 2017 16:53:43 GMT"
                },
                {
                    "text": "This year many of the stars on both teams will be free agents, and all the teams on the outside, all 28 of them, all with just as much if not more money than Golden State and Cleveland, are going to be bidding up the prices. Some are surely going to leave to make more money, to have a chance of escaping from behind the bright glow of the superstars, Curry, James, Durant, Irving, Thompson, Green, etc.",
                    "created": "Fri, 09 Jun 2017 16:53:46 GMT"
                },
                {
                    "text": "Anyway, what <i>would</i> have been exciting? How about Jeremy Lin leading the Nets to the finals? Haha. Well the Celtics would have been a lot of fun. Maybe next year. This year, it's like Ford vs GM. No matter who wins, it's fucking boring. ",
                    "created": "Fri, 09 Jun 2017 16:55:30 GMT"
                }
            ]
        },
        {
            "text": "A blog's consiglieri, much like a public editor?",
            "created": "Fri, 09 Jun 2017 13:11:47 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I now understand the idea of a public editor by analogy with an idea I had for blogs back when I was regularly getting embroiled in personal battles about stuff I posted on my blog. ",
                    "created": "Fri, 09 Jun 2017 13:28:30 GMT",
                    "image": "http://scripting.com/2015/10/26/mrmet.png"
                },
                {
                    "text": "Back then I assumed everyone meant well, so I would rebut their personal comments. Over time I learned that 99 times out of a hundred the point of a personal comment was to draw you out into defending yourself in public, so more people could pile on, creating a boredom-relieving \"accident\" the Internet has become <a href=\"https://www.nytimes.com/2017/05/20/technology/evan-williams-medium-twitter-internet.html?_r=0\">famous</a> for. ",
                    "created": "Fri, 09 Jun 2017 13:12:13 GMT"
                },
                {
                    "text": "The idea was this. Every blogger would have a designated <a href=\"https://duckduckgo.com/?q=consigleiri&t=hz&ia=definition\">consiglieri</a>. If you have an issue with a blogger, first you had to bring it to the counselor, who would then decide if the issue should be brought to the blogger, i.e. if it had merit, wasn't personal, wasn't an attempt to draw the blogger into a time-wasting personal defense. The person acting as the buffer would insulate the blogger from personal attacks. Thus tamping them down, it was hoped. ",
                    "created": "Fri, 09 Jun 2017 13:14:38 GMT"
                },
                {
                    "text": "I imagined my consigliere would be Doc. And I would offer to reciprocate. ",
                    "created": "Fri, 09 Jun 2017 13:16:27 GMT"
                },
                {
                    "text": "As I watch Jay <a href=\"https://twitter.com/jayrosen_nyu/status/873162861765427200\">make</a> an issue of the NYT's new lack of a public editor, about times when having a public editor would be handy, I recognize the role. (One which we never implemented btw.)",
                    "created": "Fri, 09 Jun 2017 13:16:43 GMT"
                }
            ]
        }
    ]
}