{
    "text": "June 18",
    "created": "Sun, 18 Jun 2017 12:07:48 GMT",
    "name": "18",
    "subs": [
        {
            "text": "Good morning humid hot summer weather fans!",
            "created": "Sun, 18 Jun 2017 12:07:49 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/06/17/bowling.png"
        },
        {
            "text": "Projects are the most fun when they're new, when you're building them up. Later, when you're adding features or fixing bugs, adapting to a platform change, you have to remember how it all works. And then there's the issue of breakage. ",
            "created": "Sun, 18 Jun 2017 21:43:26 GMT",
            "type": "outline"
        },
        {
            "text": "Writing occurs in many places these days, as does reading. It was easier when there was no writing and no reading. Now there's too much of both. And they don't work with each other, not just at a technical level, but a conceptual level. They all have a different idea of what an idea is. Some have titles some have character limits. Some allow links others don't. It helps to identify this clearly as the problem, because while there is no solution, it suggests an optimal compromise.  ",
            "created": "Sun, 18 Jun 2017 21:46:09 GMT",
            "type": "outline"
        },
        {
            "text": "Maybe we need an EFF for users.",
            "created": "Sun, 18 Jun 2017 20:03:18 GMT",
            "type": "outline"
        },
        {
            "text": "When the president's advisors say the he meant one thing, when he said the opposite, you have to wonder who is running the country?",
            "created": "Sun, 18 Jun 2017 17:06:31 GMT",
            "type": "tweet",
            "tweetId": "876486612334649344",
            "tweetUserName": "davewiner"
        },
        {
            "text": "<a href=\"https://twitter.com/davidfrum/status/876424156182708225\">David Frum</a>: \"This is a very inside-the-coalfield conversation. I just returned from California - they hate Trump more than ever.\"",
            "created": "Sun, 18 Jun 2017 13:31:10 GMT",
            "type": "outline"
        },
        {
            "text": "\"You people\"",
            "created": "Sun, 18 Jun 2017 21:13:19 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "<i><a href=\"https://duckduckgo.com/?q=%22you+people%22&t=hz&ia=web\">Noun</a>. (pejorative) Any outsiders of a clique. Members of a particular group, collectively. [That is the type of thing you people would say.]</i>",
                    "created": "Sun, 18 Jun 2017 21:15:23 GMT"
                },
                {
                    "text": "One doesn't say \"you people\" without being snickered at, with cause, because making generalizations based on race is wrong. Judge people by their character not by their race.",
                    "created": "Sun, 18 Jun 2017 21:13:25 GMT"
                },
                {
                    "text": "Even so the \"you people\" approach is condoned when applied to some groups. Think about it. ",
                    "created": "Sun, 18 Jun 2017 21:14:12 GMT"
                },
                {
                    "text": "This should stop because it's in the way of our solving problems and more important, it's wrong. ",
                    "created": "Sun, 18 Jun 2017 21:16:27 GMT"
                }
            ]
        },
        {
            "text": "Who would go on my blogroll?",
            "created": "Sun, 18 Jun 2017 15:21:12 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I'm thinking of restarting my blogroll. Remember those! ",
                    "created": "Sun, 18 Jun 2017 15:21:32 GMT"
                },
                {
                    "text": "I would put <a href=\"http://kottke.org/\">Kottke</a> in my blogroll. And then? ",
                    "created": "Sun, 18 Jun 2017 15:33:43 GMT"
                },
                {
                    "text": "Maybe Doc, but he's <a href=\"https://medium.com/@dsearls/google-enters-its-chrysalis-524dbfc4acf5\">all over</a> the place (including some of my places, mea culpa for that), and TBH the Harvard blogs look kind of crappy these days.",
                    "created": "Sun, 18 Jun 2017 15:22:03 GMT"
                },
                {
                    "text": "There's also Philip Greenspun. I don't really like to read his posts these days, so that kind of knocks him off the blogroll. A blogroll is supposed to be opinionated.",
                    "created": "Sun, 18 Jun 2017 15:26:09 GMT"
                },
                {
                    "text": "<a href=\"http://inessential.com/\">Brent</a>. I'd put Brent in the blogroll for sure.",
                    "created": "Sun, 18 Jun 2017 21:22:23 GMT"
                },
                {
                    "text": "I put this <a href=\"https://twitter.com/davewiner/status/876460753481543680\">out there</a>.",
                    "created": "Sun, 18 Jun 2017 15:24:23 GMT"
                }
            ]
        },
        {
            "text": "Should you blog on Facebook or the web?",
            "created": "Sun, 18 Jun 2017 13:31:58 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I no longer blog on Facebook. It sickens me to think I ever did. But I wanted the engagement, or I was confused, a bit of both, but more of the latter. ",
                    "created": "Sun, 18 Jun 2017 13:32:12 GMT",
                    "image": "http://scripting.com/images/2017/06/18/dandelion.png"
                },
                {
                    "text": "Engagement on Facebook comes in the form of comments. But the comments rarely illuminate. They're mostly echoes of ideas that I've heard many times before. Tired worn-out ideas. Ideas that weren't interesting the first time, and are weary-inducing the 19th time. ",
                    "created": "Sun, 18 Jun 2017 13:38:53 GMT"
                },
                {
                    "text": "Here I've set it up so there is no response mechanism. I want to learn to write that way. I hope to write a book at some point. And that is mostly an exercise in writing for yourself. There's no engagement until you're done. A book is like a freezer for ideas. Blogging is more like a dandelion spreading its seed in the wind. ",
                    "created": "Sun, 18 Jun 2017 13:33:33 GMT"
                },
                {
                    "text": "You can blog on Facebook, but you won't be able to link. I can blog on the web and link, and leave a record (try finding a previous post on Facebook sometime), but hey searching on the web is getting worse not better. Google doesn't really want search to work, they want you to see their ads.",
                    "created": "Sun, 18 Jun 2017 13:35:02 GMT"
                },
                {
                    "text": "Anyway, you can keep blogging on Facebook, and I still use it so I might see what you wrote. There'd be a better chance of that if you post on the web.",
                    "created": "Sun, 18 Jun 2017 13:37:43 GMT"
                },
                {
                    "text": "<i>And</i> if you post on the web, because it's open, independent developers can make it work better. On Facebook you have to wait for Facebook to make it better. And by now you should know how futile that is, you're not a user to them, you're the product.",
                    "created": "Sun, 18 Jun 2017 13:52:11 GMT"
                }
            ]
        },
        {
            "text": "Why I like PagePark",
            "created": "Sun, 18 Jun 2017 12:09:05 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "\"PagePark\" is my web server. I wrote it in late 2014, shipped in early 2015. I've been using it ever since, to serve static pages, and as a front-end for my Node-based server apps. ",
                    "created": "Sun, 18 Jun 2017 13:16:31 GMT",
                    "image": "http://scripting.com/images/2017/06/18/bowlingPin.png"
                },
                {
                    "text": "There is a single important idea in PagePark, something I've always wanted in a web server -- it maps domains to folders. ",
                    "created": "Sun, 18 Jun 2017 12:12:22 GMT"
                },
                {
                    "text": "Suppose you register a new domain, hello.wtf. To host it in PagePark, create a new sub-folder of the domains folder called hello.wtf. Add a file called index.html. Then map the domain to the server PagePark is running on. And that's it. You don't have to update any configuration files, or write any scripts or rules. PagePark knows where to look when a request comes in, it sees an index file (it could also be index.txt, index.png, index.md or index.js) and serves it. As they say -- <i>bing!</i>",
                    "created": "Sun, 18 Jun 2017 12:13:23 GMT"
                },
                {
                    "text": "Of course it does everything else you want a web server to do, but this is the thing it does simply better than anything before. And since this is most of what people do with web servers, it might make it possible for people who otherwise couldn't run a server, to do so.",
                    "created": "Sun, 18 Jun 2017 12:15:41 GMT"
                },
                {
                    "text": "It's free, MIT-licensed, and I'm continually <a href=\"https://github.com/scripting/pagePark#updates\">improving</a> it because <i>I use it</i> to serve many of my sites. ",
                    "created": "Sun, 18 Jun 2017 12:16:35 GMT"
                }
            ]
        },
        {
            "text": "Your future is in their hands",
            "created": "Sun, 18 Jun 2017 13:58:16 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "<img src=\"http://scripting.com/images/2017/06/18/russianSpies.png\" width=\"400\" height=\"300\" border=\"0\" alt=\"A picture named russianSpies.png\">",
                    "created": "Sun, 18 Jun 2017 13:58:21 GMT"
                }
            ]
        }
    ]
}