{
    "text": "June 24",
    "created": "Sat, 24 Jun 2017 05:50:49 GMT",
    "name": "24",
    "subs": [
        {
            "text": "Good morning sports fans! :football:",
            "created": "Sat, 24 Jun 2017 14:57:01 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"http://scripting.com/2017/03/08/theWorldIsSocialistPartIi.html\">Health care is socialist</a> is getting a bunch of new reads today thanks to some powerful RTs.",
            "created": "Sat, 24 Jun 2017 20:50:06 GMT",
            "type": "outline"
        },
        {
            "text": "Today is emoji day :star: on Scripting News. We have all the :star: best emoji. And they're free, for you, the best :star: people in the universe, the readers of :star: this humble blog. :star:  ",
            "created": "Sat, 24 Jun 2017 18:34:44 GMT",
            "type": "outline"
        },
        {
            "text": "It makes sense that because of <a href=\"https://en.wikipedia.org/wiki/Reconciliation_(United_States_Congress)\">reconcilliation</a> Repubs have a hard time repealing ObamaCare. It seems fair that you should have to have 60 votes to repeal something that required 60 votes to pass. How will they explain it to the voters they've been lying to about \"repeal and replace.\" Double-talk. Swamp-talk. :+1:",
            "created": "Sat, 24 Jun 2017 18:20:20 GMT",
            "type": "outline"
        },
        {
            "text": "I've started a <a href=\"https://gitter.im/scriptingnews/Lobby\">chatroom</a> on Gitter. Not sure what I'll use it for. Also not sure if it's open for anyone to join. I want it to be. The community <a href=\"http://guidelines.scripting.com/\">guidelines</a> apply. Keep it short, respectful and on-topic, and <i>no spam. </i>:baseball:",
            "created": "Sat, 24 Jun 2017 18:05:49 GMT",
            "type": "outline"
        },
        {
            "text": "BTW, don't ask me to pitch RSS, I won't do it, because the request is based on a misunderstanding. RSS is not a product, it's a format. I have never made a dime from it. You have as much at stake in its success as I do. So I always turn it around and ask the person who asked me for a pitch to instead pitch <i>me</i> on it. I don't budge on this. Ever. :basketball:",
            "created": "Sat, 24 Jun 2017 15:19:17 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/06/24/rssTShirt.png"
        },
        {
            "text": "Is anyone using the <a href=\"http://scripting.com/rss.json\">JSON version</a> of the Scripting News feed in their feed reader? It's a bit of a trick question, in a way, because as far as I know, only \"River5\" and \"Electric River\" support this format. If so, send me an email at my address, on the About page <a href=\"http://scripting.com/about.html\">here</a>. :cake:",
            "created": "Sat, 24 Jun 2017 15:01:10 GMT",
            "type": "outline"
        },
        {
            "text": "Journalists keep making a serious technology error -- assuming the only damage Russia can do to our government is during elections. :us: ",
            "created": "Sat, 24 Jun 2017 05:50:50 GMT",
            "type": "outline"
        },
        {
            "text": "I get my health insurance through the <a href=\"https://en.wikipedia.org/wiki/Patient_Protection_and_Affordable_Care_Act\">ACA</a>. It's very much alive, <a href=\"http://www.politico.com/story/2017/06/23/sean-spicer-obamacare-repeal-bill-239895\">Spicer</a>. Without it I would not have health insurance. :lemon: ",
            "created": "Sat, 24 Jun 2017 14:26:32 GMT",
            "type": "outline"
        },
        {
            "text": "The sad state of tech news in 2017",
            "created": "Sat, 24 Jun 2017 13:43:48 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "It won't take much to reboot the tech blogosphere, just a few bloggers with ideas who listen to each other and want to work with each other. That was the <a href=\"http://scripting.com/davenet/1996/02/08/holdinghandsincyberspace.html\">idea</a> behind blogrolls, to visibly show the relationships. ",
                    "created": "Sat, 24 Jun 2017 13:43:55 GMT",
                    "subs": [
                        {
                            "text": "I'm still thinking about how to integrate a blogroll with the new design of \"Scripting News\". I pushed everything aside to get a clean look for the new site. I want to avoid bringing it all back. ",
                            "created": "Sat, 24 Jun 2017 14:32:17 GMT"
                        }
                    ]
                },
                {
                    "text": "So, we have a few people who are writing and listening. That's a needed first step. Next we need a way to announce and hear about new tech products. Not just ones that get VC backing or come from big companies. We already hear about those products through \"TechMeme\" and the pubs that contribute to it. We also have platform-specific news about tech products, it's more limited, but it's there.",
                    "created": "Sat, 24 Jun 2017 13:44:09 GMT"
                },
                {
                    "text": "It will likely start with word of mouth among the bloggers. If <a href=\"http://altplatform.org/2017/06/20/building-a-blogroll-in-2017/\">Richard</a> is using a product and speaks highly of it, I'm likely to take a look. Especially if he says it fits into what I'm doing through the open formats my software already supports. ",
                    "created": "Sat, 24 Jun 2017 13:52:04 GMT"
                },
                {
                    "text": "Then I want a river, a place where I can go to find out quickly what's new, in the way of products, not BigCo bluster or another $250 million VC deal. I want to know what my peers are doing. So I can learn from them, and so we can make our products work with theirs. ",
                    "created": "Sat, 24 Jun 2017 13:52:04 GMT"
                },
                {
                    "text": "<i>Work together</i> is a phrase you'll hear me use a lot. It's the potential of tech, but it often isn't the attitude of tech. Even the smallest most independent developers dream of dominating. You can't work with people who dominate, even if they win. ",
                    "created": "Sat, 24 Jun 2017 13:54:33 GMT"
                },
                {
                    "text": "I want to hear about products that are open to connecting to mine. ",
                    "created": "Sat, 24 Jun 2017 20:53:41 GMT"
                },
                {
                    "text": "There have been times, often defined by news sources, that have created huge swells of compatible technology. To name a few: InfoWorld, PC WEEK, MacWEEK, TechCrunch. Very fond memories of the communities that gathered around each of those. ",
                    "created": "Sat, 24 Jun 2017 13:48:02 GMT"
                },
                {
                    "text": "It's time for another. The opportunity is there. It's been a long time since we had an open development community that worked to create great new user experience without lockin. It's like riding a bicycle or swimming, you don't forget how to do it. And like tennis or baseball, you can't play without partners and competition. ",
                    "created": "Sat, 24 Jun 2017 13:57:02 GMT"
                }
            ]
        },
        {
            "text": "Republican-inspired art",
            "created": "Sat, 24 Jun 2017 14:52:32 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "<a href=\"http://boingboing.net/2017/06/23/the-white-house-is-having-off.html\"><img src=\"http://scripting.com/images/2017/06/24/spicer.png\" width=\"502\" height=\"339\" border=\"0\" alt=\"A picture named spicer.png\"></a>",
                    "created": "Sat, 24 Jun 2017 14:52:37 GMT"
                }
            ]
        }
    ]
}