{
    "text": "June 29",
    "created": "Thu, 29 Jun 2017 12:20:25 GMT",
    "name": "29",
    "subs": [
        {
            "text": "I'm digging around in \"davereader\" today. Seeing how feasible it would be to have a single-feed viewer in \"Electric River\". That is, all the stories from one feed in reverse chronologic order. It might just work! :sun_with_face:",
            "created": "Thu, 29 Jun 2017 15:58:02 GMT",
            "type": "outline"
        },
        {
            "text": "I wonder if news org editors have feedback mechanisms connected to readers. For example, how many readers care about whether they send a reporter to White House press briefings or not? Or how Facebook is ruining the news business? (A topic for a trade pub.) Or stories about amazing nasty shit the president says. (Giving the <a href=\"http://scripting.com/2016/07/28/dontFeedDjTrump.html\">troll</a> a platform just encourages him.) Something like having a panel of readers and a UI like <a href=\"http://scripting.com/futureNews.html\">checkbox news</a>. Keep it going real time. In fact, for cable news you can put your video right there in the page. Update the checkboxes according to your editorial schedule. And adjust the schedule in accordance with what you learn from viewers.",
            "created": "Thu, 29 Jun 2017 13:50:03 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/06/29/accordionGuy.png"
        },
        {
            "text": "<a href=\"https://twitter.com/mathewi\">Mathew Ingram</a>, former old school blogger, GigaOm and then Fortune columnist, <a href=\"http://www.mathewingram.com/work/\">has a blog</a>. I'm glad. He's a good example of making money <a href=\"http://scripting.com/2017/06/25.html#a080624\">because you blog</a> as opposed to making money from blogging. Had he not had a blog back in Ye Olde Dayz, would he have been hired as professional columnist? It didn't hurt. :corn:",
            "created": "Thu, 29 Jun 2017 12:30:40 GMT",
            "type": "outline"
        },
        {
            "text": "My method for getting people to blog in 2017 is the same as it was in 1999. Roll out the red carpet for great examples of blogging. Then the Tom Sawyer <a href=\"http://scripting.com/stories/2011/01/08/youCanGetAnythingYouWant.html#imgSrchttpscriptingcomimages20110108tomsawyerjpgWidth125Height179Border0AlignrightHspace15Vspace5AltaPictureNamedTomsawyerjpgbutNoMatterIfMySiteIsUglyButPeopleStillLoveItGuessWhatHappensSomeoneComesAlongAndMakesASiteThatDoesWhatMineDoesButHersIsBeautifulWhereMineIsHomelyYouThinkThatBothersMeQuiteTheOpposite\">thing</a> kicks in. :cherries: ",
            "created": "Thu, 29 Jun 2017 12:47:47 GMT",
            "type": "outline"
        },
        {
            "text": "The NRA ad and the Milwaukee police chief",
            "created": "Thu, 29 Jun 2017 19:36:55 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "The new <a href=\"https://www.youtube.com/watch?v=WxV23Ilsu2U\">NRA ad</a> is <a href=\"http://www.businessinsider.com/national-rifle-association-ad-call-to-violence-2017-6?op=1\">terrifying</a>. I know the reality. I live in the middle of NYC. I see a few protests here and there. The police observe, respectfully, no one gets hurt. This is America. If people don't like something they protest. It's a good thing about our country. Free speech. It's in the Constitution. I recall people who didn't like President Obama availed themselves of their First Amendment rights. ",
                    "created": "Thu, 29 Jun 2017 19:37:23 GMT",
                    "image": "http://scripting.com/images/2017/06/29/thinkUsa.png"
                },
                {
                    "text": "The NRA ad attacks the First Amendment and threatens violence. The only line it doesn't cross is racial. I'm sure they're getting ready for that too. ",
                    "created": "Thu, 29 Jun 2017 20:11:00 GMT"
                },
                {
                    "text": "However, if you think the police are huge fans of the NRA, think again. Watch this <a href=\"https://twitter.com/nowthisnews/status/880464645806374912\">video</a> of the Milwaukee police chief, <a href=\"https://en.wikipedia.org/wiki/Edward_A._Flynn\">Edward Flynn</a>. Wisconsin's NRA-written gun law makes Milwaukee a lot more dangerous, and their jobs.",
                    "created": "Thu, 29 Jun 2017 19:37:42 GMT"
                },
                {
                    "text": "The two stories make a fantastic contrast. I think perhaps the NRA is worried that the police are onto them. And they're speaking out. And the gun people want to try to nullify it? I don't know, but I don't see this ad persuading too many people in New York. ",
                    "created": "Thu, 29 Jun 2017 19:38:06 GMT"
                },
                {
                    "text": "My friend Mike Rodriquez who lives in Kansas wants to know what to do. I thought about it. Maybe it's time to leave Kansas Mike. Most of the people in the country don't live in places like that. Small states like Kansas have oversized power due to the way the Senate is designed. But they're talking about extra-legal acts (i.e. illegal). If the people of Kansas are going to start shooting law-abiding Americans, I would guess they're going to spend a lot of time in jail. And if you don't want to be a victim, then just get the fuck out of there.",
                    "created": "Thu, 29 Jun 2017 19:38:48 GMT"
                }
            ]
        },
        {
            "text": "Big Tech Co's don't understand innovation, part #200,217",
            "created": "Thu, 29 Jun 2017 13:00:58 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Interesting to see Microsoft <a href=\"https://twitter.com/fxshaw/status/880222183066263557\">promoting</a> their new series of podcasts.",
                    "created": "Thu, 29 Jun 2017 13:01:12 GMT"
                },
                {
                    "text": "Reminds me, when I was living in Seattle in the summer of 2004, I was visiting various parts of Microsoft to see if there was business we could do.",
                    "created": "Thu, 29 Jun 2017 13:01:32 GMT"
                },
                {
                    "text": "That summer was the moment podcasting clicked. I was doing Morning Coffee Notes. Adam had started Daily Source Code. Dawn and Drew. Dave Slusher. Trade Secrets. And more and then even more. What had been an idea was now blossoming into a medium. You could see it happening. Every day was a revelation. So I sought out a meeting with the people at Microsoft who were developing what would become <a href=\"https://en.wikipedia.org/wiki/Zune\">Zune</a>, which was doomed, you could see it, the iPod was too much of a juggernaut. There was no room for a <a href=\"http://anildash.com/2006/11/brown-zune.html\">brown</a> music player <a href=\"https://www.amazon.com/Zune-Digital-Media-Player-Brown/dp/B000H0QDCC\">device</a> that did what Apple already did. ",
                    "created": "Thu, 29 Jun 2017 13:02:01 GMT"
                },
                {
                    "text": "But, this new thing, podcasting, needed a player device. The iPod was a terrible player. It was designed for music. You buy music. You store a song on your desktop and mobile device. You listen to a song many times over months or years. ",
                    "created": "Thu, 29 Jun 2017 13:09:19 GMT"
                },
                {
                    "text": "Podcasting was different. You download a podcast as part of a series. It's a subscription. You pay nothing. You listen once and throw it away. Music is permanent, podcasts are ephemeral. A device for listening to podcasts would make it easy to listen to more podcasts. ",
                    "created": "Thu, 29 Jun 2017 13:04:56 GMT"
                },
                {
                    "text": "There was an opening at the time for a device that was insanely great at podcasting. And it would give Microsoft something innovative to promote. A reason for the Zune to exist, at a time when it had none.",
                    "created": "Thu, 29 Jun 2017 13:10:07 GMT"
                },
                {
                    "text": "Unfortunately I learned there, and with all the other interactions with Microsoft, that while they felt they were innovative, they had no appreciation for how innovation happens. It isn't something you put in a budget or a five-year plan. It's something that happens. One day a killer idea shows up out of nowhere, and you have to be prepared to hear it. They were not, clearly, prepared. ",
                    "created": "Thu, 29 Jun 2017 13:06:05 GMT"
                },
                {
                    "text": "A year ago I tried again with Microsoft. I had an idea I thought they needed. They were very nice. They were told I was an industry founder, I guess. But they had no context to understand what I was talking about. You make software you say? Very nice. See you later. ",
                    "created": "Thu, 29 Jun 2017 13:07:25 GMT"
                }
            ]
        },
        {
            "text": "A possible business model for Tumblr?",
            "created": "Thu, 29 Jun 2017 12:27:13 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "NY Mag author Brian Feldman <a href=\"http://nymag.com/selectall/2017/06/theres-no-money-in-internet-culture.html\">says</a> there's no money in Internet culture. Proof is Tumblr, he says. But while I was reading the article I thought of something they might not have tried at Tumblr. Seeding users with test units of products. Or taking 100 bloggers from some random city to a new movie a week before it comes out and letting them write about it. Even negative reviews would get them exposure. ",
                    "created": "Thu, 29 Jun 2017 12:27:25 GMT"
                },
                {
                    "text": "They probably thought of it. It seems kind of obvious. You can put ads in the stream, but that's un-Tumblr-like, or you can give users a basis to write about your product. Create a long-term connection (people remember respect, and everyone likes to feel important) and immediate buzz.",
                    "created": "Thu, 29 Jun 2017 12:28:38 GMT"
                }
            ]
        },
        {
            "text": "Did Fargo get a reprieve?",
            "created": "Thu, 29 Jun 2017 12:20:26 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "It's the 29th. The API was <a href=\"http://scripting.com/2016/08/24/fargoTimesOutOnJune2017.html\">set</a> to <a href=\"http://scripting.com/2017/06/27.html#a080652\">expire</a> yesterday. But \"Fargo\" still works.",
                    "created": "Thu, 29 Jun 2017 12:20:31 GMT"
                },
                {
                    "text": "I tried creating a <a href=\"http://virgin.smallpict.com/2017/06/29/todayIsThe29th.html\">post</a> and updating it. And sure enough it worked. ",
                    "created": "Thu, 29 Jun 2017 12:20:50 GMT"
                },
                {
                    "text": "I even reloaded the app to see if the updates are still there, and they are.",
                    "created": "Thu, 29 Jun 2017 12:21:48 GMT"
                },
                {
                    "text": "Not complaining! But what the what?",
                    "created": "Thu, 29 Jun 2017 12:21:12 GMT"
                },
                {
                    "text": "\"curly\"",
                    "created": "Thu, 29 Jun 2017 12:21:21 GMT"
                }
            ]
        }
    ]
}