{
    "text": "June 30",
    "created": "Fri, 30 Jun 2017 11:37:27 GMT",
    "name": "30",
    "subs": [
        {
            "text": "<a href=\"http://scripting.com/2017/06/27.html#a080652\">Fargo</a> watch for June 30: <a href=\"http://virgin.smallpict.com/2017/06\">Still working</a>. ",
            "created": "Fri, 30 Jun 2017 23:47:56 GMT",
            "type": "outline"
        },
        {
            "text": "The most interesting time of the NBA year, <a href=\"https://duckduckgo.com/?q=nba+free+agency+2017&t=h_&ia=news\">free-agency</a>, starts at midnight Eastern. Kind of <a href=\"https://en.wikipedia.org/wiki/Musical_chairs\">musical chairs</a> fueled by billions of dollars. Who is the most popular free agent, landing spot? Watch it all unfurl on <a href=\"http://nbariver.com/\">nbariver.com</a>.",
            "created": "Fri, 30 Jun 2017 23:48:29 GMT",
            "type": "outline"
        },
        {
            "text": "A year ago today the new Knicks coach <a href=\"http://www.nydailynews.com/sports/basketball/knicks/knicks-coach-ny-isn-rebuilding-city-win-now-town-article-1.2694767?utm_content=buffer90dbf&utm_medium=social&utm_source=twitter.com&utm_campaign=NYDNSports+Twitter\">said</a> the Knicks are a <i>win-now</i> team. So they shipped off three healthy players in a <a href=\"http://www.cbssports.com/nba/news/knicks-trade-for-derrick-rose-send-lopez-grant-to-bulls-grades-takeaways/\">trade</a> for <a href=\"http://nypost.com/2017/04/05/two-ex-knicks-in-derrick-rose-trade-finding-niche-in-chicago/\">two players</a> with too many miles on their legs. A replay of the disastrous win-now <a href=\"http://ftw.usatoday.com/2017/05/nba-draft-lottery-2017-boston-celtics-why-lottery-pick-awful-trade-brooklyn-nets-kevin-garnett-paul-pierce-breakdown\">strategy</a> of the Nets, which <a href=\"https://www.sbnation.com/2017/6/26/15875468/d-angelo-russell-press-conference-nets-future-lottery-pick\">now</a> have them in solid rebuilding mode. Win-now is a shitty strategy, esp for the Knicks. Never has a team needed more to see itself as a work in progress. The thing the win-now proponents don't understand is that fans <i>like</i> teams with long-term strategies. They might bitch and moan about not winning or contending for a title, but a team with hope draws fan <a href=\"http://scripting.com/2015/02/25/thisThisIsWhyWeLikeBasketball.html\">interest</a>. A foolish team that makes shitty short-term bets? Well there are always other sports to watch. :baseball:",
            "created": "Fri, 30 Jun 2017 11:37:28 GMT",
            "type": "outline",
            "image": "http://static.scripting.com/larryKing/images/2013/06/06/michaelJordan.gif"
        },
        {
            "text": "It's \"Brownie, you're doing a heckuva job\" and we're all New Orleans and Katrina is the Republican health care bill. ",
            "created": "Fri, 30 Jun 2017 20:58:26 GMT",
            "type": "outline"
        },
        {
            "text": "My friend Liza <a href=\"https://twitter.com/blogdiva/status/880774516665962496\">explains</a> that when you cheat crowds are small. Good point. Look Russia may not have affected the outcome of the election as they say (I have my doubts) but I'm pretty sure that voter suppression did. Which is why they have to run those nasty NRA videos, to make us think they're huge. ",
            "created": "Fri, 30 Jun 2017 13:15:37 GMT",
            "type": "outline"
        },
        {
            "text": "Also, the NRA, which is basically a trade association for gun manufacturers, has to sell a certain number of guns every year, beyond what's out there. Increase the installed base in a saturated market. The only way to do that is to escalate fear. Rational or not. It doesn't matter, as long as it sells the product. The video we saw yesterday was a sales pitch. I wonder if she gets a commission on gun sales. ",
            "created": "Fri, 30 Jun 2017 13:21:18 GMT",
            "type": "outline"
        },
        {
            "text": "I hate to do this, but I need another test item for my software. This item should be longer than say 400 chars. And it should have <a href=\"https://www.vox.com/policy-and-politics/2017/6/30/15900478/trump-election-integrity-commission\">links</a>. And perhaps other html. I want to transmit the full content of an item in a new context. And the software currently doesn't do that. Okay it's only 271 chars. I must keep typing. Now I can add a <a href=\"http://www.memeorandum.com/170630/p61#a170630p61\">link</a> or two.  ",
            "created": "Fri, 30 Jun 2017 17:26:53 GMT",
            "type": "outline"
        },
        {
            "text": "When you realize the president has lost his mind",
            "created": "Fri, 30 Jun 2017 15:01:22 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Most episodes of <a href=\"https://en.wikipedia.org/wiki/The_West_Wing\">The West Wing</a> were pretty good, some were great; one of the <a href=\"http://westwing.wikia.com/wiki/The_Midterms\">so-so ones</a> featured a sub-plot where the president was obsessed with an obscure school board election in New Hampshire. ",
                    "created": "Fri, 30 Jun 2017 15:01:36 GMT",
                    "image": "http://scripting.com/images/2017/06/30/help.png"
                },
                {
                    "text": "The staff struggles with this, trying to get him to snap out of the dream. The person who offended him so many years ago and the president are now in completely different leagues. He should be looking for wins re whole countries, large ones with big armies and nukes and powerful leaders, like himself. Not a person running for a school board in a small state in a quiet part of the country he's in charge of. ",
                    "created": "Fri, 30 Jun 2017 15:03:23 GMT"
                },
                {
                    "text": "Kind of like our current president and the morning <a href=\"http://nymag.com/daily/intelligencer/2017/06/what-happened-between-trump-morning-joe-and-the-enquirer.html\">news show</a> he's now obsessed with. I don't think the people defending him on TV are doing him, themselves or us any favors. Any adult watching this, anywhere, understands what's going on. ",
                    "created": "Fri, 30 Jun 2017 15:03:15 GMT"
                },
                {
                    "text": "PS: That episode included one of the best <a href=\"https://www.youtube.com/watch?v=nhGk6eF65Fo\">Martin Sheen speeches</a> of the entire series, only these days the White House <i>does</i> host meetings of the Ignorant Tightass Club. ",
                    "created": "Fri, 30 Jun 2017 15:12:29 GMT"
                }
            ]
        },
        {
            "text": "We need a feed for Doc",
            "created": "Fri, 30 Jun 2017 14:08:05 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I just read a <a href=\"https://shift.newco.co/small-is-the-new-big-5e7f2c715fa1\">piece</a> from <a href=\"https://en.wikipedia.org/wiki/Doc_Searls\">Doc Searls</a>. I was lucky, I saw it because I happened to be looking at Twitter when it was in my timeline. Had the task I was doing previously taken a little more or less time I would have missed it.",
                    "created": "Fri, 30 Jun 2017 14:08:11 GMT",
                    "image": "http://scripting.com/images/2017/06/17/bowling.png"
                },
                {
                    "text": "Doc writes in a lot of different places. No blame, just fact. It was true of me too until about a month ago, when I re-concentrated my web writing back where it started on my <a href=\"http://scripting.com/\">blog</a>. ",
                    "created": "Fri, 30 Jun 2017 14:09:05 GMT"
                },
                {
                    "text": "So we need a feed for Doc that gathers together all he does into one \"RSS\" file that our feed readers can scan so no matter where he posts we'll pick it up.",
                    "created": "Fri, 30 Jun 2017 14:10:13 GMT"
                },
                {
                    "text": "Idea: Maybe this is something that could be done with Wikipedia? :bulb:",
                    "created": "Fri, 30 Jun 2017 14:12:10 GMT"
                }
            ]
        }
    ]
}