{
    "text": "The Washington Post's <a href=\"https://www.washingtonpost.com/podcasts/post-reports/\">daily podcast</a> was <a href=\"https://twitter.com/grovesprof/status/1686351734489100288\">recommended</a> to me as a replacement for the now-nauseating NYT daily. Well the first <a href=\"https://www.washingtonpost.com/podcasts/post-reports/how-jason-aldeans-small-town-became-a-rightwing-anthem/\">episode</a> I tried was exactly as depraved, incompetent and disgusting as the NYT podcast. Do we disapprove of Jason Aldean's <a href=\"https://www.youtube.com/watch?v=b1_RKu-ESCY\">song</a> because we want to deprive him of his right to free speech as the podcast says over and over. Please. We object to it because it's an expression by white people of their desire to <a href=\"https://en.wikipedia.org/wiki/Lynching\">lynch</a> black people, like they used to do when America was Great, as the slogan goes. They want to make it Great Again. Specifically, so you could <a href=\"https://www.theguardian.com/us-news/2018/apr/26/lynchings-memorial-us-south-montgomery-alabama\">lynch</a> blacks, again, when you don't like the way they look at you or your sister or when they have land you want to buy and don't want to pay a fair price for, or when a rich white guy made you feel like shit and you wanted to prove there were people <i>you</i> could <a href=\"https://www.theguardian.com/us-news/2018/apr/26/lynchings-memorial-us-south-montgomery-alabama\">terrorize</a>. When a black life was worth nothing. And btw, they're not just coming for people of color and gays and trans people, or to turn women into slaves, they also like <a href=\"https://en.wikipedia.org/wiki/Final_Solution\">Hitler's final solution</a> for Jews. It's time for one of these pubs to have the guts to say out loud what the actual problem is with the Trumpsters like Aldean. They want to go back to when they could kill anyone with impunity. And btw, it doesn't matter if he \"really\" believes it or if it's a business model. It makes absolutely no difference. Someone should teach these pitiful spineless so-called reporters how and why to be angry. BTW, I live in a small town so fuck you Jason Aldean.",
    "created": "Tue, 01 Aug 2023 15:32:02 GMT",
    "type": "outline",
    "image": "https://imgs.scripting.com/2023/08/01/lynching.png",
    "flInCalendar": true
}