{
    "text": "'Silent data loss'",
    "created": "Tue, 31 Dec 2019 13:59:51 GMT",
    "type": "outline",
    "description": "The Repubs use a trolling technique that was pioneered as far as I know by the proponents of a certain format that was intending to replace RSS.",
    "subs": [
        {
            "text": "<i>I wrote <a href=\"https://www.facebook.com/dave.winer.12/posts/666805586860183\">this</a> on Facebook in 2017, never published on my blog.</i>",
            "created": "Tue, 31 Dec 2019 14:00:01 GMT"
        },
        {
            "text": "The Repubs use a trolling technique that was pioneered as far as I know by the proponents of a certain format that was intending to replace RSS.",
            "created": "Tue, 31 Dec 2019 14:02:03 GMT"
        },
        {
            "text": "They would say: RSS has \"silent data loss.\""
        },
        {
            "text": "This sounds terrible. Right? Well, it's just like Shariah Law or \"chain-immigration.\" It sounds like a technical thing, but in reality it's a problem they made up. In practice nothing really is lost. XML sometimes garbles stuff if it isn't properly encoded. The solution is to properly encode it. ",
            "created": "Tue, 31 Dec 2019 14:04:18 GMT"
        },
        {
            "text": "By pointing at this and saying Oooooh silent data loss. Oooh RSS is bad, people who didn't understand would think, oh I need to change to use this new thing. Or so the proponents hope.",
            "created": "Tue, 31 Dec 2019 14:04:22 GMT"
        },
        {
            "text": "Just like Shariah Law is not a problem in America, and chain-immigration simply means letting families come to the US (a good thing, most people would think, so why not say it that way, hah), the tech trolls were saying basically that \"RSS is XML,\" which their format was too. If everything is done right (a big assumption) you could possibly avoid \"data loss\" by using their format, or you could stick with RSS and properly encode the text. The latter approach is <i>much</i> cheaper.",
            "created": "Tue, 31 Dec 2019 14:03:16 GMT"
        },
        {
            "text": "Anyway, by the time you explained it the people listening were tuning out because it truly is boring, and thinking you're being pretty defensive, there must be something here."
        }
    ]
}