{
    "text": "NBA playoff report",
    "created": "Wed, 16 May 2018 14:25:43 GMT",
    "type": "outline",
    "description": "I'm hoping for Celtics vs Golden State in the finals. That could be an epic contest. Multiple threats, who knows where the ball is going to go at any moment, and a sharp contrast in perspective, youth vs royalty.",
    "subs": [
        {
            "text": "I love the NBA because without much effort anyone can see what's going on. It's a very accessible sport.",
            "created": "Wed, 16 May 2018 14:26:22 GMT",
            "image": "http://scripting.com/images/2018/05/16/alHorford.png"
        },
        {
            "text": "And this time of year, the second-to-last round of the playoffs, is when it gets most dramatic. The teams with the most to lose are in a contest where all but one will lose. The trick is to figure out who, and why. ",
            "created": "Wed, 16 May 2018 14:58:38 GMT"
        },
        {
            "text": "And then there's hope. Who do you <i>want</i> to win? For me it's totally predictable, unless the Knicks are involved, I always root for the talented underdog. The one everyone assumes will not win. Especially if earlier I thought myself that they would not win. Right now that team is, of course, the Celtics. ",
            "created": "Wed, 16 May 2018 14:27:16 GMT"
        },
        {
            "text": "I like them because like the Warriors, they can win in a variety of ways, where the other two teams, the Rockets and the Cavs have basically one way to win, an isolation play with a star player who can drive to the basket and also has a good jump shot. The Rockets have two of these guys, James Harden and Chris Paul, and the Cavs have LeBron James. It's easy to defend against a team with one or two ways to win, just concentrate the defense on the strong player, and force the ball to come out through one of the others. Last night at first James looked like he might carry the Cavs, but it turns out he is human, he clearly got tired and hurt as the game went on. The shots that were going down like daggers in the first quarter were missing the mark in the third and fourth. HIs defense was porous. For the last two nights, against the Celtics, he couldn't carry the team. ",
            "created": "Wed, 16 May 2018 14:28:40 GMT"
        },
        {
            "text": "The Celtics on the other hand, move the ball around on offense until they find a play. This means you can't double-team anyone, everyone is a threat. You really can't defend against that. They're pretty much always going to get off a shot. And people get to rest, so they don't play exhausted as LeBron was.",
            "created": "Wed, 16 May 2018 14:31:23 GMT"
        },
        {
            "text": "Of course the Warriors are even better at the distributed multi-threat offense than the Celtics, but they're also worn out by so much winning. Their tiredness comes from boredom. Who cares if they win another championship. I imagine even Bay Area fans are looking for something more interesting and less predictable to watch. The players still have to show up. But they can't be even slightly hungry for a win. ",
            "created": "Wed, 16 May 2018 14:32:48 GMT"
        },
        {
            "text": "On the other hand this Celtics team has everything to prove. Not only are they very young, they are playing without their two biggest stars who are injured. You have to wonder, no matter what the outcome this year, what they're going to be like next year if <a href=\"https://en.wikipedia.org/wiki/Kyrie_Irving\">Kyrie Irving</a> and <a href=\"https://en.wikipedia.org/wiki/Gordon_Hayward\">Gordon Hayward</a> are healthy. ",
            "created": "Wed, 16 May 2018 14:33:59 GMT"
        },
        {
            "text": "So I'm hoping for Celtics vs Golden State in the finals. That could be an epic contest. Multiple threats, who knows where the ball is going to go at any moment, and a sharp contrast in perspective, youth vs royalty.",
            "created": "Wed, 16 May 2018 14:41:15 GMT"
        }
    ]
}