{
    "text": "Today, anyone can write the news",
    "created": "Mon, 09 Apr 2018 14:03:31 GMT",
    "type": "outline",
    "description": "A famous journalism quote: The job of the newspaper is to comfort the afflicted and afflict the comfortable. The irony is that today they are the comfortable being afflicted.",
    "subs": [
        {
            "text": "Is journalism serving us? I doubt if this question comes up much in the hallowed halls of the New York Times. The answer to them is self-evident, of course news serves the people. ",
            "created": "Mon, 09 Apr 2018 14:03:43 GMT",
            "image": "http://scripting.com/images/2018/04/09/charlesFosterKane.png"
        },
        {
            "text": "What I, one of the people, see is something very different, an impenetrable wall that ideas and news can't enter, except for the ways of stature, access, and ad dollars, and occasionally something to do with the interests of the audience. ",
            "created": "Mon, 09 Apr 2018 14:47:19 GMT"
        },
        {
            "text": "In 2016, just after the election, I wrote an <a href=\"http://scripting.com/2016/12/18/pressFreedomIsNotMyFreedom.html\">angry piece</a> about the press, which had just sold us out, giving us an idiot-despot as president. Now they're trying to rewrite history to say that Facebook did it. I know a lot of the facts, far more than what they report, and almost certainly more than the reporters do. I also watched the build-up to this campaign, where they openly ran editorials and op-eds saying that \"public opinion\" was about to turn against Facebook. That's insider-talk for \"we're looking for a good opportunity to attack them.\" They found it in Cambridge Analytica, a non-scandal, non-story, but one that could be presented as one.",
            "created": "Mon, 09 Apr 2018 14:05:09 GMT"
        },
        {
            "text": "In journalism-land <a href=\"https://getyarn.io/yarn-clip/4a72ac86-e7a3-4e3c-b1dc-f9a551a6ab56\">people will think</a> what they tell us to think. ",
            "created": "Mon, 09 Apr 2018 14:13:40 GMT"
        },
        {
            "text": "<a href=\"https://en.wikipedia.org/wiki/Dean_Baquet\">Dean Baquet</a>, executive editor of the NYT, <a href=\"http://money.cnn.com/2018/04/08/media/dean-baquet-new-york-times/index.html?utm_source=CNN%2BMedia:%2BReliable%2BSources&utm_campaign=4fd19770c7-EMAIL_CAMPAIGN_2017_06_06&utm_medium=email&utm_term=0_e95cdc16a9-4fd19770c7-81590981\">says</a> this is a terrible time for journalism because local news is failing. There is a way out. Knock down the wall and let us in, while there still is a modicum of respect for the great old names of journalism. Let's grow journalism by an order of magnitude. There must be a million capable people who believe in free speech who are ready to write news, for free, for the glory of it, for the chance to set things straight, to tell the story as they see it, as it is actually happening. Of course, in order for that to happen, the people who currently write the news will have to take a demotion, from the originators of public opinion to teachers and editors, coaches and quality-assurers. Innovators. And historic adjusters of news to the realities of a world where anyone can write the news. ",
            "created": "Mon, 09 Apr 2018 14:13:44 GMT"
        },
        {
            "text": "<i>A world where anyone can write the news. </i>That's both the weakness and the strength of news in this century. If there is no quality to the writing, we get Trump, a product of the current antiquated, vestigial, news system, the one the high priests of journalism wrongly tell us we must protect. We tried it their way, it didn't work. ",
            "created": "Mon, 09 Apr 2018 14:42:49 GMT"
        },
        {
            "text": "Now we should try another approach. It will be different, it feel uncomfortable, <a href=\"https://www.brainyquote.com/quotes/finley_peter_dunne_154262\">but</a> the job of journalism \"is to comfort the afflicted and afflict the comfortable.\" Fate has a sense of humor because now the comfortable who are afflicted are the journalists themselves. ",
            "created": "Mon, 09 Apr 2018 14:16:06 GMT"
        }
    ]
}