{
    "text": "What are users for?",
    "created": "Sat, 08 Nov 2025 13:45:42 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Google tries to speak for me. Here's what it does. Reading a friend's email, I click the Reply button, and withouth me asking, it writes a reply for me. Thus, if I want to speak for myself first I have to delete the message it created in my name. ",
            "created": "Sat, 08 Nov 2025 14:07:30 GMT",
            "image": "https://imgs.scripting.com/2019/03/07/tiger.png",
            "flInCalendar": true
        },
        {
            "text": "I don't yet have words to describe how invasive, insubordinate and incestuous this is. It would be like going to a restaurant where they bring you your meal before taking your order? It's worse than that because I do my own writing, always, and forever. I'm not a Luddite, btw -- if you read my blog I try tech and I use it if it fits. I'm looking for new things tech can do. But this time I was forced to use something I never wanted to use. ",
            "created": "Sat, 08 Nov 2025 14:01:39 GMT",
            "flInCalendar": true
        },
        {
            "text": "Here's a <a href=\"https://imgs.scripting.com/2025/11/08/googleSpeaksForMe.png?nodialog\">screen shot</a> with a red arrow pointing to the AI's writing. Note that it also signs my name to its creation. ",
            "created": "Sat, 08 Nov 2025 13:51:31 GMT",
            "flInCalendar": true
        },
        {
            "text": "But it gets worse. They buried the opt-out settings, and they don't actually turn anything off. I asked ChatGPT how to do it. It showed me where the settings are, I turned them off, saved changes, reloaded the page, and the same suggestion is there. It's still speaking for me. ",
            "created": "Sat, 08 Nov 2025 13:48:43 GMT",
            "flInCalendar": true
        },
        {
            "text": "Now they certainly haven't rolled this feature out to journalists, because the news would be full of rage. Journalists, like other literate people, generally have the basic ability to speak for themselves. And journalists have a pulpit that Google is probably still a tiny bit scared of. ",
            "created": "Sat, 08 Nov 2025 13:52:02 GMT",
            "flInCalendar": true
        },
        {
            "text": "Also, it's hard to come up with an example you can share publicly because it only does this with replies to emails from people you know. I tried it with spam-like messages and there it is willing to let you speak for yourself. ",
            "created": "Sat, 08 Nov 2025 13:53:23 GMT",
            "flInCalendar": true
        },
        {
            "text": "This raises a philosophical question for Google and its AI bot. Of what use are users? ",
            "created": "Sat, 08 Nov 2025 14:06:43 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}