{
    "text": "Feed items without titles",
    "created": "Thu, 08 Dec 2022 14:16:10 GMT",
    "type": "outline",
    "description": "In the real world some feed items have titles and some don't. Feed readers should work well with both. ",
    "metaImagex": "http://scripting.com/images/2022/12/08/itemsWithoutTitles.png",
    "subs": [
        {
            "text": "It's not hard to be true to the intent of the author of a feed, and create a good experience for the reader. ",
            "created": "Thu, 08 Dec 2022 15:06:56 GMT",
            "flInCalendar": true
        },
        {
            "text": "In the real world some feed items have titles and some don't. Here's a <a href=\"http://scripting.com/images/2022/12/08/itemsWithoutTitles.png\">screen shot</a> of my blog. I've put red arrows pointing to the items that don't have titles. You could argue I suppose that they should have titles. That I should take a 9-word item and give it a two-word title. But I don't do that. And it shows up in my feed without a title, because the item does not have a title. And that's not up to anyone but me, the author of the feed. ",
            "created": "Thu, 08 Dec 2022 14:16:29 GMT",
            "flInCalendar": true
        },
        {
            "text": "Here's a <a href=\"http://scripting.com/images/2022/12/08/readerviewitemswithouttitles.png\">screen shot</a> of how a popular feed reader displays those items. It isn't terrible, but it's imho wrong. The first item has a [no title] message where a title would go. Why? Look at it from the human reader point of view. What information does that convey, above what the writer was saying, in bigger type and in bold. <b>NO TITLE</b>. I don't know about you but to me that looks like criticism, an error message, from the software to the person who wrote the post. Sometimes all the posts show up with that message. This time only one did. And for the others, they repeat the first bits of the post. Again, why? The human read them once, why put the same words they just read on the screen again? That seems quite wrong to me. ",
            "created": "Thu, 08 Dec 2022 14:21:03 GMT",
            "flInCalendar": true
        },
        {
            "text": "Now I don't know why they designed their software this way, but I can guess -- when they started they designed it assuming all posts had titles, and it took a while before they discovered that some items don't. So they shoehorned those into the app without disrupting the design of the product. But this has been going on for a very long time, many years, basically since Google Reader decided, incorrectly, that all feed items must have titles. ",
            "created": "Thu, 08 Dec 2022 14:28:14 GMT",
            "flInCalendar": true
        },
        {
            "text": "With Mastodon supporting RSS, and Mastodon booming in popularity, feed readers should expect to see a lot more feeds with items without titles, unless for some reason Mastodon does what Twitter did many years ago, under pressure from Google Reader to add titles to items, and just withdraws the feeds. All because they couldn't adjust to a reality they hadn't planned for. ",
            "created": "Thu, 08 Dec 2022 14:37:43 GMT",
            "flInCalendar": true
        },
        {
            "text": "Okay so what's the answer?",
            "created": "Thu, 08 Dec 2022 14:30:32 GMT",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "Never display NO TITLE. It's not a good use of your space, the reader's time and it's wrong. The author didn't use those words. They're your words. You don't have a right to put your words in space reserved for the words from feeds. ",
                    "created": "Thu, 08 Dec 2022 14:30:51 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Instead display the first words from the description element of the item where you would put the title. If there are too many words, flow them into the space you've allocated for the description, but <i>do not repeat words</i> from the description. Again, you'd displaying something that isn't in the feed. The author did not repeat the words, so you can't do that. ",
                    "created": "Thu, 08 Dec 2022 14:31:48 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "That's it, unless I'm missing something, and if I am, tell me. You can send me email, dave@scripting.com, and if you don't want me to publish it, say so and I won't. I don't want to embarrass anyone, I just want to solve this problem and move on to a feed world where feeds with items without titles are handled well by the reader software. ",
            "created": "Thu, 08 Dec 2022 14:33:01 GMT",
            "flInCalendar": true
        },
        {
            "text": "BTW, one more thing, some feeds will have both kinds of posts, items with titles and items without. My <a href=\"http://scripting.com/rss.xml\">feed</a> is like that. The item for this post will have a title because the post has a title. ",
            "created": "Thu, 08 Dec 2022 14:34:11 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}