{
    "text": "What people want in a president",
    "created": "Sat, 18 Jun 2022 14:02:11 GMT",
    "type": "outline",
    "metaImage": "http://scripting.com/images/2022/06/18/newsom.png",
    "description": "California governor Gavin Newsom checks all the boxes.",
    "subs": [
        {
            "text": "The perfect candidate for president from either party is a clever, confident, handsome, young, white man you'd like to watch on social media every day. He can lead a cheer, tell a joke, kiss a baby, knows how to eat pizza, and will get angry in a debate and then tell another joke. You would love to have a beer with him, or ride with him on a chair at Vail even if you're too poor or old to ski. ",
            "created": "Sat, 18 Jun 2022 14:02:19 GMT",
            "flInCalendar": true
        },
        {
            "text": "I watched Trump's rally last night for a refresher. Yup. He still looks and sounds good if you overlook the criminality and lies, narcissism and mediocrity which people are happy to do. He meets the important criteria. He's funny, looks okay and is white and a man. ",
            "flInCalendar": true
        },
        {
            "text": "At the end of Trump's term people were completely wiped out from the consequences of hiring such a loud-mouth punkass papa's boy loser, but memories are short, and Biden really is old, and he stumbles through his speeches. Biden will do, as long as he's running against Trump, but doesn't inspire. ",
            "created": "Sat, 18 Jun 2022 14:04:34 GMT",
            "flInCalendar": true
        },
        {
            "text": "Look if you're willing to compromise, and I am, although I would love an America that would embrace a really black president (not Obama who is a black man designed to make white people feel comfortable) or a woman president like <a href=\"https://en.wikipedia.org/wiki/Val_Demings\">Val Demings</a> who is smart, thinks on her feet and hasn't been battered by the press and Republicans for 30 years when she runs, but that is not this America. ",
            "created": "Sat, 18 Jun 2022 14:05:11 GMT",
            "flInCalendar": true
        },
        {
            "text": "I think the best compromise for Democrats is <a href=\"https://en.wikipedia.org/wiki/Gavin_Newsom\">Gavin Newsom</a>. He checks all the boxes and he would also be a good political leader and is not a fascist. Any Democrat would get my vote, but I'd be confident Newsom would win. Almost anyone else I'd hold my breath and hope for the best, and expect we'd lose. ",
            "created": "Sat, 18 Jun 2022 14:05:25 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}