{
    "text": "August 4",
    "created": "Sat, 04 Aug 2018 18:08:03 GMT",
    "name": "04",
    "subs": [
        {
            "text": "I rarely ask for a RT, but <a href=\"https://twitter.com/davewiner/status/1025430776714813441\">this tweet</a> needs more circulation. <i>Thanks! </i>:rocket: ",
            "created": "Sun, 05 Aug 2018 02:18:07 GMT",
            "type": "outline"
        },
        {
            "text": "\"bingeworthy\" had the Twitter login problem, it's fixed. ",
            "created": "Sat, 04 Aug 2018 19:23:01 GMT",
            "type": "outline"
        },
        {
            "text": "I think it's time to start teaching regular people to do journalism. A civic thing, like jury duty. Every college grad should take a semester of journalism. It's a very important skill to at least appreciate, if not practice.",
            "created": "Sat, 04 Aug 2018 18:08:04 GMT",
            "type": "outline"
        },
        {
            "text": "I definitely don't want to be part of the debate about whether <a href=\"https://www.google.com/search?q=define+racism\">racism</a> can apply to white people. The dictionary <a href=\"https://www.google.com/search?q=define+racism\">definition</a> seems to imply it can. <a href=\"https://www.google.com/search?q=define+sexism\">Sexism</a>, on the other hand gives preference to women, but doesn't disallow sexism with men as the target. There's a lot of ridiculous gymnastics used to justify some pretty awful things said that should simply be retracted and apologized for.  One thing is very clear, it's possible to be <a href=\"https://www.google.com/search?q=define+abusive\">abusive</a> without being either sexist or racist. And a lot of what passes for satire is imho abuse. We need a broad, simple, respectful, adult and professional code of conduct on Twitter, and we should have an amnesty for all past sins, and then set about solving problems working together, instead of having these ridiculous fights over who has the right to say what.",
            "created": "Sat, 04 Aug 2018 19:09:37 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/08/04/alice.png"
        }
    ]
}