{
    "text": "August 6",
    "created": "Mon, 06 Aug 2018 12:03:28 GMT",
    "name": "06",
    "subs": [
        {
            "text": "I fixed a serious startup bug in the <a href=\"http://scripting.com/2018/08/03/144422.html\">new version</a> of LO2. Thanks to Steve Hooker for finding and <a href=\"https://github.com/scripting/Scripting-News/issues/91#issuecomment-410838712\">reporting</a> it. Now would be a great time for people to try the <a href=\"http://littleoutliner.com/testing/1.8.0/\">new version</a>. I'd like to put it to bed and move on to other projects next week. Thanks! :rocket:",
            "created": "Tue, 07 Aug 2018 02:02:12 GMT",
            "type": "outline"
        },
        {
            "text": "Here's the <a href=\"http://outlinerhowto.opml.org/\">outliner howto</a> doc that explains what an outliner is and how to use the core outliner in LO2.",
            "created": "Tue, 07 Aug 2018 02:20:27 GMT"
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1026543904227614720\">Poll</a>: Suppose all the social media sites ban a commentator whose ideas you detest. He no longer can communicate with most of the people who want to hear what he says.",
            "created": "Mon, 06 Aug 2018 19:04:15 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1026543904227614720"
        },
        {
            "text": "<a href=\"http://dave.blog/\">dave.blog</a> now redirects to scripting.com. I was never going to start a new blog there. I don't know what I was thinking. <i>One person, one blog</i> seems to be the default. ",
            "created": "Mon, 06 Aug 2018 17:05:36 GMT",
            "type": "outline"
        },
        {
            "text": "If you fight for free speech only for people who agree with you then you are not for free speech.",
            "created": "Mon, 06 Aug 2018 12:03:29 GMT",
            "type": "outline"
        },
        {
            "text": "Reporter vs Journalist",
            "created": "Mon, 06 Aug 2018 16:21:36 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I've written here many times about the <a href=\"http://scripting.com/2014/03/03/whyBloggingIsAnAmateurThing.html\">distinction</a> between the terms blogger and journalist. In a Twitter thread, <a href=\"https://twitter.com/lorakolodny\">Lora Kolodny</a> makes a distinction between <a href=\"https://twitter.com/lorakolodny/status/1026499041792647168\">journalist</a> and <a href=\"https://twitter.com/lorakolodny/status/1026499347763027968\">reporter</a>. I hadn't realized there might be a difference. Here's what she says.",
                    "created": "Mon, 06 Aug 2018 16:21:45 GMT",
                    "subs": [
                        {
                            "text": "<i>Journalist</i> (besides sounding hi-falutin) includes people who aren't reporters. Editors, producers, photographers, columnists, podcasters, vloggers and bloggers may not all be doing the primary research or interviews for a piece, but are all responsible for accuracy of it.",
                            "created": "Mon, 06 Aug 2018 16:22:31 GMT",
                            "urltweet": "https://twitter.com/lorakolodny/status/1026499041792647168"
                        },
                        {
                            "text": "<i>Reporters</i> do the primary fact finding, interviews, field work, etc. But by no means are reporters the only journalists. It's not a commutative property. If reporter then journalist. But not if journalist then reporter.",
                            "created": "Mon, 06 Aug 2018 16:22:46 GMT",
                            "urltweet": "https://twitter.com/lorakolodny/status/1026499347763027968"
                        }
                    ]
                },
                {
                    "text": "My own two cents. I'd love to reserve the term blogger for people who write about their own experiences, not for pay, the \"unedited voice of a person.\" I think of bloggers as sources in the journalism world. ",
                    "created": "Mon, 06 Aug 2018 16:24:47 GMT"
                }
            ]
        },
        {
            "text": "Succession",
            "created": "Mon, 06 Aug 2018 12:41:20 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "<i>Spoilers ahead, you have been warned! </i>:boom:",
                    "created": "Mon, 06 Aug 2018 12:49:34 GMT",
                    "image": "http://scripting.com/images/2018/08/06/tacoBellDog.png"
                },
                {
                    "text": "I had been hearing good things about the HBO series <a href=\"https://en.wikipedia.org/wiki/Succession_(TV_series)\">Succession</a> so I chose it for my next binge. I made it all the way to the next to last episode about an hour before the finale aired last night, but waited till the morning to watch it. I wasn't prepared for how disturbing it would be. I wasn't expecting it to be so. ",
                    "created": "Mon, 06 Aug 2018 12:41:25 GMT"
                },
                {
                    "text": "I think perhaps it was so disturbing because the Roy family reminds me of my own family. All the disconnects, vanity, foolish sense of self-importance. And the prohibition on every talking about it realistically. These were all big features of my upbringing. ",
                    "created": "Mon, 06 Aug 2018 12:50:20 GMT"
                },
                {
                    "text": "They really play with you. At times it's so funny, it seems like a comedy, but then, in the next episode, it knocks you down. That's what the finale was like. Complete knock down, with the tour de force in the very last scene. ",
                    "created": "Mon, 06 Aug 2018 12:44:19 GMT"
                },
                {
                    "text": "The best line delivered by the patriarch's latest wife to one of the adult children: \"He built you a playground and you think it's the world.\" ",
                    "created": "Mon, 06 Aug 2018 12:45:23 GMT"
                },
                {
                    "text": "There's a lot of self-awareness in the last episode, but mostly they avoid living their own lives, all of them, including the all-powerful father. ",
                    "created": "Mon, 06 Aug 2018 12:46:32 GMT"
                },
                {
                    "text": "On reflection, the Roy family is not like my family, where the women fought, and the men, while they often roared, were mostly sidelined, not the main act. I guess when you participate in something so intensely for so many hours your subconscious starts accepting it as real. ",
                    "created": "Mon, 06 Aug 2018 12:47:13 GMT"
                },
                {
                    "text": "I have a hard time recommending Succession. It's very well done. But hard to watch at times, it's so awkward and the people are such fools. And it's very disturbing, that gives it value, at least for me. As art, it's outstanding. ",
                    "created": "Mon, 06 Aug 2018 12:48:35 GMT"
                }
            ]
        }
    ]
}