{
    "text": "August 9",
    "created": "Thu, 09 Aug 2018 14:03:23 GMT",
    "name": "09",
    "subs": [
        {
            "text": "We had a thunderstorm in Manhattan last night. It woke me up and I was in a foul mood, as I sometimes am when I wake up in the middle of the night. The lightning and thunder scared me. First time that ever happened. My mind started playing games. I imagined the flash of lightning was a nuclear weapon detonating, and the thunder was the wave of destruction. It's a good approximation of the time it would take between the flash and death. Great move, I said to my mind. Now I'm even more scared and sad. Eventually I fell back asleep, but it wasn't a good sleep.",
            "created": "Thu, 09 Aug 2018 19:26:30 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/08/09/sriracha.png"
        },
        {
            "text": "Journalists think Twitter stands out as a <a href=\"http://amp.poynter.org/news/whats-matter-twitter\">bad tech company</a>, I think the opposite. Their unwillingness to follow the herd is a sign of hope that we may continue to use the net to speak freely, even if the majority wants us silenced. And what does it say about journalism that there are few if any dissenters? You see this regularly, they’re too scared for some reason to present all sides of a discussion. It’s amazing at times, the way they form herds.",
            "created": "Thu, 09 Aug 2018 18:22:56 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://davisshaver.com/2018/08/09/turns-out-my-favorite-mcluhan-quote-is-actually-a-churchill-quote/?ppp=7666-0\">Winston Churchill</a>: \"We shape our buildings; thereafter they shape us.\"",
            "created": "Thu, 09 Aug 2018 14:03:24 GMT",
            "type": "outline"
        },
        {
            "text": "Writing in the age of silos. After their <a href=\"http://scripting.com/2018/08/01.html#a022140\">August 1</a> change, I can't cross-post to Facebook. So if I want to speak to people I know on Facebook, I have to write on Facebook. Today if I want to even post a link, I have to do it by hand. And Twitter, new forms of writing have developed there to work around the 280-char limit. Again, if I want to write for people I know there, I have to write it there. This is what always happens with corporate platforms, they become silos. Maybe they start with good intentions, on FB, the <a href=\"http://ogp.me/\">open graph</a>, with Twitter their API, but over time, they evolve to become their own completely self-contained very unweblike worlds. You can see that evolution in action today, at a super-high pace. For me this is the Nth time around this loop, so I have an idea what to expect next.",
            "created": "Thu, 09 Aug 2018 14:18:22 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/08/09/webIsDeadFreeGift.png"
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1027582827381096448\">Poll</a>: Chrome users, do you see <i>not secure</i> on <a href=\"http://scripting.com/\">scripting.com</a>? ",
            "created": "Thu, 09 Aug 2018 15:50:22 GMT",
            "type": "outline"
        },
        {
            "text": "Smarter search for the open web",
            "created": "Thu, 09 Aug 2018 14:13:54 GMT",
            "type": "outline",
            "description": "Google started out ridiculously smart, but it's been stagnant for too long. They clearly need competition. ",
            "subs": [
                {
                    "text": "Three ideas for making the open web, and blogging, more valuable and interesting, by building a search engine for the next decade, not for two decades ago. Sorry Google, your search engine is showing serious signs of age and boredom. We can do so much better. Here are the ideas.",
                    "created": "Thu, 09 Aug 2018 14:14:04 GMT",
                    "flNumberedSubs": "true",
                    "subs": [
                        {
                            "text": "I just pointed to a post written by <a href=\"https://davisshaver.com/\">Davis Shaver</a>. A nice database would note that, and create a link between his blog and mine. I could ask for a list of all the blogs that I've pointed to, and that would become my blogroll. Lots more ideas after that esp if the blogs are willing to share data with the centralized resource.",
                            "created": "Thu, 09 Aug 2018 14:03:46 GMT"
                        },
                        {
                            "text": "You know how the index in the back of a book works? Topics, sub-topics, and lists of pages that those topics are discussed on. 99 percent of the searches I do on my own blog are really just navigations of this structure. Search engine technology is getting smart enough to recognize not just words but concepts. How about a service that sucked down all the content of my blog and created the back-of-book index of my writing. Realtime. Updated every time I post something new or modified an existing post. ",
                            "created": "Thu, 09 Aug 2018 14:06:56 GMT"
                        },
                        {
                            "text": "A search engine that knows I'm a blogger and where my blog is, and uses all the info it can glean from that to give me more relevant searches. For example, when I <a href=\"https://www.google.com/search?q=Frontier\">search</a> for Frontier, esp if the first letter is capitalized, what kind of cockamamie search engine <a href=\"http://scripting.com/images/2018/08/09/searchForFrontier.png\">shows me</a> the airline? I'm obviously referring to the scripting environment I developed and worked on for a couple of decades, and still to this day use every freaking day. Google started out ridiculously smart, but it never figured this part out (or #2 above). It's been stagnant for too long. They clearly need some competition. ",
                            "created": "Thu, 09 Aug 2018 14:09:10 GMT"
                        }
                    ]
                },
                {
                    "text": "BTW, Google knows I'm the \"owner\" of this blog, they <a href=\"http://scripting.com/images/2018/06/21/googleEmail.png\">threaten me</a> as such. :boom:",
                    "created": "Thu, 09 Aug 2018 16:06:17 GMT"
                }
            ]
        }
    ]
}