{
    "text": "August 14",
    "created": "Tue, 14 Aug 2018 16:03:31 GMT",
    "name": "14",
    "subs": [
        {
            "text": "<a href=\"http://scripting.com/2018/08/14/toMathewIngram.m4a\">20-minute podcast</a>. I got involved in a discussion with Mathew Ingram, Om Malik and others on Twitter on what is going on with <a href=\"https://blog.joincivil.com/introducing-the-first-civil-council-members-and-looking-ahead-to-the-next-year-def988ae25a1\">Civil</a> and what's needed to get journalism the support of the people that it so totally needs. I want to tell the story of the W3C and the IETF and how the tech industry made it look like the tech was open without it being open. We need journalism, and we can't afford to wait for the experiments to prove not to be the answer. I outline emphatically what needs to happen now. Journalism needs to grow, without the limits that journalism has placed on itself. This is addressed to Mathew but it's really meant for everyone. I apologize in advance for using him as a foil. :boom: ",
            "created": "Tue, 14 Aug 2018 17:28:49 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2018/08/14/toMathewIngram.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "9957321",
            "image": "http://scripting.com/images/2018/08/14/ueRoll.png"
        },
        {
            "text": "I'm looking for a good speaker for my bike, for listening to podcasts and music. I bought a <a href=\"https://en.wikipedia.org/wiki/Beats_Pill\">Beats Pill</a> a number of years ago, but the battery is shot. Not finding many choices, certainly no brands I've heard of and there don't seem to be any reviews. Has to mount on handlebar.",
            "created": "Tue, 14 Aug 2018 19:43:20 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/08/14/beatsPill.png"
        },
        {
            "text": "I finally have the Chrome that <a href=\"http://scripting.com/images/2018/08/14/notSecure.png\">opines</a> that my blog is \"not secure\". ",
            "created": "Tue, 14 Aug 2018 17:38:45 GMT",
            "type": "outline"
        },
        {
            "text": "We're a few weeks into the new Chrome way of labeling sites like \"Scripting News\" as \"not secure\". I haven't seen any notable changes among readers. The only people questioning the security of the site, that I know of, are the same ones who followed Google's lead without considering the negative consequences on the web as an archival medium. I took a <a href=\"https://twitter.com/davewiner/status/1027582827381096448\">poll</a> of my followers on Twitter and found that 68% of the Chrome users are seeing the \"not secure\" message. Here was a chance for some to express concerns, and there were none. My Chrome hasn't updated yet, apparently, so I don't see it here. I'm sure there are less draconian solutions for sites that are basically archives to Google's stated goal of assuring the content hasn't been meddled with in a MITM way while in transport. I have ideas, but so far I haven't seen much evidence of Google's interest. A bad sign for a <a href=\"http://scripting.com/davenet/1995/08/22/whatisaplatform.html\">platform</a> manager, btw. But it's par for the course for Silicon Valley tech companies. I've had this experience with all of them, Sun, Apple, Microsoft, even the company I founded, after I left. We're the <a href=\"https://www.youtube.com/watch?v=7Znh0OM9jiA\">power</a>, you're nobody, why should we listen. It's a terrible way to govern an even worse way to manage a platform. ",
            "created": "Tue, 14 Aug 2018 16:03:32 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/08/14/harderTheyCome.png"
        }
    ]
}