{
    "text": "August 19",
    "created": "Sun, 19 Aug 2018 15:38:52 GMT",
    "name": "19",
    "subs": [
        {
            "text": "Next <a href=\"https://twitter.com/davewiner/status/1031350182229803019\">time</a> you feel the urge to tell someone you disagree, skip it. If you really want to blow someone’s mind, next time you agree with someone, tell them. If you were going to qualify it, don’t. And if you think of a snappy rejoinder, chuckle to yourself and don’t pass it on.",
            "created": "Mon, 20 Aug 2018 01:29:49 GMT",
            "type": "outline"
        },
        {
            "text": "Coming <a href=\"https://twitter.com/davewiner/status/1031271167510884353\">soon</a>, a bookstore <a href=\"http://scripting.com/images/2018/08/19/bookstoreOpening.png\">opens</a>. And a <a href=\"http://scripting.com/images/2018/08/19/theaterClosed.png\">theater</a> closes.",
            "created": "Sun, 19 Aug 2018 20:27:11 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1031271167510884353"
        },
        {
            "text": "I refuse to believe that Giuliani can make news. He's a nobody. If you report on what he said, what that make you?",
            "created": "Sun, 19 Aug 2018 19:01:27 GMT",
            "type": "outline"
        },
        {
            "text": "It would be great to have a daily website that summarizes what's on each of the MSNBC shows, so I don't have to watch them. Each segment on each show. Any new information or ideas makes it in. Omit recitals of previous optics. I don't care what pundits think. Same for each of the Sunday morning shows. I just don't have the patience. If I had to list something I learned from any stretch of MSNBC-watching, I might learn one thing every week and that's it. Most of the stuff they report as news is what has appeared in my RSS river during the day. Please go ahead and put ads on the site. Or ask for donations via Patreon. It's worth a few bucks a month, also because it will force MSNBC to change, to stop being so repetitive, and to start taking a look at news more broadly than just how the legal case against Trump is proceeding or not. There is other stuff going on, and there are other ideas that need exploring. They are deep in a pointless rut.",
            "created": "Sun, 19 Aug 2018 18:23:14 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/08/19/thing1Thing2.png"
        },
        {
            "text": "They should give Krugman’s mike to someone else. Same <a href=\"https://www.nytimes.com/2018/08/18/opinion/the-slippery-slope-of-complicity.html\">story</a> every time for the last N years. We get it, you’re right, more importantly you were right, now it’s time to say something original and useful, or step aside.",
            "created": "Sun, 19 Aug 2018 15:47:20 GMT",
            "type": "outline"
        },
        {
            "text": "I haven’t heard from anyone at Berkman re the early blogs we hosted there that they have taken offline. I’m assuming at this point that we have <a href=\"http://scripting.com/2018/08/15/141004.html\">all the info</a> we’re going to get. Take-away: I hoped academia would be how we could ultimately make the web long-lived and future-safe. Now this seems like a foolish dream.",
            "created": "Sun, 19 Aug 2018 15:48:44 GMT",
            "type": "outline"
        },
        {
            "text": "Trump’s lunatic ravings are <a href=\"https://www.theguardian.com/commentisfree/2018/aug/19/twitter-supposed-to-spread-democracy-not-trumps-ravings\">part</a> of democracy. People are surprised that when everyone gets a voice, they may hear things they despise?",
            "created": "Sun, 19 Aug 2018 15:48:01 GMT",
            "type": "outline"
        },
        {
            "text": "When I rent a car, one of the first things I do is pair my iPhone with it, so I can play podcasts over the car’s sound system. But it may be sharing my contacts with the car. Does the rental company download those when I return the car?",
            "created": "Sun, 19 Aug 2018 15:38:53 GMT",
            "type": "outline"
        },
        {
            "text": "I finished <a href=\"https://en.wikipedia.org/wiki/Deadwood_(TV_series)\">Deadwood</a>. It’s worth a rewatch, to see how a person with huge money and a toxic character can destroy a community. In the end it is anything but a comedy. The last couple of episodes, when they wrap everything up, are really low quality. You see this happen sometimes in a great series. Everything but the writing is still great. They make up for the lack of coherence with music, to try to make the stupid shit they're doing seem dramatic, which just makes me turn away. I remember being angry that they didn't do a fourth season when the show was running. I have no such feeling now. I think they could have ended it without the last couple of episodes. Even so, it's a story for our times, in tech and politics, now one very rich and toxic person can spoil a flawed but vibrant community. Some rich people got rich by stinking up the room so thoroughly that people of integrity say <i>Go ahead you can have it. </i>That's their business model. Look at the top names in tech history. At least 1 in 4 are like that, in my experience. And there are a few second-tier characters like that as well.",
            "created": "Sun, 19 Aug 2018 15:39:28 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/08/19/racehorse.png"
        }
    ]
}