{
    "text": "August 23",
    "created": "Thu, 23 Aug 2018 13:45:07 GMT",
    "name": "23",
    "subs": [
        {
            "text": "Occam News says Txxmp is a territorial boss in the Putin Family. His territory is the former United States. ",
            "created": "Thu, 23 Aug 2018 19:52:15 GMT",
            "type": "outline"
        },
        {
            "text": "A NYC story you won't read on the op-ed page of the NYT. I'm in the fucking bike line, a cab is waiting, adjacent to the lane, for I don't know what, and just as I approach he starts to move across the lane. I yell five times WATCH OUT and he stops, and as I pass, I make eye contact and yell FUCK YOU BIKE LANE. In Madison or Palo Alto you'd say Yo how you doing, but in NYC the salutation is FUCK YOU. Everyone understands this except people visiting from Madison or Palo Alto of course. It's why I like NY so much. Fuck you, let's dispense with the niceties. He was probably a Yankees fan anyway.",
            "created": "Thu, 23 Aug 2018 19:38:30 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/08/23/mookie.png"
        },
        {
            "text": "<a href=\"http://blog.schockwellenreiter.de/2018/08/2018082203.html\">Jörg Kantel</a> likes the idea of Frontier for Linux. ",
            "created": "Thu, 23 Aug 2018 19:33:28 GMT",
            "type": "outline"
        },
        {
            "text": "I know this is impractical, but if we wanted a more rational government we would only allow people who serve on juries to vote. It's an education in civic responsibility like no other.",
            "created": "Thu, 23 Aug 2018 15:03:09 GMT",
            "type": "outline"
        },
        {
            "text": "Yesterday I was automatically upgraded to the new version of Gmail in the browser. The only new feature that I can see is that there's a really stupid animation that makes me wait for Gmail's UI to show up. Mail is a very integral part of my work flow. If anything they should make it load <i>faster. </i>Making the load slower is imho inexplicable and indefensible. Another beautiful feature, where the star used to appear is now a trash icon. I just deleted a message I wanted to star. Oh that really makes sense. (Sarcasm.) Now an adventure to figure out where the fuck they put deleted messages so I can undelete it. It was important (which is why I was trying to star it).",
            "created": "Thu, 23 Aug 2018 13:58:38 GMT",
            "type": "outline"
        },
        {
            "text": "I think a lot of newbie software designers don't get that their users incorporate the quirks of their products at the base of the spine, i.e. beyond conscious thought. I think \"star this mofo\" and my spine tells my fingers to do it. My mind forgets the process. Breaking this connection immediately makes you think about things you normally do automatically. When I write my book there will be a whole chapter on <a href=\"http://scripting.com/2014/01/04/burningBrainCells.html\">Burning Brain Cells</a> which is what I call this phenomenon.",
            "created": "Thu, 23 Aug 2018 14:17:43 GMT",
            "type": "outline"
        },
        {
            "text": "The last couple of days I did a bunch of farting around with programmatic access to GitHub via <a href=\"https://github.com/scripting/oldSchoolNightly/blob/master/oldschoolnightly.js\">Node app</a>. I came across a <a href=\"https://github.com/scripting/Scripting-News/blob/master/READMEx.md\">readme</a> that said it was done with the <a href=\"http://this.how/english/\">English editor</a>, a project I vaguely remembered. I did a little digging and found the software and the <a href=\"https://github.com/scripting/Scripting-News/issues/48\">thread</a> I wrote documenting the work. The idea is to use GitHub as a blogging database. So what I did was get an instance of <a href=\"https://github.com/yabwe/medium-editor\">Medium-Editor</a> to edit stuff on GitHub. Couple that with <a href=\"https://www.npmjs.com/package/githubpub\">GitHubPub</a> that maps subdomains on locations within GitHub repos, and you've got a nice dynamic blogging system with almost $0 hosting costs. Oh if only I had the time to chase down all these <a href=\"https://en.wikipedia.org/wiki/Down_the_Rabbit_Hole\">rabbit holes</a>. 🐇",
            "created": "Thu, 23 Aug 2018 13:45:08 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/08/23/whiteRabbit.png"
        }
    ]
}