{
    "text": "August 25",
    "created": "Sat, 25 Aug 2018 14:04:23 GMT",
    "name": "25",
    "subs": [
        {
            "text": "<a href=\"https://en.wikipedia.org/wiki/Patient_Protection_and_Affordable_Care_Act\">ObamaCare</a> is still the law. <a href=\"https://en.wikipedia.org/wiki/John_McCain\">McCain's</a> vote was <a href=\"https://www.theatlantic.com/politics/archive/2017/09/john-mccain-saves-obamacare-once-again/540861/\">instrumental</a> in keeping it from being gutted. McCain <a href=\"https://www.memeorandum.com/180825/p51#a180825p51\">died</a> earlier today. ",
            "created": "Sun, 26 Aug 2018 01:21:09 GMT",
            "type": "outline"
        },
        {
            "text": "I want a bank/brokerage website that has an easy UI. I don't care about commissions. My auto insurance company website is fast and easy. This builds trust, believe it or not. Nothing is worse than a bank that can't run a proper website. It's 2018, some bank should excel by now.",
            "created": "Sat, 25 Aug 2018 15:37:18 GMT",
            "type": "outline"
        },
        {
            "text": "What I hate most about Chrome's \"NOT SECURE\" message is that this is all they could think of to say about <a href=\"http://scripting.com/\">my wonderful blog</a>. A blog that predates Google itself by four years. It's got humor and sadness, fun and tech tips. Yet all they can say is yuck we don't like this site. We welcomed Google. Even <a href=\"http://scripting.com/2002/01/10.html#yupTheUsersCared\">loved</a> them. And this is what's become of them. Heartless and soulless. Bullies. No love. ",
            "created": "Sat, 25 Aug 2018 15:45:19 GMT",
            "type": "outline"
        },
        {
            "text": "There's a new brand of bike sharing in NYC now. Yesterday I saw two bright red bikes, shaped like a Lime bike or CitiBike, with a plastic basket up front. Didn't have time to read the logo/branding. Both in Manhattan. Andy DeSoto <a href=\"https://twitter.com/kadesoto/status/1033354917656911872\">says</a> they're Jump bikes. And guess what, they say on <a href=\"https://jumpbikes.com/cities/new-york-city/\">their site</a> they're available now in NYC. (But only in Staten Island and Westchester.)",
            "created": "Sat, 25 Aug 2018 14:04:24 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/08/25/notAPodcaster.png"
        },
        {
            "text": "I've been saying this for <i>decades.</i> Every brand should have an iconic image that bloggers can crib. What that means is this -- a product shot on a white or transparent background. Large enough for large product shots, and for right margin images, we can make them smaller. I wanted to put a <a href=\"https://jumpbikes.com/\">Jump</a> <a href=\"https://twitter.com/jumpbikes\">bike</a> in the right margin, but when I do an <a href=\"https://www.google.com/search?safe=off&rlz=1C5CHFA_enUS743US747&biw=1383&bih=1186&tbm=isch&sa=1&ei=4mSBW9uWH8mc_Qa7r4vYBw&q=jump+bike+share+red&oq=jump+bike+share+red&gs_l=img.3...7026.8128.0.8463.6.6.0.0.0.0.151.585.3j3.6.0....0...1c.1.64.img..2.1.67...0i24k1.0.pDhlh-JQAjE\">image search</a>, all I see are bikes being ridden or parked with lots of not-easily cropped backgrounds. No free advertising for Jump. ",
            "created": "Sat, 25 Aug 2018 14:17:52 GMT",
            "type": "outline"
        },
        {
            "text": "I have a friend who's an accomplished computer scientist, really smart and creative in that area. Also a good teacher. But in politics he's a snotty bastard, he uses logic that could never work in debugging code. I wonder how such contradictions happen? Really puzzling.",
            "created": "Sat, 25 Aug 2018 14:05:04 GMT",
            "type": "outline"
        },
        {
            "text": "I like inclusive movements. I don’t care how you got to the party. Whether you took the subway, walked, came by spaceship or were driven by your chauffeur. What’s important is you’re here. That's also the philosophy of America, btw.",
            "created": "Sat, 25 Aug 2018 15:06:09 GMT",
            "type": "outline"
        },
        {
            "text": "Facebook is broken, part #3929",
            "created": "Sat, 25 Aug 2018 15:41:44 GMT",
            "type": "outline",
            "description": "I like cilantro, but it isn't the center of my existence.",
            "subs": [
                {
                    "text": "Every time I visit the site, I get the same top message. ",
                    "created": "Sat, 25 Aug 2018 15:41:53 GMT"
                },
                {
                    "text": "If I go to the popup menu to say \"Don't show me this again\" they start me down the abusive-user path. Why do I want to block this user. I don't. What did they do? Nothing, you fucked up FB. So I skip it, and every time I come here I see the same damn image, a movie about cilantro.",
                    "created": "Sat, 25 Aug 2018 15:42:06 GMT"
                },
                {
                    "text": "I like cilantro, but it isn't the center of my existence. Facebook, we can move on from this. You have a bug. Give me a way to say stop showing me this message and the user is doing nothing wrong."
                },
                {
                    "text": "By lacking a way to tell you this, you're compounding the insult of the bug. <i>Your</i> bug. ;-)",
                    "created": "Sat, 25 Aug 2018 15:42:33 GMT"
                },
                {
                    "text": "Love,"
                },
                {
                    "text": "Dave"
                }
            ]
        }
    ]
}