{
    "text": "August 27",
    "created": "Mon, 27 Aug 2018 14:11:08 GMT",
    "name": "27",
    "subs": [
        {
            "text": "<a href=\"http://nytimesriver.com/\">nytimesriver.com</a> began <a href=\"https://web.archive.org/web/20060902170052/http://nytimesriver.com\">in 2006</a> as an experiment to see how news reading on a Blackberry might work. I kept it running for twelve years, hoping the NYT would get the idea, and do it for itself, or even better, let me do it for them. Earlier today I got a letter from an in-house lawyer at the Times. It's a nice letter, given that a lawyer wrote it. But after all these years of being ignored, the first response is from a lawyer? That's not only rude, it's sad. So I decided the best thing to do is turn the site off. I don't feel like paying a lawyer to represent me when I'm just doing this project because I want the NYT to do better by its readers. If they decide to <a href=\"https://en.wikipedia.org/wiki/Mensch\">say thanks</a>, or even maybe buy me lunch, I'll consider turning it back on. ✓",
            "created": "Mon, 27 Aug 2018 21:18:19 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/08/27/bobHopeThanksForTheMemories.png"
        },
        {
            "text": "John McCain's <a href=\"https://github.com/scripting/Scripting-News/blob/master/misc/mcCainFarewell.md\">farewell statement</a>. This is probably why Trump doesn't want the flag flying at half staff over the White House. BTW, I couldn't find a canonical copy of McCain's statement. So I thought where should I put a copy to point to where it might have a chance of surviving for a while. I chose GitHub. But we still don't have a good \"for-the-record\" place on the web, imho.",
            "created": "Mon, 27 Aug 2018 18:16:26 GMT",
            "type": "outline"
        },
        {
            "text": "David Johnson on Twitter <a href=\"https://twitter.com/TheDavidJohnson/status/1034105691689107457\">wonders</a> what's the diff betw \"LO2\" and \"OPML Editor\". That's an interesting question that never occurred to me, because they are so disjoint in time. The OPML Editor is derived from \"Frontier\", which is an outliner among many other things. But the OPML Editor does present as an outliner. One that lives inside a very powerful scripting environment, server and object database, all integrated, and evolved over a couple of decades. It's like the cellphone on the dashboard of a 747. However at this time, the power of the scripting environment would be wasted on an outliner user, most of the additions have fallen into disuse. That said, LO2 is a clone of the outliner inside OPML Editor, which was a clone of MORE, Ready and going way back to ThinkTank which first shipped in 1983. The long and winding road of Dave's outliners. ",
            "created": "Mon, 27 Aug 2018 16:48:57 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/08/27/scientist.png"
        },
        {
            "text": "I have never seen an Alex Jones tweet, believe it or not.",
            "created": "Mon, 27 Aug 2018 15:33:22 GMT",
            "type": "outline"
        },
        {
            "text": "More on inclusivity, which I wrote about <a href=\"http://scripting.com/2018/08/26/161533.html\">yesterday</a>. I wrote a <a href=\"http://scripting.com/2016/08/27/nerdsAndHippies.html\">piece</a> in 2016 about how boys interpret the demonizing of men. It's very much related to the idea of being inclusive. If we're fighting for respect and justice there can't be any limits on who is entitled to it. ",
            "created": "Mon, 27 Aug 2018 14:36:58 GMT",
            "type": "outline"
        },
        {
            "text": "Another thing about <a href=\"https://instagram.com/davew/\">Instagram</a>. When you paste a link into a comment it doesn't hot it up. So they are even less a part of the web than Twitter and Facebook are. ",
            "created": "Mon, 27 Aug 2018 14:11:09 GMT",
            "type": "outline"
        },
        {
            "text": "I went to <a href=\"https://en.wikipedia.org/wiki/Bronx_High_School_of_Science\">Bronx Science</a>, one of two special high schools in NYC that you have to take a test to get into. I took the test when I was in 9th grade, in the late 60s. The NYT recently <a href=\"https://www.nytimes.com/2018/07/18/nyregion/shsat-new-york-city-schools.html\">published</a> five questions from the test. I got four of five right. The one I got wrong was controversial. They have a discussion in the Times article why no one agrees on the correct answer. I was befuddled by it too, it was the one I got wrong. I was especially pleased to have gotten the geometry question right, because I haven't thought about geometry once since I left high school. Not a whole lot of geometry in software development work, or even in a math degree.",
            "created": "Mon, 27 Aug 2018 14:24:38 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/08/27/jumpBike.png"
        },
        {
            "text": "Kung Fu Darwin",
            "created": "Mon, 27 Aug 2018 17:05:21 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "\"kung fu darwin\"",
                    "created": "Tue, 28 Aug 2018 02:04:38 GMT"
                }
            ]
        }
    ]
}