{
    "text": "August 30",
    "created": "Thu, 30 Aug 2018 20:36:48 GMT",
    "name": "30",
    "subs": [
        {
            "text": "Journalists can't say that Google doesn't skew search results for political effect. In fact, we're pretty sure they do (consider what they'll have to do to get back into China). So the best you can say is that the company claims they don't do it. Journalism is doing this wrong.",
            "created": "Fri, 31 Aug 2018 02:41:45 GMT",
            "type": "outline"
        },
        {
            "text": "This is not the kind of thing I usually write about, but things change, and I think it's okay to change what I blog about. A couple of days ago I was walking down a car ramp into a garage, here in Manhattan, unsure of where I was going so I was looking down at my iPhone studying the map. I also had a 30-pound pack on my back which made me more top-heavy than usual. I tripped over a speed bump, at first I thought I would be able to recover, but because of the weight of the pack and the downwards slope of the driveway, I was going down. I hit on both hands, my knee, somehow my side got involved and I hit my head. My hands took the worst of it. A little blood, mostly road-rash. Three strangers came to my aid, very nice people, and I was up and dusted off in a matter of seconds, horribly embarrassed, and in pain. It wasn't until hours later that I realized that if this happened a few years from now it could have been a lot worse. For now my whole body is sore. Reminds me of how I felt after a bike accident in NYC a few years back. This was nowhere near as bad. I told a friend I feel fragile. To look at me you might think that's ridiculous. But it's true. 63 ain't 23 or even 43. And I'm sure 73 will also be different. :boom:",
            "created": "Fri, 31 Aug 2018 02:15:56 GMT",
            "type": "outline",
            "image": "http://static.scripting.com/larryKing/images/2014/03/12/stooges.gif"
        },
        {
            "text": "I did a lot of driving in the last 48 hours, and that means I listened to lots of podcasts. And a lot of them <a href=\"https://www.google.com/search?q=site:scripting.com+mccain&safe=off&rlz=1C5CHFA_enUS743US747&source=lnms&tbm=isch&sa=X&ved=0ahUKEwjIzej80pXdAhWLUt8KHcC0BUoQ_AUIDCgD&biw=1383&bih=1186\">were</a> about <a href=\"https://en.wikipedia.org/wiki/John_McCain\">John McCain</a>. Surprising to me that I wanted to hear more about him, even though in life, I felt I knew all I wanted. I had mixed feelings about him. I <a href=\"https://www.google.com/search?q=site%3Ascripting.com+mccain&rlz=1C5CHFA_enUS743US747&oq=site%3Ascripting.com+mccain&aqs=chrome..69i57j69i58.174685j0j4&sourceid=chrome&ie=UTF-8\">remember</a> when he ran against Bush and first did great and then got whipped. He does do a good New Hampshire town hall. He likes to say how honest he is, but I heard him do a lot of lying, esp about the Iraq War. That's the worst. To let people call you honest, to call yourself honest, while you're lying. That's worse than just being a liar. Anyway, he was an interesting person. One thing he said in an interview in the mid-2000s is that we should repeal Roe v Wade and then have a great debate about it. I wanted the interviewer to ask him why we can't have the debate before repealing it? I can't imagine there's anything more to say that hasn't already been said a billion times. It's a morally ambiguous situation. No amount of debating will change that. Some things just are. We will never come to agreement. Accept it. Now tell me again why appealing Roe v Wade is the right thing to do? Of course he's dead now, so we'll never know. ✓",
            "created": "Thu, 30 Aug 2018 20:36:49 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/08/30/mockcain.png"
        },
        {
            "text": "I also thought he was a spitballer. The kind of kid who sat in the back of the classroom and made wisecracks about the other kids and the teacher. But he never went to the board. He did a lot of shooting from the hip. Choosing Sarah Palin was a great example. A brainstorming session, do something bold, and oops a tragic mistake. He did it again when he suspended his campaign because of the financial crisis, called a big meeting in DC to brainstorm ideas. He had no ideas, couldn't even lead the meeting. Obama did. He would have been a terrible president. We might have done a few bold and disastrous things, and I'm sure the important stuff would have fallen through the cracks. We were right not to elect him president in 2008.",
            "created": "Thu, 30 Aug 2018 20:51:32 GMT",
            "type": "outline"
        },
        {
            "text": "I just want to add, it's sad that he's gone. I felt this more deeply than other celebrity deaths. I guess we really get to know politicians. For a musician their music doesn't die with them. Same with writers. But it's different with parents and one-time presidential candidates.  ",
            "created": "Thu, 30 Aug 2018 20:45:02 GMT",
            "type": "outline"
        }
    ]
}