{
    "text": "I fear Google's control of the web",
    "created": "Tue, 12 Jun 2018 14:03:29 GMT",
    "type": "outline",
    "description": "The wonder of the web is that it is not subject to the whims of chaotic corporate management.",
    "subs": [
        {
            "text": "My fear is this -- once <a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+google&t=h_&ia=web\">Google</a> has <a href=\"http://this.how/googleAndHttp/\">control</a> of the web, they can turn off huge parts of it for whatever reason, however thoughtless, and without disclosing why. They might say they would never do it, but I've seen them do it with <a href=\"https://www.google.com/reader/about/\">Google Reader</a>.   ",
            "created": "Tue, 12 Jun 2018 14:03:36 GMT"
        },
        {
            "text": "Their intentions might be fine and it might not be on their roadmap, but capturing RSS and then shutting it off probably wasn't on their roadmap either, until they decided to do it. Then it was on their <a href=\"https://googleblog.blogspot.com/2013/03/a-second-spring-of-cleaning.html\">roadmap</a>. :boom:",
            "created": "Tue, 12 Jun 2018 14:03:50 GMT"
        },
        {
            "text": "They talk to me like I have no idea how tech companies work internally, but I do. After the next reorg they won't remember any commitments the previous management made. It's like when we change administrations in Washington. Very chaotic.",
            "created": "Tue, 12 Jun 2018 14:03:59 GMT"
        },
        {
            "text": "That's why the wonder of the web is that it is not subject to the whims of chaotic corporate management. Now, I suppose at some point it <i>will</i> be owned, and then after that it will be shut down. That's how we lose huge amounts of <a href=\"https://en.wikipedia.org/wiki/Intellectual_property\">IP</a>, open stuff, non-corporate stuff.",
            "created": "Tue, 12 Jun 2018 14:04:11 GMT"
        },
        {
            "text": "It's not surprising that a big corporation has little respect for stuff developed outside big corporations, but that was and could continue to be the glory of the web. It was amazing all those years ago, the freedom to do whatever you thought of doing. (It's what made <a href=\"https://en.wikipedia.org/wiki/Google#History\">Google</a> itself possible.)",
            "created": "Tue, 12 Jun 2018 14:04:20 GMT"
        },
        {
            "text": "I would like future generations to have that ability too. But next year's roadmap from Google will make the web more like <a href=\"https://en.wikipedia.org/wiki/AOL\">AOL</a> and the one after that, more and so on.",
            "created": "Tue, 12 Jun 2018 14:04:29 GMT"
        },
        {
            "text": "Earlier: <a href=\"http://this.how/googleAndHttp/\">Google and HTTP</a>. Also a few thoughtful <a href=\"https://news.ycombinator.com/item?id=17295502\">comments</a> on Hacker News. ",
            "created": "Tue, 12 Jun 2018 19:26:53 GMT"
        }
    ]
}