{
    "text": "Won't get fooled again",
    "created": "Mon, 18 Jul 2022 22:00:14 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "You can invent and evolve a new sport if you are all the elements, yourself. If you're can play all the roles, have a venue, journalists (cover it), and you have fans. If you want to change the rules, you don't need to get anyone's approval, you just need a vision. ",
            "created": "Mon, 18 Jul 2022 15:40:57 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "That's how I got blogging going. I had tools for writing, and reading, and I generated feeds myself because I am a writer. I don't have to wait to find a writer who will try out my latest ideas. Or get a feed reader to support the feature, or have editing tools so that other people can do it. It happened even faster with evolving podcasting because it was the second time around, and people were paying attention to the blogs we created in Step 1. ;-)",
            "created": "Mon, 18 Jul 2022 22:01:58 GMT",
            "flInCalendar": true
        },
        {
            "text": "With RSS 2.0, I was intimidated when big companies and VCs got in the way. In the future I'll keep cruising because I know I have a better sense of what's needed than they do because they just hire bored employees to work on my ideas. None of them had the guts, curiousity or frankly enough intelligence to work with the person who put it all together. Learned that lesson after twenty years of stagnation in <a href=\"http://rss.land/\">RSS-Land</a>. No more of that. ",
            "created": "Mon, 18 Jul 2022 22:02:08 GMT",
            "flInCalendar": true
        },
        {
            "text": "PS: I turned this post into a <a href=\"https://twitter.com/cluelessnewbie/status/1549146834689556481\">thread</a> on Twitter. ",
            "created": "Mon, 18 Jul 2022 21:39:47 GMT",
            "flInCalendar": true
        },
        {
            "text": "PPS: You can read the feed <a href=\"http://feeder.scripting.com/?template=mailbox&feedurl=http://feedland.org/twitterfeeds/cluelessnewbie/rss.xml\">here</a>. And, of course -- a <a href=\"http://scripting.com/images/2022/07/18/cluelessscreenshot.png\">screen shot</a>. ",
            "created": "Mon, 18 Jul 2022 22:13:23 GMT",
            "flInCalendar": true
        },
        {
            "text": "PPPS: The title of this post comes from a <a href=\"https://www.youtube.com/watch?v=SHhrZgojY1Q\">great song</a> by The Who.",
            "created": "Mon, 18 Jul 2022 22:03:37 GMT",
            "urlvideo": "https://www.youtube.com/watch?v=SHhrZgojY1Q",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}