{
    "text": "Thinking out loud is blogging",
    "created": "Mon, 23 Oct 2023 01:19:43 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "It's weird that people have the idea that <a href=\"https://www.google.com/search?q=site%3Ascripting.com+thinking+out+loud\">thinking out loud</a> is a new idea for blogging. That's because when journalists first heard about blogging they decided that it's what they do. People who write publicly for money, mostly without any principle other than getting paid for writing, or perhaps \"building a brand.\" That imho was not what was going on. It was people asking questions, often in the form of statements they weren't sure of. Put it out there, see what comes back. At its best it was what I called <a href=\"https://www.google.com/search?q=site%3Ascripting.com+sources+go+direct\">sources go direct</a> -- where people with expertise shared what they knew so we could learn from them. So the idea of a public \"garden\" is just a response to journalists getting the story totally wrong about blogging in the early days. Amazing how these things cycle round and round often because of basic misunderstandings like this. ",
            "created": "Sun, 22 Oct 2023 17:05:14 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I love to cite this <a href=\"http://images.scripting.com/archiveScriptingCom/2005/02/10/cartoon.gif\">cartoon</a> from the 2004 Democratic Convention which first opened its doors to bloggers. I was one of them. They saw us as gatecrashers. We were just people who have the need to blog. A small number of people were born to write about what they see, and the web opened that up to all of us, for the first time it took almost no money to get your ideas out there, and clearly they were scared of us. What a crime that actual people would be reporting on the events of our democracy. They're so stuck in their calcified thought patterns that it never occurred to them that this is great, people who actually give a shit, wanting to tell other people what they saw and heard. Unfortunately they got their way, that's how powerful they are and how easily manipulated we all are. ",
            "created": "Sun, 22 Oct 2023 17:14:11 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}