{
    "text": "NY Harbor as a space port",
    "created": "Sun, 22 Oct 2023 14:19:59 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "My next DALL-E adventure: \"100 years from now in 2123, New York Harbor will be a space port, with spaceships arriving from all over the solar system and around the Milky Way galaxy. People will visit to see New York's museums, see sports games, attend NYU, Columbia and the Bronx High School of Science, all galactically renowned educational institutions. Most alien beings will not be humanoid. \"",
            "created": "Sun, 22 Oct 2023 14:20:15 GMT",
            "flInCalendar": true
        },
        {
            "text": "I was presented with four illustrations.",
            "created": "Sun, 22 Oct 2023 14:20:38 GMT",
            "flInCalendar": true
        },
        {
            "text": "1. Photo of the futuristic New York Harbor as a bustling space port. Numerous advanced spaceships are seen descending from the sky, some with designs native to the Milky Way galaxy. The skyline of New York is still recognizable but has been augmented with futuristic architectures. Aboard the ships, a diverse array of alien beings disembark. Some float, some have multiple limbs, and they come in various colors and sizes. They interact with humans and each other, many holding digital guides highlighting New York's museums and educational institutions.",
            "created": "Sun, 22 Oct 2023 14:22:25 GMT",
            "flInCalendar": true
        },
        {
            "text": "A bustling New York Harbor transformed into a space port.",
            "created": "Sun, 22 Oct 2023 14:20:48 GMT",
            "inlineImage": "https://imgs.scripting.com/2023/10/22/nyharborspaceport.png",
            "flInCalendar": true
        },
        {
            "text": "2. Illustration of the entrance to NYU in 2123. The iconic Washington Square Arch stands tall, but now with holographic enhancements. Students of various species walk, float, or glide into the campus. Some aliens are seen engaging in animated discussions with human professors. Banners in the background promote intergalactic exchange programs.",
            "created": "Sun, 22 Oct 2023 14:25:24 GMT",
            "flInCalendar": true
        },
        {
            "text": "Entrance to NYU in 2123 with the iconic Washington Square Arch and holographic enhancements.",
            "created": "Sun, 22 Oct 2023 14:21:12 GMT",
            "inlineImage": "https://imgs.scripting.com/2023/10/22/nyu.png",
            "flInCalendar": true
        },
        {
            "text": "3. Photo of an intergalactic sports game taking place in a futuristic stadium in New York. The game is a mix of soccer and a sport from another galaxy, played by teams comprising both humans and aliens. The audience is a melting pot of species from different planets, cheering passionately for their favorite teams.",
            "created": "Sun, 22 Oct 2023 14:25:07 GMT",
            "flInCalendar": true
        },
        {
            "text": "An intergalactic sports game taking place in a futuristic stadium in New York.",
            "created": "Sun, 22 Oct 2023 14:21:13 GMT",
            "inlineImage": "https://imgs.scripting.com/2023/10/22/sportvenue.png",
            "flInCalendar": true
        },
        {
            "text": "4. Watercolor painting of the Bronx High School of Science's main entrance. This prestigious school now has a massive holographic globe above it, displaying various constellations. Students, both human and alien, rush in, some levitating their books and some using advanced tech wearables for learning. A group of alien parents is seen taking a campus tour, marvelling at the institution's history.",
            "created": "Sun, 22 Oct 2023 14:28:27 GMT",
            "flInCalendar": true
        },
        {
            "text": "Bronx High School of Science's main entrance with a massive holographic globe.",
            "created": "Sun, 22 Oct 2023 14:21:21 GMT",
            "inlineImage": "https://imgs.scripting.com/2023/10/22/bronxScience.png",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}