{
    "text": "RSS on a timeline",
    "created": "Sun, 22 Jun 2025 13:13:33 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "More on the vision for WordLand and RSS. ",
            "created": "Sun, 22 Jun 2025 13:36:32 GMT",
            "flInCalendar": true
        },
        {
            "text": "Imagine that \"WordLand\" is the editor of a <a href=\"https://daytona.scripting.com/search?q=%22twitter-like%22\">twitter-like</a> system built around \"RSS\". It saves your writing to WordPress, where it is published on a website and via RSS. You don't have to use WordLand or WordPress, because RSS is an open format. <i>Any editor that generates RSS is part of the network. </i>Designed to be simple. ",
            "created": "Sun, 22 Jun 2025 12:51:27 GMT",
            "flInCalendar": true
        },
        {
            "text": "All that's missing is a timeline viewer, and that's what I'm working on now. It's coming together pretty nicely, imho. Not an easy project, though on the surface it looks like it should be. Also there's nothing proprietary about my timeline viewer. There could be a thousand of them. Anyone who has written an RSS feed reader will have all the low-level bits they need. ",
            "created": "Sun, 22 Jun 2025 13:13:47 GMT",
            "flInCalendar": true
        },
        {
            "text": "Hoping to have all the connections working by the end of the summer. ",
            "created": "Sun, 22 Jun 2025 13:15:32 GMT",
            "flInCalendar": true
        },
        {
            "text": "Once done, it will be the completion of the vision for RSS as the foundation of the open social web, the place that all the open formats agree on, so we can get on with interop and say goodbye to lock-in. It can be done, I'm almost 100 percent sure of that now. Still have a little ways to go. As they say -- <i>still diggin!</i>",
            "created": "Sun, 22 Jun 2025 13:14:18 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}