{
    "text": "WordCamp Canada in October",
    "created": "Sun, 22 Jun 2025 13:24:05 GMT",
    "type": "outline",
    "metaImage": "https://s3.amazonaws.com/scripting.com/images/2025/06/22/ottawa.png",
    "description": "We'll have a lot to talk about in October! ",
    "subs": [
        {
            "text": "I'm keynoting the <a href=\"https://canada.wordcamp.org/2025/\">WordCamp Canada</a> conference in October in Ottawa. It's the first conference I've attended since before the pandemic. ",
            "created": "Sun, 22 Jun 2025 13:16:10 GMT",
            "flInCalendar": true
        },
        {
            "text": "The timing is ideal, and the location is significant. As an American, I don't want to try to attract people from around the world to a meeting in my country. Right now, I wouldn't come here if I didn't live here. ",
            "created": "Sun, 22 Jun 2025 13:24:36 GMT",
            "flInCalendar": true
        },
        {
            "text": "I'm also not happy with the tech industry of the US. I'd like a fresh start, a return to our roots, with the assumption that the people control their destiny and the role of developers is to give them to the tools to try out new ideas. ",
            "created": "Sun, 22 Jun 2025 13:25:08 GMT",
            "flInCalendar": true
        },
        {
            "text": "With \"WordLand\" I've created a product <a href=\"https://this.how/wordland/\">for writers</a>, filling a need that's been there since the beginning of the web, using the practices in writing tools we learned in the 80s. It doesn't have the artificial <a href=\"https://textcasting.org/\">limits</a> imposed by Twitter et al. I think they're senseless. So we're going to blow that door wide open. No character limits. Simple styling. Links. Editable. ",
            "created": "Sun, 22 Jun 2025 13:32:16 GMT",
            "flInCalendar": true
        },
        {
            "text": "And it's also a product for developers. There's no lock-in anywhere in this stack. So you can make a different style of editor. Or play with new ways to view timelines.",
            "created": "Sun, 22 Jun 2025 13:25:56 GMT",
            "flInCalendar": true
        },
        {
            "text": "I wanted to take discourse in a different direction too. A good design for the social web shouldn't require intense moderation. The reward for spammers is practically nil. Also, it'll be good for small groups in a way that Twitter et al never have been. ",
            "created": "Sun, 22 Jun 2025 13:40:48 GMT",
            "flInCalendar": true
        },
        {
            "text": "So far I haven't invented any new formats. We're building on what works now. WordPress is a remarkably deep product, so deep it could be used as operating system. and that's exactly how I've chosen to view it and it works incredibly well. Some of what we're building on is based on work I did with Joseph Scott of Automattic in <a href=\"https://daytona.scripting.com/search?q=%22joseph%20scott%22\">2009</a>, believe it or not.",
            "created": "Sun, 22 Jun 2025 13:41:41 GMT",
            "flInCalendar": true
        },
        {
            "text": "And as a bonus we get a great bridge into ActivityPub, from the great work Automattic is doing in bridging WordPress to ActivityPub. Think about it and you'll see how connections in and out of WordPress can facilitate a lot of interop, not just via RSS, but any format that comes along that people want to use.  ",
            "created": "Sun, 22 Jun 2025 13:24:30 GMT",
            "flInCalendar": true
        },
        {
            "text": "We'll have a lot to talk about in October! ",
            "created": "Sun, 22 Jun 2025 13:28:40 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}