{
    "text": "Soup of abuse, part two",
    "created": "Sun, 30 Sep 2018 15:20:40 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "<i>I had written the <a href=\"http://scripting.com/2018/09/29/001342.html\">piece</a> I published yesterday in many forms over many years, but yesterday's was the first I published. Here's another way to look at the same set of facts, from a piece I wrote earlier this month. </i>",
            "created": "Sun, 30 Sep 2018 15:20:51 GMT"
        },
        {
            "text": "Our online discussions always seem to miss the 900-pound gorilla in the middle of the room. The environment we were raised in was full of abuse of all kinds, lots of it impossible to get away from, because the abuse was at home. In those situations there was no escape. ",
            "created": "Sun, 30 Sep 2018 15:21:41 GMT",
            "image": "http://scripting.com/images/2018/09/30/mushRoomSoup.png"
        },
        {
            "text": "Even if there wasn't any abuse in the house you grew up in, that you were aware of, your classmates were dealing with it, your best friends, the people you chose as lovers. Or your parents did, or their parents. It's all a fog, because we're totally not allowed to talk about it. That might the worst part, you're forced to keep the secret for the people who are hurting you. "
        },
        {
            "text": "This was the argument I had with my parents as I was growing up, why can't we talk about this, find a solution. I learned later through therapy and inference the horror show my parents grew up in. I've talked about it with my closest friends, and they've told me the stories of their families. Once, just once, my mother volunteered what happened between her and her parents, but after that, no more. She'd never talk about it. She didn't do anything wrong, she was a child,  she carried that burden for them through her whole life."
        },
        {
            "text": "It really is the environment. And when we start talking about it that way who knows what happens, maybe it gets better, or maybe we find we can't live with each other. Or something else, totally unpredictable. "
        }
    ]
}