{
    "text": "I still like Klobuchar",
    "created": "Mon, 20 Jan 2020 15:20:47 GMT",
    "type": "outline",
    "description": "She's young, but not too young. A liberal who presents as a moderate. Thoughtful. Doesn't shoot from the hip.",
    "subs": [
        {
            "text": "I like that the <a href=\"https://www.nytimes.com/interactive/2020/01/19/opinion/amy-klobuchar-elizabeth-warren-nytimes-endorsement.html\">NYT endorsed</a> Amy Klobuchar. I think she is the right choice for president, as I've <a href=\"http://scripting.com/2018/11/23/205133.html\">written</a> here before. \"She's young, but not too young. A liberal who presents as a moderate. Thoughtful. Doesn't shoot from the hip.\"",
            "created": "Mon, 20 Jan 2020 15:17:03 GMT",
            "type": "outline"
        },
        {
            "text": "They also endorsed Elizabeth Warren, who imho can't get in touch with most of America, for a lot of reasons. A video <a href=\"http://scripting.com/2019/11/05/212459.html\">convinced</a> me, she would not be a good president. A good senator, a good Secretary of the Treasury, a Harvard professor? Yes, but she writes off 1/2 the electorate in a snipe that lucky for her didn't get a lot of coverage. Also there's <a href=\"http://scripting.com/liveblog/users/davewiner/2016/02/18/1034.html\">this incident</a>, that proved that she's a Democrat as much as Biden, Clinton or Obama, and in not a good way. ",
            "created": "Mon, 20 Jan 2020 15:21:06 GMT"
        },
        {
            "text": "A president must be of all the people, not just women or men. We've seen what happens with a president who doesn't get that. Warren, while smart, and determined, is not a leader. Klobuchar still has a way to go before she's confident enough to lead. But she has a lot of things right, and she's tough and from the center of the country, and that's symbolic and important. ",
            "created": "Mon, 20 Jan 2020 15:21:47 GMT"
        },
        {
            "text": "And this is the year we need a woman president, to balance four years of having a very anti-woman president. But not someone who will undo the past by re-doing it in the inverse. We need all hands on deck to recover from the various crises that confront us. ",
            "created": "Mon, 20 Jan 2020 15:22:15 GMT"
        },
        {
            "text": "The NYT had a <a href=\"http://scripting.com/images/2020/01/20/nytOnSanders.png\">line about Sanders</a> that I knew but had forgotten. His plan for change is this: Magic! He has such a personality that everyone, once he's elected, will get behind him. It's what teenage boys dream of when they grow up to hit a walk-off home run to win the World Series. The acclaim, the wonder, such a good boy! Well it would never be like that for Bernie. He's got a character only a few people like, and many can't tolerate. I have always disliked him, think he's shallow and just plain wrong. What an awful president he'd make, something we'll never see because a cranky old Jewish socialist could not get elected president of the United States. He would be the <a href=\"https://en.wikipedia.org/wiki/George_McGovern\">McGovern</a> of 2020, but at least McGovern was a nice guy.",
            "created": "Mon, 20 Jan 2020 15:22:18 GMT"
        }
    ]
}