{
    "text": "What the Equifax breach means",
    "created": "Sat, 09 Sep 2017 17:38:10 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "The <a href=\"http://www.techmeme.com/170908/p13#a170908p13\">security</a> <a href=\"http://www.latimes.com/business/hiltzik/la-fi-hiltzik-equifax-breach-20170908-story.html\">breach</a> at <a href=\"https://arstechnica.com/tech-policy/2017/09/are-you-an-equifax-breach-victim-you-must-give-up-right-to-sue-to-find-out/\">Equifax</a> is much more than a security breach. You could say it's 1/2 of a meltdown of the economic system in the US. ",
            "created": "Sat, 09 Sep 2017 17:38:31 GMT",
            "image": "http:///scripting.com/images/2017/09/09/fatcat.png"
        },
        {
            "text": "I haven't heard anyone say exactly what information has escaped, let's assume it's the worst, it's all the info needed to identify a person. Maybe their credit history, although with this information you could access anyone's history. So why would you bother <a href=\"https://www.axios.com/what-to-do-next-after-equifaxs-security-breach-2483302344.html\">locking</a> your account so lenders know not to give you any loans? Is anyone going to trust that info in the future? I can't see why they would. ",
            "created": "Sat, 09 Sep 2017 17:39:06 GMT"
        },
        {
            "text": "I haven't seen anyone suggest you change your password this time. It's usually pointless advice, but this time it would be especially idiotic. You can't change your birthdate, social security number or mother's maiden name. ",
            "created": "Sat, 09 Sep 2017 17:42:12 GMT"
        },
        {
            "text": "I say this is only 1/2 because the other half would be a meltdown of the money system. Suppose you went to the ATM to get some cash and found you didn't have an account. Or your brokerage account was cleaned out. Or you learn that your mortgage payments have been going to Russia and you no longer have a place to live. ",
            "created": "Sat, 09 Sep 2017 17:39:38 GMT"
        },
        {
            "text": "When that happens, and I can't imagine it <i>won't, </i>it will be a civilization-level meltdown. If you think the US govt is doing anything to prevent it, well I'm not very confident about that. ",
            "created": "Sat, 09 Sep 2017 17:40:41 GMT"
        }
    ]
}