{
    "text": "Instant Dave update",
    "created": "Sat, 09 Sep 2017 13:14:25 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Happy to report that more people are tuning in to \"Instant Dave\". Now we can start learning and developing. It will be an interactive experience. I want to create a new kind of environment, to stimulate thinking and to get ideas for new features, shaping what I hope will become a new medium.",
            "created": "Sat, 09 Sep 2017 13:14:32 GMT",
            "image": "http:///scripting.com/images/2017/09/09/abrahamLincolnBobblehead.png"
        },
        {
            "text": "Naturally people ask how can they get their own? And that's something I don't know how to answer, at least not yet. But the name suggests that in addition to \"Instant Dave\" there will be other <i>Instants. </i>",
            "created": "Sat, 09 Sep 2017 13:16:02 GMT"
        },
        {
            "text": "I'd say the first step is to blog, and then start a linkblog (like <a href=\"http://scripting.com/links.html\">this</a>) and use a photo service like <a href=\"https://www.flickr.com/\">Flickr</a> that has \"RSS\" support. The idea is to aggregate them all into one easy to follow stream. ",
            "created": "Sat, 09 Sep 2017 13:16:57 GMT"
        },
        {
            "text": "What software to use? For blogging, obviously there are lots of choices and they all support \"RSS\" which of course is the basic technology behind the <i>Instant</i> movement. Your podcasts will have an <a href=\"http://fieldguide.gizmodo.com/why-rss-feeds-still-beat-facebook-and-twitter-for-track-1800722740\">RSS</a> feed (or else they are not podcasts and shouldn't be calling themselves that). For linkblogging I recommend my own \"Radio3\". And to aggregate them all into one stream, try \"River5\" or \"Electric River\". ",
            "created": "Sat, 09 Sep 2017 13:17:51 GMT"
        },
        {
            "text": "And of course use \"Instant Dave\". If you're going to be an actor you want to soak up as much other people's acting as possible, so you can steal ideas from them. Blogging is no different. :boom:",
            "created": "Sat, 09 Sep 2017 13:26:31 GMT"
        }
    ]
}