{
    "text": "November 1",
    "created": "Fri, 01 Nov 2019 12:28:47 GMT",
    "name": "01",
    "subs": [
        {
            "text": "A Florida attorney <a href=\"https://twitter.com/20thgrader/status/1190099633302839302\">writes</a>: \"Donald Trump is about to get ripped apart by NY Courts and there isn't a single presidential power that can stop it. He's moving to Florida because of a unique unlimited <a href=\"https://en.wikipedia.org/wiki/Homestead_exemption_in_Florida\">Homestead provision</a> in our Constitution letting him keep a home of any value.\"",
            "created": "Fri, 01 Nov 2019 15:00:53 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/02/08/trumpHead.png"
        },
        {
            "text": "Another thing Facebook is good for. A friend  posted a request for a referral to a cardiologist. A far-away friend was quite sick. We figured out that wasn't right, they should call 911 and get to a hospital asap. I don't know what the outcome was, but it might have saved a life.",
            "created": "Fri, 01 Nov 2019 14:26:42 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1190273598222733314"
        },
        {
            "text": "From a Scripting News reader: \"Found my kidney donor on Facebook last year, while they weren't a match for me, they opted to swap on my behalf thereby helping four other people and me finding another match. Complete stranger.\"",
            "created": "Fri, 01 Nov 2019 16:31:57 GMT",
            "type": "outline"
        },
        {
            "text": "Journalism's view of Facebook",
            "created": "Fri, 01 Nov 2019 13:14:23 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Most journalistic pieces about Facebook view it as an online bulletin board with nightmarish advertising that's getting worse every day. For what it's worth, that's not how I experience it. The only political ads i see are from Democratic candidates who want money. Harmless and easily ignored. ",
                    "created": "Fri, 01 Nov 2019 13:25:09 GMT"
                },
                {
                    "text": "In the last year I've started using a private group for Woodstock residents. It's a very civil place where people do the kinds of things towns do. ",
                    "created": "Fri, 01 Nov 2019 13:26:51 GMT",
                    "image": "http://scripting.com/images/2019/11/01/gilligan.png"
                },
                {
                    "text": "There are quite a few Republicans, occasionally someone says something inflammatory about Trump, but that's moved out the main discussion quickly. ",
                    "created": "Fri, 01 Nov 2019 13:26:44 GMT"
                },
                {
                    "text": "I think people have an interest in civility because eventually you'll see most of them face-to-face, at the post office, grocery, in a park, on the new rail trail, a local restaurant, party. That is a real force for civility. ",
                    "created": "Fri, 01 Nov 2019 13:27:43 GMT"
                },
                {
                    "text": "Anyway, there's no question that it works, and it's worth it. ",
                    "created": "Fri, 01 Nov 2019 13:28:34 GMT"
                },
                {
                    "text": "I've started to create my own private groups. ",
                    "created": "Fri, 01 Nov 2019 13:28:50 GMT"
                },
                {
                    "text": "I know it's in a silo, against my religion, but on the other hand, it's where the people are. Some things are more important than silos vs open systems. ",
                    "created": "Fri, 01 Nov 2019 15:05:56 GMT"
                },
                {
                    "text": "So when journalists write about FB as if it's a black and white thing, they aren't really doing their job. And their editors don't create room for other views, and they aren't doing their jobs either. ",
                    "created": "Fri, 01 Nov 2019 13:29:21 GMT"
                }
            ]
        }
    ]
}