{
    "text": "November 2",
    "created": "Sat, 02 Nov 2019 13:41:51 GMT",
    "name": "02",
    "subs": [
        {
            "text": "The <a href=\"https://www.nytimes.com/2019/11/02/sports/basketball/curry-zion-nba-injuries.html?emc=rss&partner=rss\">NYT says</a> the NBA is not much fun now. I get it. I tried watching the Nets v Rockets last night. Preferred the Knicks v Celtics. The Knicks are more interesting this year. A mix of young and old. And a <a href=\"https://en.wikipedia.org/wiki/RJ_Barrett\">sensational rookie</a>. The boring part of the NBA are the corporate players like Kyrie and KD. Mercenaries. Oh we'll occupy the Nets so we can take cheap shots at the Knicks. Wow. Brilliant. No one cares about the Nets. They get their paycheck and they'll move on to humiliate another team next year, until fans get tired of it. Thing is most of the fans already are. Ask Toronto. You know the players must think we don't know it's about teams. We really don't care about them so much. Make good teams and we'll be happy. That's why we like the Celtics, the Bucks, Philly, and guess what the Knicks look okay this year. Someone put some care into creating this team. I think that's what the Knicks have been missing. Someone who cares about them. But the Knicks would've said yes to Kyrie, I'm glad they didn't get the chance. ",
            "created": "Sat, 02 Nov 2019 21:33:58 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/11/02/barrett.png"
        },
        {
            "text": "I wrote <a href=\"http://scripting.com/images/2019/11/02/visualize.png\">this</a> on this day in 2016: \"Visualize Trump's victory speech where he goes off script because at that point there is no script.\"",
            "created": "Sat, 02 Nov 2019 19:03:29 GMT",
            "type": "tweet",
            "tweetId": "1190709731096244224",
            "tweetUserName": "davewiner"
        },
        {
            "text": "By now everyone who’s an actual person on Twitter should get that the extreme opinions there are programmed by software. These imitation people are algorithmic, not human. In other words we are being programmed by other people’s programs. All you have to do is not get sucked into the emotional <a href=\"https://en.wikipedia.org/wiki/Sm%C3%B6rg%C3%A5sbord\">smörgåsbord</a> the algorithms try to induce in you.",
            "created": "Sat, 02 Nov 2019 15:00:21 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/11/02/robot.png"
        },
        {
            "text": "We thought robots were going to steal our jobs. We didn't foresee that they would break our minds. ",
            "created": "Sat, 02 Nov 2019 15:43:07 GMT",
            "type": "tweet",
            "tweetId": "1190655825070764032",
            "tweetUserName": "davewiner"
        },
        {
            "text": "<a href=\"https://duckduckgo.com/?q=%22el+orange%22+site%3Ascripting.com&t=h_&ia=web\">El Orange</a> is really good at the 280-char rage tweet. Would he be competitive in a world where the limit was a bit longer? No one knows. It would be a different medium. Might favor the story-teller over the grunter.",
            "created": "Sat, 02 Nov 2019 16:46:48 GMT",
            "type": "outline",
            "fargoFindStart": "ne78fe7w2v"
        },
        {
            "text": "<a href=\"https://twitter.com/someknew/status/1190634848152514560\">Speaker Pelosi</a>: \"If we don't have a system of checks and balances, we might as well all elect a president and go home.\" The Repubs in Congress must be secretly glad Pelosi and the House Democrats are sticking their necks out for the Constitution. Unless the Dems prevail, the Repubs are out of a job too. ",
            "created": "Sat, 02 Nov 2019 14:23:35 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/someknew/status/1190634848152514560"
        },
        {
            "text": "We're erecting a Maginot Line, getting ready to re-fight the Battle of 2016, ignoring that the enemy already controls our capital. We should be <a href=\"http://scripting.com/2019/11/02/134152.html\">innovating</a>, but we're not. We're defending against Nixon with lots of Woodsteins. I have a weird feeling we should let Zuck and Jack do what they want, and <i>help</i> them, because our current response is a loser, totally inadequate. ",
            "created": "Sat, 02 Nov 2019 21:07:18 GMT",
            "type": "outline"
        },
        {
            "text": "I heard someone say that Congress shouldn't go on a week recess, but this is a good time to go home and hear from the people. ",
            "created": "Sat, 02 Nov 2019 14:28:20 GMT",
            "type": "outline"
        },
        {
            "text": "Innovating in journalism",
            "created": "Sat, 02 Nov 2019 13:41:52 GMT",
            "type": "outline",
            "description": "The innovator goes ahead. The non-innovator doesn't.",
            "subs": [
                {
                    "text": "You know the <a href=\"https://www.youtube.com/watch?v=8rwsuXHA7RA\">Steve Jobs ad</a> about how geniuses think differently. He was on to something. There is a big difference between the way innovators think and everyone else. And I think I can finally put the difference in words.  ",
                    "created": "Sat, 02 Nov 2019 13:42:08 GMT",
                    "urlvideo": "https://www.youtube.com/watch?v=8rwsuXHA7RA"
                },
                {
                    "text": "If you're going to innovate you do it first, and look for funding when you've got something working. You don't wait for anyone's approval, or investors nagging you about when you're going to finish, because if your idea is innovative enough you'll never be able to explain it in words, and you'll learn so much in the process, the idea will sound very different very quickly if it's new enough. People will want to invest when it's up and running. You have to get there first. The innovator goes ahead. The non-innovator doesn't.",
                    "created": "Sat, 02 Nov 2019 13:44:47 GMT"
                },
                {
                    "text": "I have several friends who are former journalists who are so driven by what they do they write publicly, even though no one is paying them. What they do is exciting. Their ideas are different and valuable. They get me, their reader, thinking, which imho is the best kind of journalism. They may not know it but they are innovating, and if they keep at it, I think there's a good chance they will have such obvious success that people will want to invest. ",
                    "created": "Sat, 02 Nov 2019 13:46:04 GMT"
                },
                {
                    "text": "I would invest myself if we could put it together as something investible. By that I mean it has a way to grow. That it's not just investing in a few outside-the-box thinkers, but if it could become a place where such thinkers could start, follow their idea, develop their own following, and inspire other thinkers to do what they do. I wouldn't burden it with advertising. I'd let it run for a while, the way they let software developers run without a business model these days, while they test their ideas. ",
                    "created": "Sat, 02 Nov 2019 13:49:59 GMT"
                },
                {
                    "text": "Just thinking out loud here. I am sure there's a new journalism out there, that it's not the journalism that gets so much acclaim, the <a href=\"https://www.theguardian.com/us-news/2018/aug/12/woodward-bernstein-watergate-donald-trump-era\">reinvention</a> of Woodward and Bernstein, the two Washington Post innovators who brought down Nixon. We should be way ahead of that by now. We need to be, because the forces opposing democracy, the equivalent of 1974's plumbers, are moving much faster. We're erecting <a href=\"https://en.wikipedia.org/wiki/Maginot_Line\">Maginot Lines</a> now, getting ready to fight the Battle of 2016, ignoring that <i>the enemy already controls our capital. </i>They've been innovating. We haven't seen the results of their most recent innovations, yet. ",
                    "created": "Sat, 02 Nov 2019 13:51:59 GMT"
                }
            ]
        }
    ]
}