{
    "text": "November 3",
    "created": "Sun, 03 Nov 2019 13:56:43 GMT",
    "name": "03",
    "subs": [
        {
            "text": "To Woodstock readers, a couple of ideas. 1. Eventually imho it would be cool if someone did what I'm doing but focused on the town and county. 2. I'm thinking of hosting a meetup, perhaps in my living room, where we do this face to face. I talk for a few minutes on topics either from the blog (most likely) or other subjects. I have done this before, in California and Boston, it can be really interesting. Kind of a like a book club for something that's ongoing, not finished. Or a book tour that lasts months. Just a couple of ideas, seeds planted for the future. :evergreen_tree:   ",
            "created": "Sun, 03 Nov 2019 13:56:44 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2011/11/15/tree.jpg"
        },
        {
            "text": "A blogging meta-note. I use my blog-writing as a break from development work. Ideas occur to me while doing other stuff. I use the blog as a notebook to record them. I also use Twitter as a first draft. As I've said before the 280-char limit made Twitter a lot more useful. I have a graphic editing environment for blogging that only runs on a Mac. When an idea occurs to me when I'm away from work, I can use a phone or tablet to record it on Twitter. It's there when I'm back at my Mac. It's a pretty decent editorial system. I sent a DM yesterday to Jack Dorsey asking to work on the integration of Twitter with desktop writing tools (my own in particular of course). I think it's so close toa breakthrough. I can feel it. I've been right about this before, btw. :bulb:  ",
            "created": "Sun, 03 Nov 2019 14:57:53 GMT",
            "type": "outline"
        },
        {
            "text": "Changes in our world are happening so fast. I wish more news orgs took this as an opportunity to teach and reinforce American rules of self-governance. (British too, btw.) They matter now. It's like <a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+jury+duty&t=h_&ia=web\">jury duty</a>. You'd be amazed at what random Americans can do. We are capable of understanding a lot, with nuance. Look at the rules of any sport, baseball, football, etc. Very complicated. Yet huge numbers of people understand them. And we have a baseline of truth in sports talk. People don't make up averages or rules, yet there's lots of room for subjective opinion. In some countries sports talk does turn violent, but not in the US. Wouldn't be a bad model for a new news org to adopt, up front. :watch:",
            "created": "Sun, 03 Nov 2019 15:01:43 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/06/11/strongman.png"
        }
    ]
}