{
    "text": "November 5",
    "created": "Tue, 05 Nov 2019 15:09:41 GMT",
    "name": "05",
    "subs": [
        {
            "text": "I think Sherrod Brown or Amy Klobuchar would be good Democratic candidates for president. I listened to today's <a href=\"https://www.nytimes.com/2019/11/05/podcasts/the-daily/whos-ahead-2020.html\">Daily podcast</a> about the chances of the Demo candidates based on polling the NYT just did. It's not a good picture. They say Biden would win, but the Repubs haven't run a campaign on him yet. They're going to let the Dems tear him to shreds first, which they will. People think this is about policy, it's not. <i>People want to feel like winners. </i>I wouldn't feel like a winner, of any kind, if my president was Warren, Sanders or Biden. Ugh. Anyway if a Democrat is elected what they'll do will depend totally on the makeup of Congress. The more Repubs are left the more compromise, unless of course Trump is re-elected, then you can forget about who's in Congress, it won't matter. Our Congress will be no more consequential than Russia's. I agree with <a href=\"http://nymag.com/intelligencer/2019/11/poll-trump-beats-democrats-swing-state-biden-warren-sanders.html\">Chait</a> that the Dems have been living in a fantasy world. None of the leading candidates will beat Trump, none of them. ",
            "created": "Tue, 05 Nov 2019 21:01:10 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/11/05/dems.png"
        },
        {
            "text": "You can tell <a href=\"http://scripting.com/images/2019/11/05/love.png\">they're</a> in love. <span style=\"font-size: .7em;\">:heart:</span>",
            "created": "Tue, 05 Nov 2019 16:03:28 GMT",
            "type": "outline",
            "urlexpandableimage": "http://scripting.com/images/2019/11/05/love.png"
        },
        {
            "text": "Why impeach asap",
            "created": "Tue, 05 Nov 2019 15:09:42 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "So much discussion in the news about impeachment, and they never talk about the #1 reason to impeach, asap. So here's a reminder.",
                    "created": "Tue, 05 Nov 2019 15:09:49 GMT"
                },
                {
                    "text": "He's running the presidency as if he was a monarch. Ignoring the Constitution. And the longer he gets away with it the worse it gets. ",
                    "created": "Tue, 05 Nov 2019 15:10:24 GMT"
                },
                {
                    "text": "They should make a song about this. How the president is not a king. We could change the words to the Star Spangled Banner. ",
                    "created": "Tue, 05 Nov 2019 15:38:45 GMT"
                }
            ]
        }
    ]
}