{
    "text": "November 12",
    "created": "Tue, 12 Nov 2019 14:03:13 GMT",
    "name": "12",
    "subs": [
        {
            "text": "<a href=\"https://twitter.com/rachelweinerwp/status/1194276332865294338\">Here's your smoking gun</a>. Trump knew about Russian hacking of Democratic Party emails. And planned their use in the campaign. The humiliation of the United States is complete. We, you and I, are Putin's bitches. Happy holidays!",
            "created": "Tue, 12 Nov 2019 16:24:05 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/rachelweinerwp/status/1194276332865294338",
            "image": "http://scripting.com/2014/12/17/santaCoke.png"
        },
        {
            "text": "My vision of the Republican Party is death. There is no redemption. They went over the cliff a long time ago. What remains is cancer. You don't try to rehabilitate cancer, you cut it out and destroy what remains. That's why the new version of the Democrats must piss everyone off equally. No one philosophy matters, at this time, other than adherence to the Constitution. ",
            "created": "Tue, 12 Nov 2019 22:06:49 GMT",
            "type": "outline"
        },
        {
            "text": "I envision a new version of the Democrats that pisses everyone off equally, but fanatically adheres to the Constitution so our country learns that we can survive, even thrive on disagreement, but we cannot survive chaos and kleptocracy.",
            "created": "Tue, 12 Nov 2019 22:03:47 GMT",
            "type": "outline"
        },
        {
            "text": "I have a test version of <a href=\"https://duckduckgo.com/?q=TweetSucker+site%3Ascripting.com&t=h_&ia=web\">TweetSucker</a> running on a server. It reads my previous day's tweets at midnight and sends them to me in an email. The body of the email is a sequence of HTML paragraphs. Attached is an OPML file ready to be loaded into Electric Outliner. Here's an <a href=\"http://scripting.com/2019/11/12/tweets.opml\">example</a> of the OPML file. First impression: I tweet a lot. ",
            "created": "Tue, 12 Nov 2019 17:02:48 GMT",
            "type": "outline"
        },
        {
            "text": "My longtime Silicon Valley friend Don Park has a <a href=\"https://twitter.com/donpark/status/1193931229835345926\">truly good idea</a> for a business venture he calls Dropzone. \"Turn your garage and spare room into mini warehouses. Brick and mortar retail can't compete with Amazon but this can and why wait for same day delivery if you can pick it up within an hour.\"",
            "created": "Tue, 12 Nov 2019 15:40:40 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"http://this.how/woodstock/newbies.opml#1573313656000\">Stargazing</a> in the Woodstock area.",
            "created": "Tue, 12 Nov 2019 17:18:47 GMT",
            "type": "outline"
        },
        {
            "text": "I have trouble reading the keys sometimes, so I got one of <a href=\"https://www.amazon.com/gp/product/B075H32ZFG/ref=ppx_yo_dt_b_asin_title_o00_s00?ie=UTF8&psc=1\">these fancy keyboards</a>. ",
            "created": "Tue, 12 Nov 2019 17:22:19 GMT",
            "type": "outline"
        },
        {
            "text": "Forget all the complicated arguments about impeachment, <a href=\"http://scripting.com/images/2019/11/12/heGotCaught.png\">this cartoon</a> from <a href=\"https://thenib.com/the-perfect-crime?id=tom-tomorrow&t=author\">Tom Tomorrow</a> cuts through all the quid pro quos. ",
            "created": "Tue, 12 Nov 2019 14:03:14 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1194193995800498176"
        }
    ]
}