{
    "text": "November 14",
    "created": "Thu, 14 Nov 2019 14:35:35 GMT",
    "name": "14",
    "subs": [
        {
            "text": "Can you imagine what <a href=\"https://en.wikipedia.org/wiki/William_Barr\">AG Barr</a> must think. It was his skill at hype that dug Trump out of the jam he was in with Mueller. What a gift. That was just Act One. Next would be the indictments for Justice people who started the Mueller investigation, to set an example for the people who remain. Either be loyal to Trump or get out. He probably figured he'd have DoJ and the spy agencies cleaned out by the end of next year. Then, after winning re-election, something Barr couldn't help with, they would be ready for Act Three, replete with goose-stepping storm troopers and gas chambers for people of color and non-Christians. Seems obvious that Trump and Barr's <a href=\"https://twitter.com/PeterAlexander/status/1195088750306635785\">animated conversation</a> was about Barr resigning. The Trump Train isn't going where he thought it was, and if Barr stays on board, he's probably going to jail. His bet was a long shot, and now it's impossibly long. Trump may survive impeachment, but he's not likely to become the American Hitler. ",
            "created": "Thu, 14 Nov 2019 22:19:39 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/11/14/babyHuey.png"
        },
        {
            "text": "<a href=\"https://github.com/scripting/Scripting-News/issues/138\">Braintrust query</a>: What method do you use to launch and kill a Node app in the background when you're actively developing it?",
            "created": "Thu, 14 Nov 2019 16:26:22 GMT",
            "type": "outline"
        },
        {
            "text": "Jimmy Wales <a href=\"https://www.ft.com/content/9956ff9c-0622-11ea-a984-fbbacad9e7dd\">wants</a> to turn <a href=\"https://wt.social/\">WikiTribune</a> into a Facebook or Twitter competitor. That imho is a much better idea than hiring reporters, as he did in the first instance of WT. The question is this -- can Jimmy Wales draw a positive community that will work cooperatively on the mission he has defined, defunking news. I signed on but I'm number <a href=\"http://scripting.com/images/2019/11/14/waitingList.png\">26673</a> on the waiting list.",
            "created": "Thu, 14 Nov 2019 18:06:23 GMT",
            "type": "outline"
        },
        {
            "text": "How sad for our country that yesterday's impeachment hearings were <a href=\"https://www.nbcnews.com/politics/trump-impeachment-inquiry/plenty-substance-little-drama-first-day-impeachment-hearings-n1081926\">judged</a> by American journalism as lacking in entertainment value. A good journalist could have found plenty to write about that was gripping from many perspectives. It went to the heart of the United States' role in the world. We identify with the people of Ukraine who are struggling to create a civil system like the one we used to have in the US. They were making progress, <i>with our help,</i> at fighting corruption. Two examples of American goodness testified. And the role of Trump and his mob was to bring American corruption to them. It couldn't be uglier. Maybe it lacked pizzazz if you have no sense of pride in America. I don't know why we place such a high value on journalism, when they fight against us with lunacy like this. ",
            "created": "Thu, 14 Nov 2019 14:35:36 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/11/14/unclesam.png"
        },
        {
            "text": "<a href=\"https://twitter.com/atrupar/status/1194671109679046658\">Trump</a>, with Erdogan next to him, on Syria: \"We are keeping the oil. We have the oil. The oil is secure. We left troops behind only for the oil.\" Someone in the military must have told him, many times, how this puts at risk all US military everywhere, basically forever. I don't buy that Trump is an idiot who has no idea what he's doing. Also it's a joke that we would be trying to acquire (or steal) more carbon-based energy. We should be putting carbon in the ground, not taking it out. ",
            "created": "Thu, 14 Nov 2019 14:49:04 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/atrupar/status/1194671109679046658"
        }
    ]
}