{
    "text": "November 18",
    "created": "Mon, 18 Nov 2019 13:53:03 GMT",
    "name": "18",
    "subs": [
        {
            "text": "Trump got caught hacking the election.",
            "created": "Mon, 18 Nov 2019 17:58:19 GMT",
            "type": "outline"
        },
        {
            "text": "On MSNBC they call <a href=\"https://www.msnbc.com/openingarguments\">this</a> a podcast, and I want to subscribe in the impeachment podcast list (coming soon), but there does not appear to be a feed. Hopefully the system people at MSNBC will add a feed for what is surely a valuable podcast.",
            "created": "Mon, 18 Nov 2019 18:17:40 GMT",
            "type": "outline"
        },
        {
            "text": "What if Twitter let pubs put their tweets behind their paywall?",
            "created": "Mon, 18 Nov 2019 14:44:44 GMT",
            "type": "tweet",
            "tweetId": "1196439322939068417",
            "tweetUserName": "davewiner"
        },
        {
            "text": "I was wondering why we never hear anything about the CEO of Fox News, <a href=\"https://en.wikipedia.org/wiki/Suzanne_Scott\">Suzanne Scott</a>. One of the most influential people in the American political system, and very few people know anything <a href=\"https://duckduckgo.com/?q=%22suzanne+scott%22+fox+news&t=hx&ia=web\">about her</a>. ",
            "created": "Mon, 18 Nov 2019 13:53:32 GMT",
            "type": "outline"
        },
        {
            "text": "Some <a href=\"https://twitter.com/WordswithSteph/status/1196188260449636353\">people at Fox</a> love our country more than Russia. It’s weird that this gives me pride.",
            "created": "Mon, 18 Nov 2019 14:44:05 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/WordswithSteph/status/1196188260449636353"
        },
        {
            "text": "You know I love RSS, but people who are reading this site in their RSS readers, you're missing the real effect. I want a few minutes from you every morning, to give you some ideas, something to think about during the day. That's what the <a href=\"http://scripting.com/email/\">nightly email</a> is all about, and it's evolving in ways that RSS reading <s>can't</s> doesn't.",
            "created": "Mon, 18 Nov 2019 14:39:33 GMT",
            "type": "outline"
        },
        {
            "text": "Marshall Plan for Repubs",
            "created": "Mon, 18 Nov 2019 15:07:38 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "We need a <a href=\"https://en.wikipedia.org/wiki/Marshall_Plan\">Marshall Plan</a> for Republicans. ",
                    "created": "Mon, 18 Nov 2019 14:53:24 GMT"
                },
                {
                    "text": "This is a moment of opportunity that will not come again. ",
                    "created": "Mon, 18 Nov 2019 15:08:48 GMT"
                },
                {
                    "text": "This is why, if you campaign against Bloomberg because whatever, you're being selfish and honestly, stupid. Let him run. ",
                    "created": "Mon, 18 Nov 2019 15:07:54 GMT"
                },
                {
                    "text": "The only thing that matters in this election is this:"
                },
                {
                    "text": "Does the candidate respect the Constitution?"
                },
                {
                    "text": "If so, good.",
                    "created": "Mon, 18 Nov 2019 15:08:06 GMT"
                },
                {
                    "text": "You don't have to vote for them, but don't denigrate them. In the big picture you all are on the same side. ",
                    "created": "Mon, 18 Nov 2019 15:08:06 GMT"
                }
            ]
        },
        {
            "text": "Old folks just want MAGA",
            "created": "Mon, 18 Nov 2019 14:23:11 GMT",
            "type": "outline",
            "description": "You know that you're over the hill when your mind makes a promise your body can't fill. ",
            "subs": [
                {
                    "text": "This is why old people are conservative. ",
                    "created": "Mon, 18 Nov 2019 14:27:17 GMT",
                    "image": "http://scripting.com/images/2019/11/18/oldDudePersonBoogieing.png"
                },
                {
                    "text": "As you age your body wears out. This happens to people at every age, but it first starts to be noticeable in your 40s, and it keeps getting worse until in your 60s, where I am now, you have permanent aches that don't go away. You live with them. From time to time you think about how great life was at 22, when everything worked at peak performance. ",
                    "created": "Mon, 18 Nov 2019 14:30:59 GMT"
                },
                {
                    "text": "Back then if you hurt yourself, you got better. ",
                    "created": "Mon, 18 Nov 2019 18:11:21 GMT"
                },
                {
                    "text": "Then when someone says Make America Great Again, you remember the old days when you were young, and think, yes, that's what I want. Because you felt good, the sex was great, and you had your whole life in front of you. You confuse your youth with the country. Never mind that today's 22 year olds are thinking about <a href=\"http://thesaurus.land/?word=fucking\">what</a> you were thinking about then, and their view of the future is expansive, even infinite, and old age is just something to <a href=\"https://www.youtube.com/watch?v=Q_nFwwjBlEc\">sing about</a>. ",
                    "created": "Mon, 18 Nov 2019 14:29:04 GMT",
                    "collapse": "true",
                    "subs": [
                        {
                            "text": "<i>Little Feat: And you know that you're over the hill when your mind makes a promise that your body can't fill.</i>",
                            "created": "Mon, 18 Nov 2019 14:36:47 GMT"
                        }
                    ]
                },
                {
                    "text": "Then you remember how much you have to deal with now, and when someone says they're going to really shake things up you think fuck that shit, I want my MAGA. ",
                    "created": "Mon, 18 Nov 2019 14:29:43 GMT",
                    "urlvideo": "https://www.youtube.com/watch?v=fye4uY3pCvo"
                }
            ]
        },
        {
            "text": "Radio UserLand reprise?",
            "created": "Mon, 18 Nov 2019 13:53:04 GMT",
            "type": "outline",
            "description": "An unsolicited testimonial on Twitter about Radio UserLand got me thinking.",
            "subs": [
                {
                    "text": "An unsolicited <a href=\"https://twitter.com/bb/status/1196267156268298241\">testimonial</a> on Twitter about <a href=\"https://duckduckgo.com/?q=Radio+UserLand&t=hx&ia=web\">Radio UserLand</a> got me thinking, it was a good combination of features. Blogging integrated with a feed reader. In 2001. It was the product that defined blogging for many, including people who went on to write popular blogging software. And it was where podcasting was born. Radio was both a podcatcher and a tool for managing a podcast feed. It did both sides. I don't know of any product, 18 years later, that does that. And it was easy. We really honed the UI. By then we really understood blogging, and were ready to make it flow. I would put Radio's design up against any popular blogging software today. I think it would win. ",
                    "created": "Mon, 18 Nov 2019 13:53:08 GMT",
                    "image": "http://scripting.com/images/2019/11/18/radioUserLand.png"
                },
                {
                    "text": "Then I thought hmm, we're within striking distance of being able to do it again. The thing that made Radio, still to this day a unique product was that the CMS ran on your desktop. A <a href=\"http://scripting.com/davenet/1997/09/14/FractionalHorsepowerHTTPSe.html\">fractional horsepower</a> server. It was a repackaging of Frontier. Very few people knew that there was a powerful scripting and object database system running on their machine. The <a href=\"http://scripting.com/stories/2008/04/19/suspensionOfDisbeliefAppli.html\">virtuality</a> was pretty complete.",
                    "created": "Mon, 18 Nov 2019 13:57:03 GMT"
                },
                {
                    "text": "Today we could do an even better job of that using JavaScript, Node and Electron. I have an RSS feed reader <a href=\"http://scripting.com/2017/04/19/electricRiverV041b.html\">running</a> in Electron, and it would be quite easy to get Radio3 running in there too. Then all that remains is a remixing to do the integration. ",
                    "created": "Mon, 18 Nov 2019 13:58:23 GMT"
                },
                {
                    "text": "Something to put in the hopper. Thinking about it. ",
                    "created": "Mon, 18 Nov 2019 13:59:20 GMT"
                }
            ]
        }
    ]
}