{
    "text": "November 23",
    "created": "Sat, 23 Nov 2019 12:54:14 GMT",
    "name": "23",
    "subs": [
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1198188964278079488\">Democratic impeachment strategy</a>: House hearings continue indefinitely, until Senate agrees to remove president. Explore every nook and cranny of Republican corruption. Target Repub senators up for re-election in 2020. Draft articles of impeachment are posted publicly and kept current, registered voters can vote individual articles up or down. A full week of hearings on why Republicans are repeating Russian talking points. How about the July 4 visit to Moscow by senators. Why are Repubs so beholden to Putin? What happened in Helsinki? So many questions. Let’s get the answers.",
            "created": "Sat, 23 Nov 2019 13:07:21 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1198188964278079488"
        },
        {
            "text": "Occam's Razor says if you want to grok the hows and whys of the Republican Party,  look at how the political system of Russia works. Why do the members of the <a href=\"https://en.wikipedia.org/wiki/Federal_Assembly_(Russia)\">Russian legislature</a> do whatever Putin wants? That's why the Repubs do what Trump wants. ",
            "created": "Sat, 23 Nov 2019 15:06:25 GMT",
            "type": "outline"
        },
        {
            "text": "UPS no longer delivers",
            "created": "Sat, 23 Nov 2019 12:54:15 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Living in the country, as I do, I order a lot of stuff on Amazon. The nearest department store is about 40 minutes away and it's a Walmart, not exactly my favorite place to shop. ",
                    "created": "Sat, 23 Nov 2019 12:54:23 GMT",
                    "image": "http://scripting.com/images/2019/11/23/ups.png"
                },
                {
                    "text": "In the last week the UPS driver on my route decided not to deliver to my house. The reason keeps changing, but it seems there's nothing I can do about it, so I gave up. I asked the UPS people in Kingston to return the packages to Amazon. I expect Amazon will refund the purchase price. They're usually pretty good with that. ",
                    "created": "Sat, 23 Nov 2019 12:54:53 GMT"
                },
                {
                    "text": "There are no Amazon lockers nearby. But UPS has a relationship with the hardware store in town (8 minutes from my house). That's going to be my next approach. To see if there's a way for UPS to deliver my packages to the store. ",
                    "created": "Sat, 23 Nov 2019 12:55:31 GMT"
                },
                {
                    "text": "And while the UPS people I've talked with have been professional overall this leaves a really bad feeling here for UPS. One day they deliver to your house and the next day they don't. Whatever the reason (it keeps changing) it's not cool. ",
                    "created": "Sat, 23 Nov 2019 12:56:04 GMT"
                }
            ]
        }
    ]
}