{
    "text": "Skiing",
    "created": "Tue, 05 Mar 2019 14:00:02 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Good morning sports fans!",
            "created": "Tue, 05 Mar 2019 13:45:05 GMT"
        },
        {
            "text": "I went skiing yesterday for the first time in let's say five years. The last time was at Deer Valley in Park City, Utah. I remember being in extreme pain and skiing badly, and not being happy. But this time I was less than 30 minutes from a nice easy <a href=\"https://en.wikipedia.org/wiki/Belleayre_Ski_Center\">ski area</a> (or so I thought) in the Catskills, on the day after five inches had fallen overnight, and I sucked up my courage and went skiing. It was painful, but I took it slow, and at times even felt in charge. It's the feeling where your boots are where you express your will to move in this direction or that. The skis in front and back of the boot almost aren't there. You move your ass one way to turn the other. When you get in that zone it's fun. I played another little mental game, sometimes when I'm <a href=\"http://scripting.com/stories/2011/07/05/bikingVsSkiing.html\">bike riding</a> I pretend I'm skiing. This time I pretended I was bike riding. A new thing. Now this morning I'm sore from head to toe, but I feel gratified. I did it. I can still ski. ",
            "created": "Tue, 05 Mar 2019 13:45:22 GMT"
        },
        {
            "text": "Another thing I learned is that the vertical drop on Catskills ski areas are pretty good. The big difference is elevation. <a href=\"https://en.wikipedia.org/wiki/Belleayre_Ski_Center\">Belleayre</a>, where I was skiing yesterday has a base elevation of 2000 feet, compared to <a href=\"https://en.wikipedia.org/wiki/Deer_Valley\">Deer Valley</a> at 6500 feet. That's why the snow is so much nicer at the latter. It rains a bunch in the winter in the Catskills. Enough to make the snow wet sometimes and icy others. But yesterday it was perfect. The snow was the kind of stuff Utah is famous for. ",
            "created": "Tue, 05 Mar 2019 13:50:04 GMT"
        }
    ]
}