{
    "text": "Breaking Bad finale",
    "created": "Sat, 19 Oct 2019 14:03:40 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "As with previous installments, this contains spoilers. ",
            "created": "Sat, 19 Oct 2019 14:09:35 GMT"
        },
        {
            "text": "I watched the last two episodes of Breaking Bad. ",
            "created": "Sat, 19 Oct 2019 14:03:43 GMT"
        },
        {
            "text": "I think I had only watched them once, when they first came out, but I remembered almost all of it. And it's amazing that so much happens in the last episode.",
            "created": "Sat, 19 Oct 2019 14:03:58 GMT"
        },
        {
            "text": "First I want to say that my <a href=\"http://scripting.com/2019/10/18/171521.html\">previous report</a> is one of the sloppiest bits of writing and editing I've ever done. It's practically incoherent. Sorry.",
            "created": "Sat, 19 Oct 2019 14:04:32 GMT",
            "image": "http://scripting.com/images/2019/10/19/mrWhite.png"
        },
        {
            "text": "The point was this, even though I hate Walter White, his humanity comes through, and his broken heart. Even more so in the finale. No one wants his money. His son wants him to die. He admits now he wasn't doing it for his family, he was doing it because he's good at making meth and being a crime boss, and he likes it. ",
            "created": "Sat, 19 Oct 2019 14:05:01 GMT"
        },
        {
            "text": "In the end he forgives Jesse. And he spends his last moments in Jesse's meth lab, and he's happy in the only way Walter White, having passed on the family business, ever was happy. ",
            "created": "Sat, 19 Oct 2019 14:06:41 GMT"
        },
        {
            "text": "Was it a great show? Yes. No reservations.",
            "created": "Sat, 19 Oct 2019 14:07:29 GMT"
        },
        {
            "text": "I got started on this exploration by watching the Breaking Bad movie that just came out. I was wondering if there was anything they could have done with two hours that would be respectful of the show. I haven't figured that out. I'll let you know if I do.",
            "created": "Sat, 19 Oct 2019 14:09:53 GMT"
        }
    ]
}