{
    "text": "September 4",
    "created": "Mon, 04 Sep 2017 13:30:29 GMT",
    "name": "04",
    "subs": [
        {
            "text": "\"Instant Dave\" is an approximation of what's on my mind.",
            "created": "Mon, 04 Sep 2017 16:51:40 GMT",
            "type": "outline"
        },
        {
            "text": "Quickly turned on @msnbc. They're in heavy-war-selling mode. Crisis. Repubs out of patience. Turned it off.",
            "created": "Mon, 04 Sep 2017 20:02:21 GMT",
            "type": "outline"
        },
        {
            "text": "We are all living in 2017 while <a href=\"https://twitter.com/ascaniospread/status/904277827964477440\">this kid</a> is living in 3017.",
            "created": "Tue, 05 Sep 2017 03:08:16 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/ascaniospread/status/904277827964477440"
        },
        {
            "text": "Hey instead of \"taking back\" this or that, how about we get good people in the important jobs and work on making things better.",
            "created": "Mon, 04 Sep 2017 19:34:03 GMT",
            "type": "outline"
        },
        {
            "text": "I stumbled across this <a href=\"http://static.scripting.com/photos/archive/2005/05/22/stormyAtlanticInCrescentBeachFl/original.jpg\">gorgeous picture</a> I took 14 years ago at the <a href=\"https://www.yelp.com/biz/crescent-beach-st-augustine\">beach</a> in Florida. That's one of the reasons I have a blog. So I can leave a memory of this on the web. ",
            "created": "Mon, 04 Sep 2017 16:45:30 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"http://www.politico.com/story/2017/09/03/election-hackers-russia-cyberattack-voting-242266\">Politico</a>: \"The U.S. needs hundreds of millions of dollars to protect future elections from hackers — but neither the states nor Congress is rushing to fill the gap.\" Our president wants to build a physical wall though. ",
            "created": "Mon, 04 Sep 2017 16:24:43 GMT",
            "type": "outline"
        },
        {
            "text": "I really went to town on the <a href=\"https://github.com/scripting/s3BigUpload\">s3BigUpload demo app</a>. Not sure why. Hope someone finds it useful. Post an <a href=\"https://github.com/scripting/s3BigUpload/issues\">issue</a> if you have feedback. ",
            "created": "Mon, 04 Sep 2017 13:30:30 GMT",
            "type": "outline"
        },
        {
            "text": "I worry what will happen when and if NPM or GitHub add business models to the services they provide. I pay GitHub a monthly fee, to help be somewhat sure <a href=\"https://github.com/scripting?tab=repositories\">my repos</a> are not filled with ads or made to comply with some rule I don't support. It's so funny to see the press just begin to tune into the power tech companies have to interfere with our creative work. I've been ringing this bell for a very long time. ",
            "created": "Mon, 04 Sep 2017 13:31:19 GMT",
            "type": "outline"
        },
        {
            "text": "If you want an idea of what can go wrong, read this <a href=\"https://arstechnica.com/information-technology/2016/06/under-new-management-sourceforge-moves-to-put-badness-in-past/\">Ars Technica piece</a> on the downfall of SourceForge, which was GitHub's predecessor. ",
            "created": "Mon, 04 Sep 2017 13:37:40 GMT",
            "type": "outline"
        },
        {
            "text": "It's always something",
            "created": "Mon, 04 Sep 2017 16:44:53 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Here's something I learned the other day. I have this awful pain in both my feet in the heel that happens whenever I walk. That's right when I walk. I thought oh shit this is going to mean surgery for sure. I looked it up on the net. Turns out lots of people get this.",
                    "created": "Mon, 04 Sep 2017 16:44:57 GMT",
                    "image": "http:///scripting.com/images/2017/09/04/peterRojas.png"
                },
                {
                    "text": "They recommend special shoes or orthotics, which means a trip to a bunch of special doctors which is something I totally hate, because they all get their money, and that means tests and all kinds of shit that you know is going to come out false.",
                    "created": "Mon, 04 Sep 2017 16:50:06 GMT"
                },
                {
                    "text": "Anyway, I thought it might have something to do with the way I sat, so I tried to adjust the chair I sit in when I work, and realized as I bent down that I was getting this nice good feeling from the part of my heels that hurt. And the rest of the day, no pain! Turns out I needed to stretch the muscles.",
                    "created": "Mon, 04 Sep 2017 16:49:51 GMT"
                }
            ]
        }
    ]
}