{
    "text": "September 7",
    "created": "Thu, 07 Sep 2017 13:52:31 GMT",
    "name": "07",
    "subs": [
        {
            "text": "Good morning sports fans! :football:",
            "created": "Thu, 07 Sep 2017 13:52:32 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://github.com/scripting/githubpub\">githubpub</a> is a Node app that serves from GitHub repositories.",
            "created": "Thu, 07 Sep 2017 16:20:50 GMT",
            "type": "outline"
        },
        {
            "text": "A <a href=\"https://twitter.com/BrendanEich/status/905677632225763328\">magnificent thread</a> on how JavaScript got its name. Gets me thinking about paths not-taken. Frontier is of course built around a language and a database. I wanted to call the language Juicy, because it was like C, and Doug and I are Jewish. I was voted down. Too colorful I guess. But I <a href=\"http://images.scripting.com/archiveScriptingCom/2009/10/13/17.jpg\">like</a> color in my product names.  ThinkTank was probably my best name, and I didn't even come up with it. Mike Conner, a guy from Apple, in 1982, came up with it. Those were the days. I think Public Folder might be a pretty good name. Although I really love Small Picture. I still have the domain of course. ",
            "created": "Thu, 07 Sep 2017 17:37:36 GMT",
            "type": "outline",
            "image": "http:///scripting.com/images/2017/09/07/frontierBox.png"
        },
        {
            "text": "A funny thing happens when I criticize the <a href=\"http://www.msnbc.com/msnbc-live-ari-melber\">Ari Melber show</a> on Twitter, I sometimes get a response from <a href=\"https://twitter.com/AriMelber\">Ari Melber</a>. I wonder if it's <i>Melber Actual</i> typing. Yesterday he had a bit about an important Trump appointee and the guests were smart and had a lot to say, but they cut that short to do segment on dating in the Age of Trump which I think is ridiculous. BTW, it appears Trump has <a href=\"https://www.bna.com/trump-pick-top-n73014464231/\">appointed</a> <a href=\"https://en.wikipedia.org/wiki/Eric_Dreiband\">someone</a> to run Civil Rights at DOJ who is like his appointment to run the EPA, someone opposed to the idea of civil rights. If there's more to know about this, I want to know it. ",
            "created": "Thu, 07 Sep 2017 14:26:20 GMT",
            "type": "outline"
        },
        {
            "text": "According to <a href=\"http://scripting.com/2005/08/15.html\">this blog</a>, the word <i>podcast</i> was added to the <a href=\"http://www.oed.com/\">OED</a> in August 2005. So if you think the idea of podcasting arrived fully developed in 2015, well the process took a bit longer. :balloon:",
            "created": "Thu, 07 Sep 2017 14:01:57 GMT",
            "type": "outline"
        },
        {
            "text": "Reminder to self: Small fixes on \"Instant Dave\". Strip markup from desktop notifications. Do something to gracefully handle changes to a user's Twitter icon. ",
            "created": "Thu, 07 Sep 2017 13:52:59 GMT",
            "type": "outline"
        },
        {
            "text": "BTW, \"Instant Dave\" is two-way. If you log in, you can <a href=\"http:///scripting.com/images/2017/09/07/instantDaveWhereToPost.png\">post messages</a> to the flow. At this time only I will see your message. Everyone sees my replies. I know it's awkward. But we're just getting started. As I've said before I'd love to see other sites take a similar approach: Instant Axios, or Instant Daring Fireball, as examples. Some blogs and news sites form communities. We all have multiple flows now. This project's goal is to learn about joining the flows and having a platform for communities to grow, outside the silos. So we are not limited by their vision of who we are.  :money_with_wings: ",
            "created": "Thu, 07 Sep 2017 13:53:48 GMT",
            "type": "outline",
            "image": "http:///scripting.com/images/2017/09/07/hillaryClintonActionFigure.png"
        },
        {
            "text": "Rotten Tomatoes is brilliant",
            "created": "Thu, 07 Sep 2017 16:44:18 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Rotten Tomatoes is a brilliant name because you expect nasty reviews. People are attracted to flames. So if you advertise with a flamey title like Rotten Tomatoes, that automatically makes you want to go there. ",
                    "created": "Thu, 07 Sep 2017 16:44:25 GMT"
                },
                {
                    "text": "The best YouTube channel would be person-on-the-street interviews with people who tell you about companies that screwed them. Set up a camera in Times Square or in front of Trump Tower and start recording. Instant hit."
                }
            ]
        }
    ]
}