{
    "text": "September 29",
    "created": "Fri, 29 Sep 2017 13:11:48 GMT",
    "name": "29",
    "subs": [
        {
            "text": "Good morning sports fans!",
            "created": "Fri, 29 Sep 2017 13:11:49 GMT",
            "type": "outline"
        },
        {
            "text": "A 13-minute <a href=\"http://scripting.com/2017/09/29/politics.m4a\">podcast</a> around a simple idea. The campaigns we create every four years should not disappear after the election. They should be built to have lasting value, to continue to serve the interests of the people who contribute, just as the Repubs continue to serve their donors. I'm thinking about the value I buy with my $2000, as if I were giving to a charity. How efficient are they at implementing my political values? I think we can and must do much better. In the podcast it takes a while for me to get going, but if you listen to the end I think you'll get what's driving me. ",
            "created": "Fri, 29 Sep 2017 16:18:32 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2017/09/29/politics.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "6789809"
        },
        {
            "text": "Wondering what other countries are preparing relief missions to Puerto Rico, and how Trump would react. ",
            "created": "Sat, 30 Sep 2017 02:47:32 GMT",
            "type": "outline"
        },
        {
            "text": "When designing a promotional website, ask yourself this question. What would a visitor want to know. And then make sure the questions are answered on the home page of the site, near the top, in plain language. For example, if you're hosting an event, the basic info is -- 1. Where. 2. When. 3. How much. 4. What is it for. 5. Who should go. So often none of that information is anywhere in sight, even one click off the home page. Who designs these sites? They often look nice. I think people forget to do this because they already know all that, and they're thinking how to wow you and excite you. It's 2017, soon to be 2018. Websites aren't exciting anymore. Just the facts ma'am.",
            "created": "Fri, 29 Sep 2017 21:54:37 GMT",
            "type": "outline",
            "image": "http:///scripting.com/images/2017/09/29/dragnet.png"
        },
        {
            "text": "Tom Price <a href=\"https://twitter.com/davewiner/status/913882058417729541\">resigns</a> as Health and Human Services secretary.",
            "created": "Fri, 29 Sep 2017 21:46:42 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/913882058417729541"
        },
        {
            "text": "Changed my Twitter name to <i>140-char Dave,</i> to make clear you're getting the abbreviated version of me. Of course full-fidelity high-def Dave comes to you via blog, at <a href=\"http://scripting.com/\">scripting.com</a>. ",
            "created": "Fri, 29 Sep 2017 16:13:46 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/913798899420336128"
        },
        {
            "text": "A proactive idea: Every company can agree with the idea that black lives matter. It's time for them to say they do.",
            "created": "Fri, 29 Sep 2017 16:12:09 GMT",
            "type": "outline"
        },
        {
            "text": "I changed the <i>Updated</i> message on the home page.  There's no room for it on phone and tablet-size screens, so I disabled it there. And I changed it from displaying the time of the last update to the amount of time since the last update. Here's a <a href=\"http:///scripting.com/images/2017/09/29/lastUpdateScreenShot.png\">screen shot</a> to illustrate. ",
            "created": "Fri, 29 Sep 2017 13:12:10 GMT",
            "type": "outline"
        },
        {
            "text": "It's not just Trump who's a narcissist, our culture is built on it. Break its grip. Work with someone today expecting nothing in return.",
            "created": "Fri, 29 Sep 2017 13:18:47 GMT",
            "type": "outline"
        },
        {
            "text": "Yesterday I gave in and subscribed to the Washington Post. ",
            "created": "Fri, 29 Sep 2017 13:54:04 GMT",
            "type": "tweet",
            "tweetId": "913764027192561665",
            "tweetUserName": "davewiner"
        },
        {
            "text": "Something to think about. If the Trump Administration would form a <a href=\"http://www.truth-out.org/news/item/42094-calling-out-the-kobach-commission-for-what-it-is\">commission</a> to screw with elections, how far behind could Chinese-like net censorship be? All the railing about fake news, and how Facebook is rigged against Trump and the stories about how Russia used Facebook to steal the election. It's coming. No doubt Facebook already has the software implemented and ready to go. ",
            "created": "Fri, 29 Sep 2017 13:56:35 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/05/29/wonderWoman.png"
        },
        {
            "text": "Over on FB, sorry <a href=\"http://scripting.com/2017/05/31.html#a110526\">no link</a>, a friend posted a picture of a gorgeous autumn morning scene in New England. He wrote \"It is a heartbreakingly beautiful fall morning.\" I wrote in a comment:  I often wish it were possible to annotate a FB post with a comment to myself that no one else sees. Often someone else's message is a perfect place to make a note. Like in this case -- Why is it heartbreaking? I'm guessing for this reason -- because it's something you're going to miss when life is over. Or something you'd like to share with someone who's no longer here. Or something you <i>did</i> share with someone who's no longer here. In any case, this is just a note to myself. ;-)",
            "created": "Fri, 29 Sep 2017 14:47:05 GMT",
            "type": "outline"
        }
    ]
}