{
    "created": "2025-06-03T04:00:00.000Z",
    "flInCalendar": true,
    "name": "03",
    "path": "2025/06/03",
    "text": "June 03",
    "type": "calendarDay",
    "subs": [
        {
            "text": "On today's Bill Simmons <a href=\"https://podcasts.apple.com/us/podcast/indianas-incredible-finals-run-a-knicks-summer/id1043699613?i=1000710778336\">podcast</a>, their Knicks expert, <a href=\"https://www.theringer.com/creator/van-lathan\">Van Lathan</a> <a href=\"https://youtu.be/9zHiCEhK7K8?si=IgvQiNKtzDPXenXW&t=2531\">said</a> \"I would under-react but they're going to over-react.\" I heard that about an hour before the Knicks fired their coach. I don't think it's good or bad, it could work out great. No one knows if this was The Season the Knicks were meant to go to the Finals, but if it was, maybe next year will be too? There's no right answer. Maybe this was Dolan's call. I hope not. ",
            "created": "Tue, 03 Jun 2025 21:12:55 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "\"Courtesy\" calls from insurance companies aren't.",
            "created": "Tue, 03 Jun 2025 20:48:36 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "If you followed the Knicks through the playoffs as I did, I recommend the latest <a href=\"https://podcasts.apple.com/us/podcast/indianas-incredible-finals-run-a-knicks-summer/id1043699613?i=1000710778336\">episode</a> of the Bill Simmons podcast. It began with talk about the fan base and that got me thinking. We don't know what would happen if the Knicks were in the Finals. Honestly. It could be the antidote to the crazyness. Maybe the reason things are so fucked up is that it's been 52 freaking years since the Knicks won the title. Something happens every so often, the energy field around the Knicks shifts -- Patrick Ewing, Melo, Linsanity and now Brunson. It'd be interesting to map that out against events in the world at the corresponding times. We won't find out this year. In the same way I sensed that New Orleans was doomed when I went to school there, I have a strong feeling connecting the Knicks to something not sure what, but it feels big. ",
            "created": "Tue, 03 Jun 2025 16:41:31 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Jeremy Herve of Automattic <a href=\"https://mastodon.social/@jeremy@herve.bzh/114618613561154574\">responded</a> to yesterday's <a href=\"http://scripting.com/2025/06/02/131444.html\">suggestion</a> about when to set the og:image metadata in a page. His response is persuasive, but there may be a way to work around it. And a hat-tip to Jeremy, he's helped us so many times getting \"WordLand\" ready to market. When you're fitting a product to another <a href=\"http://scripting.com/2024/10/21/155259.html\">product</a> as a platform, it's so important to get help from the vendor, and usually you don't get much of that. Thanks! :smile:",
            "created": "Tue, 03 Jun 2025 12:54:51 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2017/05/26/cat.png",
            "flInCalendar": true
        }
    ]
}