{
    "created": "2025-06-09T04:00:00.000Z",
    "flInCalendar": true,
    "name": "09",
    "path": "2025/06/09",
    "text": "June 09",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I use ChatGPT for all kinds of work problems, and for a lot of other stuff too. It can collaborate, and it has much more broad and deep knowledge than I do, than any human. No one knows whether it thinks or is self-aware, any more than we know whether humans think or are self-aware. For that reason, I think, ironically, there's no point discussing it, we'll never get an answer, because we have no idea what intelligence or thinking is. But it is every bit as thoughtful as any human I have ever worked with. And the whole business about pattern-recognition is imho bs. People who say that are just repeating what they heard from someone else. From a user standpoint, it's absolutely nothing like pattern recognition.",
            "created": "Mon, 09 Jun 2025 18:24:45 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2020/05/28/openThePodBayDoorsHal.png",
            "flInCalendar": true
        },
        {
            "text": "Idea for teachers. Allow students to use ChatGPT to write their papers, as long as they submit a log showing how they did it. Maybe they're getting help with writing, but the ideas are theirs? It might be possible to fake that part too, but for now, that's probably a bit too hard.  ",
            "created": "Mon, 09 Jun 2025 22:47:29 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I went to the <a href=\"https://daytona.scripting.com/search?q=dnc\">DNC</a> in 2004 and 2008. Both times I heard from friends later that TV had been focused on riots, which confused the hell out of me, because I didn't see anything. There was some obnoxious stuff at the 2008 convention in Denver, we had to walk a gauntlet of ugly pictures of dead fetuses going in and out of the convention center. But in neither case were there <i>any</i> disturbances. ",
            "created": "Mon, 09 Jun 2025 14:18:36 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The game of being rich",
            "created": "Mon, 09 Jun 2025 13:15:23 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Some random thoughts about wealth.",
                    "created": "Mon, 09 Jun 2025 13:21:05 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Suppose you're an average middle-class person who works for a tech company when the company is bought out for a huge amount of money and your stock is now worth $10 million. It's liquid today. You just received a check for $10 million. What do you do? ",
                    "created": "Mon, 09 Jun 2025 12:57:56 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Answer: You buy things to see if there was a reason to make the money, and it turns out there really wasn't. You would have been just as happy in the big house in the rich neighborhood or the smaller house in a more modest area. ",
                    "created": "Mon, 09 Jun 2025 13:21:34 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Then what if you reach another level, now you have a check in your hand for $100 million, then $1 billion, then $25 billion and keep going. It doesn't stop there. At each level you are compelled to find something fantastic that you can use that money for. Some power that the new level of wealth gets you. ",
                    "created": "Mon, 09 Jun 2025 13:19:49 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "We saw in <a href=\"https://daytona.scripting.com/search?q=succession\">Succession</a>, they played out the lunacy, the people use a lot of space, but they're still just people. If they loved someone or someone loved them, they'd be much happier than all the happiness all that money ever gave them. ",
                    "created": "Mon, 09 Jun 2025 13:20:20 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Having such large useless amounts of money is a not only a problem for the rich folk, we've found out, it's a problem for everyone else too, because eventually they get around to buying political power and they start using the money to change other people lives, always for the worse, it seems. ",
                    "created": "Mon, 09 Jun 2025 13:20:12 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "We need a new game that only super rich people can play that doesn't hurt the rest of us. I'm not advising anyone to do anything. But I think this is what I've been writing about on my blog since the beginning. ",
                    "created": "Mon, 09 Jun 2025 13:15:19 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I didn't understand why, for example, Evan Williams didn't just make technology and give it away, after having made billions from Twitter. ",
                    "created": "Mon, 09 Jun 2025 13:16:39 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Why did Bill Gates have to accumulate so much money and threaten the independence of the open web, a miracle, to get it? Why not use your power to make miracles <i>before</i> you retire, start doing the good you were promising to do later, right now? What good, in hindsight, did the extra billions do for anyone, including Gates? When his power was at his peak, in the 90s, he could have done a much bigger thing for the world, give us a free new level of communication that would be available equally to everyone. ",
                    "created": "Mon, 09 Jun 2025 13:16:46 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Elon Musk, having done some incredible things in computers, finance, cars and space, had to invent new challenges that only his wealth can buy, and eventually came up with things that only the US Treasury could buy, and some things like relocating the human species on Mars, that no amount of money can buy (or so scientists say). He needs to receive an award of love and gratitude for not using his wealth to make everyone else totally miserable (including himself, it seems).",
                    "created": "Mon, 09 Jun 2025 13:17:30 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PS: I haven't yet read <a href=\"https://daytona.scripting.com/search?q=%22evan%20osnos%22\">Evan Osnos'</a> new <a href=\"https://www.amazon.com/Haves-Have-Yachts-Dispatches-Ultrarich/dp/1668204487\">book</a> about billionaires, but I want to. He's done some great reporting in the past. ",
                    "created": "Mon, 09 Jun 2025 13:00:13 GMT",
                    "type": "outline",
                    "flInCalendar": true
                },
                {
                    "text": "PPS: See also: <a href=\"http://scripting.com/davenet/2000/10/19/transcendentalMoney.html\">Transcendental Money</a>, or money that replenishes itself, ie money that transcends time. ",
                    "created": "Mon, 09 Jun 2025 18:32:34 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PPPS: Another one: <a href=\"http://scripting.com/2016/05/31/1296.html\">Your human-size life</a>. ",
                    "created": "Mon, 09 Jun 2025 18:34:05 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PPPPS: Ted Turner <a href=\"http://www.quoteswise.com/ted-turner-quotes-2.html\">said</a> \"I bet you’re all wondering what it feels like to be a billionaire. It’s disappointing really. I’ve learned that great wealth isn’t nearly as good as average sex.\"",
                    "created": "Tue, 10 Jun 2025 02:06:16 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}