{
    "text": "We need to be organized",
    "created": "Sun, 20 May 2018 18:25:45 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Once you give up on the idea that the solution to our problems will ever show up in the news, it leads to new observations. ",
            "created": "Sun, 20 May 2018 18:32:01 GMT",
            "image": "http://scripting.com/images/2018/05/20/uncleSam.png"
        },
        {
            "text": "Like this. The opposition, basically American <a href=\"https://en.wikipedia.org/wiki/Oligarchy\">oligarchs</a>, who thanks to Citizens United have been able to buy enough of the government to dismantle our democracy, is somewhat organized. The rest of us, who, combined, have huge economic power if we could just organize ourselves, are without leadership. Waiting for something unspecified to happen. ",
            "created": "Sun, 20 May 2018 18:34:10 GMT"
        },
        {
            "text": "The best the Democrats can do is <a href=\"https://en.wikipedia.org/wiki/Tom_Perez\">Tom Perez</a>. He has zero charisma, no ideas, not even slightly bold. I listen to him, but it's painful.",
            "created": "Sun, 20 May 2018 18:34:04 GMT"
        },
        {
            "text": "Our problem isn't knowing <a href=\"http://scripting.com/2018/05/08/194430.html\">what we stand for</a>, we know. We need to organize our power to balance that of the oligarchs. The fact that we can't get organized is not an accident. The owners of the media are oligarchs too.",
            "created": "Sun, 20 May 2018 18:35:29 GMT"
        },
        {
            "text": "Start by looking to people who have done amazing jobs of organizing in the past. I would start with civil rights leaders. Union leaders. The Parkland kids. Teachers. Find people who can speak and write passionately. ",
            "created": "Sun, 20 May 2018 18:35:37 GMT"
        },
        {
            "text": "It's not enough to win elections, we have to elect powerful leadership to oppose the already organized and powerful leadership on the other side. ",
            "created": "Sun, 20 May 2018 18:37:09 GMT"
        }
    ]
}