{
    "text": "Another view of me via ChatGPT",
    "created": "Mon, 21 Apr 2025 12:12:02 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "People who look down their noses at ChatGPT and its cousins tend to say it's not art. Hardly the most interesting thing, but as I've <a href=\"http://scripting.com/2025/03/28/124753.html\">written</a>, art lives mostly in the mind of the viewer, it's the effect it has on the viewer -- that imho is the art. BTW I can tell when people have actually used the product, and most of the critics haven't. Sorry but until you use it you won't know how obvious that is to someone who does.",
            "created": "Mon, 21 Apr 2025 12:01:45 GMT",
            "flInCalendar": true
        },
        {
            "text": "Lately I've been interested in using ChatGPT to mash images together. <a href=\"http://scripting.com/2025/04/20/200843.html\">Yesterday</a> I asked for a rendering of my headshot through a self-portrait of my niece. It's like <a href=\"https://en.wikipedia.org/wiki/Sampling_(music)\">sampling</a> with music but with images. I say here's a photo of me, and here's a drawing someone else did. Can you render the image of me in that style? As I did <a href=\"http://scripting.com/2025/04/20/200843.html\">yesterday</a> with my niece's portrait of herself. ",
            "created": "Mon, 21 Apr 2025 12:22:19 GMT",
            "flInCalendar": true
        },
        {
            "text": "I've also been doing stories that started with an image of Mark Zuckerberg, calling him \"my programmer friend\" and taking him through all kinds of adventures, none of which could shake his depression. It was like the <a href=\"https://daytona.scripting.com/search?q=wordle%20kitty\">Wordle Kitty</a> from last year, only these only went out via Facebook. I wish I had them in an easily shareable format, but next time I may start a group for them, or something else. ",
            "created": "Mon, 21 Apr 2025 22:21:07 GMT",
            "flInCalendar": true
        },
        {
            "text": "Today I came across a cartoon of <a href=\"https://en.wikipedia.org/wiki/Pete_Hegseth\">Pete Hegseth</a>, the US Secretary of Defense drawn by <a href=\"https://www.deadder.net/home\">Michael de Adder</a>. I thought wow that's different. I wonder what ChatGPT would do if I asked it to render my headshot in the style of that drawing? While it was doing the work, I tried to imagine what it would do with it! Would I be wearing a military uniform? Would I salute the viewer? Would it change my expression? Here's the drawing, and below it, the rendering.",
            "created": "Mon, 21 Apr 2025 12:12:08 GMT",
            "flInCalendar": true
        },
        {
            "text": "Hegseth as drawn by de Adder.",
            "created": "Mon, 21 Apr 2025 12:17:15 GMT",
            "inlineImage": "https://s3.amazonaws.com/scripting.com/images/2025/04/21/hegseth.png",
            "flInCalendar": true
        },
        {
            "text": "My headshot rendered in the style of the Hegseth drawing.",
            "created": "Mon, 21 Apr 2025 12:13:33 GMT",
            "inlineImage": "https://s3.amazonaws.com/scripting.com/images/2025/04/21/winer.png",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}