{
    "text": "Don't try to change the world",
    "created": "Mon, 21 Apr 2025 14:10:55 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Silicon Valley encourages entrepreneurs to think in terms of changing the world. I was one of them when I arrived there in 1979 at the age of 24, with world-changing software ready to go (or so I thought). A few years later, I shipped a way of writing that was only possible on a computer, and in a small way I suppose it did change the world. I kept innovating, but over time I came to realize that one person trying to change the world is usually futile, but what's even worse, you might actually manage to change the world, and that's going to be a disaster for you and the world. As Elon Musk is doing right now. ",
            "created": "Mon, 21 Apr 2025 14:03:20 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Musk is the perfect cautionary tale for \"be careful of what you wish for.\" No one person should change the world. We are a creation of evolution, and we also are creators of evolution, but evolution is the result of lots of infinitesmal events, not some great god-like creation that young people tend to dream of. That's what he's doing wrong, trying to force his vision on all of the rest of us. We'd be crazy to wish for what he wants, and we're not that crazy. ",
            "created": "Mon, 21 Apr 2025 14:12:23 GMT",
            "flInCalendar": true
        },
        {
            "text": "I have a pretty good idea of what he wants because like him, I think in terms of what you can do with networks of computers and people. And I understand their weakness, and also believe in the good intentions of 99.99% of the people, so even though our networks are not perfectly secure somehow we seem to get by. But Musk has gotten inside, and is doing what he wants, and the rest of us don't get a say, and he's of the 0.01% you absolutely <i>don't</i> want to have the keys to the treasury or nukes of the United States in 2025. ",
            "created": "Mon, 21 Apr 2025 14:13:27 GMT",
            "flInCalendar": true
        },
        {
            "text": "A lot of wise people over a few hundred years set up a system where we all get a say, and it's gotten us by pretty well. When one person takes control, that's disaster, because no one, not even Musk, is an immortal god. He's got huge blind spots. If you try to rewrite every bit of code too fast you end up with a broken system. He'll leave and we'll have to deal with what remains. And hopefully after we get over that, we'll figure out how to not let a future Musk get in there again. And that's going to involve a fair amount of pain for the billionaires. If you all want to start helping to solve the problem, now would be a good time to get involved, Mr and Ms Billionaire. Thanks for listening. ",
            "created": "Mon, 21 Apr 2025 14:14:04 GMT",
            "flInCalendar": true
        },
        {
            "text": "BTW, I've <a href=\"http://scripting.com/2023/09/03/201849.html\">mentioned</a> this <a href=\"http://scripting.com/2022/12/13.html#a141000\">before</a> -- there's a <a href=\"https://clip.cafe/sleeper-1973/what-happened-everybody/\">great joke</a> in the Woody Allen movie Sleeper. It was about Albert Shanker playing the role of Elon Musk, who wasn't born when the movie came out.",
            "created": "Mon, 21 Apr 2025 14:15:16 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}