{
    "text": "Joe Biden's failure",
    "created": "Fri, 01 Jul 2022 17:40:50 GMT",
    "type": "outline",
    "description": "They had 58 days to stop the attack.",
    "metaImage": "http://scripting.com/images/2022/07/01/pearlHarbor.png",
    "subs": [
        {
            "text": "Here's what <a href=\"https://twitter.com/JoeBiden/status/1521551422931845123\">Joe Biden said</a> in a tweet on May 3, the day after the Dobbs decision leaked in advance of it's release this week.",
            "created": "Fri, 01 Jul 2022 17:41:01 GMT",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "<i>We will be ready when any ruling is issued.</i>",
                    "created": "Fri, 01 Jul 2022 17:41:51 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "They had 58 days to stop the attack. To have a powow with the court, and ask if they really planned to issue such a decision and when they said yes, shut it down before they had the chance to make it official. ",
            "created": "Fri, 01 Jul 2022 17:42:11 GMT",
            "flInCalendar": true
        },
        {
            "text": "You don't react to an attack on Pearl Harbor. If you know it's coming, you stop it.",
            "created": "Fri, 01 Jul 2022 17:49:04 GMT",
            "flInCalendar": true
        },
        {
            "text": "Look what happened instead. They got to announce that ruling and a half-dozen others, all that are head shots to American democracy. Now Biden, as president, is occupying an office with no power.",
            "created": "Fri, 01 Jul 2022 17:42:50 GMT",
            "flInCalendar": true
        },
        {
            "text": "The Democrats, <a href=\"https://twitter.com/davewiner/status/1543051727569657861\">Obama</a>, Clinton and now Biden have stood by and watched while the Repubs went deeper and deeper, cutting every artery of our system, and they still act as if this all is business as usual. Could they be that stupid or cowardly or are they just actors. My guess is that we're the ones who have been duped, and after all they are just actors and know exactly what they're doing.",
            "created": "Fri, 01 Jul 2022 17:44:02 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}