{
    "text": "Instant tech bootcamps for journalism",
    "created": "Sun, 14 Apr 2019 16:36:55 GMT",
    "type": "outline",
    "description": "It is possible to understand the basics of an email server, for example, in a couple of hours, even if you only have a user's understanding of email technology. ",
    "subs": [
        {
            "text": "This idea came up in Austin and was well-received. When journalism discovers a tech issue that appears to be a scandal, I proposed there should be a quickly convened flash conference, hosted by a university journalism department in conjunction with its computer science department. A two-evening bootcamp for journalists in New York, where the tech behind the scandal is examined dispassionately and objectively, by computer scientists who speak the language of journalism. A \"poets\" course. It is possible to understand the basics of an email server, for example, in a couple of hours, even if you only have a user's understanding of email technology. In the second evening, a smaller group convenes with journalists and techies, to write a concise backgrounder on the tech, and it is published, quickly. The organization that does this would be something like Politifact, but rather than fact-checking a single story, it's providing the necessary background for all reporters, so the delay in getting seriously factual reports on the problem is minimized. It would also likely quickly evolve, and set a baseline for the kind of information every news org should publish along with a story about tech malfeasance. ",
            "created": "Sun, 14 Apr 2019 16:44:57 GMT",
            "image": "http://scripting.com/images/2019/04/14/cartoon.png"
        },
        {
            "text": "The reason this is needed is that our political system has (imho) overreacted to sensational stories, such as Hillary's emails, or misunderstood the extent of Facebook's API. And also completely missed looming crises, failing to catch them in time for them to be prevented. It seems journalism should aspire to do this as well.",
            "created": "Sun, 14 Apr 2019 16:43:02 GMT"
        }
    ]
}