{
    "text": "Morning Coffee Notes",
    "created": "Sat, 04 Apr 2020 14:41:31 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "A bunch of things to write about today. Rolling up my sleeve.",
            "created": "Sat, 04 Apr 2020 14:41:49 GMT"
        },
        {
            "text": "In the old days of blogging I had subscribed to <a href=\"https://val.demar.in/\">Paolo Valdemarin's blog</a>. Then Paolo must've gotten busy, being an entrepreneur in Italy, and now a VC in London. Then once they had the lockdown in the UK, he started blogging again. My RSS aggregator, which had been checking his feed every fifteen minutes during his decade-long hiatus, sprung to life. The lights came on. Paolo is a much better writer than I remembered. His blog flows, his stories are human, his observations are easy to relate to. Silver linings everywhere. ",
            "created": "Sat, 04 Apr 2020 14:41:51 GMT",
            "image": "http://scripting.com/images/2020/04/04/hamster.png"
        },
        {
            "text": "Same with <a href=\"https://www.theguardian.com/profile/johnnaughton\">John Naughton</a>, though he never stopped writing. He's a columnist at the Guardian, also from the UK, a great thinker and observer. His blog is now published every morning (my timezone) <a href=\"https://johnnaughton.substack.com/\">via Substack</a>. I looked at using Substack before writing <a href=\"http://scripting.com/email/\">my own software</a>. I didn't like that I would have to manually transcribe my posts from my CMS to theirs to get them to publish it. It's 2020 for crying out loud. Support the standards. Or maybe they want their users locked in? I can't tell you how many times I've had to reimplement the entire functionality of a product to avoid having to manually transpose my writing or avoid lock-in. It's a VC way of thinking and not observant of the fundamental law of the web, <a href=\"http://scripting.com/2005/12/12.html#howToMakeMoneyOnTheInternetVersion3\">people come back to places that send them away</a>. Trust your users. If you have the best product, they'll continue to use it and sing your praises. If you don't, they'll bolt at the first opportunity.",
            "created": "Sat, 04 Apr 2020 14:47:06 GMT"
        },
        {
            "text": "Naughton also wrote about <a href=\"https://privatekit.mit.edu/\">Private Kit</a>, though I can't find the reference now. It's a brilliant idea. An app for iOS or Android that tracks your whereabouts, but doesn't share the data with anyone but you. The info never leaves your phone without your permission. It offers new opportunities for resarchers studying among other things the migration of pandemic viruses through the population. This is the future, and a very nice way to spin it, MIT. Keep up the good work. ",
            "created": "Sat, 04 Apr 2020 15:00:16 GMT"
        }
    ]
}