{
    "text": "The parent and child, in crisis",
    "created": "Sat, 04 Apr 2020 15:46:42 GMT",
    "type": "outline",
    "description": "I'm lying in bed at 10AM. I don't want to get up. The parent's voice says, Dave, it's time to get up. I don't want to, I don't want to.",
    "subs": [
        {
            "text": "We're all depressed. I heard this explained well <a href=\"https://twitter.com/laurenthehough/status/1246318803077804033\">on Twitter</a> last night. Our brain tries to understand the predicament. Not the intellectual brain, the instinctive one. The subconscious. The child. The one that decides in an instant to fight or flight. The one that keeps your organs functioning, oversees the immune system's response to an invader. It's very powerful, but its vision is limited to the input coming in through your senses. It's not very well wired up to your conscious self, the intellect. Something is threatening you, it can detect that, but it doesn't understand what it is. So it makes you numb while it tries to figure it out. But it never can. So you feel depressed. ",
            "created": "Sat, 04 Apr 2020 15:46:57 GMT",
            "image": "http://scripting.com/images/2020/04/04/parentAndChild.png"
        },
        {
            "text": "We're all in this place. Yet somehow we manage to do things. To take care. Clean, feed, nurture ourselves. To find distractions. We create moments where we feel well. I've watched myself do this, and see myself doing something I learned in various workshops and classes I participated in, in my 30s and 40s. It involves another duality inside of all of us, the dependent child and the nurturing parent. I literally give voice to the parent. Let it speak, out loud, to the child.  ",
            "created": "Sat, 04 Apr 2020 15:44:47 GMT"
        },
        {
            "text": "I'm lying in bed at 10AM. I don't want to get up. The parent's voice says, Dave, it's time to get up. I don't want to, I don't want to. The parent holds my hand, and says don't worry, I've got this. I'll give you something good to eat, something delicious and filling. Then we'll play a game, and go for a walk, and the list goes on. Things my inner child likes. It doesn't matter so much that he likes these things, but that the patient, loving voice <i>knows</i> he likes these things and will give them to him. Someone has taken charge, and the scared little boy feels loved, guarded, cherished. ",
            "created": "Sat, 04 Apr 2020 15:48:49 GMT"
        },
        {
            "text": "That's why we like listening to Gov Cuomo, and can't stand listening to Trump. The former says I've got this. I'll get us through this. You can depend on me. The latter says I'm going to fuck things up even worse than they are. The former helps us get out of bed and face the world, the latter makes us want to pull the covers over our head and pretend we're in another place and time.",
            "created": "Sat, 04 Apr 2020 15:51:10 GMT"
        },
        {
            "text": "As adults, all of us have an inner parent we can call on, if we remember to do it. A leader like Cuomo helps us access our strength and determination, helps calm the fears of the child. We may not know the answers, but we will find them, together. ",
            "created": "Sat, 04 Apr 2020 15:53:10 GMT"
        }
    ]
}