{
    "text": "AI deflates the value of expertise",
    "created": "Thu, 03 Oct 2024 15:27:57 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I didn't read the WSJ story about the deflation of expertise, quoting <a href=\"https://en.wikipedia.org/wiki/Vinod_Khosla\">Vinod Khosla</a>, Silicon Valley venture capitalist, who I know from my time in California. He says AI leads to a deflation of expertise. I agree with him, AI absolutely deflates the value of expertise. ",
            "created": "Thu, 03 Oct 2024 15:28:05 GMT",
            "flInCalendar": true
        },
        {
            "text": "It aggregates all of our knowledge in one place where it's easy to access, about anything you want to know. It answers questions that you can't get any other way. ",
            "created": "Thu, 03 Oct 2024 15:34:45 GMT",
            "flInCalendar": true
        },
        {
            "text": "Some technological developments are profound. We never understand all the implications of a new technology when it comes online, but you do get some strong clues. You have to use it to know learn how to think about it. That's not unreasonable because we all grew up in a world that didn't have this technology, as my parents grew up in a world without television, and I didn't use a computer until I was 18 or use the web until I was 37. None of us grew up with anything but fiction about AI, and the fiction imho didn't grasp the implications very well.  ",
            "created": "Thu, 03 Oct 2024 15:35:02 GMT",
            "flInCalendar": true
        },
        {
            "text": "If I ask good questions ChatGPT stretches my mind in ways it never has been stretched before and I'm well educated and in my work have explored frontiers of knowledge, even so -- this is the most mind-stretching experience I've ever had. Not kidding. And I'm not a VC or prone to overhyping tech.\n",
            "created": "Thu, 03 Oct 2024 15:32:47 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}