{
    "text": "Fallout from the new watch",
    "created": "Mon, 05 Nov 2018 20:25:26 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "<i>Note: I wrote this narrative, then stumbled across a fix, at the end. </i>",
            "created": "Mon, 05 Nov 2018 20:33:01 GMT"
        },
        {
            "text": "I bought a new Apple Watch. So far it's just like the old one. I bought it for the health features. If it can give me a realtime EKG, that alone is worth the price. Heart rate, etc, all good stuff.",
            "created": "Mon, 05 Nov 2018 20:25:31 GMT",
            "image": "http://scripting.com/2016/03/25/oldhat.png"
        },
        {
            "text": "But I had to update my iPhone to get it to talk to the new watch. And as usual the problems cascade from there. First my phone says I also need a new version of the Watch app. OK. Then the Watch app, first thing it wants to do is update the old watch. Nothing can convince it not to do this. Only other choice is to reset to factory defaults. It gets half-way through, and says oops you have to charge it up to 50 percent or no-go. Okay that takes about an hour. And that's far from the end of the story.",
            "created": "Mon, 05 Nov 2018 20:26:08 GMT"
        },
        {
            "text": "Now completely separate from the Watch and its software, most of the apps on my iPhone are gone. Ones I built the use of the phone around. <i>This kind of shit always happens with Apple updates. </i>",
            "created": "Mon, 05 Nov 2018 20:27:54 GMT"
        },
        {
            "text": "Get this. The apps are there. If I search it finds them. They just aren't on the desktop. I had about 5 pages of apps before the update. Now I have two pages and there's only one app on the second page. All kinds of apps are missing from the desktop. Apple apps. BigCo apps (Facebook, Twitter). Apps for managing various brands of headphones I have. ",
            "created": "Mon, 05 Nov 2018 20:28:36 GMT"
        },
        {
            "text": "And then I stumbled across a fix. I deleted one of the apps, and the rest came back. ",
            "created": "Mon, 05 Nov 2018 20:31:47 GMT"
        }
    ]
}