{
    "text": "The Democratic platform",
    "created": "Wed, 29 Aug 2018 13:26:34 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "One word: Oversight. ",
            "created": "Wed, 29 Aug 2018 13:26:39 GMT"
        },
        {
            "text": "Details",
            "created": "Wed, 29 Aug 2018 13:27:01 GMT",
            "subs": [
                {
                    "text": "The courts are doing their job, as are the juries (so far).",
                    "created": "Wed, 29 Aug 2018 13:27:09 GMT"
                },
                {
                    "text": "The DOJ is doing their job.",
                    "created": "Wed, 29 Aug 2018 13:28:19 GMT"
                },
                {
                    "text": "Journalism is doing the best they can, given that Mueller doesn't leak and Congress doesn't do oversight. ",
                    "created": "Wed, 29 Aug 2018 13:27:18 GMT"
                },
                {
                    "text": "There are lots of questions about the president's behavior. Perhaps his most vocal supporters won't agree, but most Americans support the Mueller investigation, and that includes Republicans. ",
                    "created": "Wed, 29 Aug 2018 13:27:26 GMT"
                },
                {
                    "text": "Every branch of government is working, except one. Congress.  ",
                    "created": "Wed, 29 Aug 2018 13:30:48 GMT"
                },
                {
                    "text": "No Congressional oversight. ",
                    "created": "Wed, 29 Aug 2018 13:43:02 GMT"
                },
                {
                    "text": "There's a way to fix that. ",
                    "created": "Wed, 29 Aug 2018 13:43:08 GMT"
                },
                {
                    "text": "Elect Democrats to Congress.",
                    "created": "Wed, 29 Aug 2018 13:43:13 GMT"
                }
            ]
        },
        {
            "text": "Impeachment is a distraction",
            "created": "Wed, 29 Aug 2018 13:32:14 GMT",
            "subs": [
                {
                    "text": "All that impeachment means is the president is indicted. Then he has to be tried and convicted before he is removed. Impeachment is easy, and relatively meaningless.",
                    "created": "Wed, 29 Aug 2018 13:43:36 GMT"
                },
                {
                    "text": "Unless the Senate votes by a 2/3 majority to convict, nothing happens. It won't matter to Trump. It'll just give him a way of dominating discourse for another six months, and in the end he will still be president. ",
                    "created": "Wed, 29 Aug 2018 13:44:07 GMT"
                },
                {
                    "text": "Unless the people overwhelmingly want him removed, then he will be removed. And we aren't there now, so there's no point impeaching. So take it off the table. We have more important work to do. ",
                    "created": "Wed, 29 Aug 2018 13:45:03 GMT"
                },
                {
                    "text": "If you look at how things are set up in the Constitution, and our experience with removing a president from office, you must have overwhelming support from the people in order for it to happen. Impeachment wihtout removal is only symbolic. Republicans have to fear they will not get re-elected with Trump as president. 2/3 of the Senate has to vote to remove. That will include a lot of senators from Republican states. So at this point, removal is an impossible dream. It can't happen until thej people want it to happen.",
                    "created": "Wed, 29 Aug 2018 13:32:20 GMT"
                }
            ]
        },
        {
            "text": "The Democratic platform",
            "created": "Wed, 29 Aug 2018 13:34:21 GMT",
            "subs": [
                {
                    "text": "Elect a majority in either house and the Democrats will provide the missing oversight.",
                    "created": "Wed, 29 Aug 2018 13:34:27 GMT"
                }
            ]
        }
    ]
}