{
    "text": "Takeaways from Iowa",
    "created": "Tue, 04 Feb 2020 15:06:18 GMT",
    "type": "outline",
    "isComment": "false",
    "description": "Tech, news and politics are inseparable from now on. We need to do a lot better.",
    "subs": [
        {
            "text": "Lots of takeaways from last night's meltdown of the vote-counting system in Iowa. ",
            "created": "Tue, 04 Feb 2020 14:38:13 GMT",
            "flNumberedSubs": "true",
            "subs": [
                {
                    "text": "Do not depend on your online systems. You must have a backup system that's tested as well as the primary system.",
                    "created": "Tue, 04 Feb 2020 15:08:07 GMT"
                },
                {
                    "text": "There was another probably more important story last night, where real news had been made during the day. The obsession of the previous week -- impeachment. Since you didn't have anything going on in Iowa, why not provide coverage of what happened in Congress during the day when no one was watching. Might have had a positive impact for the country. ",
                    "created": "Tue, 04 Feb 2020 14:43:16 GMT",
                    "type": "outline"
                },
                {
                    "text": "On MSNBC there was a party atmosphere. As if finally we don't have to talk about doom and gloom, for a few minutes we can go back to the naivete of the 2016 election when we could laugh about Trump. Or who knows what they thought was so funny. The news, which ostensibly is their business, is as funny as a heart attack during a nuclear holocaust. Having a party on TV now would be like laughing as the world was mourning Kobe Bryant. Look, CNN and MSNBC should be news rooms. If you don't know what that means, either get out of the way, or learn. Your job is to always be asking yourself Is This Actually News? Last night they had nothing. And they acted like idiots. ",
                    "created": "Tue, 04 Feb 2020 14:44:55 GMT",
                    "type": "outline",
                    "image": "http://scripting.com/images/2020/02/04/espresso.png"
                },
                {
                    "text": "At one point Chris Hayes commented you know it's fun to actually not view voters in the aggregate. Yes Chris, we think, we have ideas, we see things you'll never see, and you could stop and figure out what's important about your new realization. That there are way more of us than you, and we're the real power in the country, not the politicians you fawn over, and the other journalists of course.",
                    "created": "Tue, 04 Feb 2020 14:47:31 GMT",
                    "type": "outline"
                },
                {
                    "text": "I've said this many times. If you want to help yourselves and the country, move your newsroom to the midwest. Maybe you'll have to do all your interviews over the net. It's getting pretty good. But at least the moderators' perspective will be altered somewhat, will get out of that fetid putrid bubble you all live in. Important stuff is happening, and you're blowing it. It's time to shake things up in journalism. ",
                    "created": "Tue, 04 Feb 2020 14:48:50 GMT",
                    "type": "outline"
                },
                {
                    "text": "It's <i>good</i> that Iowa melted down. It'll wake everyone up. Even if the caucus is a total loss, it's a small price to pay to get people to pay attention to the way we're using online systems in politics and journalism. Especially in 2020 where our systems are undefended against terrorism, it's a certainty we will be replaying this, on a much larger scale, at some time during the process.",
                    "created": "Tue, 04 Feb 2020 14:55:42 GMT",
                    "type": "outline"
                },
                {
                    "text": "Why is this process so freaking long! The horserace provides good TV, I guess, if what you want to do is play video games during the broadcast (that's what I do), but we've got other more pressing business than the minutia that people think of as news in this period. It's in the boredom of the interminably long election that Hillary's Emails were invented. We would never have had time for Hunter Biden and Burisma. The length of the process is something the Repubs have mastered for their mischief. Let's not give them such a tempting target. First primary is in July, say, and it's five huge swing states. Then the rest. That's it. Then a convention and Election Day. ",
                    "created": "Tue, 04 Feb 2020 14:57:27 GMT",
                    "type": "outline"
                }
            ]
        }
    ]
}