{
    "text": "The Guardians? Please!",
    "created": "Fri, 19 May 2023 13:49:39 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "The Mets are playing the <a href=\"https://en.wikipedia.org/wiki/Cleveland_Guardians\">Guardians</a> this weekend. A few comments.",
            "created": "Fri, 19 May 2023 13:49:48 GMT",
            "flNumberedSubs": "true",
            "subs": [
                {
                    "text": "I don't like interleague play. Why the hell are the Mets playing the Guardians, of the American League, in the regular season! Makes no sense.",
                    "created": "Fri, 19 May 2023 13:50:09 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "And who are the \"Guardians.\" What a lame-ass name for a baseball team. I know they couldn't keep the old name, but why not something fun like the Cleveland Hooligans or the Cleveland Mama's Boys? Or since the <a href=\"https://en.wikipedia.org/wiki/Rock_and_Roll_Hall_of_Fame\">Rock and Roll Hall of Fame</a> is in Cleveland -- the Cleveland Rockers? Or the Eries. Or Homies. Guardians? Oh please -- wtf are they guarding? ",
                    "created": "Fri, 19 May 2023 13:50:30 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I'm not thrilled with the Mets this year. They bought all this expensive talent so the fans are expecting nothing less than a championship. But that's what the Yankees do. I'm a <i>Mets</i> fan so I expect a certain level of <a href=\"https://rowman.com/ISBN/9781566634885/Cant-Anybody-Here-Play-This-Game?-The-Improbable-Saga-of-the-New-York-Mets-First-Year\">suckage</a> from the Metsies. And even though they bought all these expensive players, they still suck! How about that. But the Yankees fans, they love this. They only understand winning. ",
                    "created": "Fri, 19 May 2023 13:51:19 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "At least we'll never have to change the name of the Mets, right? :smile:",
                    "created": "Fri, 19 May 2023 13:56:55 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "When I <a href=\"https://www.google.com/search?q=%22cleveland+indians%22\">asked Google</a> about \"Cleveland Indians\" -- it's almost as if the name never existed. Well at least this page should show up in the index. The team I grew up with, the one I had baseball cards from, was known as the Indians. I have not and will not erase my memory of my baseball-loving childhood. That's why baseball of all American sports should resist change, because of its legendary status with children, their parents and grandparents. Baseball, to many of us, is our national legacy. ",
                    "created": "Fri, 19 May 2023 14:00:02 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "When I <a href=\"http://ai.scripting.com/2023/05/19/cleveland-indians-baseball-team.html\">asked ChatGPT</a> about the Cleveland Indians it had a lot to say beginning with \"as of my last knowledge update in September 2021, the team was still known as the Cleveland Indians. Please keep in mind that there might have been changes since then, as teams occasionally rebrand themselves.\" My robot friend suspected the team might have changed its name, but proceeded as if it hadn't. :heart: ",
                    "created": "Fri, 19 May 2023 14:02:51 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}