{
    "text": "When the web was new",
    "created": "Fri, 06 Jun 2025 22:58:08 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I was an active software developer when the web came online in the early 90s. I knew what <a href=\"https://daytona.scripting.com/search?q=Macintosh\">closed systems</a> were like, and <a href=\"https://daytona.scripting.com/search?q=unix\">open systems</a>. The web was open, and a miracle because of its radical simplicity. We were so lucky. We developed all kind of stuff that was only possible when there was no platform vendor. ",
            "created": "Fri, 06 Jun 2025 22:58:22 GMT",
            "image": "https://imgs.scripting.com/2025/06/06/timBernersLee.png",
            "flInCalendar": true
        },
        {
            "text": "But then in the mid 00s things changed, and since then the users have flocked to <a href=\"https://daytona.scripting.com/search?q=twitter\">closed</a> <a href=\"https://daytona.scripting.com/search?q=facebook\">systems</a>. It would be similarly wonderful if we had an open <a href=\"https://daytona.scripting.com/search?q=%22social%20web%22\">social web</a>, but we don’t. Mastodon is open but it’s not simple like the web is, and Bluesky is simple, but it is not open. And neither supports the most basic <a href=\"https://textcasting.org/\">features of the web</a>.",
            "created": "Fri, 06 Jun 2025 22:58:24 GMT",
            "flInCalendar": true
        },
        {
            "text": "Today most active devs weren’t around when the web came along and knocked down the silos. It is imho possible to have an open social web, but the people who are trying to make one out of complex and closed systems will imho never get there.",
            "created": "Fri, 06 Jun 2025 22:58:29 GMT",
            "flInCalendar": true
        },
        {
            "text": "They would be better off to look for different foundations to build on other than Mastodon and Bluesky. I have <a href=\"https://daytona.scripting.com/search?q=wordpress\">one</a> in mind, btw. You will probably be surprised, but then we were all surprised by the web itself.",
            "created": "Fri, 06 Jun 2025 22:58:33 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}