{
    "text": "What became of the blogosphere?",
    "created": "Tue, 26 Jun 2018 11:44:10 GMT",
    "type": "outline",
    "description": "The blogosphere is made of people, but the people treated the center like a corporation, and it wasn't. ",
    "subs": [
        {
            "text": "One of the things that came up in <a href=\"http://sotn.it/schedule/\">Trieste</a> is the question of the decline of the blogosphere. Here's what I said.  ",
            "created": "Tue, 26 Jun 2018 11:44:21 GMT",
            "flNumberedSubs": "true",
            "subs": [
                {
                    "text": "I doubt if the blogosphere of 2018 is smaller in absolute terms than the blogosphere of the early 2000s. In fact I'm pretty sure it's orders of magnitude larger, if you consider the size of just two hosting services -- Wordpress.com and Tumblr. ",
                    "created": "Tue, 26 Jun 2018 11:44:30 GMT"
                },
                {
                    "text": "Most of the people who use social media, Twitter, Facebook etc are not <a href=\"http://scripting.com/stories/2009/11/24/naturalbornBlogger.html\" title=\"Natural-born bloggers\">NBBs</a>. They were never going to become bloggers. We learned this in the early days of the evangelism of blogs. Most people don't have the impulse.",
                    "created": "Tue, 26 Jun 2018 11:44:54 GMT"
                },
                {
                    "text": "What changed is we lost the center. I know something about this because I created and operated <a href=\"https://en.wikipedia.org/wiki/Weblogs.com\">weblogs.com</a>. It worked at first, but then the blogosphere <a href=\"http://oldweblogscomblog.scripting.com/2001/09/27\">grew</a> and grew, and weblogs.com didn't or couldn't scale to meet it. Eventually I sold it because it was such a personal burden for me. ",
                    "created": "Tue, 26 Jun 2018 11:45:03 GMT"
                },
                {
                    "text": "The blogosphere is made of people, but the people treated the center like a corporation, and it wasn't. If we ever want to reboot the center, there has to be a cooperative spirit, and a limit to its scope to avoid the scaling problems. You can't put a big corp at the center of something so independent, or it ceases to be independent. ",
                    "created": "Tue, 26 Jun 2018 11:45:20 GMT"
                },
                {
                    "text": "We're paying a price now for the lack of a center as <a href=\"http://this.how/googleAndHttp/\">Google</a> and others move to control the open web that made blogging possible. Bloggers need the low barrier to entry to hosting our own blogs, even if we never use it. It's our escape plan. With no way out, the hosting companies will turn into AOL. ",
                    "created": "Tue, 26 Jun 2018 11:45:28 GMT"
                },
                {
                    "text": "There used to be a communication network among bloggers, but that's gone now. ",
                    "created": "Tue, 26 Jun 2018 13:47:21 GMT"
                }
            ]
        }
    ]
}