{
    "text": "Two Democratic presidential candidates said historic things in the last week, but they have mostly gone unnoticed or misunderstood. <a href=\"https://www.newsbusters.org/blogs/nb/bill-dagostino/2019/07/30/buttigieg-alludes-changing-2nd-amendment-cnn-moderators-ignore\">Pete Buttigieg</a> said if we want change we're going to have to amend the Constitution. He's absolutely right. Changing the president, even taking the majority in the Senate won't accomplish much if a minority can overturn the whole thing any time they get it together. That's in the <a href=\"https://en.wikipedia.org/wiki/Constitution_of_the_United_States\">Constitution</a>, that's what has to change. Another thing that has to change is journalism. They can't incorporate new realities into their view of the world. They ask questions about Trump as if he were a normal president, one who had <a href=\"https://www.reuters.com/article/us-usa-trump-finance/trump-says-wont-divest-from-his-business-while-president-idUSKBN14V21I\">divested</a> and <a href=\"https://www.factcheck.org/2018/11/the-presidents-tax-returns/\">disclosed</a> before taking office. Trump is a Russian oligarch. He takes his orders from Putin. Any question about the president that doesn't accept this context is a question from Dreamland. <a href=\"https://twitter.com/davewiner/status/1159116877316132864\">Beto O'Rourke</a> busted through this crazy wall in the aftermath of the El Paso massacre. It's why we need to <a href=\"https://en.wiktionary.org/wiki/depose\">depose</a> the people who run journalism, asap. Why shouldn't the Democratic candidates help us transform politics and journalism? If they don't do that, why are they running? (To paraphrase Elizabeth Warren, who has done her <a href=\"https://thehill.com/homenews/campaign/454500-warren-presses-pelosi-on-impeachment-some-things-are-above-politics\">part</a> to transform how our politics and journalism work.)",
    "created": "Wed, 07 Aug 2019 15:02:50 GMT",
    "type": "outline",
    "image": "http://scripting.com/images/2019/08/07/elizabethWarrenActionFigure.png"
}