{
    "text": "Journalism's line separating us from them",
    "created": "Tue, 13 Nov 2018 18:19:52 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I think the problem with journalism in 2018 is that it relies on a centralized model, journalists who are paid salaries and everyone else  who pays to read what the salaried journalists produce. It's not all the way there yet, but it's close. ",
            "created": "Tue, 13 Nov 2018 18:20:00 GMT",
            "image": "http://scripting.com/images/2017/09/02/mrFrog.png"
        },
        {
            "text": "But -- who really wants to read what the paid journalists write? And why? And what about the knowledge and perspectives of the readers, why are they wasted in this model? I understand why they were wasted in the pre-Internet world, because the cost of distribution was prohibitive, but that's no longer an issue. ",
            "created": "Tue, 13 Nov 2018 18:20:11 GMT"
        },
        {
            "text": "The standard answer, which I don't disagree with is how do you separate the wheat from the chaff? The repetitive rote stuff that just echoes what a few opinion leaders put out there versus original insights that could help us solve problems? But how does the system do it now? The columnists are very predictable, they're mostly rehashing the same themes over and over, applied to different events. And as <a href=\"https://en.wikipedia.org/wiki/Matt_Taibbi\">Matt Taibbi</a> says so well in this <a href=\"https://taibbi.substack.com/p/the-church-of-averageness-continued\">paywalled piece</a> (somehow accidentally I was allowed to read it) most of what they talk about in the news is pure bullshit. We knew that, but it's nice to hear someone on the other side of the paywall say it.",
            "created": "Tue, 13 Nov 2018 18:21:09 GMT"
        },
        {
            "text": "Ultimately that model is going to break because of their inability to do the corner-turn that the new technology has required of them since the web opened up. The turn is this: stop paying writers, and figure out how to find the good stuff in a sea of bullshit. The same problem everyone has and no one has an answer to. The news org that has the courage to tackle that problem, and solves it, will lead the consolidation, which will imho happen very quickly.",
            "created": "Tue, 13 Nov 2018 18:23:26 GMT"
        }
    ]
}