{
    "text": "My take on what James Damore wrote",
    "created": "Fri, 11 Aug 2017 00:18:35 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "This is my summary. I've read many that were more harsh, but I think are wrong. This is what I got from <a href=\"https://en.wikipedia.org/wiki/Google_memo\">what</a> he wrote. ",
            "created": "Fri, 11 Aug 2017 00:21:46 GMT",
            "isComment": "false",
            "flNumberedSubs": "true",
            "image": "http:///scripting.com/images/2017/08/10/basketballplayer.png",
            "subs": [
                {
                    "text": "There are differences between men and women. Not individual men and women, but as groups. For example, men are generally taller than women. There are of course women who are tall and men who are short. It's a general statement about a group, not individuals. ",
                    "created": "Fri, 11 Aug 2017 00:18:42 GMT"
                },
                {
                    "text": "From there, he suggests that there may be reasons there are fewer women programmers, other than how we raise and educate children. I don't think there's anything to apologize for there. It's a scientific statement that anyone, male or female, privileged or poor, young or old, would make. It's also the kind of statement a <i>programmer</i> would make. ",
                    "created": "Fri, 11 Aug 2017 00:22:56 GMT"
                },
                {
                    "text": "My non-programmer friends laugh at the things I say, the questions I ask, because in my mind I'm always trying to debug something. Figure out how it works. Think of new things it could be used for. Spot problems in the design. ",
                    "created": "Fri, 11 Aug 2017 00:26:51 GMT"
                },
                {
                    "text": "Programmers must have great respect for <a href=\"http://scripting.com/davenet/1997/05/07/Programmers.html#5\">truth</a>, because our apps don't work until they are grounded in truth. Garbage in, garbage out. 1s and 0s. True and false. If then else. Programming is good training in the scientific method. Most of our lives aren't this absolute. But computers are. They do exactly what the program tells them to do. What the programmer tells them to do.",
                    "created": "Fri, 11 Aug 2017 00:19:52 GMT"
                },
                {
                    "text": "I don't know why there are fewer women programmers than men. That is the crux of the issue here. Many people will (try to) shut down anyone who says that out loud. But any person trying to get to the truth has to admit they don't know. ",
                    "created": "Fri, 11 Aug 2017 00:21:39 GMT"
                }
            ]
        }
    ]
}