{
    "text": "Visiting Flushing",
    "created": "Sat, 13 Aug 2022 18:40:41 GMT",
    "type": "outline",
    "metaImage": "http://scripting.com/images/2022/08/13/flushing.png",
    "subs": [
        {
            "text": "My mother died in February 2018. My father had died in October 2009. So she lived there alone for nine years. I came and went, it was nice to have a place to stay in NYC. I just took a trip to NY for the first time to stay overnight since I moved to the mouintains in 2019. And for the first time I didn't have a place to stay in NY. ",
            "created": "Sat, 13 Aug 2022 18:40:48 GMT",
            "flInCalendar": true
        },
        {
            "text": "It was the hottest night of the year. I ate a fishy <a href=\"https://www.nytimes.com/2019/03/05/dining/wonton-soup-maxis-noodle.html\">dinner</a> in Flushing at <a href=\"https://maxisnoodle.com/\">Maxi's Noodle</a>, one of many Chinese and Korean restaurants in the place where I grew up, only when I lived there it was a sleepy midwestern-type place you traveled through but never stopped at. I would take the <a href=\"https://en.wikipedia.org/wiki/List_of_bus_routes_in_Queens#Q16\">Q16</a> bus to <a href=\"https://en.wikipedia.org/wiki/Flushing%E2%80%93Main_Street_station_(IRT_Flushing_Line)\">Main St</a> and from there got on the <a href=\"https://en.wikipedia.org/wiki/IRT_Flushing_Line\">7 train</a>, never stopping for more than the time it took for the train to leave. But it's now a destination. It felt like a foreign country. What a thing to return to where you grew up, to experience it as a white American man would in a foreign country, Hong Kong or Seoul. What was odd though, was when the locals talked the young ones talked like me. Makes sense, but strange. ",
            "created": "Sat, 13 Aug 2022 18:55:52 GMT",
            "image": "http://scripting.com/images/2022/08/13/maxisNoodle.png",
            "imageLink": "https://maxisnoodle.com/",
            "flInCalendar": true
        },
        {
            "text": "When my mother died, shortly after we had the house cleaned out to get ready to sell, I realized I should have made a movie of the inside of the house. The scene of most of my childhood memories, good and bad. Now they only reside in my head. If only I had thought to make a video. That's what's funny about big transitions. When you look at the place so familiar so lived-in, why would you take a video, it never crossed my mind. Until the instant you realize, after the fact, that it's gone forever. ",
            "created": "Sat, 13 Aug 2022 18:45:02 GMT",
            "flInCalendar": true
        },
        {
            "text": "In the morning after staying in a weird hotel that smelled funny, in the stinky heat of an August morning, plotting my trip to <a href=\"http://scripting.com/2022/08/05.html\">Utopia Bagels</a>, I found a <a href=\"https://www.google.com/maps/@40.7687934,-73.7918902,3a,75y,231.86h,75.39t/data=!3m6!1e1!3m4!1srVHSLcEmp8uSz67aCZY2Lw!2e0!7i16384!8i8192\">Starbucks</a> (on the app) on my path at the intersection of <a href=\"https://www.google.com/maps/place/Francis+Lewis+Blvd+%26+32nd+Ave,+Queens,+NY+11358/@40.7688738,-73.7926528,210m/data=!3m1!1e3!4m5!3m4!1s0x89c28a7fa6261b81:0x5df5b6691664bc4f!8m2!3d40.7689226!4d-73.7919782\">32nd Ave and Francis Lewis Blvd</a>. I tried to imagine which corner it was on, what it had replaced. Turns out it was the <a href=\"https://www.usbanklocations.com/reliance-federal-savings-bank-29210.shtml\">Reliance Federal Savings Bank</a>, where I, as a 5th-grade boy had my first <a href=\"https://en.wikipedia.org/wiki/Passbook\">bankbook</a>, a hand-written thing, maintained by someone behind a counter who carefully stamped the date, and wrote the amount and balance in the account for every transaction. I don't remember what I was saving for, possibly a new baseball bat or glove, or later sound equipment. And of course all that remains of that little person, the former future Dave, are little vague bits of memory. How unlikely all this was I imagine that boy would think. ",
            "created": "Sat, 13 Aug 2022 18:46:35 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}