{
    "text": "July 2",
    "created": "Sun, 02 Jul 2017 11:45:10 GMT",
    "name": "02",
    "subs": [
        {
            "text": "Good morning sports fans! :baseball:",
            "created": "Sun, 02 Jul 2017 11:45:11 GMT",
            "type": "outline"
        },
        {
            "text": "Trump goes direct",
            "created": "Sun, 02 Jul 2017 13:16:58 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Going direct as Trump is doing is a valid idea, it's too bad Trump is using it to undermine our political system instead of developing it.",
                    "created": "Sun, 02 Jul 2017 13:17:03 GMT",
                    "image": "http://scripting.com/2016/04/18/yoQueroTacoBell.png"
                },
                {
                    "text": "This raises the question why a political leader hasn't emerged that puts his or her personality into their tweeting with a strong message of democracy, development and empowerment? "
                },
                {
                    "text": "So far the only political leader to fully embrace the <a href=\"https://duckduckgo.com/?q=Sources+Go+Direct+site%3Ascripting.com&t=h_&ia=web\">Sources Go Direct</a> philosophy is the worst one imaginable.",
                    "created": "Sun, 02 Jul 2017 13:17:07 GMT"
                }
            ]
        },
        {
            "text": "Could we exist without the net?",
            "created": "Sun, 02 Jul 2017 12:58:39 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "What if Twitter and Facebook are iterations and there's a next social net after it that is so absorbing that it captures everything we do beyond the most basic body functions.",
                    "created": "Sun, 02 Jul 2017 12:58:48 GMT"
                },
                {
                    "text": "Maybe we should have a fire drill where we turn off the net for an hour everywhere at the same time and see what happens. That kind of blackout is coming, hackers, a bug, or a government is going to cause it.",
                    "created": "Sun, 02 Jul 2017 12:59:14 GMT"
                },
                {
                    "text": "Maybe we should find out how addicted we collectively are. Can we exist without the net? How deep in are we?"
                }
            ]
        },
        {
            "text": "A quiet place on the open web",
            "created": "Sun, 02 Jul 2017 12:32:49 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "A funny thing happened yesterday when I wrote the <a href=\"http://scripting.com/2017/07/01.html#a100740\">bit</a> about The Mother of Dragons and NakedJen. I knew where to point to for everything but NakedJen. Most of the way I experience her publicly these days is through Facebook, and I don't point into Facebook. This suggests that perhaps the first step toward recovery may be that everyone who wants to be part of the open web but for now is spending most of their time in Facebook, should at least have one public page <i>outside</i> Facebook that says how to contact them. So I could point to that page. It would <a href=\"https://duckduckgo.com/?q=nakedjen&t=h_&ia=web\">show up</a> in search engines. And Jen would know to check from time to time to see if there were incoming messages from other people on the open web. ",
                    "created": "Sun, 02 Jul 2017 12:30:07 GMT",
                    "image": "http://scripting.com/2016/01/10/alice.png"
                },
                {
                    "text": "This would be sort of like <i>Fort NakedJen</i> on the wild frontier, which she could monitor from her snug Facebook cabin in the mountains back east. ",
                    "created": "Sun, 02 Jul 2017 12:34:41 GMT"
                }
            ]
        },
        {
            "text": "Sex in Silicon Valley",
            "created": "Sun, 02 Jul 2017 11:45:21 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I've watched with interest  p <a href=\"http://nymag.com/selectall/2017/06/vc-chris-sacca-apologizes-to-women-amid-binary-lawsuit.html\">the</a> <a href=\"https://500hats.com/im-a-creep-i-m-sorry-d2c13e996ea0\">issue</a> <a href=\"https://techcrunch.com/2017/07/01/500-startups-dave-mcclure-apologizes-for-multiple-advances-toward-women-and-being-a-creep/\">of</a> <a href=\"http://www.techmeme.com/170630/p14#a170630p14\">sexual harassment</a> in the VC world has come up. This is something I've never experienced personally, because I was never a VC and am not a woman. But I did live in the valley between 1979 and 2003. I dated women, and people did pitch me ideas from time to time. So the lines did cross. It's inevitable in a world with adults and business-obsessed people. ",
                    "created": "Sun, 02 Jul 2017 11:45:26 GMT",
                    "image": "http://scripting.com/2016/05/25/monopolyDude.png"
                },
                {
                    "text": "I have a suggestion for how to deal with this when everyone's intentions are good. Guys, if the woman is talking about her business ideas, that means it isn't about sex, no matter where it is. You need to hear that and respect it. A meeting in a business setting, a conference room at an office for example, is business. Flirting and sex talk, even complimenting a woman on her appearance is not OK. Don't do it. You may think it's innocent, it's not. ",
                    "created": "Sun, 02 Jul 2017 11:49:28 GMT"
                },
                {
                    "text": "On the other hand if it's a date, don't pitch your product. That feels really dirty. It's not fair. I've been there, it makes me angry. I believe in a level playing field. Mixing sex and business in inappropriate ways is not good. Make sure everyone knows what's going on and is okay with it.",
                    "created": "Sun, 02 Jul 2017 11:51:30 GMT"
                }
            ]
        }
    ]
}