{
    "text": "July 8",
    "created": "Sat, 08 Jul 2017 15:54:52 GMT",
    "name": "08",
    "subs": [
        {
            "text": "I wonder if news orgs consider that Americans would stand up for them as the president and <a href=\"https://twitter.com/ProPublica/status/883788038731694081\">his family</a> get more abusive (the same family that <a href=\"http://scripting.com/2017/07/08.html#a120756\">stands in</a> for the president at international summit meetings). The assumption that all or most Americans are lazy and weak is itself weak. Flip it around, set the expectation for us all to be <i>strong. </i>",
            "created": "Sat, 08 Jul 2017 20:47:14 GMT",
            "type": "outline"
        },
        {
            "text": "Must-read: <a href=\"http://www.nybooks.com/articles/2017/06/08/how-trump-used-facebook-to-win/\">How Trump used Facebook to win</a>. Take-away -- vote your interests, completely discount emotions. They are being programmed.  ",
            "created": "Sat, 08 Jul 2017 15:54:53 GMT",
            "type": "outline"
        },
        {
            "text": "To fully appreciate the norm-busting insanity of Ivanka repping the US at the G20, imagine another country doing it.",
            "created": "Sat, 08 Jul 2017 16:27:56 GMT",
            "type": "tweet",
            "tweetId": "883724598625304576",
            "tweetUserName": "davewiner"
        },
        {
            "text": "Dave Bunnell's story",
            "created": "Sat, 08 Jul 2017 15:57:50 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "This morning I'm thinking of a story of the end of <a href=\"https://en.wikipedia.org/wiki/David_Bunnell\">David Bunnell's</a> life. I don't remember who told the story. But it made an impression.",
                    "created": "Sat, 08 Jul 2017 15:57:58 GMT",
                    "image": "http://scripting.com/2016/10/19/macworld.png"
                },
                {
                    "text": "Dave was a campaigner. The <a href=\"https://www.nytimes.com/2016/10/22/technology/david-bunnell-dead.html\">kind</a> <a href=\"https://duckduckgo.com/?q=David+Bunnell&t=h_&ia=web\">of</a> <a href=\"https://www.edge.org/digerati/bunnell/\">person</a> <a href=\"https://www.amazon.com/David-Bunnell/e/B001KCOHMY\">who</a> always had something that he was trying to get the world to do. When I first met him it was personal computers. He was founding editor of PC Magazine, and famously left, with most of his staff, to found PC World, over a dispute with the publishers. He did a deal with Steve Jobs to do a <a href=\"https://en.wikipedia.org/wiki/Macworld\">magazine</a> for the Mac, it shipped the day the Mac was announced. There was a copy of the first edition on every seat in Flint Center on 1/24/84.",
                    "created": "Sat, 08 Jul 2017 15:58:36 GMT"
                },
                {
                    "text": "I met up with him again when I moved to Berkeley in 2005. He had retired from the magazine business, and now was writing and speaking about being active in old age. Then last year he got pancreatic cancer, and within months he died.  He had just finished a book. Was about to go out on tour when the disease hit. All that was put aside. He wondered what would happen with his causes after he was gone, I heard. ",
                    "created": "Sat, 08 Jul 2017 16:00:27 GMT"
                },
                {
                    "text": "I think about my dead relatives and their causes. My uncle Ken designed a windmill that captured wind from any direction. My father wanted to help businesses make smarter decisions. Both of their work, their life causes, are not even footnotes. And even if they had set the world on fire, so what?",
                    "created": "Sat, 08 Jul 2017 16:17:04 GMT"
                },
                {
                    "text": "Of course I too am a campaigner and I'm still alive. When I'm gone, my campaigns will be forgotten. They already are. I gave a talk about the origins of podcasting at a podcasting conference in April. Someone said it had never occured to them that someone must have invented it. And here I was thinking they all were reverent of the genius of the simplicity and how much it had grown and managed to stay out of the control of the tech industry, so far at least. Apparently I'm one of very few people who are even aware that there was an act of creation, much less understood the miracle of its growth and utility, and independence. ",
                    "created": "Sat, 08 Jul 2017 16:05:19 GMT"
                },
                {
                    "text": "I don't know if there's any conclusion to this, only don't be a fool and think anyone is going to care after you're gone. Very few people care even when you're alive. ",
                    "created": "Sat, 08 Jul 2017 16:07:41 GMT"
                },
                {
                    "text": "David Bunnell was a good man, with a good heart. He tried to do bigger things than most people, and often succeeded. He helped other people. I think in the end that's the measure of a life. Did your existence make other people's lives better? If so, well done. ",
                    "created": "Sat, 08 Jul 2017 16:08:22 GMT"
                }
            ]
        }
    ]
}