{
    "text": "July 10",
    "created": "Mon, 10 Jul 2017 04:19:44 GMT",
    "name": "10",
    "subs": [
        {
            "text": "People might not like a world dominated by China. For example, the Internet is heavily <a href=\"https://en.wikipedia.org/wiki/Internet_censorship_in_China\">censored</a> in China. They also have the <a href=\"https://en.wikipedia.org/wiki/Capital_punishment_in_China\">death penalty</a>. Trials are short, constitutional protections non-existent. The dominant country tends to spread its values to the countries it dominates. They are in a position to demand it. The United States has been in that position for all the lives of everyone alive today. We don't know any other way. We are spoiled and lazy and are trying desperately to pay the price for it. ",
            "created": "Mon, 10 Jul 2017 20:07:48 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/07/10/mao.png"
        },
        {
            "text": "Surprisingly, China has been <a href=\"http://www.nytimes.com/2006/10/13/business/worldbusiness/13sweat.html\">boosting unions</a> and American <a href=\"http://www.law.harvard.edu/programs/lwp/GLS_ChinaArticle.html\">companies</a> have been fighting it. That's the opposite of what I thought was happening. Maybe Chinese domination would be better than I thought. (The American companies listed are Wal-Mart, Google, UPS, Microsoft, Nike, AT&T and Intel.)",
            "created": "Mon, 10 Jul 2017 21:53:27 GMT",
            "type": "outline"
        },
        {
            "text": "58% of Repubs <a href=\"https://www.axios.com/americans-divided-on-institutions-2456778828.html\">think</a> higher education has a negative effect on the country. So how are those high-paying jobs going to stay in America if our people aren't educated? America seems to have a willed itself to fail. I don't see this as the country I grew up in.  Next-up: Repubs think health care has a negative effect on the country. ",
            "created": "Mon, 10 Jul 2017 19:56:36 GMT",
            "type": "outline"
        },
        {
            "text": "Single-feed viewer feature <a href=\"https://groups.google.com/forum/?fromgroups#!topic/river5/nAHua7ckktY\">released</a> to River5 users.",
            "created": "Mon, 10 Jul 2017 17:15:45 GMT",
            "type": "outline"
        },
        {
            "text": "As noted in the announcement, some feeds work better than others in the single-feed viewer. If you don't like the way an item looks in the right panel, it's probably something you should report to the source of the feed, not me. We show you exactly what's in the feed. Unlike the main river display, we don't truncate or strip markup. You're getting what's in the feed, no more no less. ",
            "created": "Mon, 10 Jul 2017 17:18:27 GMT",
            "type": "outline",
            "image": "http://static.scripting.com/larryKing/images/2014/05/22/thinkTankLogo.gif"
        },
        {
            "text": "An example of a feed that <a href=\"http://rss2.io/code/feedtools/feedviewer/?server=river5.scripting.com&url=http://feeds.feedburner.com/PoliticalWire\">looks great</a> is Political Wire. Good length stories, not too much markup, links are included. I've always liked Political Wire, they summarize important political stories, and save you from having to click through a paywall to use up one of your monthly reads. ",
            "created": "Mon, 10 Jul 2017 17:18:59 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/884269892534489089\">Epiphany</a>: Twitter is a slice of the crazy life. ",
            "created": "Mon, 10 Jul 2017 17:30:34 GMT",
            "type": "outline"
        },
        {
            "text": "Yes dear friends there <a href=\"https://en.wikipedia.org/wiki/The_Emoji_Movie\">is</a> an <a href=\"https://twitter.com/qhardy/status/884428165073870848\">Emoji Movie</a> coming later this month; starring <a href=\"https://en.wikipedia.org/wiki/Patrick_Stewart\">Patrick Stewart</a> as <a href=\"https://en.wikipedia.org/wiki/Pile_of_Poo_emoji\">Poop</a>. God help us. :poop:",
            "created": "Mon, 10 Jul 2017 15:05:20 GMT",
            "type": "outline"
        },
        {
            "text": "Remarkably \"Fargo\" is still <a href=\"http://virgin.smallpict.com/2017/07/10/itsJuly10DoYouKnowWhereYourBlogIs.html\">working</a>. <i>WTF!</i>  :rooster: ",
            "created": "Mon, 10 Jul 2017 04:19:45 GMT",
            "type": "outline"
        },
        {
            "text": "Good progress on the Feedviewer app. Here's the NYT > Politics <a href=\"http://rss2.io/code/testing/feedviewer/?url=http://www.nytimes.com/services/xml/rss/nyt/Washington.xml\">feed</a>. Note it is not a full-item feed. It would be interesting to <a href=\"https://duckduckgo.com/?q=curate&t=h_&ia=definition\">curate</a> a set of feeds that are designed for the feedviewer approach to reading. ",
            "created": "Mon, 10 Jul 2017 04:22:04 GMT",
            "type": "outline"
        },
        {
            "text": "We need what Mike Arrington did",
            "created": "Mon, 10 Jul 2017 22:49:14 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "How TechCrunch started in a paragraph. I met <a href=\"https://en.wikipedia.org/wiki/Michael_Arrington\">Mike Arrington</a> at a meeting at a VC in NYC in 2005. I was living in Florida, and came up for the day. <a href=\"https://en.wikipedia.org/wiki/Keith_Teare\">Keith Teare</a>, who I knew from when I lived in the Valley, came out to NY and brought Mike, his partner in a startup called <a href=\"https://www.crunchbase.com/organization/edgeio#/entity\">Edgeio</a>. Mike was a lawyer. It was either at this meeting or some time soon after that I blurted out to Mike the thing that I said to pretty much everyone: \"You should start a blog.\" Mike, being an \"NBB\" got right to it. ",
                    "created": "Mon, 10 Jul 2017 22:49:30 GMT",
                    "image": "http://scripting.com/images/2017/07/10/juliaChild.png"
                },
                {
                    "text": "His blog, TechCrunch, consisted of writeups of products Mike had tried or companies he visited. There was a lot of activity in the Valley then, but it was hard to see. Mike made it visible. That's how powerful one person can be in the new age of publishing. (We're still in that age btw, you can do all that he did then, even more easily.)",
                    "created": "Mon, 10 Jul 2017 22:49:59 GMT"
                },
                {
                    "text": "Okay now here we are in 2017, and we're there again. I'm sure there's lots of stuff going on but we can't see it. For example, I shipped a simple product called \"pngWriter\" last week. It takes about five minutes to explore. If you want to fully grok it, and you know a little CSS, maybe it takes a half hour. Yet there is no writeup of the product outside of my blog. No place everyone can turn to to find some new stuff to try out. ",
                    "created": "Mon, 10 Jul 2017 22:51:24 GMT"
                },
                {
                    "text": "No, I don't mean <a href=\"https://www.producthunt.com/\">ProductHunt</a>. It's nice. But it's so hyped up. I just want to know about products from a person like Mike who I get to know. Everyone was trying to shoot to the top of the list. I just want to know about new products. Not every new product. And I want opinion. I know he or she might not be right. And save the hype. Just tell me what's going on. ",
                    "created": "Mon, 10 Jul 2017 22:53:01 GMT"
                },
                {
                    "text": "I don't know who's going to do it. But someone please, if you have the time and a natural inclination to blog, and love the open web, give it a try. Let me know where to send readers and links to interesting products I discover. ",
                    "created": "Mon, 10 Jul 2017 22:53:46 GMT"
                },
                {
                    "text": "PS: If you decide to do this, there will be assholes who try to get you down. That happened to Mike, and I wrote <a href=\"http://scripting.com/2005/10/31.html#When:7:42:05PM\">this post</a> to encourage him. It even had a <a href=\"http://static2.podcatch.com/blogs/gems/snedit/EthanLiptonYouWereRight.mp3\">song</a> linked to it. The song is corny, but it hits the mark squarely. ",
                    "created": "Mon, 10 Jul 2017 22:59:48 GMT"
                }
            ]
        },
        {
            "text": "My ode to cargo shorts",
            "created": "Mon, 10 Jul 2017 14:58:18 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": " I didn't discover <a href=\"https://duckduckgo.com/?q=cargo+shorts&t=h_&ia=products\">cargo shorts</a> until people started dissing them. They are useful. I need pockets esp when I'm out bike riding. If you don't like em, you don't know what you're missing.",
                    "created": "Mon, 10 Jul 2017 14:58:23 GMT"
                },
                {
                    "text": "And at my age, I don't worry too much about how I look. I'm pretty much invisible anyway. And if you still have a problem with my wearing cargo shorts, you seriously need to get a life. :heart:",
                    "created": "Mon, 10 Jul 2017 15:00:20 GMT"
                }
            ]
        },
        {
            "text": "The court of Rex",
            "created": "Mon, 10 Jul 2017 14:41:48 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "<a href=\"https://www.facebook.com/rexhammock/posts/10155279182825609?comment_id=10155280388390609&comment_tracking=%7B%22tn%22%3A%22R2%22%7D&pnref=story\">Rex Hammock</a>: \"Note: on this account, there is no arguing over the who's at fault. This isn't a court of law. It's a court of Rex.\"",
                    "created": "Mon, 10 Jul 2017 14:41:52 GMT"
                },
                {
                    "text": "Sorry, I pointed to Facebook. Had to. That bit of philosophy needed to be enshrined. It's so correct. When people debate stuff on Facebook as if they're on <i>All In with Chris Hayes</i> or <i>The Situation Room, </i>or in front of the Supreme Court, they are being foolish. Rex is listening. Maybe a couple of other people. You're hanging out in his back yard on a hot summer afternoon.  We're talking about a car driver who <i>deliberately</i> hit a bike rider and <a href=\"http://www.tennessean.com/story/news/local/williamson/2017/07/09/hit-and-run-cyclist-natchez-trace-williamson-county-caught-video/462473001/\">fled</a> the scene, and everyone else here is an urban bike rider. Arguing about who was at fault based on some weird technicality is rude.",
                    "created": "Mon, 10 Jul 2017 14:43:06 GMT",
                    "image": "http://scripting.com/images/2017/07/10/citibike.png"
                },
                {
                    "text": "This is not a court of law, as Rex says, it's a court of Rex. In other words, mind your manners dude. :cop:",
                    "created": "Mon, 10 Jul 2017 14:48:18 GMT"
                }
            ]
        }
    ]
}