{
    "text": "July 11",
    "created": "Tue, 11 Jul 2017 13:11:25 GMT",
    "name": "11",
    "subs": [
        {
            "text": "The Bay Area has a new <a href=\"https://www.fordgobike.com/how-it-works\">bikeshare program</a>. Already operating in parts of San Francisco and the East Bay. San Jose coming. ",
            "created": "Tue, 11 Jul 2017 17:04:39 GMT",
            "type": "outline"
        },
        {
            "text": "What are the chances that POTUS 46 is less compromised by the Russians than Trump? Pretty low imho. Once the mob is in they don't leave.",
            "created": "Tue, 11 Jul 2017 14:25:00 GMT",
            "type": "outline"
        },
        {
            "text": "Occam and the Magnitsky Act",
            "created": "Tue, 11 Jul 2017 18:34:46 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Just listened to the <a href=\"http://podcatch.com/pages/17032.html\">Slate podcast</a> and they put it together better than I've heard before. Here's the deal. Russia is run for the benefit of 44 people. They are the ones targeted by the <a href=\"https://en.wikipedia.org/wiki/Magnitsky_Act\">Magnitsky Act</a>. They hate it because what they're about first and foremost is making money for themselves. They don't care about Russia. So the deal they were proposing to DJT Jr was this. We win you the election and you kill the Magnitsky Act. We all plunder together. \"Love it!\" says Junior. And the US govt is now run for the benefit of the Trump Family. This is the <a href=\"https://en.wikipedia.org/wiki/Occam%27s_razor\">Occam's Razor</a> explanation. ",
                    "created": "Tue, 11 Jul 2017 18:37:14 GMT",
                    "image": "http://scripting.com/images/2017/07/11/clock.png"
                }
            ]
        },
        {
            "text": "I've been Scobleized",
            "created": "Tue, 11 Jul 2017 13:26:01 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Scoble wrote something about my blog on Facebook, but sorry I can't point to it. It's <a href=\"http://scripting.com/2017/05/31.html#a110526\">against the rules</a> of this blog. But I will send Scoble a pointer to this post on Facebook. ",
                    "created": "Tue, 11 Jul 2017 13:26:10 GMT",
                    "image": "http://scripting.com/2016/10/19/fatcat.png"
                },
                {
                    "text": "He said he likes the way \"Scripting News\" works now (I'd say <a href=\"http://scripting.com/2017/05/05/iWantMyOldBlogBack.html\">again</a>) and it's given him pause to think if maybe he should blog outside of Facebook too.",
                    "created": "Tue, 11 Jul 2017 13:26:41 GMT"
                },
                {
                    "text": "So here's what I want to say to Scoble. Why can't we have both? Why can't Facebook support the <a href=\"http://scripting.com/2016/04/30/1229.html\">basic features</a> of the web so we can post the same content to Facebook as we do on our blog. Make Facebook an excellent blogging surface. Really, a minor upgrade. That's the win-win. ",
                    "created": "Tue, 11 Jul 2017 13:27:09 GMT"
                },
                {
                    "text": "For a couple of years that's what I thought Facebook was doing and why I was excited about the future that would unlock for the web. But either they punted or misled. Either way Facebook is a bad web citizen. Sucking energy from the web and not feeding it back. It's as if you had a one-way peering arrangement. You have to take our packets but we won't carry yours. That's not net-neutral (and why I don't support them in their fight against Verizon and Comcast).",
                    "created": "Tue, 11 Jul 2017 13:28:19 GMT"
                },
                {
                    "text": "It's the analog of constructing private apartment buildings in Central Park. Not only isn't it fair or moral, it's also stupid. When you're done, no one will want to live there. To this day Facebook feeds off the web. When the web is exhausted, maybe then Facebook will support linking in their discussion posts. ",
                    "created": "Tue, 11 Jul 2017 13:34:34 GMT"
                },
                {
                    "text": "I've tried over and over to get people <a href=\"http://www.goodreads.com/quotes/21810-it-is-difficult-to-get-a-man-to-understand-something\">inside</a> and outside of Facebook to understand why we need Facebook to relent, but I don't think they get it. This is one of those things you won't know you'll miss until it's too late. ",
                    "created": "Tue, 11 Jul 2017 13:30:16 GMT"
                },
                {
                    "text": "PS: Just four <a href=\"http://scripting.com/2016/04/30/1229.html\">features</a>: 1. Links. 2. Simple styling. 3. Enclosures for podcasting. 4. Titles. They already have the code written, they just have to deploy it for <a href=\"http://www.urbandictionary.com/define.php?term=peon\">regular users</a> like you, Scoble and me.",
                    "created": "Tue, 11 Jul 2017 13:49:22 GMT"
                }
            ]
        },
        {
            "text": "Why I prefer blogging on the open web",
            "created": "Tue, 11 Jul 2017 13:43:45 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "One of the reasons I prefer to blog here rather than on Facebook is that if I get an Aha! idea about a feature, over here I can implement it. On Facebook I'm just a user. That was/is one of the great things about the web. Anyone can develop features for it. On Facebook, just their employees can. No wonder it never moves.",
                    "created": "Tue, 11 Jul 2017 13:46:22 GMT",
                    "image": "http://scripting.com/images/2017/07/11/napster.png"
                },
                {
                    "text": "When a company dominates an activity, they tend to invest elsewhere. Seems kind of perverse, but that's why markets don't always evolve to fill every niche. Open platforms are more favorable. If you want to perform a new style of music in Central Park, you can. If you want to do it in Carnegie Hall or Lincoln Center, you need to get the approval of a lot of rich people.",
                    "created": "Tue, 11 Jul 2017 13:46:56 GMT"
                }
            ]
        },
        {
            "text": "China dominance, day 2",
            "created": "Tue, 11 Jul 2017 13:11:26 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "See yesterday's <a href=\"http://scripting.com/2017/07/10.html#a040748\">post</a> about Chinese dominance and how Americans might not like it.",
                    "created": "Tue, 11 Jul 2017 13:11:40 GMT"
                },
                {
                    "text": "Here's something truly <a href=\"https://www.vox.com/world/2017/7/11/15948598/china-russia-beijing-censorship-weibo-putin-xi-jinping-g20-criticism-trump\">bizarre</a> and totally on-topic. ",
                    "created": "Tue, 11 Jul 2017 13:12:37 GMT",
                    "subs": [
                        {
                            "text": "<i>While Xi and Putin were at the G20 conference over the weekend, bloggers on Sina Weibo with more than 1,000 followers discovered that they were no longer able to mention Putin in their posts.</i>",
                            "created": "Tue, 11 Jul 2017 13:14:33 GMT"
                        }
                    ]
                },
                {
                    "text": "One can imagine a <a href=\"http://www.politico.com/story/2017/07/01/trump-tweets-modern-day-presidential-240170\">modern-day</a> president ordering Twitter to block criticism of Trump, or even Putin. Technically if the Chinese Twitter can do it, why not the American Twitter.",
                    "created": "Tue, 11 Jul 2017 13:15:28 GMT"
                },
                {
                    "text": "China doesn't have a very high regard for free speech. And it's a good bet the Chinese don't have a very high regard for the 2nd Amendment either. ",
                    "created": "Tue, 11 Jul 2017 13:11:45 GMT",
                    "image": "http://scripting.com/images/2017/07/11/chairmanMeow.png"
                },
                {
                    "text": "If China is going to be the new world-dominant country, we should familiarize ourselves with how things might change for us personally. There probably is some good to it. For example, we'd be likely to get back on track re climate change. But we might not adapt so well to the Chinese citizen's lifestyle. ",
                    "created": "Tue, 11 Jul 2017 13:20:36 GMT"
                },
                {
                    "text": "BTW, this is another reason why it would be good to have a <a href=\"http://scripting.com/2017/07/10.html#a064914\">technically literate lawyer</a> blogging regularly. Tech permeates everything. ",
                    "created": "Tue, 11 Jul 2017 13:17:25 GMT"
                }
            ]
        }
    ]
}