{
    "text": "July 15",
    "created": "Sat, 15 Jul 2017 13:29:11 GMT",
    "name": "15",
    "subs": [
        {
            "text": "4PM Eastern: I moved the apps on an old server to a new server. If you notice something that stopped working around that time, post a note <a href=\"https://github.com/scripting/Scripting-News/issues/16\">here</a>. ",
            "created": "Sat, 15 Jul 2017 20:19:25 GMT",
            "type": "outline"
        },
        {
            "text": "7PM Eastern: I had to switch to a larger instance size. Hopefully that'll make things run more smoothly. As before if there continue to be problems please post a note <a href=\"https://github.com/scripting/Scripting-News/issues/16\">here</a>. ",
            "created": "Sat, 15 Jul 2017 23:28:29 GMT"
        },
        {
            "text": "Catching up on Game of Thrones",
            "created": "Sat, 15 Jul 2017 18:55:07 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Over the July 4 weekend I indulged in a lot of Game of Thrones. They were running the episodes back to back. I tuned in at various times, and got bits of all six seasons. Then, I filled in the blanks. I still have to watch a few episodes in Season 6. ",
                    "created": "Sat, 15 Jul 2017 18:55:15 GMT",
                    "image": "http://scripting.com/images/2017/07/15/joffrey.png"
                },
                {
                    "text": "The most illuminating episodes were in Season 1, esp near the end. If you watch Season 1, you'll hear the first mentions of a lot of characters and families whose names would have meant nothing to you the first time through. And the end of Season 1 is a basic primer on the logic of the titular game. Cersei and Ned do a demo with help from Kings Robert and Joffrey and the rest of the cast. ",
                    "created": "Sat, 15 Jul 2017 19:14:33 GMT"
                },
                {
                    "text": "Then there's the question of who is <s>my favorite</s> the best <a href=\"https://duckduckgo.com/?q=game+of+thrones+characters&t=hy&ia=web\">character</a>? There are so many great ones. Obviously all the main characters, Daenerys, Jon Snow, Cersei, Jamie, Tyrion, Sansa, Arya, Ned Stark, it's impossible to pick one. So it has to be a supporting character. If I had to choose a male and female, I'd go with <a href=\"https://en.wikipedia.org/wiki/Ramsay_Bolton\">Ramsay Bolton</a> and <a href=\"https://en.wikipedia.org/wiki/Ygritte\">Ygritte</a>, for opposite reasons. Ramsay is the purest of evil. So entertaining. You always want to know what he's up to now, even though you might have to avert your eyes. And Ygritte, because I am totally head over heels in love with her. I would love love love to hear her say <i>You know nothing Dave Winer. </i>:boom:",
                    "created": "Sat, 15 Jul 2017 18:58:51 GMT"
                }
            ]
        },
        {
            "text": "The word you're looking for is <i>traitor</i>",
            "created": "Sat, 15 Jul 2017 15:08:33 GMT",
            "type": "outline",
            "isComment": "false",
            "subs": [
                {
                    "text": "<a href=\"https://en.wikipedia.org/wiki/Treason\">Treason</a> probably isn't the right word. Legally it only applies when we're at war. If Trump had aided the Taliban in their fight against the US, that would be treason. If he helped ISIS plan an attack, that would be treason. If he gave North Korea a map of safe hiding places for government officials, that might not actually be treason because we're not currently at war, but there's no doubt it's a betrayal of the country. ",
                    "created": "Sat, 15 Jul 2017 15:16:57 GMT",
                    "image": "http://images.scripting.com/archiveScriptingCom/2005/02/21/charlesFoot.gif"
                },
                {
                    "text": "The word everyone's looking for is <a href=\"http://thesaurus.land/?word=traitor\">traitor</a>, which is derived from <a href=\"https://duckduckgo.com/?q=define+traitor&t=hq&ia=definition\">betray</a>. By accepting help from Russia to win the election, he betrayed us. He upped the betrayal by accepting the office, knowing that Russia had control over him.",
                    "created": "Sat, 15 Jul 2017 15:08:58 GMT"
                },
                {
                    "text": "You say there's no proof? I have two answers:",
                    "created": "Sat, 15 Jul 2017 15:12:02 GMT",
                    "flNumberedSubs": "true",
                    "subs": [
                        {
                            "text": "I am a member of <a href=\"http://scripting.com/2017/07/14.html#a112705\">Occam's Church of Political Analysis</a>. Our motto: \"It is what it appears to be until proven otherwise.\"",
                            "created": "Sat, 15 Jul 2017 15:12:21 GMT"
                        },
                        {
                            "text": "Just wait, the proof is coming. I'm pretty sure you, if you're paying attention at all, know it as well. ",
                            "created": "Sat, 15 Jul 2017 15:12:56 GMT"
                        }
                    ]
                }
            ]
        },
        {
            "text": "Ghost != Medium",
            "created": "Sat, 15 Jul 2017 13:29:12 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "John Gruber <a href=\"https://twitter.com/gruber/status/885919537627103232\">started a thread</a> on Twitter lamenting that Medium is going down a predictable path. To which <a href=\"https://twitter.com/davewiner/status/885920061919199235\">I responded</a>, it's time for a Medium without a business model. A place for people to quickly write a document that stands alone on the open web, and has a chance at longevity, to be part of the record for a long time to come. ",
                    "created": "Sat, 15 Jul 2017 13:29:26 GMT",
                    "image": "http://scripting.com/images/2017/07/15/legalPad.png"
                },
                {
                    "text": "Predictably, I wrote a <a href=\"http://scripting.com/2017/07/14.html#a033947\">post</a> about it. ",
                    "created": "Sat, 15 Jul 2017 13:30:40 GMT",
                    "xref": "http://scripting.com/2017/07/14.html#a033947"
                },
                {
                    "text": "And also predictable, people who love <a href=\"https://github.com/TryGhost/Ghost\">Ghost</a> say that Ghost already does this. To which I predictably say, Ghost is a nice product, for sure, but if it did what Medium does, people would use it for what they use Medium for, and they don't.",
                    "created": "Sat, 15 Jul 2017 14:12:54 GMT"
                },
                {
                    "text": "Think about Medium this way. It's a big public <a href=\"https://duckduckgo.com/?q=%22legal+pad%22&t=hq&ia=web\">legal pad</a>. In a perfect world, no one owns the pad. When you want to write something you tear off a sheet, write, when you're done you tack it up to a global bulletin board where everyone can see it. Search engines can add it to their indices. People can find it. Forever. You can put something on the record, without having to \"start\" a blog. This has a different feel from starting a blog, which to many people feels like a committment to write regularly, an obligation. This is for the one-off, I have to say something now, post. It has a place in the world of public writing. Ghost is not such a place, and neither is WordPress.  ",
                    "created": "Sat, 15 Jul 2017 13:31:39 GMT"
                },
                {
                    "text": "I've long felt that tying a business model to a global writing pad inevitably leads to it becoming something else. And eventually to the writing disappearing from the web. It is not a plan for long-lived writing, something I feel we should have. Urgently, because every day we don't do it is a day that may be lost to history. ",
                    "created": "Sat, 15 Jul 2017 13:35:52 GMT"
                },
                {
                    "text": "At this point it would be predictable for someone to ask if I know about <a href=\"https://archive.org/\">archive.org</a>. Yes I do. It also is not Medium. :boom:",
                    "created": "Sat, 15 Jul 2017 13:37:06 GMT"
                }
            ]
        }
    ]
}