{
    "text": "July 18",
    "created": "Tue, 18 Jul 2017 13:40:29 GMT",
    "name": "18",
    "subs": [
        {
            "text": "Welcome to the <a href=\"https://www.youtube.com/watch?v=ogHtl6UFSSI\">camp</a>, I guess you all know why we're here.",
            "created": "Tue, 18 Jul 2017 13:40:30 GMT",
            "type": "outline"
        },
        {
            "text": "Here's the official <a href=\"http://scripting.com/index.json\">JSON source code</a> for Scripting News. It's the output of my editor, in JSON form. It's totally analogous to programming in a high level language. I write in a form that makes sense for me as a writer. The software transforms that into <a href=\"http://scripting.com/\">something</a> easy for people to read. Of course this file is maintained as I publish new stuff to the blog. Knock wood, praise Murphy, I am not a lawyer. :boom:",
            "created": "Tue, 18 Jul 2017 13:40:43 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/07/18/pointBottleCap.png"
        },
        {
            "text": "There's all this wisdom out there that isn't being heard. ",
            "created": "Tue, 18 Jul 2017 15:33:34 GMT",
            "type": "outline"
        },
        {
            "text": "I'm starting a project with my friend <a href=\"https://twitter.com/R?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor\">Rex Hammock</a> relating to this blog. When you see a #rex tag  that means I wanted to call his attention to the item because it relates to something we're discussing. ",
            "created": "Tue, 18 Jul 2017 16:26:31 GMT",
            "type": "outline"
        },
        {
            "text": "Seeking common cause with opposing tribes",
            "created": "Tue, 18 Jul 2017 13:51:45 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "For the sake of argument, suppose Ann Coulter did something good. It's not debatable. Suppose she was wronged and protested and you heard about it on the Internet. Could you say \"Hey Ann Coulter did something good?\" Or would tribalism prevent you from doing so?",
                    "created": "Tue, 18 Jul 2017 13:51:50 GMT",
                    "image": "http://scripting.com/images/2017/07/18/leinenkugel.png"
                },
                {
                    "text": "By tribalism I mean, she's the member of a different tribe. You disagree with her on most issues, in fact up until today you disagreed on <i>all</i> issues. Further could your friends tell the difference between you saying \"Hey Coulter was right about this\" and \"Hey Coulter is right about everything.\" (There <i>is</i> a difference you know.)",
                    "created": "Tue, 18 Jul 2017 13:52:55 GMT"
                },
                {
                    "text": "I usually don't like moral parades. That's a lot of what Facebook and Twitter have become. My tribe is having a parade. I will memorize and rehearse the talking points and spew them out when called upon to do so. I will show that I am a member of this tribe in full standing. I will never think for myself, I let the tribe do my thinking for me. ",
                    "created": "Tue, 18 Jul 2017 13:53:51 GMT"
                },
                {
                    "text": "If we're ever going to dig out of the hole we're in, it will eventually be seen as a good thing to find <a href=\"https://www.merriam-webster.com/dictionary/make/find%20common%20cause\">common cause</a> with someone from a different tribe. I was happy to say I support <a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+%22david+frum%22&t=hq&ia=web\">David Frum</a>, even though he <a href=\"https://en.wikipedia.org/wiki/David_Frum#White_House\">wrote speeches</a> for Bush II that led to the deaths of huge numbers of innocent people. A wrong war. Huge corruption. But he and I agree on Trump, and I'm happy to say that, because we need to work together to get out of this mess. I look forward to the day when I can think of Frum as the opposition. Right now, re Trump, we're on the same side. ",
                    "created": "Tue, 18 Jul 2017 13:55:19 GMT"
                },
                {
                    "text": "And like Ann Coulter I got bumped from a seat I paid for, on Delta, and moved into a middle seat for a long cross-country trip, without any other explanation than \"We can do it, read your ticket.\" I suspect this is because the company's policies make this a common occurrence for the people working there. I understand. What I don't understand and totally object to is a rep of a big company <a href=\"https://twitter.com/Delta/status/886714198880866305?ref_src=twsrc%5Etfw&ref_url=http%3A%2F%2Fwww.huffingtonpost.com%2Fentry%2Fdelta-ann-coulter-response_us_596c2515e4b03389bb18727b\">personally lecturing</a> a customer. Many years ago I found out one of my employees was doing this. He got a really stiff lecture <i>from me</i> about how we revere our customers, and I pay him to <i>serve</i> them, not to lecture them. ",
                    "created": "Tue, 18 Jul 2017 13:57:10 GMT"
                },
                {
                    "text": "Ann Coulter was right to be pissed off, even though she's on the other team. And I am happy to say so. And I am also happy to unfriend members of my tribe who lecture me on proper piety. I look for opportunities to erase tribalism and think for myself and encourage others to do so. Ultimately that's what I think the Internet is useful for.",
                    "created": "Tue, 18 Jul 2017 14:05:59 GMT"
                }
            ]
        }
    ]
}