{
    "text": "July 21",
    "created": "Fri, 21 Jul 2017 11:05:15 GMT",
    "name": "21",
    "subs": [
        {
            "text": "Special story: <a href=\"http://scripting.com/2017/07/21/musicalPodcastsFrom2005.html\">Musical podcasts of 2005</a>.",
            "created": "Fri, 21 Jul 2017 21:57:10 GMT",
            "type": "outline"
        },
        {
            "text": "A magazine is doing a profile of me re the beginnings of podcasting in 2003-2005. They asked for stories of goofs, or the first time something weird happened on a podcast. If you were listening back at the beginning, the podcasts from the DNC in 2003, or a BloggerCon, or one of the casts from my cross-country driving in 2004, please leave a note <a href=\"https://github.com/scripting/Scripting-News/issues/17\">here</a> with any stories you remember. ",
            "created": "Fri, 21 Jul 2017 14:18:41 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/07/21/basketball.png"
        },
        {
            "text": "Here's the original <a href=\"http://scripting.com/morningCoffeeNotes/\">Morning Coffee Notes</a> podcast page. ",
            "created": "Fri, 21 Jul 2017 15:19:34 GMT",
            "type": "outline"
        },
        {
            "text": "I've skipped Rachel Maddow for the last three nights. It's no longer interesting to me. We're looping around and around. It's the same story. Trump was and is in the money laundering business. They operate in the open, just lie about it. No coincidence the same people in the June 2016 meeting are turning out to have relationships with Trump and his team as well as Putin and his. They're all part of the same effort. Trump is so happy to meet Putin and hang with him because he's the boss's boss's boss. We can all see Trump is both crazy and subordinate to Putin. The only story left to tell here is when are the Repubs going to do something about it. ",
            "created": "Fri, 21 Jul 2017 17:49:12 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/06/20/porky.png"
        },
        {
            "text": "An interesting side-effect of all the Russian-Trump michegas is that the Russian actors in US politics are getting exhaustively <a href=\"http://www.reuters.com/article/us-usa-trump-russia-lawyer-exclusive-idUSKBN1A61LZ?feedType=RSS&feedName=topNews&utm_source=twitter&utm_medium=Social\">examined</a> by the US press. They probably don't like the exposure. Makes it harder for them to do what they do. ",
            "created": "Fri, 21 Jul 2017 14:00:31 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/888342305664634881\">Tweet</a>: A few years ago in Berkeley I had a public argument with <a href=\"http://scripting.com/stories/2009/03/17/ifYouDontLikeTheNews.html\">Lowell Bergman</a>. I said <a href=\"https://twitter.com/Fusion/status/888341563121815553\">judges</a> would blog, an idea the famous journalist laughed at. The <a href=\"https://twitter.com/davewiner/status/888342698951946241\">point</a> being that people who have climbed to the top of a ladder, the people we respect the most, usually miss new ladders being erected.",
            "created": "Fri, 21 Jul 2017 13:36:31 GMT",
            "type": "outline"
        },
        {
            "text": "President Trump didn't get his way on health care, not that he had any idea what he wanted, so he threatened to \"let ObamaCare die.\" Of course the Repubs can <i>make</i> it die, and there's a pretty good chance that's what they're doing. That's really fucked up. What's next. He wants something so he threatens to launch the nukes? A president who tries hostage-taking once will do it again. ",
            "created": "Fri, 21 Jul 2017 11:30:35 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/07/21/trumpHead.png"
        },
        {
            "text": "The movie industry should solve this problem",
            "created": "Fri, 21 Jul 2017 11:07:23 GMT",
            "type": "outline",
            "flNumberedSubs": "true",
            "subs": [
                {
                    "text": "The movie industry should invest in a simple ad-free <i>fast</i> showtime listings site where you can find out wtf is playing when near you.",
                    "created": "Fri, 21 Jul 2017 11:05:16 GMT",
                    "image": "http://scripting.com/images/2017/07/21/beetlejuice.png"
                },
                {
                    "text": "Google used to have the perfect movie listings site, but they shut it down. Here's what <a href=\"https://www.google.com/movies/about/\">Google says</a>: \"You can now discover showtimes on the search results page by searching for the name of the movie you want to see or try searching for the word 'movies' to discover what’s in theaters.\" ",
                    "created": "Fri, 21 Jul 2017 11:07:31 GMT"
                },
                {
                    "text": "For the first part, I used Google Movies to find out what was available, so I might not know what movie I want to see. But today I know what movie I want to see:  Dunkirk. So how do I search for all theaters in Manhattan that are showing that movie, and the showtimes, and the address of the theater. That used to be one click in Google Movies. ",
                    "created": "Fri, 21 Jul 2017 11:08:15 GMT"
                },
                {
                    "text": "To the other half of their advice, when I type \"movies\" into the search engine, I get Fandango. Fandango is a piece of shit. Impossible to get the info you need, and it's incredibly slow. There must be a money-making reason for it. It makes it hard to find a movie in a theater to watch. To just daydream about what's available. Sometimes I used to go to a movie just because there was nothing else that interested me. I never do that anymore because they make it so hard to scan the listings. This, from an industry who feels imperiled by Netflix and piracy. Please. How much could it cost to solve this problem? How much revenue would it generate?",
                    "created": "Fri, 21 Jul 2017 11:08:36 GMT"
                },
                {
                    "text": "When I was a kid, New York Mag had a great movie listings section. So this is an example where the print era provided better info than the age of the Internet. That's just wrong. The bits cost nothing. The data is certainly available. Why don't they just solve the problem. ",
                    "created": "Fri, 21 Jul 2017 11:14:29 GMT"
                }
            ]
        },
        {
            "text": "If you're feeling down there's nothing like a little Wayne's World",
            "created": "Fri, 21 Jul 2017 20:22:23 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/EtP7mDt9L7g\" frameborder=\"0\" allowfullscreen></iframe>",
                    "created": "Fri, 21 Jul 2017 20:22:46 GMT"
                }
            ]
        }
    ]
}