{
    "text": "July 26",
    "created": "Wed, 26 Jul 2017 13:43:39 GMT",
    "name": "26",
    "subs": [
        {
            "text": "Looking forward to a quiet summer day in NYC.",
            "created": "Wed, 26 Jul 2017 13:43:40 GMT",
            "type": "outline"
        },
        {
            "text": "A reporter is trying to squeeze an oral history out of me re podcasting in 2003-04. I'm driving her crazy. Wish they had a reporter covering us 14 years ago while it was happening! ",
            "created": "Thu, 27 Jul 2017 02:26:47 GMT",
            "type": "outline"
        },
        {
            "text": "I'm doing some work with <a href=\"https://github.com/foreverjs/forever\">forever</a>, the utility that keeps a set of Node apps running. I want to be able to get a list of the running processes from within an app that builds on <a href=\"https://github.com/foreverjs/forever-monitor\">forever-monitor</a>, which is forever's core functionality. Here's the <a href=\"https://github.com/foreverjs/forever-monitor/issues/149\">question</a> I asked. Any help much appreciated. ;-) ",
            "created": "Wed, 26 Jul 2017 21:37:11 GMT",
            "type": "outline"
        },
        {
            "text": "I picked up a CitiBike this afternoon and it wasn't properly docked. I could have taken it home and no one would have known. I imagine the poor person who thought they docked it was wondering what would happen. Would they end up owning the bike? No worries, I docked the bike for them, after taking it to my destination. Everyone wins. I got a free ride. Well I would have gotten a free ride anyway, because I have an unlimited card. But I still feel like I won! :cop:",
            "created": "Wed, 26 Jul 2017 21:42:15 GMT",
            "type": "outline",
            "image": "http:///scripting.com/images/2017/07/26/citibike.png"
        },
        {
            "text": "#rex tells me that CitiBike has GPS built-in. How does that work. Is it always broadcasting its position back to the home office? Also there's a new <a href=\"http://www.ny1.com/nyc/all-boroughs/news/2017/07/25/could-dockless-bike-share-rival-be-coming-to-nyc-.html\">dockless bike sharing</a> program coming to NYC, to compete with CitiBike. Competition is good! ",
            "created": "Wed, 26 Jul 2017 23:15:25 GMT"
        },
        {
            "text": "Trump will say he was just making a joke about transgender people serving in the military. ",
            "created": "Wed, 26 Jul 2017 18:31:59 GMT",
            "type": "outline"
        },
        {
            "text": "An August 2003 <a href=\"http://scripting.com/2003/08/22.html\">post</a> about how Chris Lydon covered a Howard Dean campaign event in Manchester, NH. A confluence of politics, journalism, podcasting and a technology that was nothing more than a vision, and <i>all of it ended up mattering. </i> It doesn't often work out that way. ",
            "created": "Wed, 26 Jul 2017 15:30:59 GMT",
            "type": "outline"
        },
        {
            "text": "Betsy Devine <a href=\"http://betsydevine.com/blog/2003/08/20/tonight-i-met-howard-dean-stars-in-my-eyes/\">blogged</a> the event which happened on August 20.",
            "created": "Wed, 26 Jul 2017 15:54:13 GMT",
            "type": "outline"
        },
        {
            "text": "The <a href=\"http://blogs.law.harvard.edu/bloggerCon/\">BloggerCon blog</a> at Harvard seems to be gone. Pictures from the NH field trips were there (pointed to from Betsy's blog). Archive.org <a href=\"http://web.archive.org/web/20031002232528/http://blogs.law.harvard.edu/bloggerCon/picsEdwardsDeanNH\">has</a> the page, but many of the pictures are missing. But the pictures themselves are <a href=\"https://cyber.harvard.edu/blogs/static/bloggerCon/\">preserved</a>. The ones of the campaign events begin with DSC. However I thought all the original blogs at Harvard were preserved? This is not a good sign. There was a fair amount of history preserved there. It was an academic project, so it's not cool that our work is gone. ",
            "created": "Wed, 26 Jul 2017 16:03:46 GMT",
            "type": "outline",
            "image": "http:///scripting.com/images/2017/07/26/veritas.png"
        },
        {
            "text": "BTW, if you were part of the Berkman Thursday group, what became of you? I created a <a href=\"http://this.how/berkman/\">page</a> where you can check in. Don't be shy! (You can send me an email if you want to be private, address is on that page.)",
            "created": "Wed, 26 Jul 2017 16:05:05 GMT",
            "type": "outline"
        },
        {
            "text": "Billionaires bought the govt and their big idea was that they should get more money.",
            "created": "Wed, 26 Jul 2017 15:35:49 GMT",
            "type": "tweet",
            "tweetId": "890234701599920129",
            "tweetUserName": "davewiner"
        }
    ]
}