{
    "text": "July 28",
    "created": "Fri, 28 Jul 2017 11:52:51 GMT",
    "name": "28",
    "subs": [
        {
            "text": "The first Mac release of \"Instant Dave\" is out. Put it in your dock and leave it open and you get the latest news from my linkblog and posts from Scripting News, in an instant, as you would imagine from its name. v0.4.4.  ",
            "created": "Fri, 28 Jul 2017 21:01:44 GMT",
            "type": "outline"
        },
        {
            "text": "And there's a <a href=\"http:///scripting.com/images/2017/07/28/bug.png\">bug</a>. We're not expanding glossary entries. There will be many bugs. And lots of features to add. This is just the beginning. ",
            "created": "Fri, 28 Jul 2017 21:05:44 GMT",
            "type": "outline"
        },
        {
            "text": "Hey here's a free clue -- what you're seeing on TV is a TV show.",
            "created": "Fri, 28 Jul 2017 15:27:02 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/realDonaldTrump/status/891038014314598400"
        },
        {
            "text": "I really think Twitter's future is as an AWS-like module. Add storage to their API, and run our apps in the cloud. We all need what they have. For some reason Amazon hasn't built it. ",
            "created": "Fri, 28 Jul 2017 15:38:29 GMT",
            "type": "outline"
        },
        {
            "text": "Here's a <a href=\"http://scripting.com/images/2017/07/28/instantDaveScreenShot1.png\">screen shot</a> of my next product. It's half blog and half software.",
            "created": "Fri, 28 Jul 2017 15:30:15 GMT",
            "type": "outline"
        },
        {
            "text": "I've been reading archives of \"Scripting News\" from the early-mid 00's to get an idea of how I was using the format that now I'm once again using. Tripped over <a href=\"http://scripting.com/2006/09.html#myTwoCentsOnPodcast\">this post</a> where I say <i>podcast</i> is a good name for what we're doing. It's actually a good piece and should be part of the record of the evolution of podcasting. ",
            "created": "Fri, 28 Jul 2017 12:25:59 GMT",
            "type": "outline"
        },
        {
            "text": "ObamaCare lives",
            "created": "Fri, 28 Jul 2017 11:52:52 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Went to sleep last night not knowing if the Repubs would manage to cut down ObamaCare. Woke up at 4AM Eastern, checked the news, whew, <a href=\"http://nymag.com/daily/intelligencer/2017/07/gop-health-care-drive-ends-not-with-a-bang-but-a-whimper.html?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed:+nymag/intelligencer+(Daily+Intelligencer+-+New+York+Magazine)\">they didn't</a> thanks to a third Repub <i>no</i> vote from John McCain. ",
                    "created": "Fri, 28 Jul 2017 11:53:04 GMT",
                    "image": "http://scripting.com/2016/07/19/sadRepublicanPresident.png"
                },
                {
                    "text": "A few comments:",
                    "created": "Fri, 28 Jul 2017 11:54:18 GMT",
                    "flNumberedSubs": "true",
                    "subs": [
                        {
                            "text": "The Repubs in the House were <a href=\"http://www.politico.com/story/2017/07/27/house-members-directed-to-delay-recess-departure-for-obamacare-repeal-241045\">standing by</a> to ratify the bill the Senate passed and the president no doubt would have been happy to sign. So if this was for-real and not theater, it could have been <i>reallllly</i> bad.",
                            "created": "Fri, 28 Jul 2017 11:54:27 GMT"
                        },
                        {
                            "text": "McCain isn't going to run for re-election in 2022. He's 80 with bad cancer. So the usual thing that makes Repubs follow the leadership don't apply. He could afford to be a maverick, where his mavericky buddies Lindsey Graham, Rand Paul et al are planning to run again, maybe even for higher office, and will need support from Republican billionaire Russian backers.",
                            "created": "Fri, 28 Jul 2017 11:54:57 GMT"
                        },
                        {
                            "text": "This could all have been theater, to some extent it certainly was. McConnell and Ryan are not idiots. They understood what would happen if this crazy bullshit became law. Chaos. Real Americans dying. Lots of them. And it's hard to see how they would avoid being blamed for it. So if you need an out, but want to make it look like you tried, you get three independent Repubs to take the fall, in return for some future favor, and act all pouty like \"What a mess, we tried, we really did, now let's go sailing and camping and on wine tasting tours.\"",
                            "created": "Fri, 28 Jul 2017 11:57:05 GMT"
                        },
                        {
                            "text": "Was Trump in on the scamming? No way. They rolled him. And loved doing it. :boom:",
                            "created": "Fri, 28 Jul 2017 12:14:35 GMT"
                        }
                    ]
                }
            ]
        }
    ]
}