{
    "text": "July 30",
    "created": "Sun, 30 Jul 2017 14:00:45 GMT",
    "name": "30",
    "subs": [
        {
            "text": "Why Al Gore <a href=\"https://twitter.com/nowthisnews/status/891275390659854337\">doesn't</a> use the words \"climate change.\"",
            "created": "Sun, 30 Jul 2017 14:15:29 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/nowthisnews/status/891275390659854337"
        },
        {
            "text": "We need a whole other thread of journalism not focused on the drip-drip, but rather projecting a few months ahead based on history.",
            "created": "Sun, 30 Jul 2017 14:58:37 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/891673914195283968"
        },
        {
            "text": "There was a time not long ago when I didn't know the name of the White House chief of staff.",
            "created": "Sun, 30 Jul 2017 14:57:41 GMT",
            "type": "outline"
        },
        {
            "text": "I record my podcasts using the free <a href=\"https://support.apple.com/en-us/HT206775\">Voice Memo</a> app on my iPhone. It has the advantage of being with me almost all the time. It's kind of like the best camera is the one you have with you when you want to take a picture. ",
            "created": "Sun, 30 Jul 2017 14:18:59 GMT",
            "type": "outline"
        },
        {
            "text": "What Jeff Jarvis <a href=\"https://twitter.com/jeffjarvis/status/891804687783129088\">says</a> is true. Competing threads on Twitter, we can do so much better with blogs. ",
            "created": "Sun, 30 Jul 2017 23:39:41 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/jeffjarvis/status/891804687783129088"
        },
        {
            "text": "We need a CrunchBase for political news",
            "created": "Sun, 30 Jul 2017 14:00:46 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I've been saying for a while we need the equivalent of a mob chart for the Russian connections with the Trump Crime Family. I suspect when the story reaches equilibrium, i.e. no more major characters added to the plot, it'll turn out that TCF and the Russian Mob are one and the same. But who knows. ",
                    "created": "Sun, 30 Jul 2017 14:00:56 GMT",
                    "image": "http:///scripting.com/images/2017/07/30/dominos.png"
                },
                {
                    "text": "When <a href=\"https://techcrunch.com/\">TechCrunch</a> reached a certain point they needed to create a permanent resource called <a href=\"https://crunchbase.com/\">CrunchBase</a>, one page per company with the date founded, sources of capital, products, founders, and when they were acquired, for how much, or went public. We need that for the Trumps. Different stats, like when they first met with the Russian ambassador, testified before Congress, were indicted, convicted, committed suicide or were murdered, etc. ",
                    "created": "Sun, 30 Jul 2017 14:05:17 GMT"
                }
            ]
        }
    ]
}