{
    "text": "July 31",
    "created": "Mon, 31 Jul 2017 13:04:25 GMT",
    "name": "31",
    "subs": [
        {
            "text": "Good morning sports fans!! :baseball:",
            "created": "Mon, 31 Jul 2017 13:04:26 GMT",
            "type": "outline"
        },
        {
            "text": "Many of us have been waiting for a Republican in Congress to take responsibility. The wait is <a href=\"http://www.politico.com/magazine/story/2017/07/31/my-party-is-in-denial-about-donald-trump-215442\">over</a>. \"Too often, we observe the unfolding drama along with the rest of the country, passively, all but saying, <i>'Someone should do something!'</i> without seeming to realize that that someone is us,\" wrote Jeff Flake, Republican senator from Arizona.",
            "created": "Mon, 31 Jul 2017 23:45:03 GMT",
            "type": "outline"
        },
        {
            "text": "I went for a bike ride and when I came back <a href=\"http://talkingpointsmemo.com/livewire/nyt-reports-trump-ousts-scaramucci\">Scaramooch</a> was gone.",
            "created": "Mon, 31 Jul 2017 19:33:29 GMT",
            "type": "outline"
        },
        {
            "text": "What was it that did <a href=\"https://twitter.com/davewiner/status/892107673004421120\">Scaramooch</a> in? ",
            "created": "Mon, 31 Jul 2017 19:42:21 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/892107673004421120"
        },
        {
            "text": "New software. If you're a daily reader of this blog you should get <a href=\"http://instantdave.com/\">Instant Dave</a> and leave it running on your Mac desktop. You get <i>instant</i> notification when anything is posted to the blog. I want to evolve this. It might be instrumental in a reboot of blogging in the age of Facebook. But first we need users. Help the bootstrap get started. Be part of the second blogging revolution! ",
            "created": "Mon, 31 Jul 2017 13:25:09 GMT",
            "type": "outline",
            "image": "http:///scripting.com/images/2017/07/31/dietPepsi.png"
        },
        {
            "text": "I'm going to miss Game of Thrones when it's over",
            "created": "Mon, 31 Jul 2017 13:06:06 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "In the meantime, last night's episode was delicious. Great stuff. And there are spoilers galore following so if you're a neophyte avert your eyes.",
                    "created": "Mon, 31 Jul 2017 13:06:16 GMT",
                    "image": "http:///scripting.com/images/2017/07/31/jonSnowActionFigure.png"
                },
                {
                    "text": "I've gotten in the habit of watching two hours of GoT on Sunday night. First I watch the previous episode a second time at 8PM and then the new one at 9PM. The 8PM show was not quite as awful as I remembered. Lots of speeches as characters who had never met explain themselves. The writing was awful, stiff and unnecessary. ",
                    "created": "Mon, 31 Jul 2017 13:06:47 GMT"
                },
                {
                    "text": "But this week, they skip a lot of steps as I wish they had with the previous episode and right at the beginning <a href=\"https://en.wikipedia.org/wiki/Daenerys_Targaryen\">Mother of Dragons</a> meets <a href=\"https://en.wikipedia.org/wiki/Jon_Snow_(character)\">Jon Snow</a> and <i>they are great</i> together. Something like <a href=\"http://knowyourmeme.com/memes/you-know-nothing-jon-snow\">Ygritte</a> and Jon Snow. Real chemistry. All of a sudden Daenerys Stormborn has met her match. I was totally afraid Jon Snow was going to bend the knee, but a guy who's been resurrected probably thinks about these things differently. :angel:",
                    "created": "Mon, 31 Jul 2017 13:08:21 GMT"
                },
                {
                    "text": "There's one moment where Khaleesi dismisses him, and I could hear the voice of Ygritte. Jon Snow get on with it, is not too far from Jon Snow you know nothing. It had an erotic feel. At that moment I almost tweeted a question, do you think they'll be in bed before the end of this episode or the next? Or will the season end with them in bed. And what about the moment when they realize that the Queen of the Seven Kingdoms is really Jon Snow's auntie. Haha. They're going to do this well. They're not going to blow it. This is the moment we're all waiting for. Don't. Blow. It.",
                    "created": "Mon, 31 Jul 2017 13:10:02 GMT"
                },
                {
                    "text": "I'm sure I'll think of more stuff to say over the course of the day. ",
                    "created": "Mon, 31 Jul 2017 13:12:32 GMT"
                },
                {
                    "text": "PS: The Guardian has a good <a href=\"https://www.theguardian.com/tv-and-radio/2017/jul/31/game-of-thrones-at-last-gives-us-all-the-moments-weve-most-been-waiting-for\">writeup</a>.",
                    "created": "Mon, 31 Jul 2017 13:48:20 GMT"
                }
            ]
        },
        {
            "text": "You should blog about it",
            "created": "Mon, 31 Jul 2017 13:17:28 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "<img src=\"http:///scripting.com/images/2017/07/31/blogaboutit.png\" width=\"268\" height=\"227\" style=\"border: 1px solid silver;\" alt=\"A picture named blogaboutit.png\">",
                    "created": "Mon, 31 Jul 2017 13:17:32 GMT"
                }
            ]
        }
    ]
}