{
    "text": "We won!",
    "created": "Wed, 07 Nov 2018 14:27:34 GMT",
    "type": "outline",
    "description": "I don't know what a 'wave election' is and I don't care. I just care that we came back from the edge yesterday and decided as a country to fight. That's as much good news as I could have hoped for, a very good outcome. ",
    "subs": [
        {
            "text": "The top line of the news re yesterday's <a href=\"https://www.vox.com/midterm-elections/2018/11/7/18070802/midterm-elections-results-2018-republicans-losses-trump-house-democrats-majority\">election</a> in the US is that we won. The Constitution won. The US gets another chance. We don't get flushed down the autocracy  toilet, at least not yet. Now here are some bullet points.    ",
            "created": "Wed, 07 Nov 2018 14:27:37 GMT",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "A lot of people who voted for Trump in 2016 voted for a Democrat this year to represent them in the House. The entire House was up for election, so the results indicate the choice of all of America. Only 34 Senate seats were contested, and the nature of the Senate, where tiny North Dakota gets as much representation as California or New York, doesn't tell you so much about the collective mind of the people. And in the Senate the Dems were on the defense, Repubs on offense. What we can see from the results of this election is that if the mood of the electorate is constant, the Repubs will have a much harder time retaining control in 2020. And Trump, if he chooses to run again, will have a much harder time winning in 2020 than he did in 2016. ",
                    "created": "Wed, 07 Nov 2018 14:28:37 GMT",
                    "image": "http://scripting.com/images/2018/11/07/weWon.png"
                },
                {
                    "text": "Journalists are reporting that Congress is divided now like the rest of the country. That's such bullshit. As if the government was designed to be controlled by one party with the Congress subservient to the executive branch. What they call \"division\" is actually democracy. We all get a voice in governing. In 2017 and 2018, the majority of the electorate was shut out of governing. We had no say. As a result the Repubs have run wild with corruption and really stupid decisions (heard of climate change, the Repubs don't believe in it, for example). Now we return to the normal process of governing, where one faction doesn't control the whole thing, and if we want to move, we have to compromise. Yes, that's been rare in the last decade, but a logjam is preferable to one party running rampant. ",
                    "created": "Wed, 07 Nov 2018 14:30:57 GMT"
                },
                {
                    "text": "Imagine if it had gone the other way, and the Repubs had retained control of the House. Imagine the demons that would have been unleashed by that.",
                    "created": "Wed, 07 Nov 2018 14:33:31 GMT"
                },
                {
                    "text": "Oversight. I heard a reporter on NPR say that now there will be \"more oversight.\" I suppose technically that's true, but it doesn't really capture the essence. We're going from zero oversight to hopefully intelligent oversight. Imagine the Mafia taking over the government and the police and you have an idea of what the last two years have been like. Now we have a way of looking into the crimes of the Trumps, maybe because they know they'll be exposed they'll be a little less bold? Either way we'll get some ability to see behind the bullshit now. ",
                    "created": "Wed, 07 Nov 2018 14:34:08 GMT"
                },
                {
                    "text": "Who will lead the oversight? Very capable people. My own rep, Jerry Nadler will be chairman of the <a href=\"https://judiciary.house.gov/\">Judiciary</a> committee. Elijah Cummings will chair the <a href=\"https://oversight.house.gov/\">Oversight</a> committee. <a href=\"https://intelligence.house.gov/\">Adam Schiff</a> on Intelligence and Maxine Waters on <a href=\"https://financialservices.house.gov/\">Financial Services</a>.  All are a vast improvement over the hacks the Repubs put in those jobs. And I say that without a hint of partisanship. If any of the Repubs had had the courage to actually do their jobs in the last Congress, I would be singing their praises and the country wouldn't be in such a deep hole. ",
                    "created": "Wed, 07 Nov 2018 14:44:39 GMT"
                },
                {
                    "text": "Most important -- the American people are not fascists. Yes there are some who hate Jews and people of color and Muslims and gays and people who don't think like them. Too many. But the majority of Americans are good, and eventually saw through all the confusion the Repubs throw at the process. I expect that more will see it that way in the coming years. ",
                    "created": "Wed, 07 Nov 2018 14:36:15 GMT"
                },
                {
                    "text": "I don't know what a \"wave election\" is and I don't care. I just care that we came back from the edge yesterday and decided as a country to fight. That's as much good news as I could have hoped for, a very good outcome. ",
                    "created": "Wed, 07 Nov 2018 14:37:43 GMT"
                }
            ]
        },
        {
            "text": "Disclaimer: I am not a Democrat or Republican. I voted Republican until 2004, when I saw where they were taking us and I became a committed member of the resistance. I couldn't believe we re-elected Bush. And all the events that followed. I could vote Republican again, or even better would love to be part of a new party formed with people who may disagree on all kinds of policy issues, but agree on regular order and the sanctity of the vote and the rule of law. A party that would never try to suppress people's vote, or create misery to try to win elections. A party with real respect for the people. From there we can debate and compromise, win some, lose some, and live our lives with respect for each other. ",
            "created": "Wed, 07 Nov 2018 14:53:13 GMT"
        }
    ]
}