{
    "created": "2024-08-06T04:00:00.000Z",
    "flInCalendar": true,
    "name": "06",
    "path": "2024/08/06",
    "text": "August 06",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Walz is Harris' choice. Picking Shapiro would have been leading with her chin because of Netanyahu. Walz looks older than her but they're actually the same age. And he figured out the right word to get under Trump's skin, so there's that. He just has to say <a href=\"https://www.merriam-webster.com/dictionary/weird\">weird</a> in campaign speeches to bring down the house.",
            "created": "Tue, 06 Aug 2024 14:03:40 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Roadmap for the campaign",
            "created": "Tue, 06 Aug 2024 14:13:12 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "A roadmap for the campaign is coming into view.",
                    "created": "Tue, 06 Aug 2024 14:13:20 GMT",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "Harris has her knee on Trump's neck, and she won't let up. ",
                            "created": "Tue, 06 Aug 2024 14:04:59 GMT",
                            "type": "outline",
                            "flInCalendar": true
                        },
                        {
                            "text": "There won't be time for anyone to get tired of her. ",
                            "created": "Tue, 06 Aug 2024 14:13:37 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Their rallies are going to be the best in a very long time. They're executing perfectly. ",
                            "created": "Wed, 07 Aug 2024 00:24:47 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Trump is a comedian, a cross between <a href=\"https://en.wikipedia.org/wiki/Don_Rickles\">Don Rickles</a> and <a href=\"https://en.wikipedia.org/wiki/Joan_Rivers\">Joan Rivers</a> with a bit of <a href=\"https://en.wikipedia.org/wiki/Sam_Kinison\">Sam Kinison</a>. He had a good schtick for a long run if you find fascist slapstick entertaining, as millions of Americans do or did. ",
                            "created": "Tue, 06 Aug 2024 14:13:47 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Last night Maddow tried to get us excited about how the Repubs have planted people on voting boards in swing states with the purpose of stopping the counts, and thus preventing a vote in the Electoral College. But they're doing it too late. The administrators will feel the tide turning too. ",
                            "created": "Tue, 06 Aug 2024 14:14:04 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "This campaign will take place in the popular culture of 2024, which thankfully is not centered on cable news or the NYT. But Mark Zuckerberg and Elon Musk are in control. In my <a href=\"http://scripting.com/2017/01/14/whatIfTwtrIsBoughtByARepub.html\">2017 piece</a> I thought Zuck would run for president, given his new style <a href=\"https://imgs.scripting.com/2024/08/06/zucksNewStyle.png\">makeover</a> I wouldn't discount that, but these two will certainly have  influence over how the election goes. Both Facebook and Twitter have algorithms that are opaque and controlled by them. Same deal as with the owners of cable media. ",
                            "created": "Tue, 06 Aug 2024 14:52:49 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Trump stoked resentment with voters for being left behind, even if individually they were doing fine. But that was eight years ago and a lot has happened. Harris saying basically \"there you go again\" is an <a href=\"https://www.youtube.com/watch?v=qN7gDRjTNf4&t=46s\">echo of Reagan</a>, btw. It worked for Reagan, you just have to get the <a href=\"https://www.dictionary.com/browse/derision\">derision</a> right. And Harris can do that, she laughs and we laugh. Trump loses his mind.",
                            "created": "Tue, 06 Aug 2024 14:14:41 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "The Harris candidacy happened almost as if it was staged. The campaign hit the ground running, it feels like there was a lot of advance work. Or they picked bloggers who were up and running, gave them the keys and said go. Either approach is fine, breaking through where previous Demo campaigns didn't have the nerve. Whatever it is, there's a sign of competence and urgency in the Democrats that is grounded in the challenge not in some almost religious sense that she's The One, which was understandable with Obama, but won't do now. We have no illusions about what's ahead. I think for that Biden must have been a great teacher. ",
                            "created": "Tue, 06 Aug 2024 14:15:03 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Now we're grounded. We've seen the outline of our future. Our eyes were fully opened on Jan 6. A few weeks ago the lead Republican thinker behind Project 2025 said, like an idiot, in an interview, it was up to the liberals to avoid a bloodbath, as they took over. You don't hear that anymore. Those people must now be thinking more seriously about jail for what they're doing. And the Supreme Court will go to jail too if they try to support what Maddow was talking about. We must not let them overthrow the government. And that's why Maddow's concern is okay but overstated, imho.",
                            "created": "Tue, 06 Aug 2024 14:17:25 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "I had my doubts whether Biden would stop the <a href=\"https://www.dictionary.com/browse/dissolution\">dissolution</a> of the Supreme Court, and I don't know if Harris will, but given how purposefully the campaign in running, I suspect (hope, pray) she will. Our job is to give her the support she needs to feel that we've got her back. ",
                            "created": "Tue, 06 Aug 2024 14:18:18 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "PS: FDR <a href=\"https://chatgpt.com/share/83fbfae5-d28d-4332-bda1-480fed1e9584\">threatened</a> to pack the court in 1937. ",
                    "created": "Tue, 06 Aug 2024 14:18:20 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PPS: If you haven't listened to <a href=\"http://scripting.com/2024/08/04/195427.html\">Sunday's podcast</a>, please do. It's just 12 minutes. ",
                    "created": "Tue, 06 Aug 2024 14:18:47 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}