{
    "created": "2024-08-07T04:00:00.000Z",
    "flInCalendar": true,
    "name": "07",
    "path": "2024/08/07",
    "text": "August 07",
    "type": "calendarDay",
    "subs": [
        {
            "text": "<a href=\"https://x.com/davewiner/status/1821209204977189268\">Timothy Snyder</a>: \"If JD Vance really were a normal midwestern guy he’d be very respectful of someone like Tim Walz.\"",
            "created": "Wed, 07 Aug 2024 16:03:44 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "When I see a reference to an evil NYT piece, I RT it with a simple message: Ignore the NY Times. It's relaxing. You don't have to do something about it, in fact it says the opposite. Do nothing. It works on all social nets, and for any news org that's promoting lies, ignoring relevant facts, against the interest of the US. Find new ways to get informed. And if you can't find them, start one. And we can find each other. ",
            "created": "Wed, 07 Aug 2024 14:04:32 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2024/07/04/butHerEmails.png",
            "flInCalendar": true
        },
        {
            "text": "The <a href=\"https://www.threads.net/@davew/post/C-Xr_dcp8Vn\">Bruce Springsteen</a> mention at last night's rally was no accident. Boomers are now of the age where we vote in great numbers. So our feeling like there's something here for us might make the difference in one or more of the swing states.",
            "created": "Wed, 07 Aug 2024 14:00:39 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Last night's Democratic rally was wonderful. I was laughing and sobbing all the way through it. What an emotional release. We needed and deserved this. Beyond hope, we're finally going to fight. I hope President Kamala is really up to it, because we have a pretty substantial cleanup job to do <a href=\"https://en.wikipedia.org/wiki/Trump_v._United_States_(2024)\">here</a>.  ",
            "created": "Wed, 07 Aug 2024 13:40:11 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Democratic Party greatness",
            "created": "Thu, 08 Aug 2024 03:28:58 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I have great respect for Hillary Clinton and supported her over Sanders in 2016. I also supported Biden because we needed to win in 2020.",
                    "created": "Thu, 08 Aug 2024 03:29:08 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "But we could have had a campaign team like the one we saw yesterday and today, with some very impressive presenters who've yet to take the stage, we could have had it in 2016. We didn't have to go through the tragedy of Trump.",
                    "created": "Thu, 08 Aug 2024 03:29:34 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The Democrats are stage managing perfectly now. I never really thought we'd see this day, but here it is.",
                    "created": "Thu, 08 Aug 2024 03:29:58 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Our favorite kitten is on the road with the Democrats.",
                    "created": "Thu, 08 Aug 2024 03:18:50 GMT",
                    "type": "outline",
                    "inlineImage": "https://imgs.scripting.com/2024/08/07/wordleKittyOnTheRoad.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}