{
    "created": "2024-08-11T04:00:00.000Z",
    "flInCalendar": true,
    "name": "11",
    "path": "2024/08/11",
    "text": "August 11",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Idea for a neat product from Automattic or really anyone: Configure WordPress for writing a book, hook it up to an AI service that can always turn that site into prose, reorganized into chapters, however you'd like, on demand, in an instant. You could use an outliner to arrange the table of contents and it could automatically generate a back of the book index. Technologically I think today's AI is ready to do this, just needs to be packaged. Charge a fair price for the service, esp at the beginning it would totally be worth it. Who knows where it would lead. I bet a lot of writers would use it, I certainly would. ",
            "created": "Sun, 11 Aug 2024 22:28:22 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I carry two phones, an <a href=\"https://en.wikipedia.org/wiki/IPhone_13_Pro\">iPhone 13 Pro</a> and a <a href=\"https://en.wikipedia.org/wiki/Pixel_6\">Pixel 6 Pro</a>. The latter is my main phone, and I prefer it to the Apple phone, not sure why, it's what I use for most things. I need the iPhone because I use an Apple Watch. Lately there's been some trouble with the screen on the Pixel 6, on certain gestures, the right edge lights up in bright green and then immediately returns to normal. I'm thinking the display may be about to fail? It might be time for a new phone. So I went to the Pixel site to see what they have that's new and found that they're announcing a new phone, the <a href=\"https://chatgpt.com/share/ac8f1461-9923-43da-87b9-b951ff2f32b2\">Pixel 9</a>, on Tuesday. So I immediately, of course, dropped the idea of buying an upgrade today, why not wait till the new version is out. I looked over the teaser, guessing that AI figures big in this release. Not sure how I feel about that because the last thing I want to do is switch over to Google's AI from my beloved ChatGPT. Kind of the same thing I see happening with Threads re Twitter. ",
            "created": "Sun, 11 Aug 2024 22:24:19 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2024/08/11/zuckerberg.png",
            "flInCalendar": true
        },
        {
            "text": "A lot of people are thinking that <a href=\"https://www.threads.net/@davew/post/C-jAIEDp-9K\">Threads</a> is the new \"nice\" version of The Original Twitter, but folks, that's pure \"bullshit\" -- remember who owns Threads and ask yourself if you want that dude to be in charge of our political organizing network. We need <a href=\"https://shownotes.scripting.com/scripting/2024/08/04/itsTimeToCreateOurOwnMediaAgain.html\">something</a> better. ",
            "created": "Sun, 11 Aug 2024 22:54:16 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "From now on, until further notice, when I feel like watching some mind-numbing \"news\" program, I'm going to have a look at the <a href=\"https://www.youtube.com/@kamalaharris\">Kamala Harris channel</a> on YouTube. I don't mind doing hard work, I just don't want to hear what the NYT-centered media has to say because it's all \"bullshit\". If I have to listen to nonstop bullshit, I'd rather hear from people who tell me we can have a bright future, than the usual NYT-spawned \"bullshit\". It's just \"bullshit\". I'm tired of \"bullshit\". That's all I have to say about \"bullshit\" for now at least. Have a nice day.",
            "created": "Sun, 11 Aug 2024 18:47:25 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2024/07/03/smallerPatrioticKitty.png",
            "flInCalendar": true
        },
        {
            "text": "At some point ChatGPT will imho be programmed to compile C apps to JavaScript, for example, even large ones with bugs. ",
            "created": "Sun, 11 Aug 2024 16:00:13 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}