{
    "created": "2024-08-18T04:00:00.000Z",
    "flInCalendar": true,
    "name": "18",
    "path": "2024/08/18",
    "text": "August 18",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Another possible <a href=\"https://this.how/rulesForJournalism/\">rule for journalism</a>. Employ non-journalist op-ed writers. Appointed to a two-year residence, columns published alongside other op-eds. They expose flaws in stories that have appeared in the publication, either news or editorial. They have expertise in areas the publication covers. They have never been employed as a journalist. They are not part of your organization, never meet with other writers, have no personal relationships to preserve. They write from the perspective of a reader. By giving them equal weight as news or op-ed pieces, it's more likely the professional journalists and opinion writers will pay attention. Maybe they'll even respond. This is the beginning of accountability. The \"public editors\" the news orgs employed briefly were jokes. They never addressed the serious issues, likely because they lacked the perspective of a reader, or they had relationships to preserve, or just saw it from the perspective of an insider. There is an obvious and real problem with news, and it can never be solved until the people whose work is the problem see it. Is there a more important area of power that gets so little outside scrutiny? They say democracy dies in darkness, so does journalism.",
            "created": "Sun, 18 Aug 2024 14:42:35 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2019/10/10/sorryClosed.png",
            "flInCalendar": true
        },
        {
            "text": "BTW, <a href=\"https://www.oliverexplains.com/p/time-for-a-break-democrats-dont-need\">Olliver Willis is right</a>, the Dems don't need the journos. ",
            "created": "Sun, 18 Aug 2024 23:06:30 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Twitter isn't over",
            "created": "Sun, 18 Aug 2024 23:03:46 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I was surprised that Donald Trump was so famous because I didn't watch reality TV. I come from NY and he was a pretty small thing in NY, even though I guess the rest of the world thinks he's big in NY.",
                    "created": "Sun, 18 Aug 2024 23:03:55 GMT",
                    "subs": [
                        {
                            "text": "I come from Queens, actually, so I know the Trump character pretty well too. Self-important narcissists who inside feel worthless, lashing out at everything they come in contact with. Not the ordinary Scotch/German in Queens, but not that rare either.",
                            "created": "Sun, 18 Aug 2024 23:04:03 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "The same thing is probably happening now with Elon Musk, because attention of people like me has wandered away from Twitter, but the audience is huge, and probably every bit as movable as it was for Trump in 2016, and Musk owns it? Seems so.",
                    "flInCalendar": true
                },
                {
                    "text": "People who think this is over are fooled, imho.",
                    "created": "Sun, 18 Aug 2024 23:04:02 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Read this <a href=\"https://www.theguardian.com/commentisfree/article/2024/aug/18/inciting-rioters-in-britain-was-a-test-run-for-elon-musk-just-see-what-he-plans-for-america\">piece</a> in today's Guardian for another perspective. ",
                    "created": "Sun, 18 Aug 2024 23:04:34 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}