{
    "created": "2024-08-19T04:00:00.000Z",
    "flInCalendar": true,
    "name": "19",
    "path": "2024/08/19",
    "text": "August 19",
    "type": "calendarDay",
    "subs": [
        {
            "text": "<a href=\"https://www.threads.net/@actor_keanureeves_59/post/C-2Xy0mtOk4\">Keanu Reeves</a>: \"If you see someone falling behind, walk beside them. If you see someone being ignored, find a way to include them. Always remind people of their worth. One small act could mean the world to them.\"\n",
            "created": "Tue, 20 Aug 2024 01:07:10 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Respect the reader. This isn't exactly a new <a href=\"https://this.how/rulesForJournalism/\">rule for journalism</a>, but it's worth mentioning anyway. If you wouldn't want to read the piece yourself, don't let them put your name on it. Example. A <a href=\"https://www.nytimes.com/2024/08/18/us/politics/kamala-harris-2010-debate.html?unlocked_article_code=1.EE4.7g6L.aTYQ0sm2Xwz6&smid=url-share\">story</a> promises to tell you about 47 seconds that saved Kamala Harris's career. They do eventually tell you the words, but you have to wade through a lot of pointless bullshit to get to it. If I were writing it, the first words of the piece would have to be the words, and then explain it. You've seen this over and over and it gets worse all the time. I still don't understand why they do it, if I'm reading the piece, I'm a paying subscriber, right? Another example of disrespect, quit trying to upsell paying customers. Once a month maybe, but not every 8th time I visit your site. Most businesses have no regard for their customers' time, but the ones that do, really make an impression. ",
            "created": "Mon, 19 Aug 2024 14:08:27 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2024/05/03/shootThisDog.png",
            "flInCalendar": true
        },
        {
            "text": "The Wikipedia <a href=\"https://en.wikipedia.org/wiki/Living_Videotext\">page</a> for Living Videotext begins with one of our slogans. It was a joke, and meant to keep us humble, so we listen to users. It was one of many such slogans. LVT made some important contributions to the networks we use today. Wikipedia should talk about that first, show some respect, for crying out loud. Otherwise, except for that snipe up front, the account is actually pretty accurate. ",
            "created": "Mon, 19 Aug 2024 20:00:25 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "It's nice to see the DNC <a href=\"https://www.yahoo.com/news/the-democratic-national-convention-is-giving-influencers-media-credentials-for-the-first-time-why-both-campaigns-are-pivoting-to-social-first-strategies-110059052.html\">including influencers</a> this year. I hear them say this is the first time, but I beg to disagree. A few dozen bloggers were <a href=\"http://scripting.com/2004/07/07.html\">at the DNC in 2004</a>, and were treated well, in many ways. I think the word influencer and blogger have fairly similar meanings. Blogger is a broader term, because it's possible to have a very small readership for a blog, thus not be influencing very much, but still have a lot of value. And you always can influence your mom and little sister, right? :smile:",
            "created": "Mon, 19 Aug 2024 14:26:23 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Elon bought the airport",
            "created": "Mon, 19 Aug 2024 20:08:28 GMT",
            "type": "outline",
            "description": "There are lots of scheduled flights in and out of X because it's where most of the traffic already goes.",
            "subs": [
                {
                    "text": "Elon Musk bought the biggest airport on the social web. A major world hub like Atlanta, <a href=\"https://www.flightconnections.com/flights-from-london-heathrow-lhr\">London</a> or Dubai. ",
                    "created": "Mon, 19 Aug 2024 20:08:44 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Bluesky is a regional airport in a cool place, maybe Austin. ",
                    "created": "Mon, 19 Aug 2024 20:28:09 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Mastodon is a network of airports, like the ones served by <a href=\"https://www.ryanair.com/us/en/cheap-flight-destinations\">Ryanair</a> in Europe. ",
                    "created": "Mon, 19 Aug 2024 20:28:13 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Threads is potentially one of the big airports like the one Musk bought, but it's not as much of a hub yet. <a href=\"https://www.flightconnections.com/flights-from-orlando-mco\">Orlando</a>? <a href=\"https://www.flightconnections.com/flights-from-frankfurt-fra\">Frankfurt</a>? ",
                    "created": "Mon, 19 Aug 2024 20:28:05 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "There are lots of scheduled flights in and out of X because it's where most of the traffic already goes. It's quite possibly not running that smoothly, like perhaps JFK in NYC, always a mess, under construction, huge traffic, broken systems. ",
                    "created": "Tue, 20 Aug 2024 01:24:13 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "But it does actually work pretty reliably most of the time. ",
                    "flInCalendar": true
                },
                {
                    "text": "When I was first getting started in tech, when we got the initial angel funding for <a href=\"https://en.wikipedia.org/wiki/Living_Videotext\">LVT</a>, I asked the lead investor, Bill Jordan, if Apple was going to go out of business. At the time, 1983, a lot of people said it would. He asked what their sales were. $1 billion, I said. He said they're not going away. Companies that large don't disappear. After 40 years of experience in tech since then, Bill was right. Companies that lead markets very rarely disappear. It <a href=\"https://en.wikipedia.org/wiki/Osborne_Computer_Corporation\">does</a> happen. But not often. More likely is Musk will right the ship, and it will grow to dominate the market. Threads will possibly be Pepsi or Avis. Mastodon will be Home Depot. Bluesky will be <a href=\"https://en.wikipedia.org/wiki/Laurel_Canyon,_Los_Angeles#Counterculture_of_the_1960s_and_1970s\">Laurel Canyon</a>. Or who knows? ",
                    "created": "Mon, 19 Aug 2024 20:29:14 GMT",
                    "image": "https://imgs.scripting.com/2019/11/14/weTryHarder.png",
                    "flInCalendar": true
                },
                {
                    "text": "But there's a high probability that Musk's company will be the market leader for the forseeable future. ",
                    "created": "Mon, 19 Aug 2024 20:32:47 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Reliable app storage over time is not here yet",
            "created": "Mon, 19 Aug 2024 13:48:15 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I'm working on a project which may or may not ship, but it presents an interesting design challenge either way.",
                    "created": "Mon, 19 Aug 2024 13:48:23 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The idea is I want to write lots of little bits, less than 5000 characters each, they have titles, use styling, links, include images, etc. ",
                    "created": "Mon, 19 Aug 2024 13:48:48 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Or it could also be as small as a single emoji.",
                    "created": "Mon, 19 Aug 2024 13:49:27 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "This is what we've settled on in 2024 as the basic unit of writing. From a tweet to a long blog post. ",
                    "created": "Mon, 19 Aug 2024 13:49:40 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I want to make an editor and storage system that fits this model perfectly based on all we know about this stuff, and the latest server and network technologies. ",
                    "created": "Mon, 19 Aug 2024 14:07:22 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It should have the best simplest API we know how to make in 2024.",
                    "created": "Mon, 19 Aug 2024 13:50:25 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "In every way it'll be the nicest, fastest and most flexible way to create structures of writing over time.",
                    "created": "Mon, 19 Aug 2024 13:50:38 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "In that last sentence is the gotcha -- <i>over time. </i>It's the frontier, the leading edge. Because in 2024 there's no way for me, as an individual developer to create a structure that lasts over time.  ",
                    "created": "Mon, 19 Aug 2024 13:51:20 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I can create a structure that has a high probability of lasting a month. A pretty good chance of lasting a few years, but beyond that, it gets less likely probably at a pretty good clip and eventually goes over a cliff. ",
                    "created": "Mon, 19 Aug 2024 13:52:14 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The way I have answered that in the past was with GitHub.",
                    "created": "Mon, 19 Aug 2024 13:52:58 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "In 2017, I started an <a href=\"https://github.com/scripting/Scripting-News/tree/master/blog\">archive</a> of my \"Scripting News\" writing on GitHub. It's still just a fraction of my writing, I'm not doing anything like that for all my other sites and services. But at least I've managed to set up a system that only requires me to do something once a month, which is something I like to do because it gives me some assurance the other mechanisms are still working. Archive systems have bugs too.",
                    "created": "Mon, 19 Aug 2024 13:53:07 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "So I guess for the project I'm doing I will again use GitHub to mirror the content in the database until and unless GitHub proves unusable for this purpose, or something much better comes along.  ",
                    "created": "Mon, 19 Aug 2024 13:54:41 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Note that GitHub has made no promise about the continued availability of their service, all we have to go on is that they have been reliable for enough time to present the <i>illusion</i> of persistence. :smile:",
                    "created": "Mon, 19 Aug 2024 13:56:01 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Feeds for Threads",
            "created": "Mon, 19 Aug 2024 12:56:03 GMT",
            "type": "outline",
            "description": "Two caveats re rss.app feeds: cost and how they handle titleless items.",
            "subs": [
                {
                    "text": "I was <a href=\"https://www.merriam-webster.com/dictionary/kvell\">kvelling</a> the other day <a href=\"https://www.threads.net/@davew/post/C-wOWuDJUU6\">about rss.app</a> and how they have feeds for <a href=\"https://www.threads.net/\">Threads</a> accounts. They do. But there are two caveats.",
                    "created": "Mon, 19 Aug 2024 12:56:19 GMT",
                    "flNumberedSubs": "true",
                    "subs": [
                        {
                            "text": "It <a href=\"https://rss.app/pricing\">costs</a> $9.99 per month for 15 feeds. Could be a bit expensive for some people's budgets.",
                            "created": "Mon, 19 Aug 2024 12:56:22 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "The second concern is more serious. It doesn't handle titleless items properly. It repeats the contents of the tweet in the title and description of the feeds it generates. An <a href=\"https://feeder.scripting.com/returnjson?feedurl=https://rss.app/feeds/3A2qGRnWMHFk5DvE.xml\">example</a>. This is not right, and it's not the way Mastodon and Bluesky do it. There's nothing wrong with items that have no titles. When an item has no title you do the common sense thing -- omit the title. I'm happy to help with this. I wrote the <a href=\"https://cyber.harvard.edu/rss/rss.html\">RSS 2.0 spec</a>, and am something of an authority on this. It's important to get this right.",
                            "created": "Mon, 19 Aug 2024 12:56:22 GMT",
                            "image": "http://scripting.com/images/2023/07/02/validRss.png",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}