{
    "created": "2024-08-20T04:00:00.000Z",
    "flInCalendar": true,
    "name": "20",
    "path": "2024/08/20",
    "text": "August 20",
    "type": "calendarDay",
    "subs": [
        {
            "text": "My linkblog, which posts to the <a href=\"http://scripting.com/?tab=links\">Links tab</a> on Scripting News, as well as <a href=\"https://bsky.app/profile/scripting.com/post/3l262hoj67h2c\">Bluesky</a>, <a href=\"https://mastodon.social/@dave@social.masto.land/112995344978083167\">Mastodon</a> and <a href=\"http://data.feedland.org/feeds/davewiner.xml\">RSS</a>, now also posts to <a href=\"https://x.com/davewiner/status/1825917984361120218\">Twitter</a> and <a href=\"https://www.threads.net/@davew/post/C-5hnjltv1P\">Threads</a>. ",
            "created": "Tue, 20 Aug 2024 15:29:45 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Today would have been <a href=\"https://www.google.com/search?q=site%3Ascripting.com+%22eve+winer%22\">my mother's</a> 92nd birthday. She died in 2018, and I still haven't, deep inside, fully gotten the message that she's gone. Probably the most significant person in my life. I find most of my adult relationships can be traced back to my relationship with her. ",
            "created": "Tue, 20 Aug 2024 13:44:39 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Ignore the NY Times",
            "created": "Tue, 20 Aug 2024 13:58:36 GMT",
            "type": "outline",
            "description": "The new Democratic Party must not make the mistake that Biden did, must not subjugate itself to the press. When they go on the attack, you must respond.",
            "subs": [
                {
                    "text": "When President Biden took the stage last night at the DNC, I had a moment of buyer's remorse. He looked so good in his black suit, and the pictures of the new candidates, and their spouses, looked comical in comparison to the <i>president</i> who was about to speak. ",
                    "created": "Tue, 20 Aug 2024 13:52:34 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Why did Walz have a permanent frown on his face. I find his presence next to Harris is almost always awkward. He's taller, and moves a lot. I noticed this with Sanders when he was debating Clinton in 2016. She stood still and Sanders waved his hands a lot. She spoke quietly, he shouted. ",
                    "created": "Tue, 20 Aug 2024 14:05:56 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Biden shouted last night, and he was mostly unplugged. On the team, but you have to wonder, how did the journos get so much power that they could force this change. He gave a fine speech. I'm not sure that pushing him aside, net-net, was a win for us. Maybe Harris will be a sugar high.",
                    "created": "Tue, 20 Aug 2024 13:59:06 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "One thing I know for sure, the new Democratic Party must not make the mistake that Biden did, must not subjugate itself to the press. When they go on the attack, you must respond. Break their wall of objectivity, these people are political players, and so far not subject to rebuttal. That must end. If they want to be in the middle, then don't pretend they aren't. ",
                    "created": "Tue, 20 Aug 2024 13:59:15 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "They will yell about the First Amendment, which also applies to elected leaders and candidates for office, and there is no special right for publications like the NYT, they have no immunity to First Amendment speech about them. ",
                    "created": "Tue, 20 Aug 2024 14:08:33 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "To the extent we can, it's time to push them aside. ",
                    "created": "Tue, 20 Aug 2024 14:03:00 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "When someone quotes the NYT in frustration, I have a mantra I repeat over and over, \"Ignore the NY Times.\" I'm going to paste it in 25 times now so you get the idea. Ignore the NY Times. Ignore the NY Times. Ignore the NY Times. Ignore the NY Times. Ignore the NY Times. Ignore the NY Times. Ignore the NY Times. Ignore the NY Times. Ignore the NY Times. Ignore the NY Times. Ignore the NY Times. Ignore the NY Times. Ignore the NY Times. Ignore the NY Times. Ignore the NY Times. Ignore the NY Times. Ignore the NY Times. Ignore the NY Times. Ignore the NY Times. Ignore the NY Times. Ignore the NY Times. Ignore the NY Times. Ignore the NY Times. Ignore the NY Times. ",
                    "created": "Tue, 20 Aug 2024 14:08:43 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "The Daily Kitten",
            "created": "Tue, 20 Aug 2024 14:26:02 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I do a daily episode of the adventures of <a href=\"https://www.google.com/search?q=site%3Ascripting.com+Wordle+Kitty\">Wordle Kitty</a> as art I do with ChatGPT, on <a href=\"https://www.facebook.com/photo/?fbid=2314356502105075&set=a.113966572144090&notif_id=1724164406352558&notif_t=feedback_reaction_generic&ref=notif\">Facebook</a>. There often is a NY Times headline in the image, saying something silly like how prisons are dealing with an influx of convicted house pets (like the kitten). ",
                    "created": "Tue, 20 Aug 2024 14:11:37 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "In this <a href=\"https://imgs.scripting.com/2024/08/20/kittyInPrison.png\">drawing</a> the NYT is reporting on how the kitten loves lasagna, and of course how cute she is (it's important to emphasize that in the AI prompt because otherwise you get less cute kittens in the drawing). ",
                    "created": "Tue, 20 Aug 2024 14:27:19 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "This is therapeutic. Finally I can see the NYT doing something useful! Keeping me entertained while we try to get through this election. If I'm forced to accept lies from the NYT, without any voice given to opposition, they might as well be lies that entertain me! :smile:",
                    "created": "Tue, 20 Aug 2024 14:27:35 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Kitty in prison, via Facebook.",
                    "created": "Tue, 20 Aug 2024 14:24:33 GMT",
                    "inlineImage": "https://imgs.scripting.com/2024/08/20/kittyInPrison.png",
                    "flInCalendar": true
                },
                {
                    "text": "PS: I wonder if the NYT minds that we think of them as no more straight than Fox News. They've fallen really far, and have so far shown they totally don't care if we know.",
                    "created": "Tue, 20 Aug 2024 14:28:28 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}