{
    "created": "2024-08-22T04:00:00.000Z",
    "flInCalendar": true,
    "name": "22",
    "path": "2024/08/22",
    "text": "August 22",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Ignore the NYT, part 2",
            "created": "Thu, 22 Aug 2024 17:00:29 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I have a feeling this thread is going to go a long way, maybe all the way. Maybe the last Ignore the NYT note will be \"The NYT has been put out of its misery\" in which case \"Ignore the NYT\" will be what everyone does, 7 days a week, 24 hours a day. Or maybe the last one will be when the owners of the NYT remember that the function of news is to simply report on what happened, and stop trying to control events. ",
                    "created": "Thu, 22 Aug 2024 17:00:35 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Anyway -- today's ITNYT story goes like this. ",
                    "created": "Thu, 22 Aug 2024 17:02:03 GMT",
                    "image": "https://imgs.scripting.com/2024/06/11/nakedJenToday.png",
                    "flInCalendar": true
                },
                {
                    "text": "I'm pretty sure Trump has a negative net worth. That's what the trial in NY was about, the one which he was convicted on 34 counts of fraud which included lying to creditors about the value of collateral for loans.",
                    "created": "Thu, 22 Aug 2024 17:02:16 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Trump borrows money to pay off creditors he borrowed money from to pay off other creditors. This has been going on for many years. It's probably why he's such close friends with Putin (or wishes he was) because a daddy like Putin can play the role of Trump's actual daddy used to play, ie bailing him out from his <a href=\"https://en.wikipedia.org/wiki/Trump:_The_Art_of_the_Deal\">bullshit deals</a>. ",
                    "created": "Thu, 22 Aug 2024 17:02:37 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It's a Ponzi type pyramid. He's probably been filing fraudulent statements about the value of various real estate he owns for a lot longer than we know. But he got caught and now hopefully he will go to jail for what he's been doing because it's quite illegal. ",
                    "created": "Thu, 22 Aug 2024 17:03:19 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The NYT in <a href=\"https://www.nytimes.com/live/2024/08/20/us/dnc-fact-check/take-it-from-an-actual-billionaire-trump-is-rich-in-only-one-thing-stupidity?smid=url-share\">this fact-check</a>, relies on Forbes' opinion of Trump's net worth -- which is based on the value of his Truth Social stock (good for them for not falling for the same bullshit the banks did). But that's a pretty weak foundation, too, btw -- given that Trump probably couldn't squeeze a billion dollars out of that stock without crashing the value of the stock, in other words, come on -- that's \"bullshit\". ",
                    "created": "Thu, 22 Aug 2024 17:04:23 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "In any case, there's a good argument to be made that Trump's negative net worth in everything but Truth Social stock on a balance sheet would negate even the full value of his stock. ",
                    "created": "Thu, 22 Aug 2024 17:10:08 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Why I feel bad about Biden",
            "created": "Thu, 22 Aug 2024 13:36:14 GMT",
            "type": "outline",
            "enclosure": "https://s3.amazonaws.com/scripting.com/2024/08/22/whyIFeelBadAboutWhatHappenedToPresidentBidenInAPersonalWay.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "6309090",
            "link": "http://scripting.com/2024/08/22/133614.html",
            "subs": [
                {
                    "text": "Podcast: <a href=\"https://s3.amazonaws.com/scripting.com/2024/08/22/whyIFeelBadAboutWhatHappenedToPresidentBidenInAPersonalWay.m4a\">17 minutes</a>.",
                    "created": "Thu, 22 Aug 2024 13:57:05 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Note: You can skip the first five minutes, it's a long preamble on a different subject. I left it in because it's interesting imho. ",
                    "created": "Thu, 22 Aug 2024 13:57:36 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It's possible that what happened to Joe Biden in the debate is like something that happened to me almost ten years ago when I was turning 60. I tell the story in this podcast. It's still possible he was the best choice to go against Trump. We'll know soon enough. But there's something to learn here. No one wants their life to be over. No one wants to be thanked. They want you to let them keep going. The thing is that all through life people say you can't do what you then go on to do. It happens over and over. One day, after a life of accomplishment, you realize everyone refers to you in the past tense, but you're still here, you want to keep doing the stuff you do so well. But they won't let you. That's why I feel bad about what happened with President Biden, because I've had the experience myself. Anyway what's done is done, we all have to get behind soon-to-be President Harris. And stand behind her as she is attacked, and they try to get rid of her. ",
                    "created": "Thu, 22 Aug 2024 13:36:35 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Anyway, the substance of this podcast, which I recorded yesterday, doesn't start until 5:25. Up until then it's a rambling story about Fox News and how a little truth slipped out when they covered the assassination attempt on Trump a few weeks ago. You can skip over that part if you don't find it interesting, but I hope you do listen to the part when I had an experience that may have been like Biden's at the debate, and how it was probably just a panic attack -- these things happen -- our candidates are people, and they have bodies that do strange things sometimes. No matter what I feel for Biden and that's the story I wanted to tell here. ",
                    "created": "Thu, 22 Aug 2024 13:51:12 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Thanks for listening. :smile:",
                    "created": "Thu, 22 Aug 2024 13:53:26 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}