{
    "created": "2024-08-23T04:00:00.000Z",
    "flInCalendar": true,
    "name": "23",
    "path": "2024/08/23",
    "text": "August 23",
    "type": "calendarDay",
    "subs": [
        {
            "text": "No more shaming people for being who they are.",
            "created": "Fri, 23 Aug 2024 19:09:23 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I just realized something else -- there isn't a female America and a male America. What made me realize it is how natural the idea of <i>President Kamala</i> feels. Men and women are different, just like blacks and whites are different (it couldn't be otherwise) but we are all Americans, and further, taken together we all <i>are</i> America. All of this sprung from that <a href=\"https://www.yahoo.com/video/2012-05-24-how-red-and-blue-states-split-on-green-we-spend-differently.html\">Obama quote</a> in his 2004 convention speech (which I was lucky to be present for, that was the year they welcomed bloggers). It's the one country that's the Union of all of us and we are United. ",
            "created": "Fri, 23 Aug 2024 18:40:47 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2024/08/23/ePluribusUnum.png",
            "flInCalendar": true
        },
        {
            "text": "I'm trying to teach ChatGPT how to do sidebar art. So far, it's not a great student. But I have hope. My instructions for the image in the post in the sidebar for the previous post: \"e pluribus unum\" is the motto of the United States. Out of many one. I would like a simple picture of an eagle with this motto over its head, in the same style it is in on the back of a quarter coin. ",
            "created": "Fri, 23 Aug 2024 19:09:41 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "This is how I explained what a sidebar art is: There's a certain kind of art I need to create with you. I call it \"sidebar art\" -- they are images between 75 and 135 pixels wide. The content is on a transparent background. They are designed to fit in the right margin of my blog at scripting.com. Please remember this definition, so you can help me create new sidebar art.  ",
            "created": "Fri, 23 Aug 2024 19:11:47 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "She is perfect",
            "created": "Fri, 23 Aug 2024 12:38:05 GMT",
            "type": "outline",
            "description": "I came away thinking she could be a combination of FDR and Lincoln. ",
            "metaImage": "http://scripting.com/images/2024/08/23/presidentKamala.png",
            "subs": [
                {
                    "text": "VP Harris gave the <a href=\"https://www.youtube.com/watch?v=dtbUlKy1D7k\">best speech</a> I've ever heard. ",
                    "created": "Fri, 23 Aug 2024 12:38:18 GMT",
                    "urlvideo": "https://www.youtube.com/watch?v=dtbUlKy1D7k",
                    "flInCalendar": true
                },
                {
                    "text": "There were some great speeches at the DNC. Michelle Obama stood out. Bill Clinton, of course. But it was her show, President Kamala's, and she stole it. ",
                    "created": "Fri, 23 Aug 2024 12:43:07 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "She's perfect for our time. ",
                    "created": "Fri, 23 Aug 2024 12:38:54 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "A prosecutor running against a convicted felon.",
                    "created": "Fri, 23 Aug 2024 12:39:00 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "A first generation American running against candidate who vilifies immigrants.",
                    "created": "Fri, 23 Aug 2024 12:39:18 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "A woman running against a candidate who tried to enslave women. ",
                    "created": "Fri, 23 Aug 2024 12:39:42 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "A brilliant orator running against an incomprehensible bully.",
                    "created": "Fri, 23 Aug 2024 12:39:37 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Why wasn't she so impressive when she ran in 2019? Near as I can tell it wasn't the right time or circumstances. She needed the focus to be on her. Whatever it was, she is <i>perfect</i> for our time. ",
                    "created": "Fri, 23 Aug 2024 12:40:51 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I was blown away by AOC's speech on Monday, and thought she's going to be a great president someday. And then on the last day, here's exactly what I was dreaming of. A grown-up version of AOC. Every bit as inspiring, as wonderful, as perfect. ",
                    "created": "Fri, 23 Aug 2024 12:41:45 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "She could be a combination of FDR and Lincoln. ",
                    "created": "Fri, 23 Aug 2024 12:42:32 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "She must be the next president. ",
                    "created": "Fri, 23 Aug 2024 12:42:46 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "And she's <a href=\"https://www.berkeleyside.org/2024/08/19/kamala-harris-berkeley-homes\">from</a> Berkeley! ",
                    "created": "Fri, 23 Aug 2024 12:42:52 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}