{
    "created": "2024-08-30T04:00:00.000Z",
    "flInCalendar": true,
    "name": "30",
    "path": "2024/08/30",
    "text": "August 30",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Feature I really need: A way to search all of my conversations with ChatGPT. It's the one feature I'm most missing, and the most surprising. I'm sure there's a huge amount of utility locked up in that. ",
            "created": "Fri, 30 Aug 2024 17:20:47 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Humor and putdowns in politics are great if you know how to do it and if the time is right. Trump was the only comedian on stage at the debates. And his act was fresh. The people who loved him loved that the other people hated him. It really was simple. Like a sports team or a favorite comic. Anyway, the Harris folk are <i>good</i> at putdowns and comedy, and the time is right. Trump's act is done, people are tired of the same old bullshit (which is exactly what Kamala said last night in the big interview). That's the cushion they're floating on. If they had called Trump weird in 2016 it wouldn't have worked, and probably not in 2020 for different reasons (he wasn't a joke at that moment, a huge number of Americans were sick and dying, and the economy was in ruin and there was no end in sight, not a good time to be joking around). But now Trump <i>is</i> a joke. So it feels right. Another perspective you should get is James Carville, who was on the <a href=\"https://podcasts.apple.com/us/podcast/james-carville-trump-is-in-deep-trouble-and-he-knows-it/id1728152109?i=1000666762884\">Daily Blast podcast</a> on Tuesday. Real eye-openers re how campaigns really work and why it's working for Team Harris now. And btw, why she's doing great now and not so good in 2019, two things. 1. Obviously she's grown. The last four years she's been VP of the United States. That's got to be some kind of education for someone as brilliant as she is. 2. In 2019 she was on stage with 20 other people, and only got tiny slivers of time. Look at what you find appealing about her now (assuming you do). It's the pauses and looks as much as anything, the facial expression. Anyway, she's really good at what she's doing now, at all levels, and Donald Trump is washed up. That's why it still feels good because of course he still could win. ",
            "created": "Fri, 30 Aug 2024 14:36:23 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2023/04/17/asGoodAsItGets.png",
            "flInCalendar": true
        },
        {
            "text": "I was thinking about Wisconsin news orgs and remembered we called the two Madison papers the Crap Times and the Wisconsin State Urinal. I don't know why that's so funny. Everyone does it. We used to call our own company Living Videosex, and the company that bought us out was Cementech or Sementech. Still makes me laugh. And there are company names that are funny without changing them like Microsoft. Sorry.",
            "created": "Fri, 30 Aug 2024 17:09:24 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "What if Trump had been killed in the <a href=\"https://en.wikipedia.org/wiki/Attempted_assassination_of_Donald_Trump\">assassination</a> attempt. What would have happened next? Biden was still the Democratic candidate. ",
            "created": "Fri, 30 Aug 2024 17:13:32 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "It has come to my attention that \"It's even worse than it appears\" might not be the right overlay for Kamala Harris, whose <a href=\"http://scripting.com/images/2024/08/23/presidentKamala.png\">picture</a> is the current <a href=\"https://imgs.scripting.com/2024/08/30/scriptingNewsBanner.png\">banner art</a> for <a href=\"http://scripting.com/2024/08/30.html\">Scripting News</a>. Of course she's still even better than she appears. I really mean that, and if you read this blog regularly you know. But what would a random person think? Hmm. Maybe that it's strange, this is a picture of the would-be president, and it's a good one. I wonder if there are many levels of irony going on at this moment, the visitor might think. No matter how much I love the Democratic team this year, this is not a campaign site. I don't take ads. This is just a blog. You might have to peer below the surface to figure out what's going on. Even the guy who writes this freaking thing can't see all the angles. For now neither the image or motto are changing. There hasn't always been a motto there you know.",
            "created": "Fri, 30 Aug 2024 14:47:24 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I use my blog in the earliest part of the day to warm up and procrastinate. ",
            "created": "Fri, 30 Aug 2024 14:36:01 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}