{
    "created": "2023-09-02T04:00:00.000Z",
    "flInCalendar": true,
    "name": "02",
    "path": "2023/09/02",
    "text": "September 02",
    "type": "calendarDay",
    "subs": [
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=EZ7Eg4P6cdY\">Patti Smith</a>: I haven't fucked much with the past but I've fucked plenty with the future.",
            "created": "Sat, 02 Sep 2023 21:25:24 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "If you think of yourself as an \"open source developer\" please ask yourself this question. Are you as committed to freedom for people who use your software as you are to freedom for developers? Not just freedom to modify the source code, that isn't a meaningful power for must people, but freedom to do anything they like with the stuff they create, something your software has to facilitate. ",
            "created": "Sat, 02 Sep 2023 16:13:40 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2023/04/24/cheshireCat.png",
            "flInCalendar": true
        },
        {
            "text": "I use ChatGPT to help me write code. When it gives code examples, I'd like it to use my admittedly uncommon indenting style. Is there a way to do that? ",
            "created": "Sat, 02 Sep 2023 14:46:02 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Why can't I have an editor that I can give ChatGPT commands to. I do it anyway, I just have to copy-paste the result into my editor. Couldn't it save me that step by being integrated, or even better if we had good standards for scriptable apps. We were getting started on that in 1990 when Apple blew it all up, btw. Just sayin.",
            "created": "Sat, 02 Sep 2023 14:49:33 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I really have to take the time to learn how GitHub co-pilot works. But I still want to use my editor. See the problem?? It's the same problem Slack has. Basically every software product of 2023 adopts the attitude that it is a world unto itself. ",
            "created": "Sat, 02 Sep 2023 14:50:52 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Today's songs: <a href=\"https://www.youtube.com/watch?v=ohDqjRGqpIU\">Margaritaville</a> and <a href=\"https://www.youtube.com/watch?v=Qwx-MlbAyJ0\">Come Monday</a>. Yeah it's not the greatest music as people are say, but these are music from a great part of my life. Youth, great friends, love, and a sense of purpose. Like many people my age, these songs have strong emotional value.  ",
            "created": "Sat, 02 Sep 2023 14:08:30 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}