{
    "created": "2023-09-12T04:00:00.000Z",
    "flInCalendar": true,
    "name": "12",
    "path": "2023/09/12",
    "text": "September 12",
    "type": "calendarDay",
    "subs": [
        {
            "text": "In the <i>University Teaching Hospital For Tech</i> I'm thinking about, I would teach users how to adjust to a new piece of software before switching to it. Suppose you're going to use a new piece of software to write your blog, something you do every day. Instead of converting to the new software first and diving into production, I would ask you to play with the new editor on the side, on posts that don't matter, maybe even <a href=\"https://scripting4.wordpress.com/2023/09/03/hello-world/\">written</a> by ChatGPT, until you're sure it fits your workflow. To surface and report all bugs that are in your way, or find acceptable workarounds. And only when you're satisfied that it works for you, should you consider switching to the new editor for production work. In my experience working with users, they switch too early and then panic when they find the software doesn't work the way they think it should. More generally you have to learn how to work so you don't have to panic, and you can easily back out of the decision if you decide it isn't right. When you're in panic mode you usually only make things worse. If you can afford to put the problem down for a couple of days and come back to it, you'll get to work faster and probably with a better result. The most important thing in working with computers, if you feel like you're panicking, stop.",
            "created": "Tue, 12 Sep 2023 16:50:46 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2020/12/07/fauci.png",
            "flInCalendar": true
        },
        {
            "text": "We've never taught people how to use computers. There actually is a lot to it. We're going to get another shot with ChatGPT and its cousins. Imagine when the chat interface is what we use to command and connect our software. ",
            "created": "Tue, 12 Sep 2023 17:45:28 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "One thing I have to thank Berkman for is my new confidence. What a boost that meeting was. It took me back to a day when there were a dozen people I worked with regularly who were really first rate, and I was able to participate at my peak, that I did something uniquely valuable and was appreciated for it. I feel a million times more confident this week after the homecoming last week. ",
            "created": "Tue, 12 Sep 2023 16:58:25 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Dunkin' Donuts sandwich",
            "created": "Wed, 13 Sep 2023 02:18:52 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "When I was leaving Cape Cod a couple of weeks ago, I stopped to charge my Tesla at a <a href=\"https://www.google.com/maps/place/22+Meetinghouse+Ln,+Sagamore+Beach,+MA+02562/@41.781639,-70.5408017,230m/data=!3m1!1e3!4m6!3m5!1s0x89e4c9923ec94abb:0x335d7a8eef5da98b!8m2!3d41.781616!4d-70.540223!16s%2Fg%2F11csf2z60h?entry=ttu\">place</a> that had a Dunkin' Donuts, so I went in and got a big ice coffee and a Sourdough Breakfast Sandwich, something I had never tried. For some reason it looked good to me.",
                    "created": "Wed, 13 Sep 2023 02:19:00 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "<a href=\"https://www.dunkindonuts.com/en/menu/sandwiches-and-more/product-sourdough-breakfast-sandwich-id4001221?\">Dunkin' Donuts sourdough breakfast sandwich</a>.",
                    "created": "Wed, 13 Sep 2023 02:20:01 GMT",
                    "inlineImage": "https://imgs.scripting.com/2023/09/12/dunkinDonutsSourdoughSandwich.png",
                    "flInCalendar": true
                },
                {
                    "text": "Well it was great! Since then I've had two more and I just love the sandwich. Seems like an incredible bargain. Two once-over eggs, a bunch of bacon and melted cheese in a sourdough sandwich. Really tasty and filling. ",
                    "created": "Wed, 13 Sep 2023 02:20:02 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I don't often review food, so you know it's pretty good. :smile:",
                    "created": "Wed, 13 Sep 2023 02:21:12 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}