{
    "created": "2023-09-19T04:00:00.000Z",
    "flInCalendar": true,
    "name": "19",
    "path": "2023/09/19",
    "text": "September 19",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Yesterday the \"former president\" as he's referred to on TV, or <i>Mr President</i> on <a href=\"https://www.youtube.com/watch?v=Kcsn_6Wln60\">NBC</a>, shared a post that said <a href=\"https://thehill.com/homenews/campaign/4209650-trump-shares-post-bashing-liberal-jews-who-voted-to-destroy-america/\">Jewish liberals</a> are destroying America. Let's mark this line clearly. Talk like that is full of alarm for Jewish people, esp those raised by people who survived the last holocaust. If this doesn't stop you in your tracks, then you probably won't notice when they start calling us vermin, restricting our movement, take our property, move us to ghettos and then systematically incinerate us the way you would rid yourself of an infestation. You know the old story about the <a href=\"https://en.wikipedia.org/wiki/Boiling_frog\">frog boiling in water</a>. We all are on that path. This was always where Make America Great Again was going, an America with all the Jews dead. That this isn't Story One on every front page and newscast says everything you need to know about how journalism is failing us.  ",
            "created": "Tue, 19 Sep 2023 13:44:07 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2022/02/27/boozerAndLittleDave.png",
            "flInCalendar": true
        },
        {
            "text": "If anyone from MacArthur or Knight is tuned in, here's an idea. Help us get an <a href=\"https://www.google.com/search?q=ez-pass+for+news+site%3Ascripting.com\">EZ-Pass for News</a> going. It's a bootstrap. If there were incentives. If it were seen as a good cause. It could increase the fluidity of news around the country and world by an order of magnitude. That can't help but increase cash flow through news orgs. But more importantly it give us more access to ideas that don't come from the NYT et al. Might be a nice way to boost all the local news orgs being supported by the $500 million fund. ",
            "created": "Tue, 19 Sep 2023 14:36:44 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}