{
    "created": "2023-09-24T04:00:00.000Z",
    "flInCalendar": true,
    "name": "24",
    "path": "2023/09/24",
    "text": "September 24",
    "type": "calendarDay",
    "subs": [
        {
            "text": "So far I've asked people who I think of as <i>Friends of Local News</i> to also invest in an <a href=\"http://scripting.com/2023/09/19.html#a143644\">EZ-Pass for News</a> and help <a href=\"http://scripting.com/2022/04/13/165056.html?title=sourcesGoDirectExplained\">sources going directly</a> to users of news. We have to rebuild the open web as much as we need to rebuild local journalism. It's very much the same kind of thing. All our news flows will soon be going through ten servers. This is by design. It works a lot better for Google if they only have to keep their eye on Apple, Netflix, Microsoft and Amazon and a few others. ",
            "created": "Sun, 24 Sep 2023 22:59:39 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2023/09/24/barbie.png",
            "flInCalendar": true
        },
        {
            "text": "I watched <a href=\"https://en.wikipedia.org/wiki/Barbie_(film)\">Barbie</a> and it was so bad. Made my stomach ache. The movie is an ad for products you can buy <a href=\"https://www.amazon.com/stores/Barbie/Barbie/page/0716B6AC-A900-48E2-975E-E13245703AAF\">on Amazon</a>. The ultimate of exploitation. It got an <a href=\"https://www.metacritic.com/movie/barbie/\">80 on Metacritic</a>. What is wrong with everyone! It was probably the worst movie ever made.",
            "created": "Sun, 24 Sep 2023 14:20:46 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "You can't be meek",
            "created": "Sun, 24 Sep 2023 18:27:13 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "If you want to make a difference in tech you have to do things normal people would think are too radical. It might be the biggest hurdle to get over. You think shit, it's probably not going to work either way, so I'll just do it that way that <i>might</i> work. ",
                    "created": "Sun, 24 Sep 2023 18:27:18 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Note I said \"make a difference\" not \"succeed\" because then we have to discuss what success means. ",
                    "created": "Sun, 24 Sep 2023 18:27:41 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "At 68 I'm still getting ideas that require throwing caution to the wind. :rocket:",
                    "created": "Sun, 24 Sep 2023 18:27:51 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Time travel theory",
            "created": "Sun, 24 Sep 2023 14:47:38 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I have a new theory about time travel. ",
                    "created": "Sun, 24 Sep 2023 14:47:46 GMT",
                    "image": "https://imgs.scripting.com/2023/09/24/ken.png",
                    "imageLink": "https://shop.mattel.com/products/ken-dia-de-muertos-doll-hby10",
                    "flInCalendar": true
                },
                {
                    "text": "But first a question -- if it's possible to travel back in time, in the future, why haven't we been visited by time travelers already? Of course maybe we have been, but for some reason they're not visible to us, they're in another dimension or something like that. ",
                    "created": "Sun, 24 Sep 2023 16:47:52 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "But assuming we could experience their presence if they were here, maybe it's because in order for a time traveler to land here, we need to have a certain technology that we don't yet have, that acts as a <a href=\"https://en.wikipedia.org/wiki/AV_receiver\">receiver</a> of sorts. ",
                    "created": "Sun, 24 Sep 2023 16:45:37 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "And the day when that receiver is invented, perhaps unknowingly to the inventor, all of a sudden their house or apartment turns into a religious and historic shrine, a Disneyland or Fort Sumter of time travel. The place is instantly transformed into Wailing Wall, Ground Zero, or Mount Rushmore. ",
                    "created": "Sun, 24 Sep 2023 14:48:18 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I imagine there is already a science fiction book based on this premise. ",
                    "created": "Sun, 24 Sep 2023 14:48:43 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}