{
    "created": "2023-09-29T04:00:00.000Z",
    "flInCalendar": true,
    "name": "29",
    "path": "2023/09/29",
    "text": "September 29",
    "type": "calendarDay",
    "subs": [
        {
            "text": "When Google says having a certificate isn't enough to operate a website, now you have to be cleared by the US Department of Homeland Security, will you still think it was smart to let Google deprecate HTTP? Or, why do people lose their minds when it comes to Google?",
            "created": "Fri, 29 Sep 2023 14:47:43 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Nesting in Fargo",
            "created": "Fri, 29 Sep 2023 13:32:14 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "<i>Warning: Small spoiler for Season 3.</i>",
                    "created": "Fri, 29 Sep 2023 13:47:46 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The first scene of Season 3 of <a href=\"https://en.wikipedia.org/wiki/Fargo_(TV_series)\">Fargo</a> has always puzzled me. It takes place in East Berlin during the Cold War. A citizen is brought before a government official where he's asked to confess to a crime that apparently was actually commited by a different person who used to live at the same address. The story then moves to Minnesota, and there's no further mention of the characters or plot of the first scene. ",
                    "created": "Fri, 29 Sep 2023 13:47:40 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I've always wondered why was that scene there, what it has to do with Fargo. Here's my theory.",
                    "created": "Fri, 29 Sep 2023 13:48:49 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Every episode of Fargo begins with \"This is a true story. The events depicted took place in {location} in {year}. At the request of the survivors, the names have been changed. Out of the respect for the dead, the rest has been told exactly as it occurred.\" ",
                    "created": "Fri, 29 Sep 2023 13:49:25 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It's funny because that's what the opening scene is. A supposedly true story (we don't actually know it's true, we suspect not, same as with the show itself) but the names have been changed. ",
                    "created": "Fri, 29 Sep 2023 13:49:41 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Everything in Fargo is nested that way. That's one of the reasons it's so much fun to re-watch, you see things each time you didn't see before.",
                    "created": "Fri, 29 Sep 2023 13:50:09 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}