{
    "created": "2023-09-30T04:00:00.000Z",
    "flInCalendar": true,
    "name": "30",
    "path": "2023/09/30",
    "text": "September 30",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Maybe chatbots will enable people to flame forever to a robot who will argue with them forever and not care. Or maybe we're already there. I found myself ranting at ChatGPT earlier today about Google. I could not get it to agree with me. It had drunk the Silicon Valley Kool Aid and I said so! Eventually it sort of came around to my way of viewing things, but it quickly snapped back to the party line. I wonder if psychologists have studied this to see what happen if people: 1. Have an interminable argument without ever convincing the other person (or robot) of their rightness or 2. Have a longish argument and eventually prevail. Is there a sense of closure when the OP says you know you're right, I've changed my mind! Can they now go on with their lives feeling like a winner instead of always losing to the corrupt and all-powerful woke coastal elites or the corrupt magas of middle America? ",
            "created": "Sat, 30 Sep 2023 20:18:43 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2020/07/07/ohYeah.png",
            "flInCalendar": true
        },
        {
            "text": "A little advice about social media from someone who has been on social media since it has existed. You don’t have to argue. When someone wants to argue with you, you should block them. There is no good outcome possible from arguing on social media.",
            "created": "Sat, 30 Sep 2023 20:31:40 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Near the end of the first season of <a href=\"https://en.wikipedia.org/wiki/Fargo_(TV_series)\">Fargo</a>, <a href=\"https://en.wikipedia.org/wiki/Molly_Solverson\">Molly Solverson</a>, a wise and <a href=\"https://www.dictionary.com/browse/tenacious\">tenacious</a> cop in <a href=\"https://en.wikipedia.org/wiki/Bemidji,_Minnesota\">Bemidji</a> is talking to <a href=\"https://en.wikipedia.org/wiki/Lester_Nygaard\">one</a> of the two perps she's been chasing, telling him a story about a man, waiting on a train platform with a pair of gloves in his hand. After he gets on the train, he notices that one of the gloves has fallen onto the platform. It's too late to get off the train to retrieve the glove, so he opens the window and throws the other glove onto the platform next to the first one. A generous gesture that costs him nothing. The perp ignores the advice. The thing is, who in our world will do the generous thing that costs them nothing? It's so rare. And if few us will, what exactly is the point of saving our civilization? What values do we have that are worth preserving? We think we're good people, but really we aren't unless we help each other.  ",
            "created": "Sat, 30 Sep 2023 12:22:51 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2023/09/30/fargo.png",
            "flInCalendar": true
        },
        {
            "text": "BTW, believe it or not, I have <a href=\"http://davetravel.scripting.com/2005/08/07#a4766\">been to Brainerd</a>, which is pretty <a href=\"https://www.google.com/maps/dir/Brainerd,+Minnesota+56401/Bemidji,+Minnesota+56601/@46.900293,-95.2010452,9z/data=!3m1!4b1!4m14!4m13!1m5!1m1!1s0x52b6bc057cc793cd:0xd6efc4206c7bc613!2m2!1d-94.2020084!2d46.3526733!1m5!1m1!1s0x52b82c4ec41eb7c7:0xd6f67c8df095e306!2m2!1d-94.8826861!2d47.471573!3e0?entry=ttu\">close to Bemidji</a>, on one of my cross-country podcasting trips in <a href=\"http://scripting.com/2005/08.html\">August 2005</a>. ",
            "created": "Sat, 30 Sep 2023 12:49:42 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "As I get older things that used to seem like mysteries now seem simple. How many times has someone said they love you when you think hmm I don't think that's really love. How long did it take you to figure it out? At this point I know what love is. If you can be yourself with another person then you can be sure that's love. If you can snuggle up with them and relax, either physically or figuratively, and again, just be yourself, that's love, for sure. But if you have to be a certain way, pretend to be someone you're not, to stay in good stead with the other person, then that isn't love. It's just that simple. If you find yourself blurting out \"I love you\" without any thought, maybe even surprised yourself, that's love. But love is not a status, not a state of being. It's an act. You could be \"in love\" one moment and the next, not. That doesn't mean in the next moment after that you won't share love again. It's just that feelings are always in motion. Love is a feeling of freedom to be yourself, or in another way -- to just be. Love is the essence of being you. Nothing elusive about it. You are made of it. ",
            "created": "Sat, 30 Sep 2023 12:40:11 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "But we have really bad examples of love relationships in TV and movies and in our families. I hear people say things that I imagine they got from watching a show, where the writers, for dramatic purposes I guess, have the characters say things in the name of love that have nothing to do with it, or often are the opposite, people trying to be something they obviously aren't. I don't think my parents or grandparents shared much love with each other, maybe they had their moments, but they weren't often. My uncle once told me, after my aunt died and he was looking for a new wife to take her place, it was like casting for a movie, that it's betrayal if a person turns out to not be what they appeared to be on the first date. A lot of people think that way. To figure out love, you have to take a step back from culture and families and just be yourself and see who likes you. You just found love. ❤️",
            "created": "Sat, 30 Sep 2023 13:14:30 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "If I were an IndieWeb leader",
            "created": "Sat, 30 Sep 2023 13:53:43 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "If I were one of the leaders of the <a href=\"https://chat.openai.com/share/6854a2cf-6dcf-4091-b850-f1e515725cd5\">IndieWeb movement</a>, I'd lobby for these ideas being added to the charter. ",
                    "created": "Sat, 30 Sep 2023 13:55:44 GMT",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "I want text to flow from my editor to the places I write. ",
                            "created": "Sat, 30 Sep 2023 19:59:24 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "If I have to use your editor to write on your site, forget it. ",
                            "created": "Sat, 30 Sep 2023 19:59:29 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "I want to use one editor to write. The one that's wired into the base of my spine. Where I just think of something and somehow it gets from my brain to the screen. ",
                            "created": "Sat, 30 Sep 2023 13:55:49 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Every time I have to switch gears because I forgot which editor I'm using, or where I have to go to read and edit something, I lose ideas, or punt on getting the writing right. ",
                            "flInCalendar": true
                        },
                        {
                            "text": "We have too much social media and not enough great reading sites. The reading experience of the web generally sucks.  ",
                            "created": "Sat, 30 Sep 2023 13:55:50 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}