{
    "text": "What is an ICO?",
    "created": "Fri, 01 Sep 2017 14:02:16 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I've reconnected with <a href=\"https://twitter.com/christophera\">Chris Allen</a>, a friend from the Old Mac Days, the mid-late 80s. We used to hang out at the <a href=\"https://developer.apple.com/wwdc/\">WWDC</a> back when it wasn't such a juggernaut and pretty much anyone could buy a ticket. <a href=\"https://www.linkedin.com/in/christophera/\">Chris</a> went on to develop SSL with Netscape, and has become a guru in blockchain technologies. Yesterday on Facebook I asked him what an ICO is:",
            "created": "Fri, 01 Sep 2017 14:02:19 GMT",
            "subs": [
                {
                    "text": "I want to know what an ICO is. I saw you write about it earlier today. The amounts of money are astounding. Are they real? Can you turn the coins you get into US dollars that you can use to hire people and buy office furniture? Or does the value only exist in a theoretical sense? Or something else entirely?",
                    "created": "Fri, 01 Sep 2017 14:03:43 GMT"
                }
            ]
        },
        {
            "text": "And Chris had an answer, and it was as I expected, direct and honest.",
            "created": "Fri, 01 Sep 2017 14:04:01 GMT",
            "subs": [
                {
                    "text": "To avoid securities regulations, an Initial Coin Offering is a cryptographic asset that can be used to purchase access to a network or a service. The computer equivalent of buying a token at the entrance of an arcade that can be used to play arcade and video games.",
                    "created": "Fri, 01 Sep 2017 14:04:39 GMT"
                },
                {
                    "text": "The big change lately is that due to standardization you can easily issue these tokens in exchange for Ethereum or Bitcoin. Once purchased, they can easily be traded back using a cooperative currency exchange. You can then trade these back out for fiat.",
                    "created": "Fri, 01 Sep 2017 14:18:23 GMT"
                },
                {
                    "text": "There are many regulatory questions: many may fail the <a href=\"http://consumer.findlaw.com/securities-law/what-is-the-howey-test.html\">Howey Test</a> thus are actually securities after all and thus issuers, exchanges and sellers may be subject to fines and jail time. Others claim to not be subject to US law as they prohibit sales to US citizens.",
                    "created": "Fri, 01 Sep 2017 14:05:20 GMT"
                },
                {
                    "text": "I think there are valid uses for cryptographic tokens, but am quite concerned that many of these are little more than scams. Others are well intentioned but not well thought out."
                },
                {
                    "text": "I personally want more tools to support shared commons, and current ICOs are about halfway there. Thus my focus more on <a href=\"http://www.tokenethics.com/\">TokenEthics</a>.",
                    "created": "Fri, 01 Sep 2017 14:07:30 GMT"
                }
            ]
        }
    ]
}