{
    "text": "Morning movie notes",
    "created": "Mon, 05 Mar 2018 14:50:47 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Speaking of winners, by the middle of the <a href=\"https://en.wikipedia.org/wiki/90th_Academy_Awards\">Oscars show</a> last night I concluded that <a href=\"https://en.wikipedia.org/wiki/Get_Out\">Get Out</a> would win everything. Unfortunately not so. I think in a few years we will have forgotten <a href=\"https://en.wikipedia.org/wiki/The_Shape_of_Water_(film)\">The Shape of Water</a>, and Get Out will have been the beginning of something new. The combination of politics, comedy, romance, tragedy and horror is hard to beat. ",
            "created": "Mon, 05 Mar 2018 13:35:20 GMT",
            "type": "outline"
        },
        {
            "text": "I was delighted that <a href=\"https://en.wikipedia.org/wiki/Allison_Janney\">Allison Janney</a> won best supporting actress. I, Tonya was a wonderful movie. It could have gotten a Best Picture nomination. And Janney was brilliant as Harding's bitter, cigarette-smoking hardass waitress mother. ",
            "created": "Mon, 05 Mar 2018 13:37:45 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://twitter.com/RyanJL/status/970518467228119041?ref_src=twsrc%5Etfw&ref_url=http%3A%2F%2Ftime.com%2F5185334%2Fjennifer-lawrence-jodie-foster-oscars%2F\">Jennifer Lawrence and Jody Foster</a> made the best on-stage couple comedy act. I was staring at Foster on her crutches before my attention turned to Lawrence, who is by far my favorite actress of her generation, for her irreverence, intelligence, and last night sheer <a href=\"https://en.wiktionary.org/wiki/gobsmacked\">gobsmacking</a> beauty. She's beautiful the way Hedy Lamarr was. And what an actress. She's still only 26 and one can only imagine what delights await us. I'm more than a fan, I am in awe. ",
            "created": "Mon, 05 Mar 2018 13:39:29 GMT",
            "type": "outline"
        },
        {
            "text": "Sometimes the Academy passes on a movie that goes on to have great significance. For me, the most interesting example is <a href=\"http://www.imdb.com/title/tt0118715/awards\">The Big Lebowski</a>. It didn't win a single <a href=\"https://en.wikipedia.org/wiki/71st_Academy_Awards#Awards\">Oscar</a>. I wonder what the judges must have thought of it. A silly insignificant comedy? It's weird because TBL came after <a href=\"https://en.wikipedia.org/wiki/69th_Academy_Awards#Awards\">Fargo</a>, which was much-celebrated by the Oscars. The year Lebowski would have been up for an award, <a href=\"https://en.wikipedia.org/wiki/Shakespeare_in_Love\">Shakespeare in Love</a> won best picture, and imho the other winners were also Big Mehs. Imho there's no doubt The Big Lebowski was the Best Picture in 1999. But you don't necessarily know it in the moment. History has a role to play too. ",
            "created": "Mon, 05 Mar 2018 14:17:34 GMT",
            "type": "outline"
        }
    ]
}