{
    "text": "How journalism is like the Mets",
    "created": "Sun, 24 Jun 2018 18:17:34 GMT",
    "type": "outline",
    "description": "We know someday the press, like the Mets, will win again. It might not be this year or next, but the day will come. And you'll get yours then.",
    "subs": [
        {
            "text": "First, you have to know I have been a Mets fan since 1962 when I was seven years old. I went to Mets games with my mother and father, uncle, and lots of games with my little brother.  We grew up within walking distance of Shea Stadium. That's the first thing.    ",
            "created": "Sun, 24 Jun 2018 18:17:41 GMT",
            "image": "http://scripting.com/2015/10/26/mrmet.png"
        },
        {
            "text": "Second, the Mets <a href=\"https://nypost.com/2018/05/10/the-misery-of-the-mets-fan/\">suck</a>. All Mets fans know that. You can't hurt our feelings by saying the Mets suck. We know it. They were born in suckage. Their ability to fuck up is legendary. It's deep in the culture of the team and its fans that they screw up. A lot.",
            "created": "Sun, 24 Jun 2018 18:18:32 GMT"
        },
        {
            "text": "We have the dorkiest <a href=\"https://en.wikipedia.org/wiki/Mr._Met\">mascot</a> ever. He sucks as much as the team does. ",
            "created": "Sun, 24 Jun 2018 18:27:33 GMT"
        },
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=JO1AVdqMtis\">Casey Stengel</a>, the first manager of the Mets <a href=\"https://en.wikiquote.org/wiki/Casey_Stengel\">said</a>: \"You look up and down the bench and you have to say to yourself, ‘Can’t anybody here play this game?’\"",
            "created": "Sun, 24 Jun 2018 18:28:24 GMT"
        },
        {
            "text": "But every once in a while, something happens. We make a trade for someone who hits a shitload of home runs. We draft a couple of pitchers who make history they're so hard to hit. Once we had a second baseman who played in the postseason like Babe Ruth. And then there's <a href=\"https://en.wikipedia.org/wiki/1986_World_Series#Game_6\">game 6</a> of the 1986 World Series. Sometimes the Mets are the opposite of sucking. Sometimes they are great. ",
            "created": "Sun, 24 Jun 2018 18:19:28 GMT"
        },
        {
            "text": "This is why they are called The Amazin' Mets. Or <a href=\"https://www.amazon.com/Amazins-Celebrating-Years-York-History/dp/1600786111\">The Amazins</a> for short. (Casey Stengel coined the <a href=\"https://www.youtube.com/watch?v=PBjPm_C-53E\">term</a>, but when he said it, it wasn't because they were so great. Heh.) ",
            "created": "Sun, 24 Jun 2018 18:21:16 GMT"
        },
        {
            "text": "We don't mind if the Yankees fans, the team we share a city with, look down on us. But we do mind if, when the Mets are doing great, they start wearing Mets hats. Like they did in 2015. That, in our philosophy of baseball is what defines the Mets. We love them whether they suck or not. Whether we're on cloud nine or in the dumps. Yankees fans of course have no philosophy.",
            "created": "Sun, 24 Jun 2018 18:21:42 GMT"
        },
        {
            "text": "Once after the 2000 World Series on the subway into Manhattan a little boy dressed in a Mets hat and jacket was crying. I said to him \"Son, if you're going to be a Mets fan you're going to be doing a lot of that.\"",
            "created": "Sun, 24 Jun 2018 18:33:48 GMT"
        },
        {
            "text": "Anyway, I guess that explains how I feel about the Mets. But I realized today it's also how I feel about journalism. It sucks most of the time. Most of the time they skim the surface, or kiss the ass of the rich and powerful at the expense of progress. Usually they get it so wrong it makes you cry. Most of the time journalism sucks. We know it.",
            "created": "Sun, 24 Jun 2018 18:23:31 GMT"
        },
        {
            "text": "But if you call them <i>The Enemy of the People, </i>we know what you're doing. Just because we love them and they suck doesn't mean we're stupid. We get it. And when you take that particular shortcut, <i>you</i> become the enemy. There will come a day of reckoning. We believe that someday the press, like the Mets, will win again. We know it. It might not be this year or next, but the day will come. And you'll get yours then.",
            "created": "Sun, 24 Jun 2018 18:24:25 GMT"
        }
    ]
}