{
    "text": "November 9",
    "created": "Thu, 09 Nov 2017 14:41:34 GMT",
    "name": "09",
    "subs": [
        {
            "text": "I have to say I like the 280 char limit. It feels like <a href=\"https://en.wikipedia.org/wiki/Legality_of_cannabis_by_U.S._jurisdiction\">legal cannabis</a>. Something that was once forbidden that now is OK. It's like what, I can do that! Wow.",
            "created": "Thu, 09 Nov 2017 14:41:35 GMT",
            "type": "outline",
            "image": "http:///scripting.com/images/2017/11/09/cannabisBud.png"
        },
        {
            "text": "One of the reasons 280 chars is great is that it means that links I post to Facebook can have longer descriptions. It may seem counter-intuitive, but I use \"Radio3\" to post my links, to Twitter, Facebook, to my <a href=\"http://scripting.com/?tab=links\">linkblog</a> and to an <a href=\"http://radio3.io/users/davewiner/rss.xml\">RSS feed</a>. I don't write different versions for each environment, so what you get is the <a href=\"https://en.wikipedia.org/wiki/Lowest_common_denominator\">least common denominator</a>. Which is Twitter. When they up the limit, they do it for all other platforms, at least in my world. ",
            "created": "Thu, 09 Nov 2017 15:04:35 GMT",
            "type": "outline"
        },
        {
            "text": "I was invited to a future-of-news conference in <a href=\"https://www.google.com/maps/place/Moscow,+Russia/@55.7494733,37.35232,10z/data=!3m1!4b1!4m5!3m4!1s0x46b54afc73d4b0c9:0x3d44d6cc5757cf4c!8m2!3d55.755826!4d37.6172999\">Moscow</a> in 2011, all expenses paid, by a Russian news agency, <a href=\"https://en.wikipedia.org/wiki/RIA_Novosti\">Ria Novosti</a>. I said yes at first, but in the end didn't go. Something didn't seem right. Soon after, their feed redirected to <a href=\"https://en.wikipedia.org/wiki/Sputnik_(news_agency)\">Sputnik</a>, then to <a href=\"https://en.wikipedia.org/wiki/RT_(TV_network)\">RT</a>.  ",
            "created": "Thu, 09 Nov 2017 19:58:48 GMT",
            "type": "outline"
        },
        {
            "text": "Lindsey Graham <a href=\"https://twitter.com/davewiner/status/928643965800341505\">this</a> $5 is yours if you vote against the Repub tax bill.",
            "created": "Thu, 09 Nov 2017 15:22:53 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/928643965800341505"
        },
        {
            "text": "The 2017 election proved that the way out of our mess is with the people, not the pre-Internet political parties. This is true for everything, really. For tech, for news as well as politics. The institutions may fail, but that's not the end.",
            "created": "Thu, 09 Nov 2017 15:36:04 GMT",
            "type": "outline"
        },
        {
            "text": "In 2013 I wrote a <a href=\"http://scripting.com/2013/10/16/byrneZivkovic\">piece</a> on why men stay silent re sexual harassment. ",
            "created": "Thu, 09 Nov 2017 14:51:07 GMT",
            "type": "outline"
        },
        {
            "text": "Re Google and antitrust, a little story. I have an Android phone. When it rings, if they think it's a spam caller, the screen goes red and there's a label under the number that says it's probably spam. I trust Google to not use this feature to censor political opinions, though technically they could, and we would never know. I want to believe they're saying it's spam because it <i>is</i> spam. The same way I trust Google not lower the rank of a site because it doesn't support HTTPS. The fact that they do this, and are <a href=\"https://webmasters.googleblog.com/2014/08/https-as-ranking-signal.html\">open about it</a>, means I don't trust the whole move to HTTPS that they're trying to force on the internet, without any public debate, oversight or recourse. This is exactly the kind of thing Google, a company, not an elected government, should not be doing. ",
            "created": "Thu, 09 Nov 2017 16:26:38 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/09/24/monopolyDude.png"
        },
        {
            "text": "The perfect length for a podcast",
            "created": "Thu, 09 Nov 2017 21:30:33 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "In 2004, I decided that 40 minutes was the perfect length for a podcast.",
                    "created": "Thu, 09 Nov 2017 21:30:43 GMT"
                },
                {
                    "text": "In 2017, an update: now 20 minutes is the perfect length. "
                },
                {
                    "text": "The two trendsetters: The Daily and Planet Money."
                }
            ]
        }
    ]
}