{
    "text": "November 10",
    "created": "Fri, 10 Nov 2017 14:55:06 GMT",
    "name": "10",
    "subs": [
        {
            "text": "<a href=\"https://github.com/scripting/Scripting-News/issues/42\">Reader query</a>: I've had a report by one user of repeated items from Scripting News in Feedly. Are other people seeing this? In other feed readers? I've seen no problems in \"River5\". ",
            "created": "Fri, 10 Nov 2017 21:04:46 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/929061706839527425\">Poll</a>: Should Louis C.K.'s work disappear?",
            "created": "Fri, 10 Nov 2017 19:03:41 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/929061706839527425"
        },
        {
            "text": "The allegations against <a href=\"https://www.nytimes.com/2017/11/09/us/politics/mcconnell-roy-moore-sex-teenagers.html?_r=0\">Roy Moore</a>, it seems, could split the Republican Party in two. It's hard to imagine, for example, Mormons in Utah, who are largely Republican, condoning what Moore is accused of. ",
            "created": "Fri, 10 Nov 2017 18:47:49 GMT",
            "type": "outline"
        },
        {
            "text": "Everything in my world works better, post-280. I was sure this would happen. It's one of the things that was making the cost of Twitter too high to sustain. Facebook didn't have the 140-char limit, nor did my linkblog, or the RSS feed of links. But because I want all my links to flow to these four places, I was limited by the least capacity of them all. Now if Twitter and Facebook would support <a href=\"http://scripting.com/2016/04/30/1229.html\">limited HTML</a>, then we'd be really flying (though, depressingly, we would just be where we were in 1994).",
            "created": "Fri, 10 Nov 2017 17:56:25 GMT",
            "type": "outline",
            "image": "http:///scripting.com/images/2017/11/10/280.png"
        },
        {
            "text": "I <a href=\"http://scripting.com/2017/11/09.html#a025848\">mentioned</a> my 2011 invitation to Moscow because it's worth considering if you see an American blogger supporting Russia, or an academic, or journalist, they might have taken the trip that I chose not to. Back then it wasn't clear that Russia was an adversary. In today's climate I wouldn't be tempted. But things were different then. ",
            "created": "Fri, 10 Nov 2017 18:00:08 GMT",
            "type": "outline"
        },
        {
            "text": "An idea to balance all the writing online about ugly violent non-consensual sexual acts -- a place where people write about their loving consensual and adventurous sexual experiences. Otherwise people, esp young people, might get the wrong idea about sex. Seriously it's not all bad. (Quite the opposite.)",
            "created": "Fri, 10 Nov 2017 14:55:07 GMT",
            "type": "outline"
        }
    ]
}