{
    "text": "November 25",
    "created": "Sat, 25 Nov 2017 14:29:48 GMT",
    "name": "25",
    "subs": [
        {
            "text": "I finished <a href=\"https://duckduckgo.com/?q=Godless+tv+series&ia=web\">Godless</a>, and I liked it. 3.5 out of 5. It started off something like Deadwood, but in the end it was more of a Disney show with a bit of Hallmark, not nearly as depraved as Deadwood, which was <i>truly</i> depraved. Not that I'm opposed to lovely stories and gorgeous western scenery.  I'm not sure whether I'll give it a 3 or a 4 on \"BingeWorthy\". I'll sleep on it. In the meantime I think Rectify, based on the superb rating it has gotten from <a href=\"http://bingeworthy.io/hotlist.html\">BW users</a>, will be the next program I try. It's on Netflix. And it should be noted that this is my first binge in the BingeWorthy era. As with \"podcatch.com\", one of the reasons I do these projects is to keep me better informed and entertained. ",
            "created": "Sun, 26 Nov 2017 02:56:24 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/11/25/godless.png"
        },
        {
            "text": "I like the <a href=\"https://twitter.com/davewiner/status/934531131818545152\">idea</a> of TIME savaging Trump. ",
            "created": "Sat, 25 Nov 2017 21:49:51 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/934531131818545152"
        },
        {
            "text": "One simple reform in news would make a huge difference. If you know someone is going to lie when interviewed, you can't put them on your show. Make the broadcaster responsible for the lies they carry, just as some would make Facebook responsible.",
            "created": "Sat, 25 Nov 2017 16:35:25 GMT",
            "type": "outline"
        },
        {
            "text": "Checked on the BingeWorthy <a href=\"http://bingeworthy.io/hotlist.html\">hotlist</a>. Interesting to see Rectify at #3, but only with the minumum 5 votes to make it on the list. Freaks and Geeks which I had never even heard of, is in the top 10. It has 35 votes, which is more significant than 5. The really low-rated shows no longer get on the hotlist. Maybe I should increase it to the top 250, or increase the minimum number of votes to 10? Thinking about what's next. Have to figure out how we'll add new programs. I have some ideas. ",
            "created": "Sat, 25 Nov 2017 21:28:07 GMT",
            "type": "outline",
            "image": "http://static.scripting.com/larryKing/images/2012/11/10/horse.gif"
        },
        {
            "text": "An idea for map websites. How about a mode that let me drive a virtual car anywhere I want. I don't have to stop for traffic lights, and I can't have an accident. No speed limit. I an go the wrong way down a one-way street. I can look all around while I move through the virtual space. ",
            "created": "Sat, 25 Nov 2017 21:11:31 GMT",
            "type": "outline"
        },
        {
            "text": "A new curriculum",
            "created": "Sat, 25 Nov 2017 21:00:49 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Many of our problems could be solved thus:",
                    "created": "Sat, 25 Nov 2017 21:00:57 GMT",
                    "flNumberedSubs": "true",
                    "subs": [
                        {
                            "text": "A new K-12 curriculum in empathy. Teach listening skills. How to put yourself in other people's shoes. The Golden Rule.",
                            "created": "Sat, 25 Nov 2017 21:01:12 GMT"
                        },
                        {
                            "text": "Remedial training for adults who didn't get this education when they were kids.",
                            "created": "Sat, 25 Nov 2017 21:01:16 GMT"
                        }
                    ]
                }
            ]
        }
    ]
}