{
    "text": "November 30",
    "created": "Thu, 30 Nov 2017 14:00:52 GMT",
    "name": "30",
    "subs": [
        {
            "text": "Around this time every year, Michael Gartenberg <a href=\"https://twitter.com/Gartenberg/status/936325389043077120\">looks</a> for my <a href=\"http://scripting.com/2000/12/22.html#latkesAndShicksas\">famous latkes recipe</a>, pretends he can't find it, so I do, and post it to my blog and to <a href=\"https://twitter.com/davewiner/status/936339778605371392\">Twitter</a>, and we're okay for another year. It's a ritual like Groundhog Day. ",
            "created": "Thu, 30 Nov 2017 20:55:09 GMT",
            "image": "http://scripting.com/images/2017/11/30/starOfDavid.png"
        },
        {
            "text": "Trickle down, <a href=\"https://twitter.com/davewiner/status/933215085857718272\">illustrated</a>.",
            "created": "Fri, 01 Dec 2017 01:22:37 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/933215085857718272"
        },
        {
            "text": "I wonder if <a href=\"https://en.wikipedia.org/wiki/Andrew_Baron\">Andrew Baron</a> reads my blog. Last time I saw him was in Boulder a few years ago. I think about him whenever I end one of my posts with two very cool emoji that work well together. A rocket :rocket: followed by a boom :boom:. This was the <a href=\"https://en.wikipedia.org/wiki/Rocketboom\">name</a> of his videoblog, a pioneering effort, it was pretty famous in the early days of YouTube. It's so cool that those are the names of two emoji and they go so well together. :rocket: :boom:",
            "created": "Thu, 30 Nov 2017 14:12:52 GMT",
            "type": "outline"
        },
        {
            "text": "A fictionalized account of a true story",
            "created": "Thu, 30 Nov 2017 14:09:48 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I try to begin each email with one of two sentiments: Thanks or sorry. Or find a way to praise the person I'm writing to. Start with something positive or show empathy. I've found, over years of experience, that people will likely stop reading after the first sentence, even if you are being nice. If you show appreciation or sincere regret up front, the chances that they'll read beyond the beginning seem to go up significantly. ",
                    "created": "Thu, 30 Nov 2017 14:10:12 GMT"
                },
                {
                    "text": "A book author begins with a question, have you had a chance to read my book and write about it on your blog? Another rule kicks in here. No bad news. I could tell the truth, that I find it difficult to read printed books, esp ones with small type, because I have a disability. Not something that limits much of what I can do, but it does affect my reading ability. I had eye surgery a number of years ago and it left me with bad vision in one eye, and made it impossible for me to wear glasses, yadda yadda yadda. No one is interested in this other than me (very!) and my eye doctor (not much she can do unfortunately, other than surgery on the other eye, something I'm not willing to risk). ",
                    "created": "Thu, 30 Nov 2017 14:11:10 GMT"
                },
                {
                    "text": "If I told the author all this, he would probably react negatively. Tell people I was difficult (this has actually happened) or otherwise defame me. But if I simply don't respond there are no negative consequences. So that's what I do. I don't like it. It isn't in my nature to leave people hanging. I want to give them a chance to fix the bug. An electronic copy can help. But honestly I didn't find the subject of the book so compelling, so I don't want to create the expectation that if he jumps through this hoop I will read the book. I probably won't. ",
                    "created": "Thu, 30 Nov 2017 14:11:53 GMT"
                },
                {
                    "text": "And the idea that I owe anyone space on my blog is a <i>huge</i> turnoff for me. That isn't how it works. Once someone gets territorial about my space, that's usually the end of that. Which is why this is a blog post instead of an email. A rather long one, I might add. :rocket: :boom:",
                    "created": "Thu, 30 Nov 2017 14:00:53 GMT",
                    "type": "outline"
                }
            ]
        },
        {
            "text": "About that WSJ reporter years ago",
            "created": "Thu, 30 Nov 2017 14:22:28 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Reminds me of a story I don't think I've ever told.",
                    "created": "Thu, 30 Nov 2017 14:22:43 GMT"
                },
                {
                    "text": "There was a famous reporter at the WSJ many many years ago. ",
                    "created": "Thu, 30 Nov 2017 14:22:52 GMT"
                },
                {
                    "text": "I had been a source for him before I started blogging, and he had reciprocated by writing nice stuff about me in some of his stories (that's how it works, btw in case you don't know). He had written a book, and sent me a blurb I should put on my blog. He didn't offer to send me a review copy. So I responded by saying he should send me a review copy and if I was interested I would write about it.",
                    "created": "Thu, 30 Nov 2017 14:23:05 GMT"
                },
                {
                    "text": "He got extremely nasty about how I will run the blurb he wrote and there's no need to send me a review copy. I said no, and he got even nastier.",
                    "created": "Thu, 30 Nov 2017 14:24:27 GMT"
                },
                {
                    "text": "I got a glimpse into how that part of the business works. I had much more respect for my blog and my readers than he did. And I'm guessing I had more respect for my readers than he did for his. And I also guess that this is the common practice, though I would rather not have known that. ",
                    "created": "Thu, 30 Nov 2017 14:25:00 GMT"
                }
            ]
        },
        {
            "text": "And now I'm reminded of another story",
            "created": "Thu, 30 Nov 2017 14:26:00 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "An ad guy for a major PC pub comes to visit. I was an advertiser, so this is normal. What wasn't normal is that he brought the Editor in Chief of the pub with him. I didn't know what to make of it.",
                    "created": "Thu, 30 Nov 2017 14:26:10 GMT"
                },
                {
                    "text": "The editor excuses himself to go to the bathroom, then the ad guy mentions that they're planning to run editorial about my product (a good thing, and not unusual or improper for an ad guy to know this) and if I commit to a big buy, they'll add more space about my product to this upcoming issue. Now that crossed the line. He connected ad purchases with editorial coverage. There's supposed to be a wall separating editorial and advertising. He just told me that there is no wall at this publication.",
                    "created": "Thu, 30 Nov 2017 14:26:49 GMT"
                },
                {
                    "text": "When the editor came back I told him what the ad guy said. He shrugged as if geez what's the problem. Yes I bought some ads, the amount we were going to buy before the meeting. But I never again read any of their editorial without thinking that it was all advertising. ",
                    "created": "Thu, 30 Nov 2017 14:27:58 GMT"
                }
            ]
        }
    ]
}