{
    "created": "2024-01-18T05:00:00.000Z",
    "flInCalendar": true,
    "name": "18",
    "path": "2024/01/18",
    "text": "January 18",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I've been wrong about many of Apple's products, but not the ones that made the company -- the Apple II and Mac, though I was somewhat skeptical of the iPhone because I couldn't write software for it, but I did <a href=\"http://scripting.com/stories/2007/06/30/initialReviewOfIphone.html\">get one</a> on the day they came out in <a href=\"http://scripting.com/2007/06.html\">June 2007</a>, and never used my Blackberry again. Anyway, the <a href=\"https://techcrunch.com/2024/01/17/i-spent-the-morning-with-the-apple-vision-pro/\">goggles</a> they just <a href=\"https://www.techmeme.com/240117/p38#a240117p38\">started</a> demoing to selected reporters and analysts looks like a product they released because they invested billions in it, had no idea what it's used for, and were overlooking the ability of the human body to actually <i>use</i> such a thing, and couldn't consider writing it off because so much had been made of this, esp since the current management has been coasting on innovation done by <a href=\"https://en.wikipedia.org/wiki/Steve_Jobs\">Steve Jobs</a>, and hadn't released anything that wasn't completely predictable since his <a href=\"http://scripting.com/stories/2011/10/06/myThoughtsOnSteveJobs.html\">passing in 2011</a>. Their lack of confidence in their own product overwhelms any positive reviews coming out from the privileged press, who we know in advance to discount, these are the press people Apple can count on to not say a negative word, to preserve their access at least, if not because they are complete fans. It reeks of a loser product. I write these things partially so I can be proven ridiculously wrong when I get one myself in two weeks and can't believe all the things I can do with it. ",
            "created": "Thu, 18 Jan 2024 14:38:12 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2024/01/18/visionPro.png",
            "flInCalendar": true
        },
        {
            "text": "It's worth remembering that <a href=\"https://chat.openai.com/share/0f1e55c1-4919-4c18-a1c8-20aa9d26158c\">before the Mac</a> there was <a href=\"https://en.wikipedia.org/wiki/Apple_Lisa\">the Lisa</a>. ",
            "created": "Thu, 18 Jan 2024 14:58:41 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "BTW, did you notice how <a href=\"https://www.youtube.com/watch?v=ltc909LOR4Q\">BMW's ads</a> say their product is much better than Tesla's, without mentioning Tesla, they just say they're better, because they are just better, because they're BMW, and they know you know that. It's much more powerful esp with people who like Telsas (of which I am one). I also see the Tesla as a very capable replacement for my 2007 BMW 535i, which I donated to charity in 2012, which I loved for the same reasons I love the Tesla. Putting down the competition isn't what marketing is about, you have to think about the people whose minds you're trying to change, and know you're in it for the long haul. An example of their ad copy: \"With electric driving comes exciting possibilities. That’s why BMW approaches this new era in mobility just like any other; where engineering, innovation and aesthetics come together seamlessly to inspire joy in every journey.\" These people understand their product and how their fans see them. ",
            "created": "Thu, 18 Jan 2024 15:17:47 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2024/01/18/bullmancusohahahah.png",
            "flInCalendar": true
        },
        {
            "text": "My recipe for getting rid of a troll. Say something rude in response to their trolling and then block them. ",
            "created": "Thu, 18 Jan 2024 15:23:16 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Bull Mancuso's day",
            "created": "Thu, 18 Jan 2024 14:10:44 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I got this idea <a href=\"https://bsky.app/profile/pbump.com/post/3kj7q6wejuk23\">from Philip Bump</a>. :smile: ",
                    "created": "Thu, 18 Jan 2024 14:10:51 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "\"Draw a three-panel comic strip in the style of Mary Worth. Panel one should show Bull Mancuso, a waste management consultant in New Jersey, at a Starbuck's in Newark, ordering a huge coffee drink. In panel two he's teaching a class on organized crime in New Jersey at <a href=\"https://www.csi.cuny.edu/\">Staten Island Community College</a>. In panel three he slips on a banana peel on the steps of the Capitol and falls down. There is no dialogue on any panel.\"",
                    "created": "Thu, 18 Jan 2024 14:11:34 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Bull Mancuso's wild day in New Jersey, Staten Island and DC.",
                    "created": "Thu, 18 Jan 2024 14:12:10 GMT",
                    "inlineImage": "https://s3.amazonaws.com/scripting.com/images/2024/01/18/bullMancusoDay.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}