{
    "created": "2024-01-21T05:00:00.000Z",
    "flInCalendar": true,
    "name": "21",
    "path": "2024/01/21",
    "text": "January 21",
    "type": "calendarDay",
    "subs": [
        {
            "text": "<a href=\"http://scripting.com/2024/01/21/typicalTechIndustryMess.m4a\">Podcast</a>: ActivityPub is a typical tech industry mess. 12 minutes.  ",
            "created": "Sun, 21 Jan 2024 19:41:47 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2024/01/21/typicalTechIndustryMess.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "6374173",
            "flInCalendar": true
        },
        {
            "text": "I realize that most of the people who read this blog aren't sports fans, something that I wish were different, because sports, like HBO series, give us a way to talk about complex human relationships in the 21st century that we don't get any other way to imho. If we all watch <a href=\"https://www.google.com/search?q=site%3Ascripting.com+succession\">Succession</a>, for example, then we know how to talk about the relationship between <a href=\"https://en.wikipedia.org/wiki/List_of_Succession_characters#Shiv_Roy\">Shiv</a> and her wimpy husband whose name I now have trouble remembering (later: <a href=\"https://en.wikipedia.org/wiki/List_of_Succession_characters#Tom_Wambsgans\">Tom</a>). (No spoilers as to why he's significant, and won the <a href=\"https://en.wikipedia.org/wiki/75th_Primetime_Emmy_Awards\">Emmy</a> for best supporting dramatic performance.) We all know the scene where they both nailed it. For anyone who has ever loved someone yet had to say goodbye anyway, it reached into your heart, and gave you a way to say to your friends -- there! -- <i>that's</i> what I was talking about. Same thing in sports, esp basketball, where you get to know a team a few players at a time, and you get to see them perform in really personal ways. Last night there was a rematch between the Knicks and the Raptors, which was one of those games you don't ever forget, because of a <a href=\"http://scripting.com/2024/01/02.html#a123238\">recent trade</a> where the teams exchanged core players who formed the personality of the teams, playing each other, so we could see in a memorable and visual way what was exchanged. Understand, we loved the players who were traded away. One day they're our team, and the next day, supposedly they're the other guys. Impossible to see it that way. The love doesn't just leave, maybe it never does. But. But now you know that one of the players, a former <a href=\"https://bleacherreport.com/articles/10002703-rj-barrett-talks-knicks-future-i-hope-im-here-for-the-rest-of-my-career\">Great Hope</a> of ours, didn't pan out, and now it's nice to see him on the court, fumbling an easy play or missing a shot you think he could've gotten, but doing it for the other team. Sadly, we think while he was the more expensive of the two stars the Knicks traded, the other one, the <a href=\"https://theknickswall.com/immanuel-quickley-changes-the-knicks-future/\">hotshit kid</a> with an attitude is going to be the real thing, a starting point guard of a contender, an opportunity he was unlikely to get with the Knicks. Anyway thanks for listening. Last night's <a href=\"https://www.sportsnet.ca/nba/knicks-crush-raptors-as-barrett-quickley-return-to-msg-after-trade/\">game</a> was something else. I understand that <a href=\"https://www.espn.com/nfl/story/_/id/39351490/49ers-packers-nfc-championship-game-jordan-love-brock-purdy-deebo-samuel\">Niners and Packers</a> fans were emoting in other ways at the same time. I can relate. ",
            "created": "Sun, 21 Jan 2024 16:24:25 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2022/05/30/quickley.png",
            "flInCalendar": true
        },
        {
            "text": "YABMC",
            "created": "Sun, 21 Jan 2024 19:22:38 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I apologize in advance for <b>Y</b>et <b>A</b>nother <b>B</b>ull <b>M</b>ancuso <b>C</b>omic.",
                    "created": "Sun, 21 Jan 2024 19:22:49 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "In this adventure Bull Mancuso is a woman, and is an astronaut on the space station, performing experiments on her fellow astronauts. The goal of the experiment is to determine if astronauts can play a new form of basketball that was invented by SpaceXYZ founder Mucky Lonnegan, who is in space with Astronaut Mancuso.",
                    "created": "Sun, 21 Jan 2024 19:23:01 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Bull Mancuso in space, experimenting with basketball. ",
                    "created": "Sun, 21 Jan 2024 19:24:42 GMT",
                    "inlineImage": "https://imgs.scripting.com/2024/01/21/muckyAndBullInSpace.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}