{
    "created": "2024-01-24T05:00:00.000Z",
    "flInCalendar": true,
    "name": "24",
    "path": "2024/01/24",
    "text": "January 24",
    "type": "calendarDay",
    "subs": [
        {
            "text": "BTW, we're <a href=\"https://imgs.scripting.com/2024/01/24/slowAllTab.png\">aware</a> that the <i>All</i> tab on \"news.scripting.com\" is pretty slow. It's taking about 15 seconds to load. There are a lot of ways we can improve the performance, but are first looking into possible problems in the software. ",
            "created": "Wed, 24 Jan 2024 14:47:24 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The Knicks beat the Nets last night, in the way the Knicks used to get beat, in the last minute of the game. I felt bad for the Nets. It wasn't that long ago that the Nets were super-irritating because they had been taken over by two reallllly ugly NBA players, Kevin Durant who isn't worthy of NY's basketball fans, what a total piece of shit, but even worse, his best friend Kyrie who is either a complete fucking idiot, or a Jew-hater. Probably both. Why is he an idiot? Because he accidentally revealed that NBA players probably all hate Jews, not one would speak up for our people. The best they could say is that Kyrie shouldn't have said what he said. How revealing. Not that the Holocaust was real, and is remembered by its children, who were raised to believe it would happen again, as it appears to be. Anyway, the Nets have moved past that, and they are after all a NYC-based team, and are playing with the haplessness of typical our pro teams, and deserve some of our sympathy. But -- not saying the Knicks should have let them win, or that I was even slightly rooting for them. But I was embarrassed that there were far more Knicks fans in attendance than Nets fans, and I still don't admit that there are actually any Nets fans in NYC. ",
            "created": "Wed, 24 Jan 2024 13:25:53 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2024/01/24/linsanity.png",
            "flInCalendar": true
        },
        {
            "text": "I also watched Nikki Haley speak for the first time last night, and was impressed. She held my attention through the whole speech, and that's hard to do when the Knicks are playing on another channel. I listened carefully to every word. It was a well-written speech and said some things that needed to be said about Trump, things that he won't have a response to, since you can't control or spin how old you are. We can all see Trump aging on screen, even his fans must see it and like those of use who will vote for Biden, they must wonder if he can make it much further. If you had cast a great presidential candidate, in Hollywood, Nikki Haley comes pretty damn close. But while she was speaking I remembered that she is a Republican and thought of Roe v Wade, and remembered that while she might not be able to or even want to fully dismantle democracy, she is backing a form of slavery for all American women. A good actor, but a person I could never trust. But, I just want to say that she should continue to speak. She might be able to pull is in an interesting new direction, not by winning, but by opening people's minds to the idea of a young vital leader engaged in the real world. It would be a nice thing for the good old USA. ",
            "created": "Wed, 24 Jan 2024 13:37:54 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Happy <a href=\"http://scripting.com/2024/01/23.html\">40th</a> to the Mac. ",
            "created": "Wed, 24 Jan 2024 13:25:40 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}