{
    "created": "2024-01-26T05:00:00.000Z",
    "flInCalendar": true,
    "name": "26",
    "path": "2024/01/26",
    "text": "January 26",
    "type": "calendarDay",
    "subs": [
        {
            "text": "<a href=\"https://www.threads.net/@jeffjarvis/post/C2hkFNXu_Sx\">Jeff Jarvis nails it</a>. They need a public editor at the NYT to point out, under the NYT banner, when they break the deal they made with their readers, to keep their interests separate from their editorial work.",
            "created": "Sat, 27 Jan 2024 01:33:45 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I don't think there is a curiosity gene. Instead some people are, I assume, not raised to think creatively. I was challenged intellectually by my parents from a very young age, asked to think about things that maybe most kids don't get asked about. Somehow my mind was trained to ask questions. What a perfect time it was to be born. Because along come personal computers, where you don't have to use someone else's hardware to explore. And then the web. And now AI. At this point you can't see the horizon, you don't have an idea what the limits are, but you can see some of the paths that lead beyond where you are. It's wonderful to watch people explore this. We can do that because we have the web and personal computers. See how these things build on each other? We were able to do podcasting because we had a way to spread the word through our blogs. One bootstrap leads to others. ",
            "created": "Fri, 26 Jan 2024 21:59:19 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2023/04/01/siliconValley.png",
            "flInCalendar": true
        },
        {
            "text": "I have never been good at drawing but I still have ideas for visual art. Now I have an interpreter to help express them.",
            "created": "Fri, 26 Jan 2024 22:06:17 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://www.facebook.com/stan.krute/posts/pfbid0R7d2eJNAPqzoiaXrGDDQBUsXdZtGHHZPEXGTKfA7XgQmNrzwWGq4aFAHLi7jPK3Dl\">Stan Krute</a> is a ChatGPT explorer. If you're on Facebook, maybe you can follow him. He's discovering new things all the time with the drawing capability of ChatGPT.",
            "created": "Fri, 26 Jan 2024 22:05:15 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2024/01/26/cartoonChicken.png",
            "flInCalendar": true
        },
        {
            "text": "In a comment on one of Stan's post, <a href=\"https://www.facebook.com/stan.krute/posts/pfbid0R7d2eJNAPqzoiaXrGDDQBUsXdZtGHHZPEXGTKfA7XgQmNrzwWGq4aFAHLi7jPK3Dl?comment_id=1508870853009664\">Josh Cox</a> said: \"Might be my morbid sense of humor but I'd be interested to see its take on chickens in a human processing plant.\" Okay so I <a href=\"https://imgs.scripting.com/2024/01/26/chickens.png\">asked ChatGPT</a> to do it. Tell me it doesn't have a sense of humor, and it's the opposite of morbid. :smile:",
            "created": "Fri, 26 Jan 2024 22:08:01 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "On Threads, <a href=\"https://www.threads.net/@davew/post/C2kb5UkLtV0\">Guy Kawasaki says</a>: \"Every day I ask myself at least once, 'How did we do this before ChatGPT?'\" He's writing database queries in his prompt. It won't be long before he has an idea for how spreadsheets should work, or a writing tool, and getting ChatGPT to write it for him. It'll be ready to download before he can load the page. We just have to make sure the open protocols are there for him to build on. It's possible that's not something the bots will be able to do on their own. ",
            "created": "Fri, 26 Jan 2024 22:06:56 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}