{
    "created": "2024-01-27T05:00:00.000Z",
    "flInCalendar": true,
    "name": "27",
    "path": "2024/01/27",
    "text": "January 27",
    "type": "calendarDay",
    "subs": [
        {
            "text": "A fundamental law of the internet says that social situations are nice at first then become shitty as trolls take over.",
            "created": "Sat, 27 Jan 2024 14:12:11 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "When people say we should walk away from Twitter because the owner is a Nazi, well -- are they willing to stop using products from all companies that are owned by Nazis? I bet that would be pretty hard to do. If you add in racists I think you'd be totally out of luck. The people who own the businesses we depend on by and large are pretty awful people. Also I go to NYC even though there are Nazis there (esp Queens and Staten Island). And Twitter has far more users than NYC has citizens. That gives you a sense of how foolish this idea of boycotting Twitter is. And one more thing -- if you're posting about this need to vote with your feet, you should get your ass off Threads because it's really Facebook, and remember you're a very high-minded person, right?  ",
            "created": "Sat, 27 Jan 2024 15:54:56 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2021/10/07/drummer.png",
            "imageLink": "http://scripting.com/2021/01/26.html",
            "flInCalendar": true
        },
        {
            "text": "Imho, whether you or I use Twitter makes absolutely no difference to anyone. ",
            "created": "Sun, 28 Jan 2024 02:05:22 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "One of the rules of \"textcasting\" is that the writer must be able to edit their posts. An almost universal response is the way Twitter used to explain their not having editable posts -- then people who commented might have said something that seems foolish. I have a couple of rebuttals to that. 1. Then don't comment on what the author said, instead write what you know or believe, so it would make sense even if the author changed their post. This is a good practice anyway, instead of saying people are wrong, just state your belief. It's a lot easier for people to listen to, and by the way the other person might be right. 2. A counter-example -- Facebook. They let authors edit their posts and comments. And somehow it keeps working more or less. Their software does add a note that the text has been edited, and I think they even have a way for you to see the changes, but who bothers. Comments are usually simple \"you go girl\" or \"my brother\" or \"I'm great!\" or \"check out my site.\" ",
            "created": "Sat, 27 Jan 2024 15:36:30 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}