{
    "text": "Democratic mistakes",
    "created": "Fri, 08 Nov 2024 12:30:49 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I've actually written a lot, but haven't wanted to publish most of it. So many reasons why the Dems lost. Maybe I should just list them.",
            "created": "Fri, 08 Nov 2024 12:10:33 GMT",
            "type": "outline",
            "flNumberedSubs": "true",
            "subs": [
                {
                    "text": "Biden shouldn't have run again. There would have been a primary. Given the result of the election this week, we should have found out what support each candidate had with voters. We didn't get to choose the candidate. That said Harris ran a fantastic campaign. ",
                    "created": "Fri, 08 Nov 2024 12:24:25 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Biden should not have shut down his campaign website. Rather than using it to raise money to feed to the media industry, they should have organized and listened, to develop new channels of communication with voters that were not dependent on journalism. Every time the Dems run a campaign, win or lose, they shut down their connection to the electorate. The voters' only role in the party was when they needed our money and our vote. <b>We were not part of governing</b>. Huge mistake. And I'm not just saying that now, I've said that about every Democratic campaign since Obama. This is probably the biggest single mistake the Dems keep making.",
                    "created": "Fri, 08 Nov 2024 12:26:56 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "We needed a prosecutor at the top of Justice. I don't know what Garland actually did, but I'm sure it will all be swept out by whoever is Trump's AG. ",
                    "created": "Fri, 08 Nov 2024 12:25:46 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Men's votes need to be sought and welcomed, specifically. So much has been done to alienate male voters, which is why so many voted for Trump. We could have had a bunch of them this year, if we had only spoken to them with respect. ",
                    "created": "Fri, 08 Nov 2024 15:56:24 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "I don't know if we can reboot the Democrats as an opposition party given all these problems. Whatever comes next is going to perform very differently from the party that lost this election. If we try to do it again the same old way, it will fail even worse. I think everyone knows this by now. ",
            "created": "Fri, 08 Nov 2024 12:33:20 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}