{
    "text": "Watching last night's playoff game between the Yankees and Astros, there was a moment when the camera zero'd in on the Houston pitcher, doing nothing. The announcers describe the scene. Someone from the crowd had run out on the field and <a href=\"https://twitter.com/AriA1exander/status/1583287947469918208\">tried to hug</a> the Houston infielder <a href=\"https://en.wikipedia.org/wiki/Jos%C3%A9_Altuve\">José Altuve</a>. They described how the police were trying to catch the guy. How much would his lawyers cost for this? $10K another announcer thought. And he'll spend the night in jail, another collegue guessed. But we didn't see any of this. The camera never pointed at the action because to do so, <a href=\"https://www.mlb.com/\">MLB</a> felt, would encourage people to do more of this. It's a rule for a kind of journalism, <a href=\"https://en.wikipedia.org/wiki/Sports_commentator#Main/play-by-play_commentator\">sports play-by-play</a>. I don't think there's much actual journalism in the coverage of professional sports (I can go into that another time). Okay so what if there were a similar rule to political journalism, if they were not allowed to run stories based only on polling. For a different reason, because polling has proven to be wildly wrong in the last few elections. Polls were almost certain <a href=\"https://en.wikipedia.org/wiki/Nationwide_opinion_polling_for_the_2016_United_States_presidential_election\">HRC</a> would win. They got whole sections of the country wildly wrong. Many other examples. There are theories about why this is, but no one knows. So it seems hugely damaging, even unprofessional to report poll results as news, esp when it isn't disclaimed in the headline, so it's clear they're writing about fiction and the story is almost certainly 100% [[bullshit]]. ",
    "created": "Fri, 21 Oct 2022 15:51:50 GMT",
    "type": "outline",
    "image": "http://scripting.com/images/2022/10/21/altuve.png",
    "urltweet": "https://twitter.com/AriA1exander/status/1583287947469918208",
    "flInCalendar": true
}