{
    "created": "2022-04-01T04:00:00.000Z",
    "flInCalendar": true,
    "name": "01",
    "path": "2022/04/01",
    "text": "April 01",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I hate April 1 on the web and esp in news orgs, whose <i>business</i> is posting stuff that's true. I tend to take things literally as I read them, and puzzle my way through strange news, until it hits that I've been burned. I waste a fair amount of time on April 1 wading through this nonsense. The only thing you can do is let people know in advance that if they troll you with one of these things, if it's on a system where I can block you, that's what I do. If it's a news org, I try to remember never to trust anything they write, because they clearly have no respect for their own mission. So I posted a <a href=\"https://www.facebook.com/dave.winer.12/posts/1729710617236336?comment_id=1729845797222818\">message</a> on <a href=\"http://scripting.com/images/2022/04/01/fbwarningaboutapril1garbage.png\">FB</a> and <a href=\"https://twitter.com/davewiner/status/1509848417098518534\">Twitter</a> establishing this rule, and wouldn't you know it, some people actually post \"jokes\" there. Mostly it's harrassment. Bitterness I guess. They don't like life, so they drop little turds on message threads to get attention. Yes I block them. Yes, it's tiresome. There is a certain amount of overhead to maintaining one's integrity. If you say you're going to block someone, you have to actually do it. Kind of like the <a href=\"https://www.youtube.com/watch?v=oGfvV3Syud8\">second to last scene</a> in <a href=\"https://en.wikipedia.org/wiki/No_Country_for_Old_Men_(film)\">No Country for Old Men</a>, if you remember it.  I got here the <a href=\"http://scripting.com/images/2022/04/01/gotHereTheSameWayTheCoinDid.png\">same way</a> the coin did. Gotta do what I gotta do. ",
            "created": "Fri, 01 Apr 2022 16:55:52 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/08/27/businessmanWithAGun.png",
            "flInCalendar": true
        },
        {
            "text": "I love <a href=\"https://en.wikipedia.org/wiki/Dickinson_(TV_series)\">Dickinson</a> on AppleTV+. ",
            "created": "Fri, 01 Apr 2022 20:53:09 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "How does the market feel about a <a href=\"https://twitter.com/Twitter/status/1509951255388504066\">public company</a> making forward-looking April Fool jokes?",
            "created": "Fri, 01 Apr 2022 20:50:08 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I end all my Peloton workouts, while I do a few cool-down laps, with two songs. <a href=\"https://www.youtube.com/watch?v=azdwsXLmrHE\">Radio Gaga</a> and <a href=\"https://www.youtube.com/watch?v=t1Jm5epJr10\">I Am The Walrus</a>. They're my reward for taking care of myself, which is of course its own reward. ",
            "created": "Fri, 01 Apr 2022 20:46:27 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I heard a BBC reporter ask a Ukrainian official if they would attack Russian military in Russia. What kind of question is that. Of course they would. It's a war. Russia attacked Ukraine. All of Russia is a fair target for the Ukraine military.",
            "created": "Fri, 01 Apr 2022 13:32:53 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "There are too many niches in tech. Niches are defended by lack of interop. You can see categories being born with limited interop, features vendors can say deliver interop, it would be hard to argue, but they don't deliver much practical interop for users. That's why the tech industry was so ho-hum about RSS. Where's the fun for them if they can't lock users into a niche product and then another and another? As a technologist, what gets me excited about computer networks are all the combinations users can make, but that works only if there's <i>lots</i> of interop.        ",
            "created": "Fri, 01 Apr 2022 14:01:37 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/09/17/simpsonsBeeGuy.png",
            "flInCalendar": true
        },
        {
            "text": "Welcome to the month of April. The usual <a href=\"http://scripting.com/2022/03/01/134432.html?title=theMonthlyRitual\">monthly rollover</a> is done. Here's the <a href=\"https://github.com/scripting/Scripting-News/blob/master/blog/opml/2022/03.opml\">archive</a> for March. ",
            "created": "Fri, 01 Apr 2022 13:21:41 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<img src=\"http://scripting.com/images/2022/04/01/wordle.png\">",
            "created": "Fri, 01 Apr 2022 13:27:19 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}