{
    "created": "2022-04-03T04:00:00.000Z",
    "flInCalendar": true,
    "name": "03",
    "path": "2022/04/03",
    "text": "April 03",
    "type": "calendarDay",
    "subs": [
        {
            "text": "A <a href=\"https://www.youtube.com/watch?v=vdvnOH060Qg\">fine</a> <a href=\"https://en.wikipedia.org/wiki/Happiness_Is_a_Warm_Gun\">song</a> for a rainy Sunday.",
            "created": "Sun, 03 Apr 2022 20:55:08 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=vdvnOH060Qg",
            "flInCalendar": true
        },
        {
            "text": "I am soooo glad that <a href=\"https://nintendoswitchsports.nintendo.com/?cid=N1101-01:ch=pdpd\">sports</a> are coming to the <a href=\"https://en.wikipedia.org/wiki/Nintendo_Switch\">Nintendo Switch</a>. Now I will use mine. I thought they would, of course, have ported <a href=\"https://en.wikipedia.org/wiki/Wii_Sports\">Wii Sports</a> to the Switch as the first thing. Kind of like MacWrite and MacPaint. I never bought any other software for my Wii. The fact that I could play tennis in my living room, or golf or go bowling -- that's all I ever wanted. I imagine the new Sports will do a bunch of things the original couldn't, they've had fourteen years to work on it. ",
            "created": "Sun, 03 Apr 2022 13:35:16 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2022/04/03/mii.png",
            "flInCalendar": true
        },
        {
            "text": "Will I ever stop using <a href=\"http://daytona.scripting.com/?q=wordle&collection=scriptingnews\">Wordle</a> or is this a chronic addiction?",
            "created": "Sun, 03 Apr 2022 13:35:01 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Ken Smith <a href=\"https://twitter.com/KenSmith/status/1510577457979662339\">says</a> Twitter is anti-writer. Hmm. Interesting thought.",
            "created": "Sun, 03 Apr 2022 13:52:15 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "One  of  these  decades  the tech industry is going to grow the fuck up and stop insisting on being the boy wonder and respect what has been accomplished before they showed up. Then we won’t have to constantly be retooling and ripping up the pavement and starting over.",
            "created": "Sun, 03 Apr 2022 13:51:50 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "If the Dems had a passion for humanity they’d ratify <a href=\"https://en.wikipedia.org/wiki/Supreme_Court_of_the_United_States#Size_of_the_court\">twenty</a> new Supreme Court justices this year, and pass a law that  limits the term of a justice to ten years. I am not a lawyer but I read <a href=\"https://www.audible.com/pd/Allow-Me-to-Retort-Audiobook/B09TCG7PMK\">a book written by one</a> and this is what the author recommends. ",
            "created": "Sun, 03 Apr 2022 20:05:21 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I'm working on a piece of software built around a single closure. The data type that's at the center of the user experience. When you create it as a closure, it is very easy to tweak it up. Every instance of a closure is a little world unto itself. You have to set up protocols for the outside world to speak to the object. That's good because there can't be any other interactions. When debugging you just have to look there. And when there are no deeply hidden bugs, its deliciously easy to work on. But when you type <code>[feedItem, theFeed]</code> when you really meant <code>{feedItem, theFeed}</code>, and your eyes are imperfect as mine are, and you tend to see what you expect to see in debugging, and miss the little subtle mistakes. Whether you use square or curly brackets makes all the difference in the world. It can turn rich structures into <code>undefined</code>. And all the debugging code in the world doesn't help until you see the square brackets are where there should be curly ones. I think this is a lot like Wordle. The pattern has to be seen by the subconscious. You don't move on until you've solved the problem. But unlike Wordle you get as many tries as it takes. ",
            "created": "Sun, 03 Apr 2022 13:28:38 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "BTW, written explanations of <a href=\"https://en.wikipedia.org/wiki/Closure_(computer_programming)\">closures</a> always read like gobbledygook. Here's what I would say. A closure is an <i>instance</i> of a function, as opposed to a <i>call</i> to a function, but they start life as a call. If when you call the function, it still has work to do, in the form of local functions that run every second or minute, for example, or to respond to messages from the outside, such as a click on an object it created (and is linked into the DOM), or an HTTP request, then all its data sticks around. And it's private to the function, no one else can get at it. That helps you keep the overall program simpler, there are fewer things that can go wrong.  Now as I read this I'm not sure I got it, but it's close. I guess the thing is I've never written an interpreter for a language that has closures. In my experience that's when you really understand a piece of machinery, when it stops being magic -- when you've implemented it. ",
            "created": "Sun, 03 Apr 2022 13:44:25 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The problem with Worldle",
            "created": "Mon, 04 Apr 2022 03:47:09 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "The Wordle-clone for geography is <a href=\"https://worldle.teuteuf.fr/\">Worldle</a>. At first it looked promising, but in the end, it's usually either impossible, there are huge numbers of tiny island nations in every ocean and sea on the planet, or totally obvious like today's \"puzzle,\" an instantly-recognizable landmass for probably everyone with an internet connection.",
                    "created": "Mon, 04 Apr 2022 03:47:15 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Today's <a href=\"https://worldle.teuteuf.fr/\">Worldle</a>, no spoilers so I didn't solve it for you. :smile:",
                    "created": "Mon, 04 Apr 2022 03:48:52 GMT",
                    "inlineImage": "http://scripting.com/images/2022/04/03/worldlePuzzle.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}