{
    "created": "2022-04-11T04:00:00.000Z",
    "flInCalendar": true,
    "name": "11",
    "path": "2022/04/11",
    "text": "April 11",
    "type": "calendarDay",
    "subs": [
        {
            "text": "There's a technique in movies where the camera follows the star doing something very ordinary. Like walking into a store. Or just driving their car. The camera is looking at the driver, then focuses on what's happening outside, to get your mind to consider that. It's at this point that you know that something momentous and bad is about to happen. In some movies it's a car crash. Or the star gets shot. Or someone runs in front of the car. There are some movies where the director doesn't prepare you for The Bad Thing, and if it's done well it can be very disturbing (if you've seen <a href=\"http://daytona.scripting.com/?q=The%20Departed&collection=scriptingnews\">The Departed</a> you know what I mean). Anyway, today I was walking in the springtime garden outside my house, with all the debris from fallen trees and branches. It was a rough winter. And I become conscious in a way that happens sometimes. It's uncomfortable because you connect to your animal-ness in a way that's a lot more real than usual. I always get nervous that something momentous and bad is about to happen. The feeling of consciousness in the moment and the movie-maker's technique are the same thing, and it's why you have the feeling of dread watching the movie, and in real life. Only in the movie the bad thing always happens and in real life (so far) it never does. ",
            "created": "Mon, 11 Apr 2022 23:00:51 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/06/20/van.png",
            "flInCalendar": true
        },
        {
            "text": "BTW, I have experienced momentous and bad things, and have never had this kind of super conscious awareness preview. My 18-year-old uncle driving his car at 60 mph on city streets in <a href=\"https://en.wikipedia.org/wiki/Elmhurst,_Queens\">Queens</a>, going through a stop sign. A car coming the other way smashes into ours. No seatbelts. Our car spins around, my head crashes into the window, breaks it. I get out of the car and run around a few times and then pass out. Broken collarbone. I don't remember any of this, I didn't experience it, consciously. I was told this is what happened and what I did. There was no fear, presumably because fear wouldn't have helped me survive?",
            "created": "Mon, 11 Apr 2022 23:09:34 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "In the 90s when I was studying massage, my <a href=\"http://jeru.scripting.com/\">teachers</a> wanted us to be in this hyper-conscious mode always, 24 hours a day, 7 days a week. I think. I rarely attain that. Most of the time I'm in my movie. Maybe that's why the awareness of my personal presence in a scene in my movie is so alarming. ",
            "created": "Mon, 11 Apr 2022 23:23:41 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "\"In my movie\" is a mode of living that's detached from reality, in memory. We're all doing it all the time. Each of us is the star in our own movie, the center of existence, when in fact we're just one of <a href=\"https://en.wikipedia.org/wiki/World_population\">7.9 billion humans</a> on an <a href=\"https://www.youtube.com/watch?v=wupToqz1e2g\">insignificant planet</a> orbiting a boring star, in a galaxy that's one of a <a href=\"https://bigthink.com/starts-with-a-bang/how-many-galaxies/\">two trillion galaxies</a> in the known universe. Each of us are, in fact, the star of nothing that matters. ",
            "created": "Tue, 12 Apr 2022 03:19:19 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I would love to see a Democratic ad that went like this. \"The Supreme Court could overturn Roe v Wade this summer. The best way fight back is to make sure the Democrats have a majority in the Senate. Here's what you must do.\"",
            "created": "Mon, 11 Apr 2022 18:52:59 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "BTW, you can use \"Drummer\" to read the DaveNet outlines. Here's a <a href=\"http://drummer.scripting.com/?url=https://raw.githubusercontent.com/scripting/Scripting-News/master/blog/opmlOtherSources/DaveNet/1997.opml\">link</a> that opens the 1997 DaveNets. You just have to change the number in the URL to open a different year. I picked 1997 because that was a big year for innovation. The basic ideas of blogging were starting to become pretty obvious. And it's all there in the archive. ",
            "created": "Mon, 11 Apr 2022 15:48:05 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I am happy to <a href=\"http://this.how/davenetInOpml/#1649683430000\">report</a> that as far as I can tell all of DaveNet, 1994-2004, is in the Daytona database and is searchable. Yay! Ten years of writing restored. Not bad.",
            "created": "Mon, 11 Apr 2022 13:55:50 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}