{
    "created": "2022-04-17T04:00:00.000Z",
    "flInCalendar": true,
    "name": "17",
    "path": "2022/04/17",
    "text": "April 17",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Om Malik's <a href=\"https://om.co/2022/04/15/musk-or-not-twitter-ceo-needs-to-go/\">must-read</a> on the full picture at Twitter. ",
            "created": "Sun, 17 Apr 2022 15:19:29 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "From watching Severance twice, I now know why, when Helly goes out through the exit, trying to escape, she immediately comes back through the same door she went out from. It wasn't metaphysical. There's a simple explanation for it. ",
            "created": "Mon, 18 Apr 2022 03:59:27 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Tell someone they did something good, or they look nice, or they're a great friend. Or give them something nice to eat. I just realized it's so rare that we do this. Everyone's looking for a nice word of praise or reassurance. We treat our pets better than our human friends.",
            "created": "Sun, 17 Apr 2022 13:05:13 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "A more concise brain dump",
            "created": "Sun, 17 Apr 2022 16:12:55 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Key point -- Twitter has been going nowhere for its whole life, just drifting, aimlessly.",
                    "created": "Sun, 17 Apr 2022 16:13:13 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The companies Musk leads do not drift. They create amazing products that change things. ",
                    "flInCalendar": true
                },
                {
                    "text": "The way we need Twitter to change.",
                    "created": "Sun, 17 Apr 2022 16:13:37 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Here's the <a href=\"https://twitter.com/davewiner/status/1515721884461146119\">full thread</a>.",
                    "created": "Sun, 17 Apr 2022 16:13:38 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Let a thousand Twitters bloom",
            "created": "Sun, 17 Apr 2022 15:24:58 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "A rambling brain dump about Twitter and Musk.",
                    "created": "Mon, 18 Apr 2022 03:43:20 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Self-moderation is going to be a huge deal. Maybe something like self-driving Teslas. Which the driver controls, btw. It isn't a passive thing. If a Musk company can do that, yeah I think they can give users more control over the bullshit they have to deal with on Twitter. The thing is Twitter has been stuck since 2006 when it started. They hired people to make the system run reliably, which is fantastic, hat's off, but it needs a few more things to be able to realizae its potential as a world-scale notification system for all kinds of networked writing. ",
                    "created": "Sun, 17 Apr 2022 15:25:07 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Maybe to make something workable you have to start something new, not in a half assed way.. Or maybe a no-bullshit capitalist like Musk can make it come about from the chaos of Twitter.",
                    "created": "Sun, 17 Apr 2022 15:25:16 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Most people have no idea how software works and is made. ",
                    "created": "Mon, 18 Apr 2022 03:27:49 GMT",
                    "type": "outline",
                    "flInCalendar": true
                },
                {
                    "text": "A Twitter-like webservice at <a href=\"https://en.wikipedia.org/wiki/Amazon_Web_Services\">AWS</a>. With better docs and a JavaScript API that doesn't require developer to run a server (big deal). Effortless install on Digital Ocean.",
                    "created": "Sun, 17 Apr 2022 15:25:22 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Let a thousand Twitters bloom.",
                    "created": "Sun, 17 Apr 2022 15:31:32 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Interop baked in from the beginning.",
                    "created": "Sun, 17 Apr 2022 15:25:57 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Look, Elon made buying a car a completely online experience, moving around huge amounts of money and metal and an explosion in demand. Buying a Tesla was like buying a Mac in 1984 or an iPhone in 2007, except they're doing it 365 days a year for years. And buying a StarLink is just as easy and just as much of a sensation. If this is easy to do why do so few companies do it?",
                    "created": "Sun, 17 Apr 2022 15:26:17 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "BTW, if Musk was trying to buy my bank, I'd be all for it. That's how bad their software is. All banks have shit software, btw, near as I can tell. ",
                    "created": "Sun, 17 Apr 2022 15:27:15 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Seriously, if you think he can't run Twitter when he can run StarLink and Tesla, please. And why should Twitter be stuck in the mud like it has been since inception. It desperately needs some fixes, and at a minumum must be made easier to peer with. Developers can do all the work if they just add a few simple features that they probably already have implemented. ",
                    "created": "Sun, 17 Apr 2022 15:27:35 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I was an Apple dev in 1997 when Jobs came back. Musk is like Jobs in that he won't be scared to make the big changes that are needed. ",
                    "created": "Sun, 17 Apr 2022 15:28:54 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "We're lucky a guy like Musk is hanging around and willing to take on this job. ",
                    "created": "Sun, 17 Apr 2022 15:30:40 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "And as usual the journalists see a teeny little corner of the picture and are screaming about that. ",
                    "created": "Sun, 17 Apr 2022 15:30:56 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Diego Rivera",
            "created": "Sun, 17 Apr 2022 15:37:05 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2022/04/17/theMilliner.png",
            "subs": [
                {
                    "text": "<a href=\"https://www.diego-rivera-foundation.org/The-Milliner-Potrait-Of-Henri-De-Chatillon-1944.html\">The Milliner. Potrait of Henri de Chatillon</a>, 1944.",
                    "created": "Sun, 17 Apr 2022 15:37:18 GMT",
                    "inlineImage": "http://scripting.com/images/2022/04/17/theMilliner.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}