{
    "created": "2022-04-22T04:00:00.000Z",
    "flInCalendar": true,
    "name": "22",
    "path": "2022/04/22",
    "text": "April 22",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Netflix should have something nice like \"bingeworthy\" for people to find out what’s good from friends.",
            "created": "Sat, 23 Apr 2022 02:08:49 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "What I want to hear: Audio of Trump talking with Congress people from the White House, in the Capitol, while the riot was taking place. I want to hear the fear in their voices, and the pathology in Trump's. If the <a href=\"http://scripting.com/2022/04/21.html#a021116\">reporters</a> have that audio, release it now.",
            "created": "Fri, 22 Apr 2022 19:23:59 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I'm convinced <a href=\"https://en.wikipedia.org/wiki/Sarah_Sherman\">Sarah Sherman</a> is the next <a href=\"https://en.wikipedia.org/wiki/Saturday_Night_Live\">SNL</a> star. There isn't very much of her yet, the best stuff are <a href=\"https://www.youtube.com/watch?v=FivN1PZxWeA\">two</a> <a href=\"https://www.youtube.com/watch?v=kViC3pTtHrE\">appearances</a> on Weekend Update where she acts like a lunatic, roasting Colin Jost. ",
            "created": "Fri, 22 Apr 2022 14:31:46 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I'm working my way through Paul McCartney's <a href=\"https://en.wikipedia.org/wiki/McCartney_(album)\">first solo album</a>. It was as big an event in 1970 as Elon Musk tweeting that he wanted to acquire Twitter in 2022. The album amounted to the <a href=\"https://en.wikipedia.org/wiki/McCartney_(album)#Press_release_and_the_Beatles'_break-up\">announcement</a> that the Beatles were broken up. In fact, Lennon had already quit the group, but hadn't announced it publicly. But it's a <i>good</i> album. I listened the hell out of it when I was a teen and in my 20s, but never really <i>listened</i> to it if you know what I mean. Like try <a href=\"https://www.youtube.com/watch?v=WrCppWWmIGQ\">this song</a> out. Or <a href=\"https://www.youtube.com/watch?v=N6XB2STqyKY\">this</a>. So much to listen to. And he did the album, in secret, and on really low tech hardware with no mixing board. Just four tracks straight to tape. Much more lightly produced than Beatles songs, no grand George Martin productions, just McCartney and that's worth something.",
            "created": "Fri, 22 Apr 2022 14:24:09 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Here's the thing about Mark Zuckerberg's <a href=\"https://www.nytimes.com/2021/10/29/technology/meta-facebook-zuckerberg.html?unlocked_article_code=AAAAAAAAAAAAAAAACEIPuomT1JKd6J17Vw1cRCfTTMQmqxCdw_PIxftm3iWna3HNDmwTiPgYCIiG_EPKarskYtYv1nGVTdRMOrgoR7lg0-RcMlZnRhOn5JuYnZBPawMElbWOZEJklZTcQeJ_tjbwcmiyLOo4lOy050mIaTH1X_SIgWkmdFk2vcNlJVy1inwCwabPQeR02tIuzu5hUs4hPUoIZiGMu_foDwwve4nVK0GBtXRlHr1RSjrRntWD6r8fcw40CVnOTnh34mtU-8oLcZpMf_65d0h8DZK41bYBCWVoL5OrA4kxROXXlLZrsr3NrH-c2R3VhMC2sBl-WfIShpbC5YQ&smid=url-share\">dream</a> of the Metaverse. It's like <a href=\"https://secondlife.com/\">Second Life</a>. And Second Life was boring. All kinds of people said it was the next big thing, but they were people who generally didn't correctly spot big tech things. But there are life simulations that did catch on. I loved <a href=\"https://en.wikipedia.org/wiki/SimCity\">SimCity</a> and <a href=\"https://en.wikipedia.org/wiki/The_Sims\">The Sims</a>. Poured endless hours into them. The difference is that they are third person and Second Life was first person. In The Sims you get to play god. It must not be a lot of fun for the <a href=\"http://scripting.com/images/2022/04/22/sims.png\">virtual people</a> in The Sims, but it sure is fun to play god. Maybe Zuck should check that out. An online system where everyone gets to be a tech trillionaire with a massive family <a href=\"https://www.theguardian.com/technology/2017/jan/23/mark-zuckerberg-hawaii-land-lawsuits-kauai-estate\">compound</a> in Hawaii and nukes (like Putin) and you get to do whatever you want with the poor <a href=\"https://en.wiktionary.org/wiki/schnook\">schnooks</a> (who aren't actual people, btw). That's where the <i>virtual</i> in virtual reality is fun, when you get to be Elon Musk and own your own Twitter for example. Isn't that the dream we all had as kids, that we'd grow up and then we'd show them. I used to have images of my father, locked in a tiny bathroom, with a bowl of spaghetti poured on his head. I would say to him \"You're staying in there until you learn some manners, young man!\" It was a nice dream then, truthfully it still is. :smile:",
            "created": "Fri, 22 Apr 2022 12:15:44 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2022/04/22/aSim.png",
            "flInCalendar": true
        },
        {
            "text": "I'd love to see some publication do a comparison of legal cannabis in various different states. How does the quality compare, prices? What states have public places like bars and coffee shops where it's legal to hang out and consume as in Amsterdam (where it's not legal, I know, but tolerated). New Jersey just opened yesterday, and I was interested in seeing how prices compare to those in Massachusetts. Too early to draw any conclusions. But I can tell you that it's way more expensive than in Washington or Oregon. ",
            "created": "Fri, 22 Apr 2022 12:13:17 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I'm rooting against Durant",
            "created": "Fri, 22 Apr 2022 21:43:20 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "KD, with all due respect, I'm thinking about you tonight because tomorrow your team, the NBA team that plays in Brooklyn, will be returning, down 2-0 vs the Celtics, and I'm dreaming that Barclays will be filled with Celtics fans. ",
                    "created": "Fri, 22 Apr 2022 21:43:26 GMT",
                    "image": "http://scripting.com/images/2022/04/22/tatum.png",
                    "flInCalendar": true
                },
                {
                    "text": "There won't be any Nets fans there, maybe a few Knicks fans who would be willing to root for the Nets if Durant <a href=\"https://nypost.com/2017/08/16/kevin-durant-disses-knicks-nyc-hoops-while-in-town/\">hadn't</a> so thoroughly <a href=\"https://nypost.com/2020/02/06/kevin-durant-i-never-considered-playing-for-the-knicks/\">dis'd</a> Knicks fans and the Garden when they came to town. Who exactly do you think comes to games in the Garden? We sure as hell aren't Nets fans. And that's what's going to greet them tomorrow night. An arena full of Knicks and Celtics fans. ",
                    "created": "Sat, 23 Apr 2022 01:54:55 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "If he wants the support of NY basketball fans, he should say so, and maybe even apologize for dis'ing us when he came to town. Until then, this lifelong Knicks fan is going to be rooting for the Celtics, and yes I know that's weird. ",
                    "created": "Sat, 23 Apr 2022 01:54:50 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Frida Kahlo",
            "created": "Fri, 22 Apr 2022 15:58:43 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2022/04/22/kahloSelfPortrait.png",
            "subs": [
                {
                    "text": "<a href=\"https://www.fridakahlo.org/self-portrait-dedicated-to-dr-eloesser.jsp\">Self Portrait Dedicated to Dr Eloesser</a>, 1940.",
                    "created": "Fri, 22 Apr 2022 15:58:46 GMT",
                    "inlineImage": "http://scripting.com/images/2022/04/22/kahloSelfPortrait.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}