{
    "created": "2022-04-24T04:00:00.000Z",
    "flInCalendar": true,
    "name": "24",
    "path": "2022/04/24",
    "text": "April 24",
    "type": "calendarDay",
    "subs": [
        {
            "text": "The <a href=\"https://nypost.com/2022/04/23/nba-playoffs-2022-nets-fall-into-3-0-hole-after-loss-to-celtics/\">Nets lost</a> last night, playing at Barclay's in Brooklyn. There weren't many people rooting for the Nets in the arena. There was a lot more enthusiasm for the Celtics, because they're an exciting team and they're going somewhere. Boston is close and NYC is so huge there are already a fair number of Celtics fans here. Today's Nets don't have a home court. They haven't sold the idea of the Nets to the NBA fans here. NYC is huge, even a team without much of a following should be able to fill the arena with enthusiasm. But Kevin Durant, the leader of the team, the reason the Nets are supposedly contenders, never approached the city as something he had to win over. They must've thought fans are simple. They loved me in Oklahoma and Oakland, of course they'll love me here. I don't think anyone in particular loved KD in Oakland, they do love Curry, Thompson and Green. KD was a carpetbagger in Oakland as he is in NYC. He came to the city with disrespect for NBA fans here. He could have said hey it's great to be in NY, love the energy of Knicks fans, I hope some of you will come out to see the Nets. That would've been appropriate. Instead he disses the Knicks, the Garden and by implication those of us who have suffered with the Knicks all these years. Yeah we know they suck, but we <i>love</i> them. They're family. You don't get to dis them. So this is the price. No one here cares if this year's Nets win. And some of us want them to lose. At this point it seems unless there's a miracle, the Nets are eliminated. If he's going to stick around KD should ask for a reboot with Knicks fans. Forget about a crosstown rivalry. For now the Knicks own the city, even if they suck. Ask for our support. You might get it next time you're in the playoffs. But you'll have to earn it by showing up in our city in the meantime. ",
            "created": "Sun, 24 Apr 2022 15:21:16 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2022/04/22/tatum.png",
            "flInCalendar": true
        },
        {
            "text": "How about a rule that only stories that are not behind a paywall will be considered for a Pulitzer prize.",
            "created": "Sun, 24 Apr 2022 13:47:59 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}