{
    "created": "2022-04-26T04:00:00.000Z",
    "flInCalendar": true,
    "name": "26",
    "path": "2022/04/26",
    "text": "April 26",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Jan 2017: <a href=\"http://scripting.com/2017/01/14/whatIfTwtrIsBoughtByARepub.html\">What if TWTR is bought by a Repub?</a>",
            "created": "Tue, 26 Apr 2022 22:25:25 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "My guess is that every billionaire is going to try to compete with Musk, maybe some will join together. If you know how to write a TWTR get busy.  ",
            "created": "Tue, 26 Apr 2022 22:17:51 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "AWS should have, long ago, written a faceless TWTR clone, and let a million flowers bloom. As with many other things, I beat the drum ceaselessly for this, as far as I know they never heard me. ",
            "created": "Tue, 26 Apr 2022 22:41:44 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "That's why it was interesting to see <a href=\"https://twitter.com/JeffBezos/status/1518734031566778368\">Jeff Bezos</a> poke Elon Musk  in the eye last night. That's exactly the kind of thing a competitor would say, and the fact that he said it so publicly, on TWTR, says he's going to do it. He wants to reserve the space in our minds. ",
            "created": "Tue, 26 Apr 2022 22:42:06 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Another thought, making a federated twitter will be hard. No one knows how to do it. But I bet a lot of people know how to clone twitter. That's the way this will go. And we should make sure all these clones can peer with each other. I'm available to help with this.",
            "created": "Tue, 26 Apr 2022 22:42:22 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Last night the <a href=\"https://www.nytimes.com/2022/04/25/sports/basketball/nets-eliminated-celtics-sweep.html\">Nets lost</a> and were <a href=\"https://nypost.com/2022/04/26/nets-got-it-all-wrong-and-paid-for-it-with-nba-playoff-flop/\">eliminated</a>. The Nets might've fared better if at least some of NY's long-suffering Knicks fans were behind them. But this team has no idea what NY is, and our relationship with basketball, and our Knicks, who we love like family. It doesn't matter if KD thinks they're cool, and if you think that matters, <a href=\"https://twitter.com/davewiner/status/1518880919762919424\">you can have</a> the Nets. But last night's crowd at Barclay were mostly pulling for the Celtics, and that's a shame. It tells you how much the owners of and players for the Nets have to learn about the city that they are supposedly playing for. And btw, forget about a cross-town rivalry. You might want to see if the arena y'all were using in NJ is still available. ",
            "created": "Tue, 26 Apr 2022 12:11:31 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2022/04/26/quickley.png",
            "flInCalendar": true
        },
        {
            "text": "Why Musk bought Twitter: There’s tremendous value that does not show up on a balance sheet. He was smart enough to see it, gutsy enough to buy it, and had the means to do it.",
            "created": "Tue, 26 Apr 2022 12:01:19 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Peering",
            "created": "Tue, 26 Apr 2022 22:49:00 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "The <a href=\"https://en.wikipedia.org/wiki/First_transcontinental_railroad\">Golden Spike</a> was a very simple form of peering.",
                    "created": "Wed, 27 Apr 2022 01:40:51 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "There was a rail system in the east, and one developing in the west. ",
                    "flInCalendar": true
                },
                {
                    "text": "So in the middle of the Civil War if you can believe that, they started building a branch from each to meet up somewhere in the middle. And then you could ride a train from New York to San Francisco. ",
                    "flInCalendar": true
                },
                {
                    "text": "<a href=\"https://en.wikipedia.org/wiki/Peering\">Peering</a> means you can get from one system onto another. Peering is what makes the internet the internet. ;-)",
                    "created": "Tue, 26 Apr 2022 22:50:01 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It's past time we built another layer on the net. ",
                    "flInCalendar": true
                },
                {
                    "text": "The packet basically will be an <a href=\"https://cyber.harvard.edu/rss/rss.html#hrelementsOfLtitemgt\">&lt;item></a> from an RSS feed. A title, simple styled text, links, enclosures. A very simple concept, well-understood. ",
                    "created": "Tue, 26 Apr 2022 22:49:15 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It'd be a shame not to plan this out now. ",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "A big patch of blue sky",
            "created": "Tue, 26 Apr 2022 12:02:04 GMT",
            "type": "outline",
            "metaImage": "http://pics.scripting.com/0095/0003.jpg",
            "subs": [
                {
                    "text": "<i>I wrote this <a href=\"https://twitter.com/davewiner/status/1518701984265687045\">last night</a> on Twitter, when I unexpectedly felt pretty sad about what had happened. </i>",
                    "created": "Tue, 26 Apr 2022 12:02:20 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Twitter inherited the blogosphere, in a sense, and the chaos of the company hid the fact that it was owned, all that we put into it, we owned none of it. It could all be sold. Now it’s glaring.",
                    "created": "Tue, 26 Apr 2022 12:02:51 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Although Twitter was never a living thing, it feels like something died, in an instant, unexpected, shock, the end. When Jerry Garcia died, also suddenly, I <a href=\"http://scripting.com/davenet/1995/08/14/eatdrinkandbejerry.html\">wrote</a>:",
                    "created": "Tue, 26 Apr 2022 12:03:09 GMT",
                    "subs": [
                        {
                            "text": "“Like the big tree that fell last March, the death of a huge human being like Jerry Garcia frees up a huge amount of space. Once there was a tree, now there are seedlings. After the sadness, there will be huge creativity.“",
                            "created": "Tue, 26 Apr 2022 12:03:20 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "That’s my wish. With this passing, a big patch of <a href=\"https://www.google.com/search?q=site%3Ascripting.com+%22blue+sky%22\">blue sky</a> opens. Let’s create something beautiful in that space.",
                    "created": "Tue, 26 Apr 2022 12:03:33 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}