{
    "created": "2022-04-27T04:00:00.000Z",
    "flInCalendar": true,
    "name": "27",
    "path": "2022/04/27",
    "text": "April 27",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Today's song: <a href=\"https://www.youtube.com/watch?v=aSHkH_uMmtY\">Every Night</a>.",
            "created": "Wed, 27 Apr 2022 14:58:48 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=aSHkH_uMmtY",
            "flInCalendar": true
        },
        {
            "text": "I'm <a href=\"https://twitter.com/davewiner/status/1519300450520080384\">addicted</a> to Twitter, but I could live without it, if I had something better. What I want is to be connected to smart people who want to work together to make cool things and solve important problems. That, emphatically, is <i>not</i> what Twitter is.",
            "created": "Wed, 27 Apr 2022 13:00:33 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2022/04/27/biles.png",
            "flInCalendar": true
        },
        {
            "text": "I love the <a href=\"https://en.wikipedia.org/wiki/McCartney_(album)\">McCartney album</a> even though at the time the <a href=\"https://en.wikipedia.org/wiki/McCartney_(album)#Contemporary_reviews\">critics panned</a> it. It's a really interesting album because they're all Beatles songs. He wrote them to do with the Beatles. But they had already broken up. At the time no one knew. So he bought a tape deck and recorded them all on his own. He has a beautiful voice. And they're not big productions, though they would've been if they had been done by the Beatles. This is like blogging or punk rock, but it's McC. What's not to like? It's Paul McCartney man. Get over yourself. ",
            "created": "Wed, 27 Apr 2022 14:56:04 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Another band I've been appreciating more than ever is <a href=\"https://en.wikipedia.org/wiki/R.E.M.\">R.E.M</a>. The songs are so beautiful. I'm sure there will be more to say about this. ",
            "created": "Wed, 27 Apr 2022 15:05:45 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "There's so much power to be taken all around you. But if you're waiting for someone to give it to you, packaged up a gift box with a ribbon, that's never going to happen.",
            "created": "Wed, 27 Apr 2022 13:50:53 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "What I like about Elon Musk",
            "created": "Wed, 27 Apr 2022 13:26:59 GMT",
            "type": "outline",
            "description": "He creates audacious products that capture the imagination and work.",
            "metaImage": "http://scripting.com/images/2022/04/27/steveJobs.png",
            "subs": [
                {
                    "text": "Elon Musk took over for Steve Jobs as the audacious tech lover who did wtf he wanted and told people he didn't like to fuck off.",
                    "created": "Wed, 27 Apr 2022 13:27:06 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Jobs actually said the words, not if sure Musk does.",
                    "created": "Wed, 27 Apr 2022 13:32:42 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Both made audacious products that capture the imagination. Very few people do that. And their products were also outrageously successful.",
                    "flInCalendar": true
                },
                {
                    "text": "And even with all that success, they both were willing to put it all on the line, over and over, because they had an idea they wanted to see through. ",
                    "flInCalendar": true
                },
                {
                    "text": "Making software for Jobs is another matter. He tended to blow up his developers' products, something that platform vendors get to do. ",
                    "created": "Wed, 27 Apr 2022 13:33:38 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "When I realized I couldn't be part of his platform, I bought some $AAPL stock to wipe away the tears, and as a result I can buy nice toys like my new <a href=\"http://daytona.scripting.com/?q=tesla&collection=scriptingnews\">Tesla</a>. :boom:",
                    "created": "Wed, 27 Apr 2022 13:34:39 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "As Tesla stock goes down after the Twitter deal was announced, I realize I should probably be buying some. ",
                    "created": "Wed, 27 Apr 2022 13:29:21 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "I got what I want",
            "created": "Wed, 27 Apr 2022 12:46:16 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "If the NBA playoffs were Christmas, I already got the two presents I wanted, as a diehard Knicks fan.",
                    "created": "Wed, 27 Apr 2022 12:46:20 GMT",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "The Nets were swept and eliminated.",
                            "created": "Wed, 27 Apr 2022 12:46:25 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Trae Young was ineffective against Miami and the Hawks were eliminated too. ",
                            "created": "Wed, 27 Apr 2022 12:46:27 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "I want to add, I don't have anything against the Nets, I would probably be interested in them if they stopped trying to form superteams and win at all costs \"this year.\" And if they advised Nets players not to openly dis the Knicks because if they're ever going to get fans for the Nets they're all also going to be Knicks fans. ",
                    "created": "Wed, 27 Apr 2022 12:46:59 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I feel about the Nets the way Lakers fans probably feel about the Clippers. Sort of meh. Why do they even bother, for example. But for years when the Knicks aren't in the postseason (which is most of them) why not root for the home team that's in contention?  ",
                    "created": "Wed, 27 Apr 2022 12:47:33 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I say this as a lifelong Mets fan. Proving I'm not all that simple.",
                    "flInCalendar": true
                },
                {
                    "text": "Anyway I now get to relax and enjoy the rest of the playoffs, without any goals, just hoping for some good basketball. ",
                    "created": "Wed, 27 Apr 2022 12:57:22 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PS: Why Trae Young? He <a href=\"https://www.youtube.com/watch?v=CGLacgHgvTs\">wasn't nice</a> to the Knicks last year. ",
                    "created": "Wed, 27 Apr 2022 12:57:24 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}