{
    "created": "2022-04-29T04:00:00.000Z",
    "flInCalendar": true,
    "name": "29",
    "path": "2022/04/29",
    "text": "April 29",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I got my <a href=\"https://www.youtube.com/watch?v=tiwjvBSS_Wk\">Nintendo Sports</a> and was pretty excited till I found out there's <a href=\"https://www.ginx.tv/en/video-games/nintendo-switch-sports-golf\">no golf</a>. Oy. That was my favorite. But bowling and tennis are pretty good. They say golf is coming. ",
            "created": "Fri, 29 Apr 2022 21:11:40 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "We already live in an autocracy",
            "created": "Fri, 29 Apr 2022 14:48:11 GMT",
            "type": "outline",
            "description": "Journalism tells us it's bad that Elon Musk owns Twitter, but what do they say about their own employers? ",
            "metaImage": "http://scripting.com/images/2022/04/29/gugenheim.png",
            "subs": [
                {
                    "text": "Think about it. Journalism controls what we think about everything. The online world has become an echo chamber for what's talked about on cable news and podcasts. The journalists who control so much of what we all think aren't required to be transparent, there aren't any rules governing how they get paid, and worst of all, we didn't elect them and we can't vote them out.",
                    "created": "Fri, 29 Apr 2022 14:55:25 GMT",
                    "image": "http://scripting.com/images/2021/02/19/blueJello.png",
                    "flInCalendar": true
                },
                {
                    "text": "They tell us how bad it is that Elon Musk owns Twitter (and I'm starting to see it that way too), but what do they have to say about the people who employ them? I guess we depend on their integrity, their good intentions. But what evidence is there of the goodness of their intentions. I turn off the \"news\" the first time i hear them overstating a case, leaving out important facts that would contradict the conclusions they reach. ",
                    "created": "Fri, 29 Apr 2022 15:02:49 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "And then there are gems like <a href=\"https://twitter.com/davewiner/status/1519693680000520192\">this</a>.",
                    "created": "Fri, 29 Apr 2022 14:56:29 GMT",
                    "subs": [
                        {
                            "text": "<i>I couldn't believe my ears when I heard Maddow say the other night, in passing: \"...assuming the Dems lose congress, as expected.\" That's like your doctor saying: \"Assuming you die of cancer in November, as expected,\" when you don't have cancer as far as the doctor knows. </i>",
                            "created": "Fri, 29 Apr 2022 14:50:42 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "We let these things go by without challenging them, and we start stating them as facts ourselves, and then no one bothers to vote because we already knew what was going to happen because according to people who know better, that's what always happens. ",
                    "created": "Fri, 29 Apr 2022 14:55:57 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "As rich as you can be",
            "created": "Fri, 29 Apr 2022 15:41:40 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "My friend <a href=\"https://www.instagram.com/monicalo68/\">Monica Loredan</a>, an Italian who is vacationing in Venice, stopped to enjoy a nice ice cream with her husband Paolo, and posted this picture to her account on Facebook. I asked if I could publish it on my blog, because it reminded me of the <a href=\"http://scripting.com/2022/01/28/174509.html?title=theRichestYouCanBe\">fantastic sushi</a> I had in Sausalito many years ago, that helped me understand what real wealth is. You can't be richer than Monica is, in the moment, with this fantastic creation sitting before her, ready to bring her soul the pleasure of eating it. I felt wealthy myself because I had the experience too, as a memory of past pleasure. Now I am sharing the experience with you. Enjoy!",
                    "created": "Fri, 29 Apr 2022 15:41:46 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Monica's dessert, at <a href=\"https://www.google.com/maps/@45.4295366,12.3261928,3a,75y,329.67h,67.03t/data=!3m6!1e1!3m4!1syQ-6dwATnJNAG3mX-Nqyaw!2e0!7i13312!8i6656\">Gelateria Nico</a>, in Venice. ",
                    "created": "Fri, 29 Apr 2022 15:44:24 GMT",
                    "inlineImage": "http://scripting.com/images/2022/04/29/monicasDessert.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}