{
    "text": "March 3",
    "created": "Tue, 03 Mar 2020 14:27:42 GMT",
    "name": "03",
    "subs": [
        {
            "text": "After many attempts, I'm now rolling on <a href=\"https://en.wikipedia.org/wiki/The_Expanse_(TV_series)\">The Expanse</a>. In the middle of season 2, I more or less understand who the characters are and the plot. I don't know why it took so many tries to get it. <span class=\"spSpoiler\">I am sure that Julie Mao and Miller are melding into some kind of incredible love monster whose body is the planet of Venus. I also think their meeting was the sexiest thing I've seen on TV ever</span>. ",
            "created": "Tue, 03 Mar 2020 16:49:43 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/03/03/venus.png"
        },
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=Cys5H1O7SLQ\">Demo of a new feature</a> on my blog. Spoilers are now hidden behind a placeholder. This is how it works. Warning there's a spoiler in this video about how spoilers work. Not kidding. If you haven't seen The Expanse and think you might, you should avert your eyes at the right moment in this video. <i>Sorry! </i>",
            "created": "Tue, 03 Mar 2020 17:33:06 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=Cys5H1O7SLQ"
        },
        {
            "text": "Democrats have one goal. Trump out in a landslide. All the insiders talk about turnout, but you know what, that's up to us, the voters. I think that's the message of tonight. If he wins, Biden has been drafted to be our representative. We should organize <i>ourselves</i> so we can't be ignored after the election. ",
            "created": "Wed, 04 Mar 2020 03:08:28 GMT",
            "type": "outline"
        },
        {
            "text": "Idea for Mike Bloomberg. Hire some smart ex-CDC people and have them solve the testing problem in the US. Commit say $1 billion to the effort.",
            "type": "tweet",
            "created": "Tue Mar 03 17:54:55 +0000 2020",
            "tweetId": "1234900072774717445",
            "tweetUserName": "davewiner"
        },
        {
            "text": "Wonder if they're testing people at the White House. What are the chances that it's a hot spot for transmission? Lots of people coming and going.",
            "created": "Tue, 03 Mar 2020 16:45:37 GMT",
            "type": "outline"
        },
        {
            "text": "What sense does it make to <a href=\"https://www.wsj.com/articles/federal-reserve-cuts-interest-rates-by-half-percentage-point-11583247606\">stimulate</a> an economy that will be crippled by lack of parts and workers? The economy will shrink, no way to avoid that. Maybe we'll need stimulus later, once (hopefully) people are back at work.  ",
            "type": "outline",
            "created": "Tue Mar 03 18:50:20 +0000 2020",
            "tweetId": "1234914020462821378",
            "tweetUserName": "davewiner"
        },
        {
            "text": "When the WSJ gets an <a href=\"https://www.wsj.com/articles/trump-administration-considering-paying-hospitals-for-treating-uninsured-coronavirus-patients-11583258943\">important story</a> in the public interest down comes the paywall. But when do they publish a story that <i>isn't</i> in the public interest?  So news is <a href=\"http://scripting.com/stories/2011/01/01/theWorldIsSocialist.html\">socialist</a> too. :boom:",
            "created": "Tue, 03 Mar 2020 19:07:50 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/03/03/biden.png"
        },
        {
            "text": "So many forbidden topics on Twitter, might lead you to believe no one is offended by your ideas (assuming you're politically correct) but voting is private which provides a channel for anger and resentment. Might be a good idea to factor that in.",
            "created": "Tue, 03 Mar 2020 14:27:43 GMT",
            "type": "outline"
        },
        {
            "text": "Thoughts and prayers to <a href=\"https://twitter.com/R/status/1234852841250021376\">friends</a> in Nashville after the <a href=\"https://www.wkrn.com/news/nashville-tornado/possible-tornado-crosses-through-downtown-nashville-widespread-damage-reported/\">deadly tornado</a> that struck downtown in the middle of the night. ",
            "created": "Tue, 03 Mar 2020 14:27:50 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=nBJYxPN8qIA\">Come on people now</a> smile on your brother, everybody get together try to love one another. ",
            "created": "Tue, 03 Mar 2020 16:18:47 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=nBJYxPN8qIA"
        },
        {
            "text": "My father apologized",
            "created": "Tue, 03 Mar 2020 14:43:17 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Something really weird happened in a dream last night.",
                    "created": "Tue, 03 Mar 2020 14:43:22 GMT"
                },
                {
                    "text": "My father apologized for something. "
                },
                {
                    "text": "He's been dead since 2009."
                },
                {
                    "text": "He never apologized for anything to anyone as far as I recall, certainly not to me. He said and did plenty he should have apologized for.",
                    "created": "Tue, 03 Mar 2020 14:45:26 GMT"
                },
                {
                    "text": "I think in a weird way this is my subconscious telling me that it's ready to forgive him. ",
                    "created": "Tue, 03 Mar 2020 14:43:32 GMT"
                },
                {
                    "text": "In the dream I felt so safe and secure in the moment, I said genuinely, don't worry about it, we can fix the problem right now. Then we went to the post office and I mailed a package to someone.",
                    "created": "Tue, 03 Mar 2020 14:43:33 GMT"
                }
            ]
        }
    ]
}