{
    "text": "March 4",
    "created": "Wed, 04 Mar 2020 13:59:50 GMT",
    "name": "04",
    "subs": [
        {
            "text": "A new version of \"LO2\" is released. v1.8.10. ",
            "created": "Wed, 04 Mar 2020 15:28:38 GMT",
            "type": "outline",
            "image": "http://static.scripting.com/larryKing/images/2013/10/28/pitcher.gif"
        },
        {
            "text": "<a href=\"http://this.how/littleoutliner/versions.opml#1583335881000\">Change notes</a> for v1.8.10. Two big changes. A new <a href=\"http://scripting.com/images/2020/03/04/fileOpenDialog.png\">File/Open dialog</a>. And the storage server has moved to a new machine. ",
            "created": "Wed, 04 Mar 2020 15:48:41 GMT",
            "type": "outline"
        },
        {
            "text": "Very important -- here are the <a href=\"https://github.com/scripting/Scripting-News/issues/156\">testing notes</a>. I need a few people to go through the steps to verify that things are working as they should. Your help is much needed and appreciated. Thanks! :boom:",
            "created": "Thu, 05 Mar 2020 01:46:15 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"http://scripting.com/2020/03/04/bidenTheGratefulDeadOfPresidents.m4a\">Podcast</a>. Yesterday was the Woodstock of American elections. African-Americans extended a hand in love to America. Let's all be friends again. Why not say yes? Let's do it. ",
            "created": "Wed, 04 Mar 2020 16:57:16 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2020/03/04/bidenTheGratefulDeadOfPresidents.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "7547375"
        },
        {
            "text": "Jennifer Granholm <a href=\"https://twitter.com/JenGranholm/status/1235219391828103169\">endorses</a> Joe Biden, with enthusiasm. ",
            "created": "Wed, 04 Mar 2020 17:25:16 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/JenGranholm/status/1235219391828103169"
        },
        {
            "text": "You know, Twitter is an <a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+%22idea+processor%22&t=h_&ia=web\">idea processor</a>. It works. It's klunky and whatever, but I get ideas when I write there, and I don't lose them. That's all I want from an idea processor. Here's a <a href=\"https://twitter.com/davewiner/status/1235235567245373445\">thread</a> I just wrote. Figured a bunch of stuff out. I don't care if everyone can see it. ",
            "created": "Wed, 04 Mar 2020 16:27:00 GMT",
            "type": "outline"
        },
        {
            "text": "What we all learned last night is that the electorate is wise and conscious and makes up its own mind. ",
            "created": "Wed, 04 Mar 2020 14:31:44 GMT",
            "type": "tweet",
            "tweetId": "1235211385115684864",
            "tweetUserName": "davewiner"
        },
        {
            "text": "I think Biden is as competent as McCain was when he ran against Obama in 2008. Luckily Biden doesn’t have to run against Obama.",
            "created": "Wed, 04 Mar 2020 16:15:01 GMT",
            "type": "outline"
        },
        {
            "text": "The mistake we continue to make is to project our personal aspirations on a candidate for president. Every one of them will come up lacking if you look at who they really are, even your hero.",
            "created": "Wed, 04 Mar 2020 14:40:55 GMT",
            "type": "outline"
        },
        {
            "text": "BTW, when this euphoria is over, there's still the question if the Repubs will allow the election.",
            "created": "Wed, 04 Mar 2020 17:09:01 GMT",
            "type": "outline"
        },
        {
            "text": "What happened last night, part 1",
            "created": "Wed, 04 Mar 2020 14:04:07 GMT",
            "type": "outline",
            "description": "Democrats who try to drive us apart are no better than Republicans who do that.",
            "subs": [
                {
                    "text": "Last night was a big deal in American politics. You know <a href=\"https://fivethirtyeight.com/features/how-biden-beat-expectations-on-super-tuesday/\">the news</a>. Biden scored big, at the expense of Sanders. Beyond that everything else is subject to opinion and polling. ",
                    "created": "Wed, 04 Mar 2020 14:04:12 GMT"
                },
                {
                    "text": "Toward the end of the evening I wrote: \"I honestly don't think people want Biden, I think they really <i>don't</i> want Sanders.\" ",
                    "created": "Wed, 04 Mar 2020 14:04:48 GMT"
                },
                {
                    "text": "<a href=\"http://www.raines.com/\">Raines Cohen</a> asked: \"If that were the case, why not Warren?\" ",
                    "created": "Wed, 04 Mar 2020 14:05:37 GMT"
                },
                {
                    "text": "Before I answer, a couple of things about Raines. I've known him for a very long time, since I met him in Mitch Kapor's office in Cambridge in 1979. His father was Mitch's lawyer. I think Raines was all of 13 years old then. I was 25. Second, he's a friend, and I trust him. ",
                    "created": "Wed, 04 Mar 2020 14:10:23 GMT",
                    "image": "http://scripting.com/images/2017/09/01/mrFrog.png"
                },
                {
                    "text": "So I gave him an honest answer, what I really think is true. With Warren fans I find you have to tiptoe around their certainty that anyone who says anything negative about her is a misogynist, or \"a person who dislikes, despises or is strongly prejudiced against women.\" ",
                    "created": "Wed, 04 Mar 2020 14:16:53 GMT"
                },
                {
                    "text": "I think Warren and Sanders are similar, but not on policy, on the way they approach the electorate, and I think to the extent they are rejected, it's for this reason.",
                    "created": "Wed, 04 Mar 2020 14:06:07 GMT",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "I saw a meanness in Warren that I didn’t like. A good president tries to draw everyone in, make everyone feel welcome. Neither her or Sanders has that impulse, like Trump.",
                            "created": "Wed, 04 Mar 2020 14:09:14 GMT"
                        },
                        {
                            "text": "Look at how people talk about her on the net — if you don’t support her you’re a misogynist. If you don’t support Sanders, you’re The Establishment. That excuses both of them from trying to understand who they aren’t reaching. ",
                            "created": "Wed, 04 Mar 2020 14:10:55 GMT"
                        },
                        {
                            "text": "If I’m their enemy, their scapegoat, I’m not voting for them. ",
                            "created": "Wed, 04 Mar 2020 16:06:22 GMT"
                        },
                        {
                            "text": "I think they’re both smart enough to know this especially Warren. That makes them dangerous. The president of the United States must be a consensus builder. Not someone who could shoot someone on Fifth Avenue and not lose a single supporter. Warren created a wedge, based on gender, intentional or not. Men bad, women good. With predictable results, imho. It's a turnoff because we need to come together, and smart voters know this. ",
                            "created": "Wed, 04 Mar 2020 14:11:29 GMT"
                        },
                        {
                            "text": "People who do \"turnout math\" miss this point. It isn't just getting people to the polls to vote for you, it's getting the country to see itself as one thing, not warring factions. These Democrats, Sanders and Warren, are doing what Trump did. Dividing. Wedging.",
                            "created": "Wed, 04 Mar 2020 14:14:20 GMT"
                        },
                        {
                            "text": "Their policies aren't new, they're standard Democratic policies. Any Democrat would pursue those goals if we demand they do. The power is ours, as long as we stick together. Democrats who try to drive us apart are no better than Republicans who do that.",
                            "created": "Wed, 04 Mar 2020 14:15:12 GMT"
                        }
                    ]
                },
                {
                    "text": "PS: Ezra Klein said the <a href=\"https://www.vox.com/2020/3/4/21164091/sanders-biden-super-tuesday-endorsements-primary-2020\">same thing</a> in a different way. ",
                    "created": "Wed, 04 Mar 2020 14:27:15 GMT"
                }
            ]
        }
    ]
}