{
    "text": "March 6",
    "created": "Fri, 06 Mar 2020 14:11:12 GMT",
    "name": "06",
    "subs": [
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=MYpv5Orkn40\">Preview</a> of next feature for \"LO2\" -- sorting. ",
            "created": "Fri, 06 Mar 2020 18:03:05 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=MYpv5Orkn40"
        },
        {
            "text": "Went grocery shopping today. Found it impossible not to put my fingers in my mouth when trying to open the plastic bags for fruit and produce. Touching all kinds of surfaces that probably are infected. The place had a Thanksgiving-like feel to it. Could just be a Friday thing in late winter. I've been stocking up on canned goods. I buy about twice as much as I need every week. Also noted there is <a href=\"http://scripting.com/images/2020/03/06/plentyOfToiletPaperInHannafords.png\">plenty of toilet paper</a> on the shelves. Apparently people here aren't so scared of running out. The only thing that was in short supply was <a href=\"https://www.breadalone.com/home\">Bread Alone</a> bread, for some reason. I should've asked. It looks like they're not going to carry it in the future? That would be not good. ",
            "created": "Fri, 06 Mar 2020 20:57:37 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/03/06/breadAlone.png"
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1235645351668764673\">Asked on Twitter</a>: I have a Mac and an iPhone. What's the best way to get a text file from my Mac onto my iPhone. Best == least work. Lots of answers. The thing I like about email the best is that the same approach works from a browser-based app like \"LO2\". I can add email capabilities there so I can make a list in the outliner and email it to my phone. That will be beautiful.",
            "created": "Fri, 06 Mar 2020 15:24:41 GMT",
            "type": "outline"
        },
        {
            "text": "There's a new version of <a href=\"https://github.com/scripting/nodeStorage#v099---3520-by-dw\">nodeStorage</a> that supports the enhanced File/Open dialog in LO2.",
            "created": "Fri, 06 Mar 2020 15:28:52 GMT",
            "type": "outline"
        },
        {
            "text": "We will look back at March 2020 as the good old days when the virus was more or less contained. Will we ever get back to this level again of containment? What will the survivors witness? What will be left if our economy? Will anyone ever say again we don’t need government?",
            "created": "Fri, 06 Mar 2020 15:32:52 GMT",
            "type": "outline"
        },
        {
            "text": "One thing I want from the eventual Democratic nominee. A promise not to pardon Trump or any of his co-conspirators.",
            "created": "Fri, 06 Mar 2020 14:38:41 GMT",
            "type": "tweet",
            "tweetId": "1235937930478333952",
            "tweetUserName": "davewiner"
        },
        {
            "text": "Non-disclosure agreements",
            "created": "Fri, 06 Mar 2020 14:11:13 GMT",
            "type": "outline",
            "description": "NDAs are not nearly as simple as candidate Elizabeth Warren made them sound in the debates.",
            "subs": [
                {
                    "text": "I was CEO of a small Silicon Valley company in the 1980s. Even back then, lawyers were advising companies to settle with employees who made claims, even when the company had done nothing wrong.",
                    "created": "Fri, 06 Mar 2020 14:11:25 GMT"
                },
                {
                    "text": "Here's why. Lawyers are expensive, as are trials, and some employees make a business of suing their employers, knowing that they will settle instead of contesting the claim because it's far less expensive. ",
                    "created": "Fri, 06 Mar 2020 14:25:09 GMT"
                },
                {
                    "text": "We only had one such claim, for age discrimination. I forget how much we paid, but it was a lot for a company our size. And it came with a mutual NDA. It wasn't to keep the employee from talking, it was to keep the company silent, because <i>we</i> were the ones who were harmed. After the suit was over and settled, I realized then why none of his references were willing to talk about him. He was going through the Valley, to companies who were hungry for skilled programmers, and willing to take a chance, with or without references. No doubt we weren't the last company to pay him off and accept an NDA. ",
                    "created": "Fri, 06 Mar 2020 14:20:24 GMT"
                },
                {
                    "text": "Also, even if there is no NDA, the laws in California and New York heavily favor the employee. So the company isn't likely to say much about a former employee it had differences with, because it could very easily turn into an expensive lawsuit. ",
                    "created": "Fri, 06 Mar 2020 14:22:07 GMT"
                },
                {
                    "text": "Just want to say NDAs are not nearly as simple as candidate Elizabeth Warren made them sound in the debates. I know from experience and I am not a lawyer, she is, and I'm sure she knows all about it. ",
                    "created": "Fri, 06 Mar 2020 14:26:27 GMT"
                }
            ]
        }
    ]
}