{
    "text": "March 12",
    "created": "Thu, 12 Mar 2020 14:30:11 GMT",
    "name": "12",
    "subs": [
        {
            "text": "I'm keeping the list of <a href=\"http://this.how/virus/whatShouldBeClosed.opml\">What Should Close</a> updated. ",
            "created": "Thu, 12 Mar 2020 18:32:16 GMT",
            "type": "outline"
        },
        {
            "text": "I had to drive to the car dealer today to pick up my car. Along the way, I had many opportunities to pick up the virus. First was when I crossed the <a href=\"https://en.wikipedia.org/wiki/Kingston%E2%80%93Rhinecliff_Bridge\">Rhinecliff Bridge</a> and had to stop to pay a toll. The toll booth operator had gloves on. I gave her six quarters and before continuing, I wiped the hand that touched hers. Her glove was accumulating all the viruses on everyone's hands who paid the toll. At the dealer, I had to sign a form to get my car back. They gave me a pen to use. I had no idea who else had used the pen. They did have hand sanitizer on the desk. I used it. Also thought about stealing it, but didn't. When I got my car, I rubbed down the steering wheel with sanitizer. Forgot to wipe the gear shift or the controls for the heating system, until after I touched them. On the way back I got a car wash. Paid the attendant $12 in cash, and he gave me change, again in cash. I thought about all the people who had touched the bills, including the attendant. ",
            "created": "Thu, 12 Mar 2020 17:47:28 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/03/12/purell.png"
        },
        {
            "text": "The tragedy of America's non-response to the virus is explained in <a href=\"https://www.nytimes.com/2020/03/12/podcasts/the-daily/coronavirus-pandemic.html\">today's Daily podcast</a>. If you want to know the truth and what we should be demanding of our government, this is a must-listen. ",
            "created": "Thu, 12 Mar 2020 17:40:26 GMT",
            "type": "outline"
        },
        {
            "text": "People who think they're humane, even liberal or progressive, think they have big hearts, treat people like statistics. Maybe part of the good of this virus is wakes people up that we're all human, mortal, frail.",
            "created": "Thu, 12 Mar 2020 19:07:44 GMT",
            "type": "outline"
        },
        {
            "text": "Another great podcast. Fresh Air <a href=\"https://www.npr.org/2020/03/10/813970591/rupauls-recipe-for-success-love-yourself-and-stay-flexible\">interview</a> with RuPaul.",
            "created": "Thu, 12 Mar 2020 18:50:44 GMT",
            "type": "outline"
        },
        {
            "text": "They said RuPaul is in the B-52s <a href=\"https://www.youtube.com/watch?v=9SOryJvTAGs\">Love Shack</a> video. I used to ski to that song in Park City. Really brings back memories. ",
            "created": "Thu, 12 Mar 2020 18:55:42 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=9SOryJvTAGs"
        },
        {
            "text": "An easy feel-good thing for Trump to announce last night. The government is giving <a href=\"https://www.google.com/search?q=purell+hand+sanitizer&safe=off&sxsrf=ALeKk00X5m8RpdZl18JT0weV2x5HHPz1nw:1584036262618&source=univ&tbm=shop&tbo=u&sa=X&ved=2ahUKEwjtlvr1wpXoAhUHmHIEHb-YCJQQsxh6BAgRECw\">Purell</a> $1 billion to make as much hand sanitizer as <a href=\"https://www.businessinsider.com/who-makes-purell-hand-sanitizer-gojo-industries-coronavirus-2020-3\">they</a> can. One bottle per person. A little thing, but man it would make people happy.",
            "created": "Thu, 12 Mar 2020 18:00:17 GMT",
            "type": "outline"
        },
        {
            "text": "I had anxiety about Covid19 for the first time this morning. This could be it. But if it isn't, I have some great software in mind. Funny how being this scared brings out the creativity. On the other hand if this is the time to go -- I'd rather have it be in a plot of a terrible science fiction novel than say going in my sleep. The drama of Trump's speech last night. At one point I thought he was losing it and was going to start talking like Jerry Lewis in the <a href=\"https://youtu.be/neEe1itDC_k?t=320\">Nutty Professor</a>. I think that would have been good for everyone, but he got himself back on track. His eyes are dead. No one home. ",
            "created": "Thu, 12 Mar 2020 14:30:12 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/03/12/usAttacked.png"
        },
        {
            "text": "Writing <a href=\"http://scripting.com/2020/03/11.html\">yesterday's</a> Scripting News felt a lot like writing the blog on <a href=\"http://scripting.com/2001/09/11.html\">9/11/2001</a>, with the realization that far more people will die, and this time there is something every one of us can do, both individually and collectively, but because of no leadership, we aren't. ",
            "created": "Thu, 12 Mar 2020 15:02:13 GMT",
            "type": "outline"
        },
        {
            "text": "New slogan",
            "created": "Thu, 12 Mar 2020 18:48:56 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I have a new slogan.  ",
                    "created": "Thu, 12 Mar 2020 18:48:59 GMT"
                },
                {
                    "text": "Must be spoken with a Southern accent.",
                    "created": "Thu, 12 Mar 2020 18:49:05 GMT",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "<i>I'm a washin my hands. </i>",
                            "created": "Thu, 12 Mar 2020 18:49:14 GMT"
                        },
                        {
                            "text": "<i>I'm a hand-washin man.</i>",
                            "created": "Thu, 12 Mar 2020 18:49:15 GMT"
                        }
                    ]
                },
                {
                    "text": "<a href=\"http://scripting.com/2020/03/12/washinMyHandsImAHandWashinMan.m4a\">This</a> is what it sounds like.",
                    "created": "Thu, 12 Mar 2020 18:49:39 GMT"
                }
            ]
        }
    ]
}