{
    "text": "March 15",
    "created": "Sun, 15 Mar 2020 16:03:13 GMT",
    "name": "15",
    "subs": [
        {
            "text": "The stock market says Trump must go.",
            "created": "Mon, 16 Mar 2020 01:45:40 GMT",
            "type": "outline"
        },
        {
            "text": "Two doctors I admire and trust have told me what my mother told me years ago. <a href=\"https://news.harvard.edu/gazette/story/2017/02/study-confirms-vitamin-d-protects-against-cold-and-flu/\">Take Vitamin D</a>. <a href=\"https://duckduckgo.com/?q=Vitamin+D3\">It</a> helps the body fight acute respiratory infection. Also, get outside, <a href=\"https://daylight.academy/news/coronavirus-and-the-sun/\">get sun</a> and exercise. ",
            "created": "Sun, 15 Mar 2020 20:12:33 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/03/15/vitaminD3.png"
        },
        {
            "text": "<a href=\"https://www.facebook.com/enochchoi/posts/10102337425856651\">Enoch Choi</a>: \"With Cuomo’s <a href=\"https://www.nytimes.com/2020/03/15/opinion/andrew-cuomo-coronavirus-trump.html\">request</a> for military support, I expect the army to deploy DMAT hospitals to hardest hit areas in coming days, NY, WA, CA. They deployed to Katrina when my dad and I were the first in St Bernard to arrive. Praying for my friends who volunteer in them. The demand outstripped availability there, and I expect the same as what happened then, that churches will serve the vast majority, since Red Cross/NGOs will be outstripped in capacity as well.\" ",
            "created": "Sun, 15 Mar 2020 19:51:30 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"http://scripting.com/images/2020/03/15/1918OutdoorHospital.png\">New header image</a>. Part of a <a href=\"https://www.docsteach.org/documents/document/emergency-hospital-brookline-massachusetts-influenza\">photo</a> from the National Archives of an emergency hospital for influenza patients in Brookline, MA. Previous image was a <a href=\"http://scripting.com/images/2020/01/03/winterMountain.png\">snowy mountaintop</a> in the Catskills. ",
            "created": "Sun, 15 Mar 2020 20:49:24 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://twitter.com/DrJenGunter/status/1239228230403362816\">Jennifer Gunter</a>: \"When a company doesn’t give their employees sick leave not only are they saying they don’t care about their employees they’re also saying they don’t care about their customers.\"",
            "created": "Sun, 15 Mar 2020 16:34:08 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/DrJenGunter/status/1239228230403362816"
        },
        {
            "text": "Coco in San Jose: \"I am so grateful for all the <a href=\"http://scripting.com/images/2020/03/15/cocosMailMan.png\">people</a> still delivering the mail and packages and keeping basic services running.\"",
            "created": "Sun, 15 Mar 2020 17:42:32 GMT",
            "type": "outline"
        },
        {
            "text": "Yvonne, a programmer, now working from home: \"Hot water with lemon and cayenne in the morning. Staying home and noticing that I haven't watered the plants for a really long time. Vacuuming while waiting for the long queries to run.\"",
            "created": "Sun, 15 Mar 2020 17:29:47 GMT",
            "type": "outline"
        },
        {
            "text": "Proving there is hope for the world, Ted Cruz <a href=\"https://twitter.com/tedcruz/status/1238957310787170307\">tweeted</a> something true, elegant and bi-partisan. I decided to unblock him, but not necessarily permanently.",
            "created": "Sun, 15 Mar 2020 16:21:18 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/tedcruz/status/1238957310787170307"
        },
        {
            "text": "A <a href=\"http://scripting.com/2020/03/05/aDeadlyVirusIstakingOverTheWorldAndTheUnitedStatesDoesntHaveAGovernment.m4a\">ten-minute podcast</a> I recorded nine days ago, but didn't publish. At the end I say why. Even I thought it was crazy, delusional. Since then however the story proved true. It's why I write and record my thoughts. I want to remember the perspective of events before, during and after they happen. Listening to <a href=\"http://scripting.com/2020/03/11.html#a190333\">James Taylor</a> talk about his music, the one thing he doesn't mention in the long list of roles music plays in our lives is that it brings old memories to the surface. Listening to his songs takes me back to high school, young love, and the wild random and erratic ideas I had as a teen. Writing isn't as strong a stimulus as music, but it's what I do. And podcasting too of course. Story-telling. So much has happened in the last nine days, every one of the upcoming nine days is no doubt going to be equally consequential. We're living out the crazy consequences of believing somehow as if by magic it all would take care of itself. To keep my fears at bay, to feel strong and consequential, I keep in mind what Syrio says to Arya to say to Death: <a href=\"https://www.youtube.com/watch?v=AEhAFgvwS1M\">Not today</a>. A new motto! :boom:",
            "created": "Sun, 15 Mar 2020 16:03:14 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2020/03/05/aDeadlyVirusIstakingOverTheWorldAndTheUnitedStatesDoesntHaveAGovernment.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "4944304",
            "image": "http://scripting.com/images/2018/09/10/aryaActionFigure.png"
        }
    ]
}