{
    "text": "March 18",
    "created": "Wed, 18 Mar 2020 14:23:20 GMT",
    "name": "18",
    "subs": [
        {
            "text": "My <a href=\"http://woodstock.today/\">list of local businesses</a> is coming together. Then I had another idea, a barter system. For example, I have a lot of toilet paper. I need a thermometer, hand sanitizer and wipes. I would trade.",
            "created": "Wed, 18 Mar 2020 16:47:13 GMT",
            "type": "outline"
        },
        {
            "text": "Speaking of thermometers, I really want a <a href=\"https://www.kinsahealth.co/products/\">Kinsa</a>. Heard about it on Maddow this evening, what a great idea, a network of thermometers. Can they spot outbreaks of Coronavirus? You can <a href=\"https://www.nytimes.com/2020/03/18/health/coronavirus-fever-thermometers.html\">read</a> about it in the NYT. ",
            "created": "Thu, 19 Mar 2020 02:27:11 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/03/18/kinsaThermometer.png"
        },
        {
            "text": "<a href=\"https://en.wikipedia.org/wiki/Horn_%26_Hardart\">Horn & Hardart</a> automats would be a perfect way to serve takeout food. No human-human contact. They were supposed to be the future when I was a kid, but they went the way of <a href=\"https://en.wikipedia.org/wiki/Chock_full_o%27Nuts\">Chock Full o'Nuts</a> coffee shops in NYC.",
            "created": "Wed, 18 Mar 2020 15:10:14 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1240313617280569349\">Maybe part</a> of the trillion dollar stimulus could given to news orgs to temporarily take down their paywalls. ",
            "created": "Wed, 18 Mar 2020 17:45:31 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1240313617280569349"
        },
        {
            "text": "The trillion dollar stimulus should go to shoring up the hospitals and food supply chain, and making sure people have enough money for basics. We should not be bailing out the travel industry. By the time this is over there will not be a travel industry. Money spent there is as foolish as spending money on wars in Iraq and Afghanistan. Don't piss this away. We need help.",
            "type": "tweet",
            "created": "Wed Mar 18 14:15:28 +0000 2020",
            "tweetId": "1240280666601861120",
            "tweetUserName": "davewiner"
        },
        {
            "text": "I ordered a <a href=\"http://scripting.com/images/2020/03/18/thermometer.png\">thermometer</a> on Amazon for delivery sometime in April. They sent an email that it just shipped and it'll be here by March 23. How could that be? Are they sending it via bicycle? Well, turns out it's coming from China. We should be nice to China. We need them. They're going to help me keep track of my temperature. Maybe alleviate a little of my anxiety. Now the question is will <a href=\"https://www.google.com/search?q=site%3Ascripting.com+ups\">UPS</a> deliver it to me, or automatically return it without trying. Something they've been doing for a while now. ",
            "created": "Wed, 18 Mar 2020 14:48:44 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/02/23/ronaldMcDonaldWithBomb.png"
        },
        {
            "text": "Speaking of anxiety, I've been relatively anxiety-free since I got out on my own in my early 20s. All through my childhood I had terrible anxiety, which manifested in an unhappy digestive system. Always had a stomach ache, trouble controlling my bowels. Upset. I was always upset. I understood why totally, my parents created a very tense atmosphere, and after many years of therapy and self-examination I understood why they were so tense. But a few years after I established myself outside their house the digestive problems magically went away. They're back. Started just after watching Trump's Oval Office speech last Wednesday. I was already hunkered down. I understood what was coming. What was clear from his speech that he didn't. He was still throwing out racist bullshit. From the fucking Oval Office. After that, I realized fully how fucked we are. There have been moments of relaxation. But they're few and far between now. ",
            "created": "Wed, 18 Mar 2020 14:56:17 GMT",
            "type": "outline"
        },
        {
            "text": "On <a href=\"http://scripting.com/2020/03/05.html#a211925\">March 5</a>, <a href=\"http://scripting.com/urgent/2020/03/05.html\">this</a> is what was on the home page here. ",
            "created": "Wed, 18 Mar 2020 15:01:53 GMT",
            "type": "outline"
        },
        {
            "text": "Five jobs I've had",
            "created": "Wed, 18 Mar 2020 14:24:25 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "This is a meme.",
                    "created": "Wed, 18 Mar 2020 14:24:31 GMT",
                    "flNumberedSubs": "true",
                    "subs": [
                        {
                            "text": "Sales engineer. ",
                            "created": "Wed, 18 Mar 2020 14:25:28 GMT"
                        },
                        {
                            "text": "Software lead developer.",
                            "created": "Wed, 18 Mar 2020 14:25:35 GMT"
                        },
                        {
                            "text": "Startup CEO. ",
                            "created": "Wed, 18 Mar 2020 14:25:38 GMT"
                        },
                        {
                            "text": "Contributing editor.",
                            "created": "Wed, 18 Mar 2020 14:25:41 GMT"
                        },
                        {
                            "text": "Research fellow.",
                            "created": "Wed, 18 Mar 2020 14:25:44 GMT"
                        }
                    ]
                }
            ]
        }
    ]
}