{
    "text": "March 20",
    "created": "Fri, 20 Mar 2020 14:11:30 GMT",
    "name": "20",
    "subs": [
        {
            "text": "Podcast: <a href=\"http://scripting.com/2020/03/20/rememberHowWeLived.m4a\">Remember how we lived</a>. An 18-minute story about the world we came from and questions about the one we'll create. ",
            "created": "Fri, 20 Mar 2020 15:52:10 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2020/03/20/rememberHowWeLived.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "9150826"
        },
        {
            "text": "If we get out of this alive, let's all work together, and respect each other, listen, and not judge people before getting to know them. ",
            "created": "Sat, 21 Mar 2020 03:09:51 GMT",
            "type": "outline"
        },
        {
            "text": "Stewart Brand: <a href=\"https://twitter.com/stewartbrand/status/1241188560419446784\">Is it worth going to the ICU?</a>",
            "created": "Sat, 21 Mar 2020 03:21:13 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/stewartbrand/status/1241188560419446784"
        },
        {
            "text": "Based on the <a href=\"https://healthweather.us/\">Kinsa map</a> it looks like Florida is the next hot spot for Corvid19.",
            "created": "Sat, 21 Mar 2020 03:23:48 GMT",
            "type": "outline"
        },
        {
            "text": "I wish the <a href=\"https://www.cnn.com/2020/03/20/politics/bloomberg-campaign-money-dnc/index.html\">Bloomberg campaign organization</a> had stayed in it. They were sharp, irreverent, and the first effective pushback on Trump since he took office. Now the money goes to the DNC, to disappear into a void of nothingness.",
            "created": "Fri, 20 Mar 2020 15:11:05 GMT",
            "type": "outline"
        },
        {
            "text": "Following the <a href=\"http://scripting.com/2020/03/19.html#a141211\">travels</a> of NakedJen. She made it to Seoul. I had a voice chat with her just after midnight Eastern. I wanted to discuss a possible twist to her travels. In Seoul, she has a good network through the University of Utah. Of course it's one of the few places where the virus is being fought effectively, the US is a somewhere between a shitshow and a clusterfuck. I wanted to suggested she skip the return to the US and just stay there for the duration. Of course she was thinking about that. She had decided to let fate determine the outcome. If her flight to Seattle wasn't canceled she would return. If not, she'd stay in Seoul, and not try to return through some other hub like Dubai. It's pretty clear now that there aren't going to be many, if any, more flights to the US from South Korea, or anywhere for that matter. At about 5AM, I got a <a href=\"http://scripting.com/images/2020/03/20/jenplane.png\">text</a> saying she was on the plane. A few minutes later it <a href=\"https://flightaware.com/live/flight/DAL198\">took off</a>. I'm happy, I'd like to see her again, and I'm not sure that could happen if she had stayed there. Also, I'm not sure if Jen is better off here, but we are. :boom:",
            "created": "Fri, 20 Mar 2020 14:14:48 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/03/20/jen.png"
        },
        {
            "text": "Update: 11PM Eastern -- NakedJen is in SLC. She will have many stories to tell. ",
            "created": "Sat, 21 Mar 2020 02:55:42 GMT",
            "type": "outline"
        },
        {
            "text": "Reuters has a <a href=\"https://twitter.com/tomgara/status/1241007641230544898\">live stream</a> of Times Square. ",
            "created": "Fri, 20 Mar 2020 14:42:06 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/tomgara/status/1241007641230544898"
        },
        {
            "text": "I saw a video of Trump listening to Pence speak on a conference call. People said he looked bored, but that's not what I saw. I saw he resented having to listen to Pence. What was Pence talking about? Saving our lives. Yeah. That's not important.",
            "created": "Fri, 20 Mar 2020 14:43:54 GMT",
            "type": "outline"
        },
        {
            "text": "Trump has to go, now, or we die.",
            "created": "Fri, 20 Mar 2020 14:11:31 GMT",
            "type": "outline"
        }
    ]
}