{
    "text": "March 21",
    "created": "Sat, 21 Mar 2020 12:53:14 GMT",
    "name": "21",
    "subs": [
        {
            "text": "I had to run errands into Kingston just now and heard <a href=\"https://en.wikipedia.org/wiki/Andrew_Cuomo\">Gov Cuomo's</a> <a href=\"https://www.youtube.com/watch?v=l3h9Z4u4icM\">press conference</a>. He is masterful. I feel like there's someone in charge who knows what to do and is doing it. I feel lucky to live in New York State, wish we had something approaching that kind of leadership in Washington.",
            "created": "Sat, 21 Mar 2020 16:28:04 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=l3h9Z4u4icM",
            "image": "http://scripting.com/images/2019/09/27/todd.png"
        },
        {
            "text": "Now I wish there were a podcast feed for his press conferences so I could listen to them asynchronously. I won't always be able to listen when they're happening. Maybe this is something WNYC or the NY Times could do? Betaworks?",
            "created": "Sat, 21 Mar 2020 16:31:20 GMT",
            "type": "outline"
        },
        {
            "text": "Rachel Maddow cried at the end of her show last night. I assume for her colleague, a man about my age, who died of CV. But it meant something personal to each of us. I saw it as her crying for the end of America. Reagan was right, government is the problem. But not the way Reagan meant it. I don't know what goes through the minds of the Republicans in Washington, I can't find a bottom to their depravity. It's possible they're masochists. They feel they, and we, deserve to die.",
            "type": "tweet",
            "created": "Sat Mar 21 12:29:42 +0000 2020",
            "tweetId": "1241341213497843719",
            "tweetUserName": "davewiner"
        },
        {
            "text": "There’s a ticking time bomb. The people who don’t have health insurance and don’t have savings or a job and aren’t part of the stimulus, these people are going to be broke, hungry, homeless and sick. And on CNN they’re talking about Trump's racist tweets.",
            "created": "Sun, 22 Mar 2020 01:18:45 GMT",
            "type": "outline"
        },
        {
            "text": "Most times we can convince ourselves that in the immediate future:  1. We will remain alive and well.  2. Our friends and family will too.  What's so unsettling about the moment: Now we know that either, we will be sick or die, or some of our friends and family will. I think that's why we are all reaching out to our friends now, and re-establishing the connection, because we want to hold them close so they don't leave us. It's a good thing. In this week's <a href=\"https://radioopensource.org/springtime-in-the-plague-year/\">Radio Open Source</a>, at the end, Andrew Sullivan talks about that re AIDS, which he experienced as a gay man in the 80s and 90s.  I experienced it as a man with a fatally sick heart in the 00s. After being fixed, I felt like I wanted to die. Weird, right? But real. We call the first feeling \"normal.\"  Over time, this will become normal.  Then at some point, if we survive, a vaccine or treatment will come about.   And we'll go through the unsettled feeling again.",
            "type": "tweet",
            "created": "Sat Mar 21 13:25:04 +0000 2020",
            "tweetId": "1241355144442281991",
            "tweetUserName": "davewiner"
        },
        {
            "text": "Trump's depravity has no limit.",
            "created": "Sat, 21 Mar 2020 13:33:08 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/03/21/trumpsDepravity.png"
        },
        {
            "text": "From NYC",
            "created": "Sat, 21 Mar 2020 12:53:15 GMT",
            "type": "outline",
            "description": "'Social distancing is not what this city is about.'",
            "subs": [
                {
                    "text": "<i>Via email from a young friend who lives in NYC, a medical researcher.</i>",
                    "created": "Sat, 21 Mar 2020 12:53:20 GMT"
                },
                {
                    "text": "Yesterday was a spectacularly beautiful spring day. I went out biking in the park in the afternoon. Others had the same idea, and it was so crowded it quickly became almost impossible to maintain the 6 foot distance even while riding a bike. The fact is, NYC is just too crowded to make this work well -- social distancing is just not what this city is about. I'm not seeing the kind of distancing you'd hope to see out here; New York has always felt like a human zoo to me, and it still does.",
                    "created": "Sat, 21 Mar 2020 12:53:43 GMT"
                },
                {
                    "text": "My friend and former co-worker's wife is a doctor, just finishing her hospital residency, and they're preparing for all-out war. Constructing tent hospitals outside all the major hospitals to deal with the expected overflow. 5000 confirmed cases now means there were tens of thousands infected a week ago, by the end of this week we will have tens of thousands confirmed, and likely over 100K in less than a month. I am fully expecting NYC to be not only the worst-hit city in the U.S., but possibly the entire world. ",
                    "created": "Sat, 21 Mar 2020 12:55:02 GMT"
                },
                {
                    "text": "Maybe I should have listened to that natural instinct I felt when I first visited this place -- too many people, get out -- but it's too late now, I'm riding this out right here. ",
                    "created": "Sat, 21 Mar 2020 12:56:40 GMT"
                }
            ]
        }
    ]
}