{
    "text": "March 22",
    "created": "Sun, 22 Mar 2020 15:46:12 GMT",
    "name": "22",
    "subs": [
        {
            "text": "A wonderful and <a href=\"https://nymag.com/intelligencer/amp/2020/03/the-story-of-a-coronavirus-infection.html\">literate story</a> of how CV infects your body. No spoilers, I won't say how the story ends. It's really well-written, the title doesn't do it justice. ",
            "created": "Sun, 22 Mar 2020 21:18:01 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://www.axios.com/rand-paul-coronavirus-847b3df1-92bc-4ee6-833b-952d16f3ee3f.html\">Rand Paul</a> getting CV is going to rock the government.",
            "created": "Sun, 22 Mar 2020 19:06:04 GMT",
            "type": "outline"
        },
        {
            "text": "I think we're all slowly coming to the realization that none of us have the imagination to cope with what's coming. It's a slow motion disaster of unprecedented proportion. ",
            "created": "Sun, 22 Mar 2020 18:53:19 GMT",
            "type": "outline"
        },
        {
            "text": "I <a href=\"http://scripting.com/2005/12/13.html\">went</a> to <a href=\"http://scripting.com/2005/12/14.html\">New</a> <a href=\"http://scripting.com/2005/12/15.html\">Orleans</a> in <a href=\"http://scripting.com/2005/12.html\">December 2005</a> after Katrina to see what it was like. To see what an American city was like after it was half-destroyed. What I learned would inform the people making financial decisions in DC. They're not understanding what's going to be left when this is done. Saving corporations is not a possibility. We should be focused on surviving as people and a country. In Katrina people had somewhere to evacuate to. This time we don't. On the other hand nothing we made need be destroyed. It should mostly be here when we emerge. I suppose pirates could hijack airplanes, or occupy skyscrapers in Manhattan. A question I learned to ask from New Orleans. Who's going to supply the supply chain? They had trouble rebuilding because there was no place for the builders to sleep, and no food for them to eat, and no one to prepare it because they had nowhere to live. We need really smart people there thinking and planning. Yet this is the fog of war. We have very little data on the enemy. ",
            "created": "Sun, 22 Mar 2020 18:53:53 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/03/22/accordionPlayer.png"
        },
        {
            "text": "I've been calling it CV, not Coronavirus or whatever.",
            "created": "Sun, 22 Mar 2020 19:34:26 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://twitter.com/GiftedTawk/status/1241470273741824005\">Teachers parade</a> through school neighborhoods so the students could see them.",
            "created": "Sun, 22 Mar 2020 18:32:53 GMT",
            "type": "outline"
        },
        {
            "text": "How are news orgs going to keep going without advertising?",
            "type": "tweet",
            "created": "Sun Mar 22 14:38:13 +0000 2020",
            "tweetId": "1241735942391697408",
            "tweetUserName": "davewiner"
        },
        {
            "text": "New header <a href=\"http://scripting.com/images/2020/03/22/woods.png\">image</a>, a country road between winter and spring. I hated the <a href=\"http://scripting.com/images/2020/03/15/1918OutdoorHospital.png\">previous</a> image. Brrr.",
            "created": "Sun, 22 Mar 2020 17:18:54 GMT",
            "type": "outline"
        },
        {
            "text": "I wasn't alive during <a href=\"https://en.wikipedia.org/wiki/Fireside_chats\">FDR's fireside chats</a>, but I imagine they were <a href=\"https://www.c-span.org/video/?298210-1/president-franklin-roosevelts-fireside-chat\">something</a> like what Gov Cuomo is doing now.",
            "created": "Sun, 22 Mar 2020 15:46:13 GMT",
            "type": "outline"
        },
        {
            "text": "I’m watching The Expanse slowly. They’re fighting something unknown and alien. I watch it because the characters are so compelling.",
            "type": "tweet",
            "created": "Sun Mar 22 14:09:01 +0000 2020",
            "tweetId": "1241728594591825920",
            "tweetUserName": "davewiner"
        },
        {
            "text": "<a href=\"https://www.facebook.com/dave.winer.12/posts/699186266955448\">2018</a>: Facebook is a system for figuring out what kind of bullshit you like and then giving it to you.",
            "created": "Sun, 22 Mar 2020 21:27:28 GMT",
            "type": "outline"
        },
        {
            "text": "The opportunity for science fiction writers to build in the new reality. Start from where we are now, and imagine a path for reality to take that is interesting to the analytical mind. Problem is once you start writing, the baseline will have moved down a different path. Still could be interesting. ",
            "type": "tweet",
            "created": "Sun Mar 22 14:50:50 +0000 2020",
            "tweetId": "1241739116989071362",
            "tweetUserName": "davewiner"
        },
        {
            "text": "These <a href=\"https://twitter.com/KilledByAPixel/status/1241803332794097666\">two</a> <a href=\"https://twitter.com/GillEllisYoung1/status/1241803328968888321\">tweets</a> were one above the other in my timeline.",
            "created": "Sun, 22 Mar 2020 19:08:19 GMT",
            "type": "outline"
        },
        {
            "text": "I gather Trump is having another press conference. We should all have blood pressure monitors hooked up to the net, with a realtime display. You could tell a lot.",
            "created": "Sun, 22 Mar 2020 17:03:54 GMT",
            "type": "outline"
        },
        {
            "text": "Using cannabis during Covid-19",
            "created": "Sun, 22 Mar 2020 21:07:31 GMT",
            "type": "outline",
            "description": "Michael Backes' best advice about using cannabis during the 2020 Covid-19 World Tour.",
            "metaImage": "http://scripting.com/images/2020/03/22/cannabis.png",
            "subs": [
                {
                    "text": "<i>This is a copy of a Michael Backes <a href=\"https://www.facebook.com/michael.backes.180/posts/2442563802721764\">post</a> on Facebook, yesterday.</i>",
                    "created": "Sun, 22 Mar 2020 21:07:41 GMT"
                },
                {
                    "text": "Michael Backes studies and writes about cannabis. Here's his best advice about using it \"during the 2020 Covid-19 World Tour.\" ",
                    "created": "Sun, 22 Mar 2020 21:08:41 GMT",
                    "flNumberedSubs": "true",
                    "subs": [
                        {
                            "text": "Moderation - Cannabis interacts with your body's endocannabinoid system, which the body uses to regulate physiological function- from immune response to memory. Regular high-dose use reduces the density of your endocannabinoid receptors. That's a really poor choice at the moment. Three days of abstinence can restore a significant part of that lost receptor density. Good time to consider a short break. Trust me, cannabis will be there when you get back.",
                            "created": "Sun, 22 Mar 2020 21:09:10 GMT"
                        },
                        {
                            "text": "Find your MED - MED stands for minimum effective dose. There are still folks that think that huge doses of cannabis are a demonstration of their expertise. Sorry, Cheech. The cool folks know that massive doses quickly lead to the disappearance of the subtlest and most interesting effects of cannabis. Find the smallest MED that moves your needle and stick with it.",
                            "created": "Sun, 22 Mar 2020 21:09:14 GMT"
                        },
                        {
                            "text": "Freeze your stash - Cannabis is more than its THC or CBD content. Cannabis flower is perishable and room temperatures degrade its essential oil content. Freeze and just take what you're going to consume. Make sure the freezer container is airtight (I recommend mason jars, as they come in many sizes and are non-reactive with cannabis.)",
                            "created": "Sun, 22 Mar 2020 21:09:17 GMT"
                        },
                        {
                            "text": "Inhale with care - Cannabis smoke and cannabis concentrates can irritate your lungs and suppress your pulmonary immune function and response. Consider mixing it up by taking cannabis orally or switching to a flower vaporizer. An occasional puff is okay, but only if your lungs are in good shape and you're symptom free. Don't inhale if you have symptoms or have been exposed. Period.",
                            "created": "Sun, 22 Mar 2020 21:09:25 GMT"
                        }
                    ]
                }
            ]
        }
    ]
}