{
    "text": "March 24",
    "created": "Tue, 24 Mar 2020 16:19:21 GMT",
    "name": "24",
    "subs": [
        {
            "text": "<a href=\"http://scripting.com/2020/03/24/cuomoMarch24.mp3\">Audio</a> of Gov Cuomo's press conference for today. My next project is to figure out how to flow this through an RSS feed so it can be a podcast. <a href=\"https://www.linkedin.com/in/rbrianbluestein/\">Richard Bluestein</a> did the MP3. More tomorrow. ",
            "created": "Tue, 24 Mar 2020 21:50:48 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2020/03/24/cuomoMarch24.mp3",
            "enclosureType": "audio/mp3",
            "enclosureLength": "130091929"
        },
        {
            "text": "Let Trump ride on the NYC subway for a couple of hours every day and see <a href=\"https://www.businessinsider.com/coronavirus-trump-urges-economic-restrart-early-as-next-week-2020-3\">how he feels</a> then. Turning on the economy in NYC, which is <a href=\"https://www.washingtonpost.com/politics/before-trump-called-for-reevaluating-lockdowns-they-shuttered-six-of-his-top-earning-clubs-and-resorts/2020/03/23/88780374-6d38-11ea-aa80-c2470c6b2034_story.html#click=https://t.co/KdxodfguO5\">probably</a> <a href=\"https://www.nytimes.com/2020/03/20/business/trump-businesses-coronavirus.html\">what he cares about</a>, means cramming millions of people into  virus-infested subway cars each for an hour or two every day. If Trump wants to ride with them, well I'd be impressed, and would also ask Mike Pence to be ready to assume the presidency. Trump may have forgotten that at age 73, he's in the <a href=\"https://www.washingtonpost.com/opinions/2020/03/24/viral-on-air-plea-captures-an-essential-truth-about-trump/\">expendable class</a> according to his Republican (supposed) friends. Make sure your will is current Mr President. ",
            "created": "Tue, 24 Mar 2020 17:01:08 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/03/24/trumpActionFigure.png"
        },
        {
            "text": "<a href=\"https://github.com/scripting/Scripting-News/issues/158\">Braintrust query</a>: I grok regex, but I have a mental block against working in it. It's weird because I used it all the time when I was a grad student, but after programming on PCs and Macs, I became regex-phobic.",
            "created": "Tue, 24 Mar 2020 20:41:19 GMT",
            "type": "outline"
        },
        {
            "text": "I'm <a href=\"https://twitter.com/davewiner/status/1242557388516806656\">looking</a> for volunteers to produce MP3s every day after <a href=\"https://www.c-span.org/person/?andrewcuomo\">Gov Cuomo's talks</a>. I want to have it be a podcast feed. I can do all the RSS work. ",
            "created": "Tue, 24 Mar 2020 21:23:56 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1242557388516806656"
        },
        {
            "text": "Don't waste time on Trump's idiotic idea. He just wants to own a news cycle. He remembers what that was like. He's a <a href=\"http://this.how/trolls/\">troll</a>, now and forever, even with our lives. Don't take the bait.",
            "created": "Tue, 24 Mar 2020 22:13:14 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://www.brainyquote.com/quotes/george_s_patton_102496\">George Patton</a>: \"The object of war is not to die for your country but to make the other bastard die for his.\"",
            "created": "Tue, 24 Mar 2020 20:14:13 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=sv9XNFpRdhg"
        },
        {
            "text": "Pelosi, make a condition of the stimulus that Trump resign.",
            "created": "Tue, 24 Mar 2020 21:39:26 GMT",
            "type": "outline"
        },
        {
            "text": "Why America is so bad at Covid-19. It’s our attitude, there are never consequences for Americans. That’s for other people. We have wars and tax cuts at the same time. We don’t see the coffins of our returning dead. Nothing happens to us. We can’t imagine things not being normal. The generation that grew up during World War II, who experienced the Holocaust, the advent of nuclear weapons, that generation is gone now. Everyone alive today, not just boomers, have been spoiled. We're all coming awake now from a life-long trance. For the first time in our lives, we have to deal with the mortality of our country. Don't cry for America. It's time to grow up, again. Couldn't have a more perfect person as president. It's easy to see he is our past. Now how do we move beyond that. ",
            "created": "Tue, 24 Mar 2020 19:37:58 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/03/24/mirror.png"
        },
        {
            "text": "My parents were born in 1929 (father) and 1932 (mother), in Bucharest and Prague. They fled from the Nazis as children with their parents, to NYC. Their lives were formed in chaos.",
            "created": "Tue, 24 Mar 2020 21:40:57 GMT",
            "type": "outline"
        },
        {
            "text": "I always wondered <a href=\"https://twitter.com/davewiner/status/1242438120580186113\">why</a> bike delivery people in NYC put plastic bags over the handles of their bikes. Today I <a href=\"https://twitter.com/polly/status/1242438758001258496\">found out</a>. \"They keep your hands warm, particularly when you're biking really fast and the wind is bad. Can still access the gears and brakes this way, which you couldn't do easily in gloves.\"",
            "created": "Tue, 24 Mar 2020 16:55:25 GMT",
            "type": "outline"
        },
        {
            "text": "Went to a local supermarket this morning. It was empty of people. The shelves were pretty well stocked. I went because a friend told me there were paper products. I got four rolls of paper towels. And two packages of bacon (why not, who knows when we'll see it again). ",
            "created": "Tue, 24 Mar 2020 16:30:15 GMT",
            "type": "outline"
        },
        {
            "text": "Note to people who manage websites that deliver timely and vital information about the virus. Think clearly about the user experience. Some sites have popups and cluttered templates, even paywalls. If technical people want to do something to help, i.e. the people who read this blog, try to simplify and ease access to your sites. ",
            "created": "Tue, 24 Mar 2020 16:19:22 GMT",
            "type": "outline"
        },
        {
            "text": "My friend <a href=\"https://twitter.com/enochchoi\">Enoch Choi</a> on the front line. ",
            "created": "Tue, 24 Mar 2020 16:52:20 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/03/24/enochChoi.png"
        }
    ]
}