{
    "text": "March 27",
    "created": "Fri, 27 Mar 2020 13:54:04 GMT",
    "name": "27",
    "subs": [
        {
            "text": "This week's <a href=\"https://radioopensource.org/profits-or-people/\">Radio Open Source</a> is worth a listen. The economics of Coronavirus. They breezed by a huge issue. Millions of Americans without health insurance, no savings, no job, sick, homeless, hungry, plus guns. The <a href=\"http://scripting.com/2020/03/21.html#a011845\">ticking time bomb</a> I wrote about briefly on March 21. The so-called stimulus Congress passed, what a joke, does nothing to address this. I would much preferred see the $2 trillion give everyone the health care they need, keep us all fed, and reboot the economy around serving the people of the country. The UK did this, by guaranteeing 80% of people's salaries for the duration. They already have a national health care system. We are headed for a big crash. Congress didn't deal with it. ",
            "created": "Fri, 27 Mar 2020 21:38:48 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/03/27/wileECoyote.png"
        },
        {
            "text": "I think it's clear now that if SXSW had gone on <a href=\"https://www.sxsw.com/2020-event-update/?_ga=2.8584572.819356914.1585317263-1624801780.1585317263\">as scheduled</a>, Austin would now be a hot spot for the virus, like New Orleans or New York.",
            "created": "Fri, 27 Mar 2020 13:54:05 GMT",
            "type": "outline"
        },
        {
            "text": "I don't feel good about this. I was glad to hear Boris Johnson got the CV, not because I hold anything against him, but if he can get it so can Trump. And I think that would be good for Americans who are scared out of our minds about this disease esp because our president is not.",
            "created": "Fri, 27 Mar 2020 14:00:46 GMT",
            "type": "outline"
        },
        {
            "text": "It helps to remember we are an occupied country. Vichy America. The person at the podium is our <a href=\"https://en.wikipedia.org/wiki/Philippe_P%C3%A9tain\">Marshal Pétain</a>. ",
            "created": "Fri, 27 Mar 2020 14:42:21 GMT",
            "type": "outline"
        },
        {
            "text": "Meta-chaos",
            "created": "Fri, 27 Mar 2020 16:54:53 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "There's chaos and there's chaos about the chaos.",
                    "created": "Fri, 27 Mar 2020 16:54:56 GMT"
                },
                {
                    "text": "Reduce the chaos until what we're doing is as smart as possible, to reduce death, and hasten the time we can resume living."
                },
                {
                    "text": "The way we're living now is not sustainable, we have to stay focused and not give in to the circus.",
                    "created": "Fri, 27 Mar 2020 16:55:17 GMT"
                }
            ]
        }
    ]
}