{
    "text": "March 28",
    "created": "Sat, 28 Mar 2020 17:14:52 GMT",
    "name": "28",
    "subs": [
        {
            "text": "<a href=\"https://twitter.com/MemoMakanika/status/1238398794955399168\">This video</a> from Saudi Arabia demonstrates how CV spreads in the most memorable way I've seen. ",
            "created": "Sat, 28 Mar 2020 21:01:15 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/MemoMakanika/status/1238398794955399168",
            "image": "http://scripting.com/images/2020/03/28/hillary.png"
        },
        {
            "text": "Google, Apple, Facebook all know where people are moving around and where they’re locked down. People in pre-CV America would have freaked if they made the data public, in aggregate. Personally I’d love to see it.",
            "type": "tweet",
            "created": "Sat Mar 28 23:34:41 +0000 2020",
            "tweetId": "1244045274080776192",
            "tweetUserName": "davewiner"
        },
        {
            "text": "Those of us who are locked down should know that our lockdown doesn't really begin until every state in the country does it.",
            "created": "Sat, 28 Mar 2020 20:38:24 GMT",
            "type": "outline"
        },
        {
            "text": "This time thanks to Trump the entire country is ground zero.",
            "created": "Sat, 28 Mar 2020 20:11:32 GMT",
            "type": "outline"
        },
        {
            "text": "My friend Om Malik, one of the original bloggers and now a <a href=\"https://en.wikipedia.org/wiki/Venture_capital\">VC</a>, has started <a href=\"http://omshow.libsyn.com/rss\">a podcast</a>, because what else does he have to do. This is a silver lining to the pandemic. All kinds of <a href=\"https://www.dictionary.com/e/slang/og/\">OG</a> bloggers are dusting off their websites and getting back to work. ",
            "created": "Sat, 28 Mar 2020 17:14:53 GMT",
            "type": "outline"
        },
        {
            "text": "We're updating the <a href=\"http://scripting.com/cuomo/rss.xml\">Cuomo podcast</a>, still have to submit it to various podcast aggregators, and \"Woodstock Today\" is catching on in the community. ",
            "created": "Sat, 28 Mar 2020 17:16:50 GMT",
            "type": "outline"
        },
        {
            "text": "We are now clawing our way up the other side of the abyss. Making features for the CV epoch. Wheee! :boom:",
            "created": "Sat, 28 Mar 2020 18:51:37 GMT",
            "type": "outline"
        },
        {
            "text": "What viral means",
            "created": "Sat, 28 Mar 2020 19:52:52 GMT",
            "type": "outline",
            "description": "A tutorial on virality that the president might understand.",
            "subs": [
                {
                    "text": "I heard someone parrot what the president said about how car accidents kill 65K people a year, yet we don't shut down the car industry. So why do we all have to hibernate in isolation while the scientists find a treatment or a vaccine for this killer disease, Covid-19. I suppose it's good to explain, one time, in one place, why a virus is different from a car accident, using Twitter as an example. ",
                    "created": "Sat, 28 Mar 2020 19:53:06 GMT",
                    "image": "http://scripting.com/images/2020/03/28/budgie.png"
                },
                {
                    "text": "Most things I post on Twitter are not viral. One or two people may RT it, and that's it. Once in a while I post something does go viral. That means a few people RT to people who then RT it to people who then RT it, etc. Sooner or later 100K people have seen my stupid little tweet. Covid-19 is like that. If you have it, and you don't isolate, you will give it to 3 other people, and they will give it to 3 more people, and so on. Very quickly a million people have it. It goes viral. I'm sure Trump has used that word perhaps without really understanding what it means. ",
                    "created": "Sat, 28 Mar 2020 19:54:04 GMT"
                },
                {
                    "text": "Now why is that a problem? We'll answer that in the next lesson. ",
                    "created": "Sat, 28 Mar 2020 20:02:34 GMT"
                }
            ]
        },
        {
            "text": "Instant updates",
            "created": "Sat, 28 Mar 2020 17:58:36 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I've gotten a few requests from people who get the <a href=\"http://scripting.com/email/\">nightly email</a> who want more frequent updates to the <a href=\"http://scripting.com/?tab=blog\">main blog</a> and the <a href=\"http://scripting.com/?tab=links\">linkblog</a>. There are feeds for both. If you follow them in an RSS reader, you will get the items as they are posted, throughout the day.",
                    "created": "Sat, 28 Mar 2020 17:58:42 GMT"
                },
                {
                    "text": "Here are the feeds:",
                    "created": "Sat, 28 Mar 2020 17:59:30 GMT",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "<a href=\"http://scripting.com/rss.xml\">http://scripting.com/rss.xml</a>",
                            "created": "Sat, 28 Mar 2020 17:59:38 GMT"
                        },
                        {
                            "text": "<a href=\"http://radio3.io/users/davewiner/rss.xml\">http://radio3.io/users/davewiner/rss.xml</a>",
                            "created": "Sat, 28 Mar 2020 17:59:50 GMT"
                        }
                    ]
                }
            ]
        }
    ]
}