{
    "text": "Be careful with takeout food",
    "created": "Tue, 17 Mar 2020 14:14:20 GMT",
    "type": "outline",
    "description": "Don't eat takeout food straight out of the container. Heat it first to kill the virus.",
    "subs": [
        {
            "text": "I asked a theoretical <a href=\"https://twitter.com/davewiner/status/1239548652504391680\">question</a> on Twitter yesterday.  ",
            "created": "Tue, 17 Mar 2020 13:59:40 GMT",
            "subs": [
                {
                    "text": "I have to take a drive today. I like to stop off at a McDonald's and get an Egg McMuffin and a coffee on this drive. The question is -- is this safe? What if someone preparing the food has the virus. ",
                    "created": "Tue, 17 Mar 2020 14:19:29 GMT"
                }
            ]
        },
        {
            "text": "Everyone said it was not safe. Later I thought, wait -- the virus has to enter the lungs. If you eat it, it's harmless, it never makes it to the lungs. I asked a doctor friend. He says: You are wrong. Don't eat it.",
            "created": "Tue, 17 Mar 2020 14:15:46 GMT",
            "subs": [
                {
                    "text": "The virus in the food attaches to receptors on the cells of the back of your throat, like any cold virus, and is taken into those cells, after which you become infected. It spreads to your lungs later. ",
                    "created": "Tue, 17 Mar 2020 14:17:16 GMT"
                }
            ]
        },
        {
            "text": "He continued:",
            "created": "Tue, 17 Mar 2020 14:20:26 GMT",
            "subs": [
                {
                    "text": "If it's super hot, that kills the virus. This is what I've been doing: order food, use gloves to touch the packaging. When you get home, open the package, dump the food out onto a plate, then throw that plate in the oven (or if you can heat on the stove, in a pot), then dump the packaging and wash hands. Packaging more likely to have the virus, but heat the food to almost boiling as well to ensure everything is dead. Hot food only, get a hot coffee and ice it yourself. ",
                    "created": "Tue, 17 Mar 2020 14:18:30 GMT"
                }
            ]
        }
    ]
}