{
    "text": "The Beatles had a sad end",
    "created": "Sun, 05 Dec 2021 15:02:00 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I finished <a href=\"http://scripting.com/2021/12/01/144612.html?title=theBeatlesWereAnInvention\">Get Back</a>, and I kind of hated the way it ended, but it is what it is, it's not like there were screen writers who chose the wrong ending. The rooftop concert was a Ouija board thing. Something Ringo could have an opinion about, so they had the concert. I thought it was awful, esp for the last live performance of the Beatles. It wasn't really a concert, it was cheap, they used London, acted like dicks, it made the whole Let It Be process suck. ",
            "created": "Sun, 05 Dec 2021 14:54:09 GMT",
            "flInCalendar": true
        },
        {
            "text": "At one point the idea of going back to <a href=\"https://en.wikipedia.org/wiki/The_Cavern_Club\">The Cavern</a> was brought up, and I thought that would have been great. They clearly have very strong feelings for that period of the Beatles, even though it's something most of us never experienced (it was before the mania). Or they could have arranged to be surprise guests at a London club. I'm sure they were there, and any of them would be happy to host the Beatles. Then it would have been legal, the enthusiasm would have been there, and they could have fucked around and everyone would've loved it. ",
            "created": "Sun, 05 Dec 2021 15:02:30 GMT",
            "flInCalendar": true
        },
        {
            "text": "Or maybe there was just no place for the Beatles to go in 1969. I've noted this about superstar basketball teams. Once they win a couple of championships, I felt, they should just disband the team, because there would be no joy in a third or fourth. It seems like everything they did in the album Let It Be was no more interesting than what they did in Magical Mystery Tour or the White Album or Sargent Pepper, Revolver, they were all huge leaps. Let It Be -- no -- it's great stuff, historic -- it all really matters, but none of it was necessary. Anything past that, well there was no vision for it. ",
            "created": "Sun, 05 Dec 2021 15:03:46 GMT",
            "flInCalendar": true
        },
        {
            "text": "Another thing I learned, over the whole three episodes, is how little the Beatles cared about business and how much of it they delegated. I had read the story of Billy Joel, and was amazed about how he kept money far away, and had gotten ripped off massively by someone he trusted. Lennon was in awe of <a href=\"https://en.wikipedia.org/wiki/Allen_Klein\">Allen Klein</a>, but he sounds like a schmuck. I think if the Beatles had a manager who loved them, and cared about them, they might have continued writing music together for many years, and gotten what they wanted out of independence. It doesn't seem like it had to be either/or, and what's also clear is how much love there was between them. It's a common pattern, something great happens, and the assholes move in and squeeze the life out of it. How strong the Beatles were that they got so far. Or how much their manager, who had just died, must've loved them. ",
            "created": "Sun, 05 Dec 2021 15:02:39 GMT",
            "flInCalendar": true
        },
        {
            "text": "PS: A good movie to watch after finishing Get Back is the <a href=\"https://en.wikipedia.org/wiki/The_Beatles:_Eight_Days_a_Week\">Ron Howard documentary</a> about the touring Beatles. It's on <a href=\"https://www.hulu.com/movie/the-beatles-eight-days-a-week-the-touring-years-d3b00689-e450-4fcb-9853-d37e78ed4c57?\">Hulu</a>.  ",
            "created": "Mon, 06 Dec 2021 03:16:33 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}