{
    "text": "We can't budge on the so-called wall",
    "created": "Fri, 11 Jan 2019 19:51:54 GMT",
    "type": "outline",
    "description": "If we can't stand against this and say no, and have it stick, then we have given up any hope of ever having self-government in the US. ",
    "subs": [
        {
            "text": "First, I am not a Democrat. I'm an independent but these days I vote straight Democrat because what the Republicans have become is so abhorrent to me. We're at the very baseline of governance in the US. Do you or do you not stand for the Constitution? Today only the Dems do. The Repubs do not.   ",
            "created": "Fri, 11 Jan 2019 19:52:38 GMT",
            "image": "http://scripting.com/images/2019/01/11/uncleSam.png"
        },
        {
            "text": "Anyway, if Pelosi and Schumer give the president \"the wall\" which I put in quotes because we have no clue what it means, we are giving into the idea that <i>a majority of the American electorate have no say in how the country is run.</i> ",
            "created": "Fri, 11 Jan 2019 19:53:37 GMT"
        },
        {
            "text": "We've been pushed to the limit by the Repubs. They wouldn't confirm Merrick Garland. They have installed a majority on the court even though they don't represent a majority in the country. The latest appointee slandered the court during his confirmation hearings. It's going to get worse. They gerrymandered Congressional districts so that in order to control the House the Dems have to win a landslide, which they did, in 2018, and even so, according to the Repubs, have no say in governance.",
            "created": "Fri, 11 Jan 2019 19:54:34 GMT"
        },
        {
            "text": "Enough. We have a system of government. Respect it. Trump's \"wall\" is an imaginary thing. It's an example of the emperor with no clothes. If we can't stand against this and say no, and have it stick, then we have given up any hope of ever having self-government in the US. ",
            "created": "Fri, 11 Jan 2019 19:55:56 GMT"
        }
    ]
}