{
    "text": "Good morning everybody ",
    "created": "Sun, 17 Jan 2021 17:08:49 GMT",
    "type": "outline",
    "description": "No matter what, things will change radically in the US in the next few days.",
    "metaImage": "http://scripting.com/images/2021/01/17/twinTowers.png",
    "subs": [
        {
            "text": "There's a weird feeling in the world right now. Tomorrow is a <a href=\"https://en.wikipedia.org/wiki/Martin_Luther_King_Jr._Day\">national holiday</a>, and Wednesday is Inauguration Day. No matter what, things will change radically in the US in the next few days.  ",
            "created": "Sun, 17 Jan 2021 17:15:20 GMT",
            "image": "http://scripting.com/images/2020/03/12/usAttacked.png",
            "imageLink": "https://archive.nytimes.com/www.nytimes.com/packages/html/nyregion/9-11imagemap.html?mcubz",
            "flInCalendar": true
        },
        {
            "text": "I got an answer to a <a href=\"http://scripting.com/2021/01/16.html#a170934\">question</a> I asked yesterday, about who 20K+ troops in DC will report to, until Biden is sworn in. By law they report to the commander-in-chief, President Trump. Just a fact. If Trump orders them to assassinate everyone at the inauguration, it's not all that different from what Trump told the mob to do on January 6. So unfortunately it is in the realm of possibility.  ",
            "created": "Sun, 17 Jan 2021 17:15:42 GMT",
            "flInCalendar": true
        },
        {
            "text": "It all hinges on who the troops are loyal to. Turns out the military thought of that, and <a href=\"https://www.defenseone.com/threats/2021/01/troops-inauguration-pre-screened-extremism-says-dc-guard-commander/171456/\">pre-screened</a> the soldiers assigned to this job to weed out white supremacists. I kid you not. They know how to do that? I guess it would be naive for them not to.",
            "created": "Sun, 17 Jan 2021 17:44:13 GMT",
            "flInCalendar": true
        },
        {
            "text": "I have a nightmareish vision of <a href=\"https://en.wikipedia.org/wiki/Assassination_of_Anwar_Sadat\">Anwar Sadat's assassination</a> in 1981. If you haven't seen it, <a href=\"https://www.youtube.com/watch?v=cKu-u-W5J84\">watch the video</a>. You've never seen anything like it, even in a movie or TV show.  As they <a href=\"http://scripting.com/2021/01/16.html#a170600\">say</a>, this is why you want to have programmers around, we think about these things. :boom:",
            "created": "Sun, 17 Jan 2021 17:20:06 GMT",
            "flInCalendar": true
        },
        {
            "text": "I read last night that <a href=\"https://www.defenseone.com/ideas/2021/01/pentagon-wont-throw-traditional-farewell-ceremony-trump/171408/\">the Pentagon turned Trump down</a> for a great military send-off on Wednesday morning. Interesting, are they allowed to do that? No one seems to be questioning it. ",
            "created": "Sun, 17 Jan 2021 17:18:16 GMT",
            "flInCalendar": true
        },
        {
            "text": "Anyway, if it goes smoothly and the Bidens end up running the government on Thursday, and recinding Trump's orders, the tension goes down a lot. We still have to deal with Trump, and Republicans, but really if they could just STFU our real business is with the virus. ",
            "created": "Sun, 17 Jan 2021 17:19:55 GMT",
            "flInCalendar": true
        },
        {
            "text": "All the usual mottos apply, Let's Have Fun, Still diggin, and It's not like anyone gets out of this alive. ",
            "created": "Sun, 17 Jan 2021 17:20:51 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}