{
    "text": "Why Facebook doesn't ban liars",
    "created": "Fri, 20 Jul 2018 18:52:15 GMT",
    "type": "outline",
    "description": "What would happen if Facebook banned Infowars and Breitbart and other lie-spreading make-believe news orgs?",
    "subs": [
        {
            "text": "I love the <a href=\"https://www.nytimes.com/column/the-daily\">Daily podcast</a>, but it may be because I'm a neophyte in most of what they cover. When they cover Facebook, and other tech industry topics, they are the neophytes, and imho, they once again, imho, have missed the story in <a href=\"http://podcatch.com/archive/2018/07/20/570056.html\">today's podcast</a>. ",
            "created": "Fri, 20 Jul 2018 18:52:26 GMT",
            "image": "http://scripting.com/images/2018/07/20/biketirereverse.png"
        },
        {
            "text": "The story is Facebook's attempts to regulate the virality of lies. They're not trying to eliminate the lies, because as Zuckerberg states, we all make mistakes, and if they banned people or organizations that told lies, they'd be banning a lot of valuable interactions and people. Instead, when a story starts going viral, and if it's a lie, they tell the algorithm to ignore its popularity. To me, someone with some experience managing online communties, though not at the scale of Facebook, that seems to be a clever and wise solution. ",
            "created": "Fri, 20 Jul 2018 18:53:14 GMT"
        },
        {
            "text": "The Times reporter wants them to do more. He says Zuckerberg will have to use his power. He has no obligation to be fair, applying the <a href=\"https://en.wikipedia.org/wiki/First_Amendment_to_the_United_States_Constitution\">standards</a> of a western democracy to speech on Facebook. He could do what the NYT would like him to do, ban Infowars, Breitbart and Gateway Pundit, and keep the NYT and Washington Post. But this isn't what Facebook wants.",
            "created": "Fri, 20 Jul 2018 18:55:37 GMT"
        },
        {
            "text": "What would happen if Facebook banned Infowars and Breitbart and other lie-spreading make-believe news orgs? They'd start their own Facebook. You might think it's not possible, but Facebook knows how many followers they have, and how hard the technology is. \"Facebook is a business,\" Zuck said. And as a business he has to think about growth, and defending against potential competition.",
            "created": "Fri, 20 Jul 2018 18:57:40 GMT"
        },
        {
            "text": "The last thing he wants is to give the right-wing infowarriors an excuse to move their users off Facebook and onto a right-wing-approved social network. I am sure that's coming, btw. I'm sure he's sure as well. And he wants to put that out as far in the distance as he can. ",
            "created": "Fri, 20 Jul 2018 18:59:14 GMT"
        }
    ]
}