{
    "text": "Phoenix bike share",
    "created": "Fri, 03 Nov 2017 17:06:18 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Whenever I'm in a city that has a bike share program, I give it a try if I have the time. Today I'm in <a href=\"https://en.wikipedia.org/wiki/Phoenix,_Arizona\">Phoenix</a>, for a future-of-news conference, and took a 1/2 hour ride around downtown on their <a href=\"http://gridbikes.com/\">Grid</a> bike system. ",
            "created": "Fri, 03 Nov 2017 17:06:22 GMT",
            "image": "http://scripting.com/2017/11/03/phoenixBike.png"
        },
        {
            "text": "The setup is just like the one in Portland. The bikes have GPS built in, and communicate with a server. You enter your account number and PIN and it releases the bike. The UI is very confusing and the server is slow, and it falls behind when you type the numbers. It took me ten minutes to unlock a bike, and I had prepaid through their website. The cost for a tourist like me is $7 an hour. ",
            "created": "Fri, 03 Nov 2017 17:19:59 GMT"
        },
        {
            "text": "I had no idea what downtown Phoenix is like, but the ride gave me a good view, much better than you'd get by walking or driving. Phoenix's downtown has a lot of empty space, like Oakland or San Jose in the 80s. And it's poor and outside of the main area pretty rundown. Lots of homeless and poor people. Very little sidewalk or street traffic, not many stores. An empty feel. A big arena and sports stadium. The arena must be where the Phoenix Suns play, and I'm guessing the stadium is where the Cardinals or DIamondbacks play. ",
            "created": "Fri, 03 Nov 2017 17:09:14 GMT"
        },
        {
            "text": "The place looks very small, judging from the downtown, but the city has a population of 1.6 million. It's the fifth largest city in the US. From memory: New York, Los Angeles, Chicago and Houston are larger. ",
            "created": "Fri, 03 Nov 2017 17:11:38 GMT"
        }
    ]
}