{
    "text": "We did nothing and now we pay",
    "created": "Tue, 21 Jan 2025 17:38:54 GMT",
    "type": "outline",
    "metaImage": "http://scripting.com/images/2025/01/20/noCountry.png",
    "subs": [
        {
            "text": "The most depressing moment of Trump 1.0, for me, was leaving the local supermarket, after seeing the kind of empty shelves you see in third world countries with broken or non-existent economic systems. This was when it sunk in how far the United States had fallen. ",
            "created": "Tue, 21 Jan 2025 17:31:27 GMT",
            "flInCalendar": true
        },
        {
            "text": "But somehow those of us who survived Covid could relax on January 20, four years ago -- which was also coincidentally the day I got my first Covid vaccination -- the nightmare was over. We could relax for at least a few months before paying the price that was sure to come when we cleaned the mess that Trump had created with his January 6 insurrection. The question was will there be a war over this? Well, I reasoned, as I assumed the incoming president would, that it's better if you have to fight a civil war to do it when the military is responsible to you. But then a few months turned into a couple of years, and nothing happened. No indictments. He hadn't been arrested. I thought geez if we had done something like what he did, the scale of it, the audacity, the terror, my god how could he be left to walk around as if nothing had happened. I figured there must be a reason and our president had a plan. He didn't. Neither did journalism. When Trump ran for re-election he got the consideration any major party candidate would get from the press. As he is getting now as a newly sworn-in president. But we know his oath is meaningless. ",
            "created": "Tue, 21 Jan 2025 17:44:42 GMT",
            "image": "https://imgs.scripting.com/2021/01/11/klaesAshford.png",
            "flInCalendar": true
        },
        {
            "text": "So that day when the shelves were empty is now only the second worst day, and yesterday I was still living with the respite of a four year trance of normality, as if all it took was belief that somehow we'd get through this. But now it's so depressing. I feel both like dying and living at the same time. I know many others feel this way. I don't imagine too many of the people who voted for Trump are full of joy right now. ",
            "created": "Tue, 21 Jan 2025 17:45:35 GMT",
            "flInCalendar": true
        },
        {
            "text": "If we get another shot at cleaning this up, we must not let that opportunity slip by. ",
            "created": "Tue, 21 Jan 2025 17:46:00 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}