{
    "text": "How to find new feeds in FeedLand",
    "created": "Sun, 11 Dec 2022 23:41:53 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Talking with a friend who uses \"FeedLand\" today, the question came up as to how you find new feeds that might be interesting. So here are a few ways.",
            "created": "Sun, 11 Dec 2022 23:42:03 GMT",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "If you don't want to do a lot of work, start with <a href=\"http://feedland.org/?username=davewiner\">my feed list</a>. I subscribe to a lot of feeds, more than anyone else. Now here's the cool part. If you see a checkbox that isn't checked that means you aren't subscribed to it. Just click on the checkbox to subscribe. ",
                    "created": "Sun, 11 Dec 2022 23:48:25 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Start with a feed you like, on your <i>Feed List</i> page. <a href=\"http://scripting.com/images/2022/12/11/feedlistScreen.png\">Screen shot</a>. Click on the title of the feed, which takes you to the <i>Feed Info</i> page. At the end of the page is a list of other people who subscribe to that feed. Click on a name to see their Feed List page. ",
                    "created": "Sun, 11 Dec 2022 23:42:32 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Choose <i>Recent users</i> from the first menu. It takes you to a <a href=\"http://feedland.org/?userslist\">list of users</a> who have recently used FeedLand. <a href=\"http://scripting.com/images/2022/12/11/recentUsersScreen.png\">Screen shot</a>. Click on any name to go to their feed list. There are the checkboxes again. You can play with the sort order on the Recent Users page, you can see the people who have used FeedLand the most (that's the <i>Hits</i> colum) or are subscribed to the most feeds (the <i>Ct</i> column) or have been using it the longest (click twice on the <i>Started</i> column). ",
                    "created": "Sun, 11 Dec 2022 23:44:02 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}