{
    "text": "Privilege is a hierarchy",
    "created": "Tue, 02 Jul 2019 14:58:06 GMT",
    "type": "outline",
    "description": "I chose to do something hard, that I loved, that represented my aspiration not just for myself but for you, and everyone else.",
    "subs": [
        {
            "text": "<i>This originated as a <a href=\"https://twitter.com/davewiner/status/1146061518699581441\">thread</a> on Twitter. </i>",
            "created": "Tue, 02 Jul 2019 14:58:12 GMT",
            "urltweet": "https://twitter.com/davewiner/status/1146061518699581441",
            "image": "http://scripting.com/images/2017/06/20/orange.png"
        },
        {
            "text": "At the journalism <a href=\"https://isoj.org/symposia/2019/\">conference</a> I keynoted in <a href=\"http://scripting.com/2019/04/14.html\">April</a>, with @rmack as my partner, I was criticized for being <a href=\"http://scripting.com/2019/04/18.html#a211113\">privileged</a>. Only now, months later am I formulating the proper response. I'm going to try to outline it here. ",
            "created": "Tue, 02 Jul 2019 14:59:22 GMT"
        },
        {
            "text": "Okay, I'm privileged. But so are you. Even if you're a woman or a person of color. There is a hierarchy of privilege. Maybe your parents were born in this country, so you have deep roots and a large loving family. That's a kind of privilege.",
            "created": "Tue, 02 Jul 2019 14:59:30 GMT"
        },
        {
            "text": "Maybe your parents had wonderful childhoods, cared for by loving parents who always wanted the best for them. Or maybe you were raised by parents who were horribly abused, not just by their family but by the world. You can't necessarily see that in a person's age, gender, or race. ",
            "created": "Tue, 02 Jul 2019 14:59:39 GMT"
        },
        {
            "text": "But I chose to do something hard, that I loved, that represented my aspiration not just for myself but for you, and everyone else.  But when you listened, to the extent that you did, all you felt was bitterness, so deeply you had to speak.",
            "created": "Tue, 02 Jul 2019 14:59:51 GMT"
        },
        {
            "text": "What should I have done differently? And assuming you are correct and that my privilege oppressed someone else (hard to see how) I'm now getting my comeuppance, not from you. Basically my work offended so many people that getting asked to tell my story is the rarest thing.",
            "created": "Tue, 02 Jul 2019 14:59:59 GMT"
        },
        {
            "text": "And even so, I couldn't tell my pretty relevant story given that innovation is so needed in journalism, without being attacked. I didn't feel that particular fear before speaking, but if I ever do it again, I will.",
            "created": "Tue, 02 Jul 2019 15:00:07 GMT"
        },
        {
            "text": "I wasn't a big fan of Bernie Sanders, but he said something wonderful after the debate last Thursday to the challenge that it was time for older people to step aside and let the young people lead. He said no. These ideas are too important. And that's what I say too.",
            "created": "Tue, 02 Jul 2019 15:00:16 GMT"
        }
    ]
}