{
    "created": "2022-03-02T05:00:00.000Z",
    "flInCalendar": true,
    "name": "02",
    "path": "2022/03/02",
    "text": "March 02",
    "type": "calendarDay",
    "subs": [
        {
            "text": "We need to be more like Ukraine.",
            "created": "Wed, 02 Mar 2022 20:19:57 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "When we look back on <a href=\"http://daytona.scripting.com/?q=tesla&collection=scriptingnews\">Tesla</a> if we manage to avoid all the calamities that are lined up, I'm sure it'll be one of the most influential products of our time. Without Tesla the auto manufacturers that <a href=\"https://www.cnbc.com/2022/03/01/elon-musk-takes-aim-at-president-biden-after-he-fails-to-mention-tesla-during-state-of-the-union.html\">Biden praises</a> wouldn't have the guts or vision to develop the cars they are now preparing to sell. There are always politeness experts around to say how they want their revolution to be nicely scented, but it doesn't work that way. You will be offended by the ideas that shake your world. You'll get over it too.",
            "created": "Wed, 02 Mar 2022 20:00:13 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2022/03/02/roomFreshener.png",
            "flInCalendar": true
        },
        {
            "text": "I couldn't watch last night's State of the Union. Biden is not a good speaker. But the funny thing is that without a script, in press conference mode, he's masterful. His timing is perfect. He's not in his head. He should do more of those. ",
            "created": "Wed, 02 Mar 2022 20:24:31 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I cruised through the first season of <a href=\"http://daytona.scripting.com/?q=raised%20by%20wolves&collection=scriptingnews\">Raised By Wolves</a>, and the first four episodes of Season 2. But then I caught up and I'm waiting a week for every new episode, and this show doesn't work well that way. It's too complicated, so many characters, and they keep adding new ones, there's too much to remember, and I never got caught up with the story before the last episode was over. They're making different kinds of shows now, and the one episode per week style of distribution often doesn't work. For a show like Rick & Morty, fine. I don't even know if there's any continuity between episodes. The characters talk about the season, the fourth wall is often permeable in that show, but I don't care. The shows stand alone too. Some series, like the fantastic <a href=\"https://en.wikipedia.org/wiki/Counterpart_(TV_series)\">Counterpart</a> are completely unwatchable except by watching one season immediately after the other. I found the second season impossible to follow after the hiatus. Also if the show had a great runner in the first season don't bother with another season unless the same runner is still doing it. <a href=\"http://daytona.scripting.com/?q=killing%20eve&collection=scriptingnews\">Killing Eve</a> is the example. The third season was crap. There's a fourth one out now. Not planning on watching it. ",
            "created": "Wed, 02 Mar 2022 20:20:16 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Pro tip: <a href=\"http://scripting.com/images/2022/03/02/mothersEyes.png\">Mother's eyes</a> are important. ",
            "created": "Wed, 02 Mar 2022 20:27:00 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I write all my Twitter threads with <a href=\"http://thread.center/\">thread.center</a>. You should too! And spread the word. If you do, more people will make tools for you. That's your part of the deal. Don't be selfish. <span style=\"font-size: 0.8em\">:heart:</span>",
            "created": "Wed, 02 Mar 2022 20:14:07 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "You know I like to write about our <a href=\"http://daytona.scripting.com/?q=human-size&collection=scriptingnews\">human-size</a> lives, and how when you try to live larger, you fail, no matter how much money or fame you have. But... Watching <a href=\"https://en.wikipedia.org/wiki/Freddie_Mercury\">Freddie Mercury</a> perform <a href=\"https://www.youtube.com/watch?v=0omja1ivpx0\">Radio Ga-Ga</a> or <a href=\"https://www.youtube.com/watch?v=vbvyNnw8Qjg\">Bohemian Rhapsody</a> at <a href=\"https://en.wikipedia.org/wiki/Live_Aid\">Live Aid</a>, you can see that it is possible to live a greater than a human-size life. Here I am watching this event that took place 37 years ago, electrified, emotionally touched, and FM is long-gone. So it is also possible to achieve some amount of immortality. Mercury has the experience that few of us get to have -- he can make love with many thousands of people at once, over decades. ",
            "created": "Wed, 02 Mar 2022 14:34:32 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2022/03/02/queen.png",
            "flInCalendar": true
        },
        {
            "text": "The thing that's so cool is how much the fans love Freddie Mercury. That's because, unlike a lot of musical performers and other kinds of leaders, he knows they're there and includes them in the performance. If you want to be a big hit and have your fans love you, you have to do that. Let them in on the fun. ",
            "created": "Wed, 02 Mar 2022 20:15:08 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://dev.mysql.com/doc/refman/8.0/en/fulltext-natural-language.html\">MySQL</a> has special features for text search which I am not using in Daytona. It should get faster and more flexible. I will try to make time for it in the upcoming weeks. ",
            "created": "Wed, 02 Mar 2022 20:37:41 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}