{
    "created": "2022-03-03T05:00:00.000Z",
    "flInCalendar": true,
    "name": "03",
    "path": "2022/03/03",
    "text": "March 03",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I almost missed that the Jan 6 committee came out with a <a href=\"https://www.cnn.com/2022/03/02/politics/trump-criminal-conspiracy-defraud-january-6-committee/index.html\">big conclusion</a> yesterday. Trump as part of a criminal conspiracy to overthrow the government. I mean, it was kind obvious, but you know, due process and all. No one is above the law, we hope.  ",
            "created": "Thu, 03 Mar 2022 13:27:47 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I gotta say that setting up a sound system <a href=\"http://scripting.com/2022/03/01.html#a221306\">around my Peloton</a> was a really good move. The combination of the Echo-Dot and the Audioengine speakers is sweet. Very little hardware but the sound is incredible. I installed Alexa on my new iPhone, and can now make music play near the Peloton any time, which I do, just for the sheer power of it. I have three Echos in the house. And now thanks to Alexa on the iPhone I can make any of them <a href=\"http://scripting.com/images/2022/03/03/fartsOverEcho.png\">fart</a> at any time, or all of them even. I think back to my primitive networking experiments at UW in the 70s (favorite was Bells-For-All) and realize I've looped all the way back to that, except instead of bells I can now have farts too. And just thinking out loud, I would have thought farts would a prohibited word like fucks. But we're allowed to use it in polite company with kids around. (Of course all kids love farts.) So the world has become more democratic too! And they say the Boomers were the good-for-nothing generation. Keep on truckin.",
            "created": "Thu, 03 Mar 2022 13:22:30 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/05/26/cherries.png",
            "flInCalendar": true
        },
        {
            "text": "I'm going to convert my Mac+Frontier based development system to \"Electric Drummer\" on Linux. I'm at that point where it can be done, so I am doing it. I will like doing all my work on Linux, I predict -- that's where my servers run. I expect some synergy from that, knock wood, Praise Murphy, I am not a lawyer, <a href=\"http://daytona.scripting.com/?q=my%20mother%20loves%20me&collection=scriptingnews\">my mother loves me</a>, etc.",
            "created": "Thu, 03 Mar 2022 13:26:23 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The big question is at what level should the US, NATO or individual countries take part in the war over Ukraine.",
            "created": "Thu, 03 Mar 2022 21:10:47 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}