{
    "created": "2022-03-05T05:00:00.000Z",
    "flInCalendar": true,
    "name": "05",
    "path": "2022/03/05",
    "text": "March 05",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Journalism is self-governing. Responsible to no one but itself. Journalism is its own journalism, and not surprisingly that means no journalism. Imagine any other industry or organization that could make sure it never got bad press. That is the problem with journalism.",
            "created": "Sat, 05 Mar 2022 17:02:42 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I got lucky and a baby deer was running in front of my camera when I was ready to take a <a href=\"https://www.youtube.com/watch?v=QgzEUYikhdE\">video</a> so that’s what I did.",
            "created": "Sat, 05 Mar 2022 16:34:49 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=QgzEUYikhdE",
            "flInCalendar": true
        },
        {
            "text": "Now is a time for news sources that might be cut off to start using \"RSS\" seriously because that would allow others to mirror their content, and make it possible to get it back online with just a <a href=\"https://www.google.com/search?q=DNS+how+to+edit\">DNS</a> change. People thought we were being too idealistic when it was said that a benefit of syndication is that it helps route around censorship. Now in 2022, that's a very real thing. Such an inexpensive insurance policy to help make sure the news gets out.",
            "created": "Sat, 05 Mar 2022 14:55:34 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/08/05/loveRss.png",
            "flInCalendar": true
        },
        {
            "text": "Dave as CEO",
            "created": "Sat, 05 Mar 2022 23:21:13 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Taken in 1992 or so, demoing software on a state of the art Mac. ",
                    "created": "Sat, 05 Mar 2022 23:21:20 GMT",
                    "inlineImage": "http://scripting.com/images/2022/03/05/daveAsCeo.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Reply to Jeff Jarvis",
            "created": "Sat, 05 Mar 2022 14:41:04 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "<i>Jeff Jarvis posted a <a href=\"https://twitter.com/jeffjarvis/status/1500107275872133121\">thread</a> about Ukraine on Twitter. My reply was too long to fit in a tweet, so I'm posting it here. </i>",
                    "created": "Sat, 05 Mar 2022 14:41:10 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I've read your whole thread, and agree -- it's confusing because norms are being busted now, norms of the <a href=\"https://en.wikipedia.org/wiki/Mutual_assured_destruction\">nuclear deterrent</a> that has been present for all our lives. Putin went first. A nuclear superpower, which Russia is (which until now most seem to have overlooked), is not supposed to provoke another nuclear superpower so blatantly. ",
                    "created": "Sat, 05 Mar 2022 14:41:10 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Putin's complaint is he isn't getting the respect a nuclear superpower is entitled to. The expansion of <a href=\"https://en.wikipedia.org/wiki/NATO\">NATO</a> into the former Warsaw Pact was insult #1, but that wasn't enough, NATO then added former states of the USSR. And that wasn't enough, the US promised to add Ukraine to NATO, as I understand it that was one of the final acts of the Bush II presidency, no one noticed here because we were obsessed with the financial collapse of 2008. This happened in a NATO meeting in Bucharest. ",
                    "created": "Sat, 05 Mar 2022 14:53:43 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "But I think the US and NATO sitting out the war in Ukraine is probably the right thing to do, because either way Ukraine is destroyed, and we're giving up a chance for politics in Russia to stop the next more provocative steps, if we were to intercede before Ukraine is settled. The sanctions will hurt, and I bet the Russians who care know what a debacle this has turned to. Why not take the chance that could work? If we go into the war in Ukraine, the war all of a sudden isn't the war with Ukraine, it's a war with the West. ",
                    "created": "Sat, 05 Mar 2022 15:11:00 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Also I have a dream however unrealistic that Ukraine will defeat Russia, and then cross the border into Russia and take a few towns and maybe destroy them just to send a message to the Russian people that Putin is bullshit. ",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}