{
    "created": "2022-03-08T05:00:00.000Z",
    "flInCalendar": true,
    "name": "08",
    "path": "2022/03/08",
    "text": "March 08",
    "type": "calendarDay",
    "subs": [
        {
            "text": "<a href=\"https://twitter.com/ErinInTheMorn/status/1501314842992467975\">We live in Putin's America</a>. People seem to have forgotten. We let them in for four years at the top of our government. You don't just vote them out. They stick around. If you used a Windows machine in the early 00s you <a href=\"https://en.wikipedia.org/wiki/Malware\">learned</a> all about this. ",
            "created": "Tue, 08 Mar 2022 23:56:34 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/ErinInTheMorn/status/1501314842992467975",
            "flInCalendar": true
        },
        {
            "text": "Another thought -- people assume Russia will keep marching after taking Ukraine and presumably assassinating its president, the lovely Volodymyr Zelenskyy. This was discussed at the end of <a href=\"https://www.nytimes.com/2022/03/08/podcasts/the-daily/zelensky-putin-ukraine-war.html\">today's Daily podcast</a>, where the reporter and host agreed that Putin will have a problem if he has Zelenskyy assassinated. I'd like to propose an alternate theory. Once Zelenskyy is gone, Putin will give a speech saying that the Nazis did it. He will have a black ribbon on his lapel, the standard thing people will wear to mourn the death of Zelenskyy. He will say Russia entered Ukraine to <i>protect</i> Zelenskyy, not to kill him. They will round up some Ukrainian \"Nazis\" and kill them. The Russian army, their job done, will return home, leaving Uktraine to be run by a Putin puppet. I think this is much more likely than Putin repeating his mistake of invading Ukraine, or at least wait until a Putinite is in power in the US, and they've had a chance to withdraw from NATO, rendering it powerless,. Then all of Europe will recalculate and accept Russia as Stalin 2.0, and try to coexist, without the protection of the American nuclear shield. Putin can continue looting the United States, and get started on Europe.",
            "created": "Tue, 08 Mar 2022 22:40:46 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/03/26/comradeStalin.png",
            "flInCalendar": true
        },
        {
            "text": "I went to the grocery store today. Gone are the masks and the plastic shields between the clerk and the customer. I was still wearing my mask. I wondered, when exactly did we conquer Covid? How did we do it? Spoiler: We didn't. It's very much still out there. Maybe the infection rates are low but they're not zero. I'm in the habit of wearing a mask, and I was far from the only one at the market today. I think I'm going to keep doing it. I see it as a way of saying to my fellow citizens that I care about your health. ",
            "created": "Tue, 08 Mar 2022 23:30:31 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Don't forget, scattered throughout the governments of the US and Europe are figures who are being blackmailed by Putin. They can make things come out however he wants them to come out. ",
            "created": "Tue, 08 Mar 2022 23:28:34 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Last night, shortly before the net went down here, I saw an interview on <a href=\"https://twitter.com/allinwithchris?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor\">Chris Hayes</a> with a Ukraine legislator in the US lobbying for more assistance. She said something I forgot about, that Hayes didn't respond to, and he should have. We are actually obligated at least morally to defend Ukraine because of the <a href=\"https://en.m.wikipedia.org/wiki/Budapest_Memorandum_on_Security_Assurances\">agreement</a> we entered in with them when they gave up their nuclear weapons after the break-up of the USSR. They were the third largest nuclear power. Had they kept their nukes, Russia attacking them would have been a far riskier move for Putin. It would be the exact thing we're all worried about if the US and Russia engage militarily. The doctrine of <a href=\"https://en.wikipedia.org/wiki/Mutual_assured_destruction#:~:text=Mutual%20assured%20destruction%20(MAD)%20is,nuclear%20strike%20and%20second%20strike).\">Mutual Assured Destruction</a> kicks in. We said we will protect Ukraine because they gave up their nukes. Oddly so did Russia, btw. Why didn't Hayes acknowledge this? Instead he rushed her off. He should've cancelled the rest of his program and asked his experts what they think of that. Doesn't bode well for Latvia, Estonia and Lithuania, or Poland, Moldova, Rumania, Hungary, et al.",
            "created": "Tue, 08 Mar 2022 22:36:31 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Today was a internet outage day. I have a generator but the internet goes down when <a href=\"https://www.cenhud.com/en/outages/\">Central Hudson</a> power goes down, I guess they feel they're entitled to a day off, whatever. I hate it when the internet goes down. And I thought \"Electric Drummer\" would be fine without the net, but I guess not. I had this long excellent post written, but when I tried to move things around well it turns out it wasn't saving it. I wish I hadn't lost it. It was a lovely post. Score one for the <a href=\"https://en.wikipedia.org/wiki/Shit_happens\">Shit Happens</a> crowd. ",
            "created": "Tue, 08 Mar 2022 22:27:33 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I was on my way out to go for a walk, cabin fever hitting me hard -- and all of a sudden the phone in my back pocket starts buzzing as if I had messages. It had been doing that once in a while during the day, Apple TV saying there are new episodes of shows available. Each time that happened I thought well that's it, the power is back, only to find out it's not. Those messages from Apple must be done on a calendar sort of thing. I had written a long post which I lost saying the power never comes back on in a way you imagine, because God is listening and one of Her favorite messages to poor humans is \"YOU HAVE NO CLUE\" and power outages are one of the most moral religious things out there. Anyway I don't have to go out for a walk -- I can just use my <a href=\"http://daytona.scripting.com/?q=peloton&collection=scriptingnews\">Peloton</a> now that the internet is back. ",
            "created": "Tue, 08 Mar 2022 22:27:23 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/07/21/beetlejuice.png",
            "flInCalendar": true
        }
    ]
}