{
    "created": "2022-03-16T04:00:00.000Z",
    "flInCalendar": true,
    "name": "16",
    "path": "2022/03/16",
    "text": "March 16",
    "type": "calendarDay",
    "subs": [
        {
            "text": "<a href=\"http://scripting.com/2022/03/16/whyIWentToHarvard.m4a\">23-minute podcast</a> on the contribution <a href=\"http://scripting.com/2022/03/15.html#a153454\">Chris Lydon</a> and <a href=\"https://www.linkedin.com/in/mary-mcgrath-962765/\">Mary McGrath</a> are making, and why we need a core of capable \"Drummer\" users to test each new feature or we can't move. Also why I wanted to be at Harvard in 2003. And how lucky it was that Chris was there too. I ramble a lot, if you listen to me, you know that. But I do eventually get to the point. :smile:",
            "created": "Wed, 16 Mar 2022 13:28:16 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2022/03/16/whyIWentToHarvard.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "12192270",
            "flInCalendar": true
        },
        {
            "text": "I can’t imagine <a href=\"https://www.silverscreenandroll.com/2022/3/16/22980192/lebron-james-knee-soreness-injury-swelling-video-medical-explainer-lakers-video\">Lebron</a> has any fans left after he’s dumped so many teams. It’s not just that he wins championships, it’s that he leaves behind wrecks. Fans don’t want to win as much as we want to love. I’m glad he never chose the Knicks. I can’t imagine another team accepting LeBron unless he swears he will leave the team in better condition than he found it. That would be something worth giving a try. Go to Orlando, for example, and don’t bring any stars with you, just work. And do it for a dollar a year. Then there will be at least some goodwill for you going forward. ",
            "created": "Wed, 16 Mar 2022 16:54:37 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "BTW the first feed was mine. Here’s the <a href=\"http://scripting.com/davenet/1997/12/15/scriptingNewsInXML.html\">announcement</a>. This is why we needed blogging before anything else. It was the way new tech innovation could be announced when journalism was ignoring it.",
            "created": "Wed, 16 Mar 2022 16:53:03 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The other day, after <a href=\"http://scripting.com/2022/03/12.html#a150018\">writing</a> about a theoretical new RSS reader app, I decided to try an experiment. I took the feed of a well known tech publication and just displayed the <i>description</i> element of an <i>item</i> from its feed in my browser. This is <a href=\"http://scripting.com/images/2022/03/16/unwantedbullshitinyourfeed.png\">what showed up</a> in the JavaScript console. How embarrassing for the publisher. That's what I mean about being picky about which feeds I'm willing to allow into my lovely theoretical RSS garden. If you're going to hack at the browser like that, you're not invited. Please no business models in my app. You want the people who read your feed to pay? Ask them for some money. ",
            "created": "Wed, 16 Mar 2022 14:28:24 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/08/05/loveRss.png",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1504091679242043392\">To Kasparov</a>: I'm sure you understand Russia much better than I do, but still, I think it's worth a chance to see if the situation doesn't get resolved without destroying civilization. Once we're in a shooting war with Russia there will be no more time to think.",
            "created": "Wed, 16 Mar 2022 13:59:58 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1504091679242043392",
            "flInCalendar": true
        },
        {
            "text": "I wrote something the other day that bears repeating. \"When you read something, you're not in touch with the author's emotions, not when they wrote it, and esp not now, long after they wrote it. Emotions are fluid things, and unless you're very careful, it's unlikely that the emotions you are feeling, as you read the piece, are the author's. It would be a remarkable coincidence if they were. They're your feelings.\" It <a href=\"http://scripting.com/2022/03/09/145728.html?title=writingReadingAndProjection\">goes on</a> from there.",
            "created": "Wed, 16 Mar 2022 13:28:29 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<img src=\"http://scripting.com/images/2022/03/16/wordletoday.png\">",
            "created": "Wed, 16 Mar 2022 15:23:43 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}