{
    "created": "2022-03-19T04:00:00.000Z",
    "flInCalendar": true,
    "name": "19",
    "path": "2022/03/19",
    "text": "March 19",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Podcast: <a href=\"http://scripting.com/2022/03/19/whyTheNYTEditorialWasAGoodSign.m4a\">Why the NYT editorial is a good sign</a>. ",
            "created": "Sat, 19 Mar 2022 17:12:45 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2022/03/19/whyTheNYTEditorialWasAGoodSign.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "7070251",
            "flInCalendar": true
        },
        {
            "text": "If you're good at JavaScript and familiar with outliners and are looking for a project to sink your teeth into,  I'm not planning on doing any further development on the <a href=\"https://github.com/scripting/treechart\">Tree Chart</a> project, but it could use more features, and should plug into any outliner. Lots of room for creativity. ",
            "created": "Sat, 19 Mar 2022 15:53:15 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Defending your right to ruin people's lives seems really weird. Why not defend your right to love other people? I don't get people who get pleasure out of hurting others. I certainly don't respect that. ",
            "created": "Sat, 19 Mar 2022 16:10:31 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The NYT editorial is a good sign",
            "created": "Sat, 19 Mar 2022 13:15:55 GMT",
            "type": "outline",
            "description": "The editorial people are deriding is actually a sign of huge progress in the web and journalism working together.",
            "subs": [
                {
                    "text": "I don't have a lot of time to write this morning but I wanted to get this out there.",
                    "created": "Sat, 19 Mar 2022 13:16:03 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "First, my goal for the web has always been that I want the bright minds to be on the web, sharing important stuff that comes from what they do. These people would be considered <a href=\"https://en.wikipedia.org/wiki/Source_(journalism)\">sources</a> in journalism, not reporters. I've been working on this since I first started using the web as a <a href=\"http://scripting.com/davenet/\">writing platform</a> in 1994. ",
                    "created": "Sat, 19 Mar 2022 13:16:14 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "One of the things that keeps bright minds from fully expressing their ideas on the web is the sense that it's a savage place, where people cut you down, make your life miserable, possibly lose you your standing, even your job. So they don't take the step.",
                    "created": "Sat, 19 Mar 2022 13:17:29 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "This idea comes from journalism. From organizations like the NYT.",
                    "created": "Sat, 19 Mar 2022 13:36:30 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "They paint us all with the same brush. They talk about us as monsters. All the same. They don't listen. Only their ideas get out. Reporters are easily fooled, we've learned, with great cost for all of us. Journalism says Facebook sucks, a lot, and that scares some of my neighbors from using Facebook, and keeps us from making connections that would make things work better on a local level. We need more of that. Journalism has stood in the way of good uses of the web. Maybe they don't know they've been doing it, but they have been doing it just the same. ",
                    "created": "Sat, 19 Mar 2022 13:18:13 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "So when a big influential organization like the NYT says, in <a href=\"https://www.nytimes.com/2022/03/18/opinion/cancel-culture-free-speech-poll.html?unlocked_article_code=AAAAAAAAAAAAAAAACEIPuomT1JKd6J17Vw1cRCfTTMQmqxCdw_PIxftm3iWka3DODm8SiOMNAo6B_EGKbqNlbNY3mj-GQMNcKrJqSuZ_w6pEJ0FgQAntupyAnNIFPyAx48qVb18B4qjsD_o-4CO4KS6wMvt-z7my-E_cO2PoXPGPzSErIQ16pZRgIEX52ScI2qzPR7Ny3YR_ia9yBotoBmtVPFn8tPPrDhl7O9mUPFqLukRtBbYvCXyElsWc6rkAbAxTFVrNKXt-6m03499fU8gFaOe9d1VzPZqj3shCTzBgP4yrBJYuRoXLl7QMsbTFqhyEzMLe1Oz9dYCNcFG1TG9VoeW7P86L&smid=url-share\">its official voice</a>, that this is a problem, and presumably we should do something about it, I see that as huge progress. We have an ally in organizing our knowlege and passion, the good stuff of human intelect, with their support, instead with their derision.",
                    "created": "Sat, 19 Mar 2022 13:19:14 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "And I am so sad when I see people who already have mastered the tools predictably try to put the NYT down for noticing this problem which <i>all of them know about, </i>I'm sure of it. So who has the old idea and who has the new one? Who's wired and who's tired?  In my mind, the NYT has made a breakthrough. I love it. Build on it. Bring that philosophy into the NYT itself. Look for the good on the web, not just the mean stuff. Set the example. I think the light will come on for others, not all of them, some are too dug in, but progress can be made here, I feel it. ",
                    "created": "Sat, 19 Mar 2022 13:20:23 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PS: Save me the lecture about the First Amendment. I go way back with the fight against the <a href=\"https://en.wikipedia.org/wiki/Communications_Decency_Act\">CDA</a> in 1996. You use the First Amendment as a hammer, the same way the gun lobby uses the Second Amendment. I see you as exactly like them. ",
                    "created": "Sat, 19 Mar 2022 13:16:14 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PPS: I used one of my montly gifts as a NYT subscriber to provide the <a href=\"https://www.nytimes.com/2022/03/18/opinion/cancel-culture-free-speech-poll.html?unlocked_article_code=AAAAAAAAAAAAAAAACEIPuomT1JKd6J17Vw1cRCfTTMQmqxCdw_PIxftm3iWka3DODm8SiOMNAo6B_EGKbqNlbNY3mj-GQMNcKrJqSuZ_w6pEJ0FgQAntupyAnNIFPyAx48qVb18B4qjsD_o-4CO4KS6wMvt-z7my-E_cO2PoXPGPzSErIQ16pZRgIEX52ScI2qzPR7Ny3YR_ia9yBotoBmtVPFn8tPPrDhl7O9mUPFqLukRtBbYvCXyElsWc6rkAbAxTFVrNKXt-6m03499fU8gFaOe9d1VzPZqj3shCTzBgP4yrBJYuRoXLl7QMsbTFqhyEzMLe1Oz9dYCNcFG1TG9VoeW7P86L&smid=url-share\">link to the editorial</a>. The link should go through the paywall. ",
                    "created": "Sat, 19 Mar 2022 13:24:05 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}