{
    "created": "2022-03-23T04:00:00.000Z",
    "flInCalendar": true,
    "name": "23",
    "path": "2022/03/23",
    "text": "March 23",
    "type": "calendarDay",
    "subs": [
        {
            "text": "What would Ukraine do?",
            "created": "Wed, 23 Mar 2022 15:27:08 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "When I signed on Twitter earlier this evening I was offered a chance to create a community, <a href=\"https://twitter.com/i/communities/1506783411016450048\">so I did</a>. Not sure how to use this. In the meantime if you read my blog, go ahead and sign up.",
            "created": "Thu, 24 Mar 2022 01:59:41 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "How art works. An artist asks a question and the viewer answers it. ",
            "created": "Wed, 23 Mar 2022 13:44:04 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Here's a wild idea. If Ukraine needs money and I bet they do, how about selling honorary Ukraine citizenships. Let us all sign up on their side, not just our political leaders. Maybe there are creative ways millions of people could help save Ukraine.",
            "created": "Wed, 23 Mar 2022 15:29:11 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "All the talk about cord cutting was bullshit, if you like sports, as I do. So if I want to watch the Knicks and the Mets, I also have to pay for Fox News. It took me a long time to figure that out. But in the end that's how it works. ",
            "created": "Wed, 23 Mar 2022 14:12:49 GMT",
            "type": "tweet",
            "tweetId": "1506635397954256902",
            "tweetUserName": "davewiner",
            "flInCalendar": true
        },
        {
            "text": "<img src=\"http://scripting.com/images/2022/03/23/wordleAlLaCarte.png\">",
            "created": "Wed, 23 Mar 2022 18:28:25 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "A philosophical question",
            "created": "Wed, 23 Mar 2022 13:54:14 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "The Constitution says the government can't conduct unreasonable searches, without a warrent or probable cause. ",
                    "created": "Wed, 23 Mar 2022 13:58:03 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Suppose someone you have invited into your house goes through your private stuff. Reads your diary, your financial records, calendar, contacts list. Looks in your medicine cabinet, your collection of drugs, legal and illegal, sex toys. Etc. ",
                    "created": "Wed, 23 Mar 2022 13:58:44 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Should you be prevented from writing a tweet or a blog post about how it felt to be violated that way? Would it be fair to rebut the post by talking about the Constitution? Can you imagine someone actually doing that? (I can't, it would seem pretty cruel.)",
                    "created": "Wed, 23 Mar 2022 13:58:00 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "In this situation, with the question posed this way, it's ridiculous to think someone would be condemned for expressing their thoughts and feelings about being so violated. Note that I didn't say their rights were violated, in any legal sense. But their rights were violated in some sense.",
                    "created": "Wed, 23 Mar 2022 13:59:29 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It might not be illegal for someone you invite into your house to violate your privacy, but legality isn't the only thing we're permitted to write about. ",
                    "created": "Wed, 23 Mar 2022 14:00:31 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}