{
    "created": "2022-03-24T04:00:00.000Z",
    "flInCalendar": true,
    "name": "24",
    "path": "2022/03/24",
    "text": "March 24",
    "type": "calendarDay",
    "subs": [
        {
            "text": "My <a href=\"https://twitter.com/i/communities/1506783411016450048\">first post</a> to the Scripting News \"community\" on Twitter. ",
            "created": "Thu, 24 Mar 2022 15:07:15 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Putin must not have known how much power he had. Ukraine is small potatoes. He was the czar of one half of the political system of the US. It was a real possibility his party would control the whole government again in 2024. A lot of times people don't know how successful they've been.",
            "created": "Thu, 24 Mar 2022 18:27:10 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The point of yesterday's <a href=\"http://scripting.com/2022/03/23/135414.html?title=aPhilosophicalQuestion\">philosophical question</a> was this. The Constitution says the government may not search you unless there's <a href=\"https://en.wikipedia.org/wiki/Fourth_Amendment_to_the_United_States_Constitution#:~:text=The%20government%20has%20probable%20cause,or%20was%20committing%20a%20crime.\">probable cause</a>. That doesn't mean that people you invite to enter your house should be allowed to go through your private stuff. It may not be illegal, but we still recognize it as wrong. In the same way, you have \"free speech\" in America, even when it isn't the government restricting your speech, when it's your employer, school, family or friends. No law prohibits them from doing it, so you don't need to make that much-belabored <a href=\"https://xkcd.com/1357/\">point</a>, but being intolerant of other people's opinions is still, as far as I'm concerned, and many other Americans of all persuasions, wrong, un-American.     ",
            "created": "Thu, 24 Mar 2022 13:47:45 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<img src=\"http://scripting.com/images/2022/03/24/wordleOnAThursday.png\">",
            "created": "Thu, 24 Mar 2022 13:46:28 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Are African-Americans fungible?",
            "created": "Thu, 24 Mar 2022 16:00:06 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "First let me say up front that, of course, African-Americans are <i>not</i> fungible. It's a stupid question, but I didn't raise it -- the Supreme Court process did, over many decades of the comings and goings of black justices and also women.   ",
                    "created": "Thu, 24 Mar 2022 16:07:17 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "So -- are racism and genderism part of the Supreme Court process? Yes they are and I can prove it.",
                    "created": "Thu, 24 Mar 2022 16:00:25 GMT",
                    "flNumberedSubs": "true",
                    "flInCalendar": true
                },
                {
                    "text": "When <a href=\"https://en.wikipedia.org/wiki/Thurgood_Marshall\">Thurgood Marshall</a> retired, the Repubs replaced him with <a href=\"https://www.google.com/search?q=who+replaced+thurgood+marshall\">Clarence Thomas</a>. Thus the \"African-American\" seat's significance was supposedly preserved. Marshall was the Supreme Court's first African-American justice. Thomas is the second.  ",
                    "created": "Thu, 24 Mar 2022 16:00:30 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "African-Americans are fungible, they seemed to say. Of course Marshall and Thomas, even though both were black, were almost exact opposites in philosophy and rage-suppression. The former was very liberal, a highly respected scholar, and the latter is fascist and resentful, and the depths of his depravity are only now <a href=\"https://www.npr.org/2022/03/14/1086535100/wife-of-justice-thomas-rebuts-claims-of-conflict-of-interest\">starting</a> to be explored.",
                    "created": "Thu, 24 Mar 2022 16:01:57 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "And when <a href=\"https://en.wikipedia.org/wiki/Ruth_Bader_Ginsburg\">RBG</a> died, she was replaced with <a href=\"https://en.wikipedia.org/wiki/Amy_Coney_Barrett\">ACB</a>. Yes both are women, and thus women are considered fungible as well, as far as the Supreme Court is concerned, at least by some people, in some sense. Politically, ACB is the opposite of RBG, probably is committed to reversing all of RBG's accomplishments. Yet the number of women on the court remains the same.",
                    "created": "Thu, 24 Mar 2022 16:00:31 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Of course <a href=\"https://en.wikipedia.org/wiki/Clarence_Thomas\">Clarence Thomas</a> is in the hospital while the <a href=\"https://en.wikipedia.org/wiki/Ketanji_Brown_Jackson\">Ketanji Brown Jackson</a> hearings are going on, which gets you to consider that the number of AA's on the court would be preserved if KBJ was ratified and the unspeakable happens to CT.",
                    "created": "Thu, 24 Mar 2022 16:01:02 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PS: I actually love the term <a href=\"http://daytona.scripting.com/?q=fungible&collection=scriptingnews\">fungible</a> for some reason, always have, so I was somewhat delighted that the latest tech scam are NFTs where the F stands for fungible. This means I get to think of this word more often and that generally makes me happy for some odd reason. I hope the scamminess of NFTs doesn't end up spoiling that, or maybe I'm wrong and NFTs are the basis for a new capitalism? I have been wrong before. ",
                    "created": "Thu, 24 Mar 2022 16:08:38 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Vasily Polenov ",
            "created": "Fri, 25 Mar 2022 02:05:21 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "<a href=\"https://www.wikiart.org/en/vasily-polenov/voria-1882\">Voria</a>, 1882.",
                    "created": "Fri, 25 Mar 2022 02:06:32 GMT",
                    "inlineImage": "http://scripting.com/images/2022/03/24/voria.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}