{
    "created": "2022-03-26T04:00:00.000Z",
    "flInCalendar": true,
    "name": "26",
    "path": "2022/03/26",
    "text": "March 26",
    "type": "calendarDay",
    "subs": [
        {
            "text": "It's nice to see two people you know on Facebook are friends only because you know both of them. Like Dan Conover and Steve Goodman. Cori Kesler and NakedJen. I'm sure I'll think of others. A visible legacy. In basketball, an assist. ",
            "created": "Sat, 26 Mar 2022 14:56:58 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<img src=\"http://scripting.com/images/2022/03/26/oyWordle.png\">",
            "created": "Sat, 26 Mar 2022 21:03:46 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I remember Watergate",
            "created": "Sat, 26 Mar 2022 13:57:58 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2022/03/26/nixonFarewell.png",
            "description": "The main product the US sells is safety.",
            "subs": [
                {
                    "text": "I remember Watergate and the Gerald Ford pardon of Richard Nixon. Because right now that's the prior art. That's the event we're paying for now, and it seems as if we're about to repeat the mistake Ford made. While all the attention is focused on Putin and Ukraine. ",
                    "created": "Sat, 26 Mar 2022 13:58:04 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I remember Watergate. And I remember the <a href=\"https://en.wikipedia.org/wiki/Pardon_of_Richard_Nixon\">pardon</a>, and remember that some people were very angry about it but I wasn't -- I was relieved. Finally we could stop obsessing over Nixon. He was obviously guilty right from the outset. Yet it took what seemed an incredibly long time to get from the initial reports of the break-in to his waving goodbye from the White House lawn as he left for the last time. That was the way I wanted to remember Nixon. Humiliated, brought down, going <a href=\"https://www.youtube.com/watch?v=XTFsoElX-a0\">off to exile</a> to spend the rest of his days wondering what if he hadn't cheated. Because the <a href=\"https://wapo.st/3iF4Rpe\">heart</a> of Watergate is the same issue as the heart of Trump, only what Trump did was a million times worse. We excused Nixon. I guess Trump, who is also old enough to remember it (he's ten years older than me) wasn't too concerned about paying a price if his attempted coup didn't work. Now they're getting ready to do it again, they're doing it in the open, and it looks like a perfect plan. If it works, we've already had the last real national election in the US. From now-on they will all be Putinesqe parodies of fair elections. ",
                    "created": "Sat, 26 Mar 2022 14:00:08 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "<a href=\"https://www.youtube.com/watch?v=XTFsoElX-a0\">Nixon's farewell</a>, 1974.",
                    "created": "Sat, 26 Mar 2022 14:11:26 GMT",
                    "inlineImage": "http://scripting.com/images/2022/03/26/nixonFarewell.png",
                    "flInCalendar": true
                },
                {
                    "text": "So here we are.",
                    "created": "Sat, 26 Mar 2022 14:10:41 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Can you imagine how the rest of the world sees the January 6 attack on the US Capitol?",
                    "created": "Sat, 26 Mar 2022 14:05:19 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Spoiler: It scares the shit out of them. Because the main product the US sells is safety. Our financial system is where the world stores their money for safe keeping.",
                    "created": "Sat, 26 Mar 2022 14:05:30 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "What scares them even more? We haven't done anything about it. Trump and all the people who organized the coup are free. No prospect of any punishment. The can do it again and again.",
                    "created": "Sat, 26 Mar 2022 14:05:40 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "If you're smart you're looking for the next safe place to put your savings.",
                    "created": "Sat, 26 Mar 2022 14:05:59 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I want to know this -- why isn't journalism running constant articles, reports and panels on this topic:",
                    "created": "Sat, 26 Mar 2022 14:06:08 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "When will Trump be charged?",
                    "created": "Sat, 26 Mar 2022 14:06:13 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "We failed to learn the lesson from Nixon it seems. ",
                    "created": "Sat, 26 Mar 2022 14:06:18 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Maybe one of the networks should give time to Dan Rather to look at the story from that angle. Every night at an assigned time. Rather reported Watergate. No doubt he remember.",
                    "created": "Sat, 26 Mar 2022 14:06:49 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PS: One thing that seems evident after the Putin attack on Ukraine. The only people outside the US who want the Repubs to win are other despots whose people would <a href=\"https://en.wikipedia.org/wiki/Nicolae_Ceau%C8%99escu#Death\">kill</a> them if they could. ",
                    "created": "Sat, 26 Mar 2022 14:23:27 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}