{
    "created": "2022-03-29T04:00:00.000Z",
    "flInCalendar": true,
    "name": "29",
    "path": "2022/03/29",
    "text": "March 29",
    "type": "calendarDay",
    "subs": [
        {
            "text": "The Scripting News <a href=\"https://twitter.com/i/communities/1506783411016450048\">community</a> on Twitter is off to a friendly start. We're here to help and learn. ",
            "created": "Tue, 29 Mar 2022 12:07:04 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "A question for devs. When connecting a web client to a server, do you do polling, long polling or websockets for real time updates? Do you know what Twitter does? Facebook? Any other popular \"live\" web app. ",
            "created": "Tue, 29 Mar 2022 18:05:18 GMT",
            "type": "tweet",
            "tweetId": "1508868233100767236",
            "tweetUserName": "davewiner",
            "flInCalendar": true
        },
        {
            "text": "I did a bunch of driving today and thought of a couple of <a href=\"https://help.twitter.com/en/using-twitter/communities#create-admin\">Twitter communities</a> I should make. Unfortunately at this point you have to apply to do it. I guess I must've applied at one point. I'd like to start a community to <a href=\"https://www.google.com/search?q=%22Defund+Fox+News%22\">Defund Fox News</a>. Basically it'll be a mail list. I'd only mail to it when there's an action you can participate in to help unbundle cable systems so you and I don't have to give money to Fox News which is now hosting an openly <a href=\"https://www.rollingstone.com/politics/politics-news/lara-logan-theory-of-evolution-anti-semitism-1328721/\">anti-semitic news star</a>. ",
            "created": "Tue, 29 Mar 2022 18:09:34 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "A Google <a href=\"https://www.google.com/search?q=%22Defund+Fox+News%22\">search</a> for \"Defund Fox News.\" Lots of hits. This is already a popular idea. Now all we have to do is get Congress to force cable companies to give us choice. No one should be forced to fund Putin's propaganda arm in the US.",
            "created": "Tue, 29 Mar 2022 18:14:52 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<img src=\"http://scripting.com/images/2022/03/29/wordle.png\">",
            "created": "Tue, 29 Mar 2022 21:22:55 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Today's Tesla drive",
            "created": "Tue, 29 Mar 2022 18:25:54 GMT",
            "type": "outline",
            "description": "I took a drive upstate this morning, on the NYS Thruway and on country roads.  ",
            "subs": [
                {
                    "text": "I took a drive upstate this morning, on the <a href=\"https://en.wikipedia.org/wiki/New_York_State_Thruway\">NYS Thruway</a> and on country roads.  ",
                    "created": "Tue, 29 Mar 2022 18:26:00 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I drove as much as possible with the car self-driving such as it is. It's a lot of fun to see what it can and can't handle. There was one place where the Thruway narrowed to one lane, and it freaked out because it couldn't tell if it was driving off the road or what. So I took over. It's like having a teenage driver helping out, and you just have to be ready to take the wheel to get it through difficult situations. ",
                    "created": "Tue, 29 Mar 2022 18:26:27 GMT",
                    "image": "http://scripting.com/images/2021/11/21/tesla.png",
                    "flInCalendar": true
                },
                {
                    "text": "Once when a truck was exiting the highway in the same lane I was in, as it switched to the lane to the right, the <a href=\"http://daytona.scripting.com/?q=tesla&collection=scriptingnews\">Tesla</a> slowed from about 50 or so to 25, very quickly. I couldn't figure out what it thought it saw. Just guessing that the software, confused, decided better to be safe. I love it for trying to #savemylife, but it really wasn't necessary. ;-)",
                    "created": "Tue, 29 Mar 2022 18:29:22 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "On the way back, after I told it where I was going, it first looked for charging stations, apparently found none that were on the way. Then after a pause of a second or two, <a href=\"http://scripting.com/images/2022/03/29/stayUnder75.png\">this message</a> appeared. Basically if you stay under 75 you have enough battery to get home without detouring to get a charge. ",
                    "created": "Tue, 29 Mar 2022 18:35:48 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It correctly merged onto the Thruway all on its own. A long curved on-ramp, its max MPH as I instructed it was 70, but it slowed to 30 to handle the curve on the ramp. The speed limit was 25 btw. As as passenger, basically, I was glad it slowed down a little. More time to appreciate how well it was doing. I tend to be a nervous passenger, much prefer to be the driver. That's changing now. ",
                    "created": "Tue, 29 Mar 2022 18:26:36 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Also at one point I was being followed by another Tesla. I imagined they were doing the same thing I was doing. Appreciating the teenage intelligence of the machine. Eventually they passed me. I wondered why.  ",
                    "created": "Tue, 29 Mar 2022 18:26:46 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "One other thing -- instead of listening to my own music I let Amazon Music choose it for me. Very nice. I don't know how they know I like the bands they gave me to listen to. But they guessed very well.  Their best choice was a <a href=\"https://www.youtube.com/watch?v=QTPndsG_KA4\">Dead song</a> I hadn't heard in a long time but had special meaning to me. ",
                    "created": "Tue, 29 Mar 2022 18:26:56 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I got the car in November, it's almost April now, and I'm actually starting to use the car as more than a thrilling ride, beginning to appreciate its finer points. It does take that long to get the feel, and yet it seems I've only begun. This is fundamentally different driving than what I learned when I was 17.  Of course my 2020 Subaru <a href=\"https://en.wikipedia.org/wiki/Internal_combustion_engine\">ICE</a> is too, but this is another level beyond that. ",
                    "created": "Tue, 29 Mar 2022 18:33:26 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}