{
    "created": "2022-03-30T04:00:00.000Z",
    "flInCalendar": true,
    "name": "30",
    "path": "2022/03/30",
    "text": "March 30",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Is there a browser-based workbench app for MySQL databases?",
            "created": "Wed, 30 Mar 2022 15:21:12 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1509188963755606023",
            "flInCalendar": true
        },
        {
            "text": "A kind of obvious question. Why isn't there a realtime connection between Facebook and Netflix or HBO or Apple TV or whatever. So that when I'm browsing movies I can see which of my friends loved it. I'm sure they must've had talks about this. it's so obvious. Or why didn't Facebook buy one of them? Wouldn't it be more of a sure thing than (drumroll please) The Metaverse. For that matter why isn't there a similar connection between Amazon and Facebook?",
            "created": "Wed, 30 Mar 2022 16:40:49 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<img src=\"http://scripting.com/images/2022/03/30/wordledujour.png\">",
            "created": "Wed, 30 Mar 2022 13:14:23 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Defund Fox News",
            "created": "Wed, 30 Mar 2022 13:28:06 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2022/03/30/tuckerPutin.png",
            "description": "We're all paying for Fox News, we must have a choice not to.",
            "subs": [
                {
                    "text": "Cutting off the public funding of Fox News is as important to the security of the United States as providing arms to Ukraine in its fight to survive the Russian attack, or sanctioning Russia to cut off the money they need to continue the war. ",
                    "created": "Wed, 30 Mar 2022 13:28:11 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "People seem to forget or overlook that the United States is very much under attack by Russia, since they dominate one of our two political parties. The source of that dominance is Fox News. If there is a World War III, Fox will have played a major role in making it happen. ",
                    "created": "Wed, 30 Mar 2022 14:56:54 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "In the US, many of the cable systems were given monopolies by local government. For example if you live in Berkeley, CA, your only choice is Comcast. In NYC, it's Spectrum (formerly Time-Warner Cable). ",
                    "created": "Wed, 30 Mar 2022 13:31:52 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Fox News is always included in the basic minimal package. That means we're all paying for it, even if you believe as I do that they are deliberately trying to overthrow our government and turn it over to Putin, for some reason I seriously do not understand. ",
                    "created": "Wed, 30 Mar 2022 13:37:53 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "<b>I don't want to pay for Fox News</b>, yet I'm paying just the same. Some portion of my monthly bill is paid to them, even though I think they are the enemy of the United States, and funding them I am undermining the future of my country. ",
                    "created": "Wed, 30 Mar 2022 14:58:17 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The system must change. We must be given a choice of stations that are included in our package. I would probably choose to subscribe to MSNBC and CNN, though there are times when I think I would unsub them too. ",
                    "created": "Wed, 30 Mar 2022 13:34:22 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I think we can afford more competition in this area. But I am sure we can't afford to keep subsidizing Fox News. ",
                    "created": "Wed, 30 Mar 2022 13:38:41 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}