{
    "text": "March 2",
    "created": "Fri, 02 Mar 2018 17:46:37 GMT",
    "name": "02",
    "subs": [
        {
            "text": "Found this old <a href=\"http://scripting.com/images/2018/03/02/thinkTankButton.png\">ThinkTank <i>fanatic</i> button</a> in the back of a drawer. ",
            "created": "Fri, 02 Mar 2018 22:22:02 GMT",
            "type": "outline"
        },
        {
            "text": "I started a page with my <a href=\"http://this.how/davewiner/politics.opml\">political views</a>. As they change, if I stick to it, the page will change as well. Note when I edit the changes automatically post. Reload the page to be sure you're looking at the latest. ",
            "created": "Fri, 02 Mar 2018 17:46:38 GMT",
            "type": "outline"
        },
        {
            "text": "Tech companies aren't half the story",
            "created": "Fri, 02 Mar 2018 18:16:20 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "<i>Note: This was a Twitter <a href=\"https://twitter.com/davewiner/status/969331186446237696\">thread</a>, turned into a blog post. </i>",
                    "created": "Fri, 02 Mar 2018 18:17:03 GMT"
                },
                {
                    "text": "The press sees only one thing when they look at tech -- companies. The biggest ones. They are not the exclusive driving force of technology. Open systems, that they always oppose, keep undermining them. You're not even getting 1/2 the story.",
                    "created": "Fri, 02 Mar 2018 18:16:35 GMT"
                },
                {
                    "text": "It's important because there's a lot of political movement when tech's grip on tech is gone, when there's a generational shift in platforms. I've seen at least four of these in my life: Unix, PCs, GUI (Mac/Windows), Web. The powerful companies were always caught flat-footed.",
                    "created": "Fri, 02 Mar 2018 18:16:48 GMT"
                },
                {
                    "text": "The blindness of the press re tech evolution always amazes me. At first I thought they all must see it. A few did, in the early days, but now -- that knowledge appears lost.",
                    "created": "Fri, 02 Mar 2018 18:16:57 GMT"
                },
                {
                    "text": "It's important that they see it because the press has been an important part of the transition at least in the turn to GUIs and the web. I have a feeling the next platform will rise out of journalism getting tired of waiting for tech, believe it or not.",
                    "created": "Fri, 02 Mar 2018 18:17:02 GMT"
                },
                {
                    "text": "Also when the press looks for transformational change, they tend to see ones that require massive capital investment, and miss the ones that break the rules of the incumbent platform. The PC let people have their own computer without interference from corporate managers.",
                    "created": "Fri, 02 Mar 2018 18:25:40 GMT"
                },
                {
                    "text": "The Mac let people publish their own documents, newsletters, and evolved into a platform that could publish newspapers and magazines, far less expensively and much more easily that typographic systems they replaced.",
                    "created": "Fri, 02 Mar 2018 18:25:46 GMT"
                },
                {
                    "text": "And the web upended the GUI's dominance, by making networking so simple anyone could do it. And making the niceties of print unnecessary. It was really something watching the WYSIWYG crowd (of which I was one) struggle with the inability of the web to be wizzy.",
                    "created": "Fri, 02 Mar 2018 18:25:53 GMT"
                },
                {
                    "text": "Yet the web rose to dominance because the power of networking (Amazon, FB, Twitter, email, banking, Yelp, Craigslist, podcasting, etc etc) was so huge. Okay it didn't look as pretty but look at what it DOES.",
                    "created": "Fri, 02 Mar 2018 18:26:00 GMT"
                }
            ]
        },
        {
            "text": "Buttons from my bedroom",
            "created": "Fri, 02 Mar 2018 22:24:29 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "These buttons were on the wall of my teenage bedroom. ",
                    "created": "Fri, 02 Mar 2018 22:25:38 GMT"
                },
                {
                    "text": "",
                    "created": "Fri, 02 Mar 2018 22:24:42 GMT",
                    "image": "http://scripting.com/images/2018/03/02/buttonsFromDavesRoom.png"
                }
            ]
        }
    ]
}