{
    "text": "March 5",
    "created": "Mon, 05 Mar 2018 13:29:35 GMT",
    "name": "05",
    "subs": [
        {
            "text": "Good morning sports fans!",
            "created": "Mon, 05 Mar 2018 13:29:36 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/03/05/mrWhite.png"
        },
        {
            "text": "<a href=\"https://github.com/scripting/Scripting-News/issues/65\">Braintrust query</a>: Face recognition as a service.",
            "created": "Mon, 05 Mar 2018 14:33:00 GMT",
            "type": "outline"
        },
        {
            "text": "For a troll, normalization is the worst thing possible. Like pouring water on the wicked witch in Oz.",
            "created": "Mon, 05 Mar 2018 17:48:42 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/embed/aopdD9Cu-So"
        },
        {
            "text": "Little-known fact. The initials for Tim Berners-Lee, the inventor of the web, are the same as the initials for The Big Lebowski, a classic Coen Bros movie. Can't say you never learned anything on Scripting News. ",
            "created": "Mon, 05 Mar 2018 14:39:37 GMT",
            "type": "outline"
        },
        {
            "text": "Plot for a fantasy movie",
            "created": "Mon, 05 Mar 2018 16:50:07 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Here's a plot for a fantasy movie.",
                    "created": "Mon, 05 Mar 2018 16:50:14 GMT",
                    "flNumberedSubs": "true",
                    "subs": [
                        {
                            "text": "The fictitious Patriot Party surprisingly wins control of Congress and the White House. ",
                            "created": "Mon, 05 Mar 2018 16:50:18 GMT"
                        },
                        {
                            "text": "They want to control the government forever.",
                            "created": "Mon, 05 Mar 2018 16:50:33 GMT"
                        },
                        {
                            "text": "Instead of raping the country they pass laws that voters love that make them happier, healthier.",
                            "created": "Mon, 05 Mar 2018 16:50:19 GMT"
                        },
                        {
                            "text": "Everyone lives happily ever after.",
                            "created": "Mon, 05 Mar 2018 16:50:39 GMT"
                        }
                    ]
                }
            ]
        },
        {
            "text": "Do you care about the Knicks??",
            "created": "Mon, 05 Mar 2018 14:51:14 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "It's not necessary to actually watch Knicks games because they all seem to end the same. Last night they played the Sacramento Kings, another lottery team, and you might think here's a game the Knicks might actually be able to win. <a href=\"http://www.nydailynews.com/sports/basketball/knicks/knicks-fall-kings-skai-labissiere-game-winner-article-1.3855565\">Nahh</a>. At least they're consistent!  ",
                    "created": "Mon, 05 Mar 2018 13:29:51 GMT",
                    "type": "outline"
                },
                {
                    "text": "A friend who happens to be a Yankees fan is also a Knicks fan, and we talk about the team regularly. He wonders why he's a Knicks fan if they always lose. I said I know the answer. The Knicks are his <a href=\"http://thesaurus.land/?word=atonement\">atonement</a> for being a Yankees fan. Now what does this say about me, a lifetime Mets fan? Well, one thing -- winning isn't the most important thing. And that said, unlike the Knicks, the Mets do win once in long while. Even that amount of winning requires <a href=\"https://duckduckgo.com/?q=define+atonement&t=hf&ia=definition\">atonement</a>, I guess. ",
                    "created": "Mon, 05 Mar 2018 13:30:51 GMT",
                    "type": "outline"
                }
            ]
        },
        {
            "text": "Morning movie notes",
            "created": "Mon, 05 Mar 2018 14:50:47 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Speaking of winners, by the middle of the <a href=\"https://en.wikipedia.org/wiki/90th_Academy_Awards\">Oscars show</a> last night I concluded that <a href=\"https://en.wikipedia.org/wiki/Get_Out\">Get Out</a> would win everything. Unfortunately not so. I think in a few years we will have forgotten <a href=\"https://en.wikipedia.org/wiki/The_Shape_of_Water_(film)\">The Shape of Water</a>, and Get Out will have been the beginning of something new. The combination of politics, comedy, romance, tragedy and horror is hard to beat. ",
                    "created": "Mon, 05 Mar 2018 13:35:20 GMT",
                    "type": "outline"
                },
                {
                    "text": "I was delighted that <a href=\"https://en.wikipedia.org/wiki/Allison_Janney\">Allison Janney</a> won best supporting actress. I, Tonya was a wonderful movie. It could have gotten a Best Picture nomination. And Janney was brilliant as Harding's bitter, cigarette-smoking hardass waitress mother. ",
                    "created": "Mon, 05 Mar 2018 13:37:45 GMT",
                    "type": "outline"
                },
                {
                    "text": "<a href=\"https://twitter.com/RyanJL/status/970518467228119041?ref_src=twsrc%5Etfw&ref_url=http%3A%2F%2Ftime.com%2F5185334%2Fjennifer-lawrence-jodie-foster-oscars%2F\">Jennifer Lawrence and Jody Foster</a> made the best on-stage couple comedy act. I was staring at Foster on her crutches before my attention turned to Lawrence, who is by far my favorite actress of her generation, for her irreverence, intelligence, and last night sheer <a href=\"https://en.wiktionary.org/wiki/gobsmacked\">gobsmacking</a> beauty. She's beautiful the way Hedy Lamarr was. And what an actress. She's still only 26 and one can only imagine what delights await us. I'm more than a fan, I am in awe. ",
                    "created": "Mon, 05 Mar 2018 13:39:29 GMT",
                    "type": "outline"
                },
                {
                    "text": "Sometimes the Academy passes on a movie that goes on to have great significance. For me, the most interesting example is <a href=\"http://www.imdb.com/title/tt0118715/awards\">The Big Lebowski</a>. It didn't win a single <a href=\"https://en.wikipedia.org/wiki/71st_Academy_Awards#Awards\">Oscar</a>. I wonder what the judges must have thought of it. A silly insignificant comedy? It's weird because TBL came after <a href=\"https://en.wikipedia.org/wiki/69th_Academy_Awards#Awards\">Fargo</a>, which was much-celebrated by the Oscars. The year Lebowski would have been up for an award, <a href=\"https://en.wikipedia.org/wiki/Shakespeare_in_Love\">Shakespeare in Love</a> won best picture, and imho the other winners were also Big Mehs. Imho there's no doubt The Big Lebowski was the Best Picture in 1999. But you don't necessarily know it in the moment. History has a role to play too. ",
                    "created": "Mon, 05 Mar 2018 14:17:34 GMT",
                    "type": "outline"
                }
            ]
        },
        {
            "text": "Phantom Thread review",
            "created": "Mon, 05 Mar 2018 14:06:48 GMT",
            "type": "outline",
            "description": "I wouldn't have given it Best Picture, not in the same year as Get Out, but Phantom Thread, like There Will Be Blood, will age well. ",
            "subs": [
                {
                    "text": "I finally saw <a href=\"https://en.wikipedia.org/wiki/Phantom_Thread\">Phantom Thread</a> over the weekend. ",
                    "created": "Mon, 05 Mar 2018 14:01:50 GMT"
                },
                {
                    "text": "I really liked it. But I was pretty sure I would. I'll tell you why. ",
                    "created": "Mon, 05 Mar 2018 14:07:07 GMT"
                },
                {
                    "text": "When I first saw <a href=\"https://en.wikipedia.org/wiki/There_Will_Be_Blood\">There Will Be Blood</a>, the previous collaboration between <a href=\"https://en.wikipedia.org/wiki/Paul_Thomas_Anderson\">Paul Thomas Anderson</a> and <a href=\"https://en.wikipedia.org/wiki/Daniel_Day-Lewis\">Daniel Day-Lewis</a>, the first time I watched it, I didn't like it. Too dark, too slow, not enough story, odd sad ending. Meh. But then for some reason I watched it again, and had the opposite reaction. A masterpiece. The pace was just right, and there totally was a story. It was just so slow, your mind has to get in the right gear to appreciate it. It's not an easy movie to like. But who said movies have to be easy?",
                    "created": "Mon, 05 Mar 2018 14:07:14 GMT"
                },
                {
                    "text": "Same with Phantom Thread. The. Pace. Is. So. Deliberate. The characters say so little. We're watching the most mundane acts. But it builds and a story emerges, and the music and the acting are superb, the story is fascinating. It's the kind of movie to watch again, alone, like you read a book, to savor every moment. ",
                    "created": "Mon, 05 Mar 2018 14:08:09 GMT"
                },
                {
                    "text": "I wouldn't have given it Best Picture, not in the same year as Get Out, but Phantom Thread, like There Will Be Blood, will age well. ",
                    "created": "Mon, 05 Mar 2018 14:09:01 GMT"
                }
            ]
        }
    ]
}