{
    "text": "March 17",
    "created": "Sat, 17 Mar 2018 14:40:46 GMT",
    "name": "17",
    "subs": [
        {
            "text": "Trump is <a href=\"https://www.youtube.com/watch?v=JKDgjLf_rk4\">Morrie</a> in <a href=\"https://en.wikipedia.org/wiki/Goodfellas\">Goodfellas</a>. Putin is the <a href=\"https://www.youtube.com/watch?v=JG3mhtojm8Y\">character</a> De Niro plays.",
            "created": "Sat, 17 Mar 2018 14:40:47 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/embed/JKDgjLf_rk4"
        },
        {
            "text": "I did some work on the <a href=\"http://xmlviewer.scripting.com/?url=http%3A%2F%2Fscripting.com%2Frss.xml\">xmlviewer</a> app. I have some ideas on how to improve it, which I explain in this <a href=\"https://github.com/scripting/Scripting-News/issues/69\">braintrust query</a>. ",
            "created": "Sat, 17 Mar 2018 15:15:14 GMT",
            "type": "outline"
        },
        {
            "text": "We're in an asymmetric war, not Watergate",
            "created": "Sat, 17 Mar 2018 19:42:11 GMT",
            "type": "outline",
            "description": "We've been at war, while the press has been indulging in wishful thinking. This is not Watergate. Our network is compromised. It's more like BattleStar Galactica.",
            "subs": [
                {
                    "text": "I guess the <a href=\"https://www.thedailybeast.com/trumps-lawyer-its-time-to-fire-robert-mueller\">Trump people</a> feel they have to <a href=\"http://www.memeorandum.com/180317/p22#a180317p22\">move</a> now. I don't think they'll have much support. Even his base will be split. Obviously there's something explosive about to come out. But this isn't Watergate. It's more like <a href=\"https://en.wikipedia.org/wiki/Battlestar_Galactica\">BattleStar Galactica</a>. It's a war and we're fighting an inhuman enemy, one that doesn't behave like a human. It's an amalgam of all of humanity.",
                    "created": "Sat, 17 Mar 2018 19:35:17 GMT",
                    "image": "http://scripting.com/images/2018/03/17/trashcan.png"
                },
                {
                    "text": "Trump being gone won't help us very much because so much has changed. A silent war has been going on. We have not had any defenses. It's an <a href=\"https://www.wired.com/story/russian-hackers-attack-ukraine/?mbid=social_fb\">asymmetric war</a>, unlike any we've ever (not) fought. The press is oblivious, still, focused on the Watergate-ness of the situation and missing that now our society and economy are fully wired, to an extent not even foreshadowed in the <a href=\"https://blogs.weta.org/boundarystones/2013/05/17/40-years-ago-tvs-tuned-watergate-hearings\">time</a> of Watergate. ",
                    "created": "Sat, 17 Mar 2018 19:48:42 GMT"
                },
                {
                    "text": "The press ought to listen to techies. We're still seen as low-level workers. But our counterparts in Russia and elsewhere are undermining everything. Here too probably. ",
                    "created": "Sat, 17 Mar 2018 20:01:00 GMT"
                },
                {
                    "text": "Nailing Trump won't fix it. It would be like killing a comedian, a distraction. The real action has been on our networks. ",
                    "created": "Sat, 17 Mar 2018 19:44:44 GMT"
                },
                {
                    "text": "Remember what <a href=\"https://en.wikipedia.org/wiki/The_medium_is_the_message\">McLuhan</a> said. It's not about armies anymore, it's about media. And <i>we,</i> all of us, are media now. ",
                    "created": "Sat, 17 Mar 2018 19:45:12 GMT"
                },
                {
                    "text": "Imagine journalism as a rectangular box. They've tried to move what they do from print to the net without changing the shape of the box. In their world this all as a replay of Watergate. It's familiar, they know what to do, and btw it had a <a href=\"http://www.washingtonpost.com/wp-srv/national/longterm/watergate/articles/080974-3.htm\">happy ending</a>. That's what we call wishful thinking. A bit of a bedtime story.",
                    "created": "Sat, 17 Mar 2018 19:45:56 GMT"
                },
                {
                    "text": "We always prepare to fight the last war. We're doing it again. ",
                    "created": "Sat, 17 Mar 2018 19:50:35 GMT"
                }
            ]
        }
    ]
}