{
    "text": "March 22",
    "created": "Thu, 22 Mar 2018 14:07:37 GMT",
    "name": "22",
    "subs": [
        {
            "text": "Observed: People don't know what they don't know.",
            "created": "Thu, 22 Mar 2018 16:54:09 GMT",
            "type": "outline"
        },
        {
            "text": "Lincoln had a <a href=\"https://en.wikipedia.org/wiki/Team_of_Rivals\">team of rivals</a>. Trump is assembling a <a href=\"https://www.npr.org/2018/03/22/594363877/trump-names-john-bolton-as-national-security-adviser\">team</a> of <a href=\"https://en.wikipedia.org/wiki/Peter_Navarro\">nutjobs</a>.",
            "created": "Thu, 22 Mar 2018 23:44:31 GMT",
            "type": "outline"
        },
        {
            "text": "Today's <a href=\"http://podcatch.com/archive/2018/03/22/505335.html\">Daily podcast</a> was a disaster. They interviewed <a href=\"https://en.wikipedia.org/wiki/Mark_Zuckerberg\">Zuck</a>. And they have no idea of the context that Facebook exists in, as far as they knew they FB has no competition (there is Google of course), there is no open web, and it probably never crossed their mind that <a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+%22lock-in%22&t=hy&ia=web\">lock-in</a> might be a problem. It's <i>always</i> the problem in tech. Poor Zuck, never thought he would have to deal with these problems. They actually have sympathy for him! It's still the <a href=\"https://www.google.com/search?safe=off&source=hp&ei=zhy0WrqnJama_Qbr8oTwCg&q=baby+squirrels&oq=baby+squirrels&gs_l=psy-ab.3..0i67k1j0l9.1639.4841.0.5001.16.12.0.3.3.0.97.848.11.12.0....0...1c.1.64.psy-ab..1.15.944.6..46j35i39k1j0i131k1j0i46k1j0i20i263k1.86.NS3xzrSRuCk\">baby squirrels</a> thing. There's an easy way out Mark. Set everyone free. Let people use Facebook not because it's the only choice, but rather because it's the best. Eventually his monopoly will break, and it will be a shock to him and the economy. We might come to think of Facebook as <a href=\"https://en.wikipedia.org/wiki/Too_big_to_fail\">too big to fail</a>. Which btw, might have been a fair question to ask him too. I love the Daily, but this is the problem, when they finally get to a subject you know well, we find out what we always find out. They aren't doing a good job of representing the rest of us. ",
            "created": "Thu, 22 Mar 2018 21:04:15 GMT",
            "type": "outline",
            "image": "http://scripting.com/2016/01/10/alice.png"
        },
        {
            "text": "Tonight's Facebook <a href=\"https://twitter.com/papascott/status/976933478980874242\">gem</a>.",
            "created": "Thu, 22 Mar 2018 23:47:40 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/papascott/status/976933478980874242"
        },
        {
            "text": "A note for the Programmer's Ethos. All users shall be treated with respect. They will be listened to and assumed by default to know what they're talking about. On the other hand, users must take responsibility for their presence on the net, and beware of the costs and tradeoffs of using different services. All we have to do is clearly offer the information they need. If they don't listen, that's on them.",
            "created": "Thu, 22 Mar 2018 16:50:46 GMT",
            "type": "outline"
        },
        {
            "text": "Facebook is what the web has become. Its closed nature (no linking) is forcing Google to try to hijack what remains of the web to try to compete, to co-exist. They should both disarm, and stop fighting for control and just provide compatible services and let the open web be.",
            "created": "Thu, 22 Mar 2018 14:07:38 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/976725186010632193"
        },
        {
            "text": "If I were dictator",
            "created": "Thu, 22 Mar 2018 16:22:11 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "If I were benevolent dictator of the net in 2018, here would be my first decree.",
                    "created": "Thu, 22 Mar 2018 16:22:22 GMT",
                    "subs": [
                        {
                            "text": "Make it so that leaving Facebook is just a matter of signing out. And that does not mean leaving your friends behind.",
                            "created": "Thu, 22 Mar 2018 16:23:55 GMT"
                        }
                    ]
                },
                {
                    "text": "This would would make it possible for anyone to compete with Facebook, which would keep Facebook (and their competitors) from grabbing too much power. It's Facebook's lock-in that makes the problems inexorable.",
                    "created": "Thu, 22 Mar 2018 16:22:53 GMT"
                },
                {
                    "text": "And Facebook would have to support all the protocols they currently don't support. Most important -- linking. That's how their walls are implemented. It's probably a fix they could implement in 24 hours. And would work wonders at turning the lights back on outside Facebook.",
                    "created": "Thu, 22 Mar 2018 16:23:01 GMT"
                }
            ]
        }
    ]
}