{
    "text": "March 24",
    "created": "Sat, 24 Mar 2018 13:19:36 GMT",
    "name": "24",
    "subs": [
        {
            "text": "Don't you ever <a href=\"https://www.youtube.com/watch?v=BkAlr90k23Y\">ask them why</a> if they told you you would cry. ",
            "created": "Sat, 24 Mar 2018 17:16:28 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=BkAlr90k23Y"
        },
        {
            "text": "Is it possible to let the users tell you what kind of marketing they want, instead of spying on them, and gathering all kinds of potentially damaging information, in an effort to <i>guess</i> what they want? Yes, it is. I know it is because Zillow does it. I have a bunch of queries about real estate in various markets I'm interested in. They send a bulletin every morning of property for sale in each market. The same idea could apply to almost everything I shop for. <i>Instead of guessing, let me tell you what I want. In return you don't spy on me. </i>",
            "created": "Sat, 24 Mar 2018 14:32:34 GMT",
            "type": "outline",
            "image": "http://scripting.com/2016/01/30/strongman.png"
        },
        {
            "text": "The kids are right!",
            "created": "Sat, 24 Mar 2018 13:19:37 GMT",
            "type": "outline",
            "description": "All the voter suppression that the Repubs can muster can't snuff out a movement of this magnitude. We will win. And we will also have a template for winning that can apply to other acts of government.",
            "subs": [
                {
                    "text": "Today is March 24, the day we march.",
                    "created": "Sat, 24 Mar 2018 13:19:45 GMT",
                    "image": "http://static.scripting.com/larryKing/images/2013/08/28/guns.gif"
                },
                {
                    "text": "I'm in NYC, and will march with the kids from Central Park West to 43rd St and 6th Ave. Inspired, completely by their purity of purpose. They aren't trying to win any battle other than getting the military guns out of our society, and getting guns out of the hands of kids who rage against other kids.  ",
                    "created": "Sat, 24 Mar 2018 13:19:51 GMT"
                },
                {
                    "text": "If you want change, you have to be focused like a laser on two things:",
                    "created": "Sat, 24 Mar 2018 13:20:52 GMT",
                    "flNumberedSubs": "true",
                    "subs": [
                        {
                            "text": "What you want.",
                            "created": "Sat, 24 Mar 2018 13:21:21 GMT"
                        },
                        {
                            "text": "What you have to do to get it.",
                            "created": "Sat, 24 Mar 2018 13:21:37 GMT"
                        }
                    ]
                },
                {
                    "text": "So many causes led by adults falter on these two elements.",
                    "created": "Sat, 24 Mar 2018 13:21:54 GMT"
                },
                {
                    "text": "An example of a cause that is magnificently focused is #blacklivesmatter. It's in their hashtag. They don't care about teaching whites a lesson, or teaching whites what it feels like to be black, or to popularize the concept of white toxicity, or whitesplaining, what they care about is simply -- black lives. Anyone of any race with an ounce of empathy can get behind that. #blacklivesmatter is ready to accept help from anyone. And why not? If you're focused on a goal, in this case, saving black lives, why would you turn away someone who might be able to help?",
                    "created": "Sat, 24 Mar 2018 13:28:08 GMT"
                },
                {
                    "text": "For #2, the kids have it exactly right. Vote. It's always been the paradox of gun rights vs gun control in the US, that a small minority controls the majority because they vote. I said this over and over during the Occupy movement. If the result of Occupy is a \"message gets out there\" you will have accomplished nothing. But if we vote our cause, then we will achieve a lot. Everything. ",
                    "created": "Sat, 24 Mar 2018 13:24:27 GMT"
                },
                {
                    "text": "The kids are right. If, when they turn 18, and many of them will before the next election, they vote, this will make change. All the voter suppression that the Repubs can muster can't snuff out a movement of this magnitude. We will win. And we will also have a template for winning that can apply to other acts of government.",
                    "created": "Sat, 24 Mar 2018 13:26:03 GMT"
                },
                {
                    "text": "One of the kids said <a href=\"https://en.wikipedia.org/wiki/Sleeper_(1973_film)\">something</a> so wise it makes my skin crawl. \"Our parents don't know how to use a fucking democracy.\" Oh man. That is so true. They give up before they even start. The kids, bless their souls, see right through it. I love these kids with all my heart.",
                    "created": "Sat, 24 Mar 2018 13:29:53 GMT"
                },
                {
                    "text": "Let's go out and make some change today.",
                    "created": "Sat, 24 Mar 2018 13:41:20 GMT"
                }
            ]
        },
        {
            "text": "The best condolence note",
            "created": "Sat, 24 Mar 2018 14:42:46 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Since my mother's recent <a href=\"http://scripting.com/2018/02/11/152545.html\">death</a>, I've received many notes of condolence. All very very much appreciated. We all have to send messages of sympathy from time to time. I often find it awkward. Do I say I know what they're going through? In some sense I think I do, but I'm sure I don't, and would it be comforting? I don't think so.",
                    "created": "Sat, 24 Mar 2018 14:43:57 GMT"
                },
                {
                    "text": "When people say \"It's tough,\" or talk about what you're \"going through\" that makes me want to object. I don't think it's tough, that's not the word I'd use. There are silver linings. New freedom. And expressing sadness is just sad, it's not tough. It's the easiest thing in the world. And is \"going through\" the right term? That assumes there's an end. There isn't always an end. And at the outset it doesn't at all feel like there is. ",
                    "created": "Sat, 24 Mar 2018 14:45:46 GMT"
                },
                {
                    "text": "An example, from an anonymous sender (not wanting to embarrass them).",
                    "created": "Sat, 24 Mar 2018 14:42:58 GMT",
                    "subs": [
                        {
                            "text": "Just caught up with the news and wanted to express my condolences.",
                            "created": "Sat, 24 Mar 2018 14:43:33 GMT"
                        },
                        {
                            "text": "She sounds like a great lady."
                        },
                        {
                            "text": "And good to know that she wasn’t too intimidated by her very smart son."
                        },
                        {
                            "text": "May she rest in peace.",
                            "created": "Sat, 24 Mar 2018 14:43:48 GMT"
                        },
                        {
                            "text": "And may you continue to provide optimism, criticism and horse sense in your customary generous quantities."
                        }
                    ]
                },
                {
                    "text": "What' so great about about the example?",
                    "created": "Sat, 24 Mar 2018 14:47:08 GMT",
                    "subs": [
                        {
                            "text": "How to express condolences? Just that way. \"I want to express my condolences.\" ",
                            "created": "Sat, 24 Mar 2018 14:47:22 GMT"
                        },
                        {
                            "text": "Say something positive about the departed. ",
                            "created": "Sat, 24 Mar 2018 14:47:43 GMT"
                        },
                        {
                            "text": "Say something kind about the relationship between the departed and the person you're writing to, even if you didn't know the departed.",
                            "created": "Sat, 24 Mar 2018 14:47:57 GMT"
                        },
                        {
                            "text": "Offer a little closure, and then talk about the bright future, in terms of the qualities of the person you're writing to. ",
                            "created": "Sat, 24 Mar 2018 14:48:25 GMT"
                        }
                    ]
                },
                {
                    "text": "I just wanted to write this up, as a writer, who appreciates effective writing, and as a son who isn't going through something that is bittersweet and full of meaning, and is anything but tough.",
                    "created": "Sat, 24 Mar 2018 14:48:55 GMT"
                }
            ]
        }
    ]
}