{
    "text": "March 27",
    "created": "Tue, 27 Mar 2018 16:46:05 GMT",
    "name": "27",
    "subs": [
        {
            "text": "A <a href=\"http://scripting.com/2018/03/27/whatDevelopersCanDoWithFeedbase.m4a\">podcast</a> primarily for developers of feed reader software, on how feedBase starts a bootstrap. ",
            "created": "Tue, 27 Mar 2018 17:24:35 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2018/03/27/whatDevelopersCanDoWithFeedbase.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "4398037",
            "image": "http://scripting.com/images/2018/03/27/handbookRecentlyDeceased.png"
        },
        {
            "text": "An idea for a social network. When a family member dies, everyone remaining who was related to that person gathers, virtually and physically, and spends weeks telling stories about that person and other departed family members. The process could go on for generations.",
            "created": "Tue, 27 Mar 2018 20:11:10 GMT",
            "type": "outline"
        },
        {
            "text": "And following the mythology that NakedJen and I have <a href=\"http://scripting.com/2018/03/03/135246.html\">evolved</a>, a similar ceremony takes place in the afterlife, at the end of the newly departed's runway, and they tell stories about themselves, and those still living, of course. ",
            "created": "Tue, 27 Mar 2018 20:11:50 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://www.rawstory.com/2018/03/nra-admits-moving-money-accounts-foreign-donations-us-campaign-accounts/#.WrptTRjnabY.twitter\">This</a> makes my head spin because he's using foreign money to prop up a lie about the US Constitution, yet he claims the Supreme Court gave him the right to do this.",
            "created": "Tue, 27 Mar 2018 19:58:05 GMT",
            "type": "outline"
        },
        {
            "text": "First feedBase demo",
            "created": "Tue, 27 Mar 2018 16:46:06 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/pkLbhqGO8F0\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen></iframe>",
                    "created": "Tue, 27 Mar 2018 16:47:04 GMT"
                },
                {
                    "text": "Well here it is folks! A quick video demo of my new product. ",
                    "created": "Tue, 27 Mar 2018 16:46:13 GMT"
                },
                {
                    "text": "Here are some quick notes about what you're seeing here.",
                    "created": "Tue, 27 Mar 2018 16:47:25 GMT",
                    "flNumberedSubs": "true",
                    "subs": [
                        {
                            "text": "The new app both consumes and generates OPML files. ",
                            "created": "Tue, 27 Mar 2018 16:48:39 GMT"
                        },
                        {
                            "text": "You upload your OPML files, exported from various feed readers you use. All the feeds are added to a database, tagged with your name. Then we produce a new OPML file of all the feeds you've subscribed to. ",
                            "created": "Tue, 27 Mar 2018 16:48:51 GMT"
                        },
                        {
                            "text": "There are other ways of adding and removing feeds, but this is the basic input out. You give us OPML files, we give you back a single OPML file.",
                            "created": "Tue, 27 Mar 2018 16:49:52 GMT"
                        },
                        {
                            "text": "<i>It's a bootstrap. </i>This is where the leap of faith comes in. The new OPML file is fairly useless until feed reader apps add the ability to subscribe to an OPML file. Right now very few have this feature. But if even just a few of them do support the feature, all of a sudden we have a bootstrap. And a new way to share flows of news on the web. This was always part of the vision of RSS. Let's see if we can make this happen now in 2018. In a very real sense, we all can be part of history, if it works. :boom:",
                            "created": "Tue, 27 Mar 2018 16:50:16 GMT"
                        },
                        {
                            "text": "Please watch <a href=\"https://www.youtube.com/watch?v=pkLbhqGO8F0&feature=youtu.be\">the video</a> and ask any questions you have in <a href=\"https://github.com/scripting/Scripting-News/issues/71\">this topic</a> on our GitHub site. This is the beginning of something new, and hopefully fun!",
                            "created": "Tue, 27 Mar 2018 16:52:46 GMT"
                        }
                    ]
                }
            ]
        }
    ]
}