{
    "text": "When the end is near",
    "created": "Wed, 21 Mar 2018 16:51:59 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I'm having a <a href=\"https://twitter.com/davewiner/status/976500005342253057\">back and forth</a> with Brent on Twitter about maxing out on change, something that happens to every generation at some time. I was reminded of a story I told once about <a href=\"https://en.wikipedia.org/wiki/Don_Hewitt\">Don Hewitt</a>, the creator of <a href=\"https://en.wikipedia.org/wiki/60_Minutes\">60 Minutes</a>. It was in a <a href=\"http://scripting.com/2014/07/17/howGoodIsMyMind.html#comment-1496974270\">comment</a>, I need to get it on my blog and in my archive, so here it is. ",
            "created": "Wed, 21 Mar 2018 16:53:18 GMT",
            "subs": [
                {
                    "text": "I remember seeing an interview with 60 Minutes producer Don Hewitt, as it turns out a few weeks before he died. He said in the interview that he just couldn't keep up with the technology anymore. And you could tell he meant it. This is a guy who had been at the leading edge of media technology for most of his life, was one of the major innovators. There does come a time, it seems, when you just can't deal with it any more. Your mind gives up.",
                    "created": "Wed, 21 Mar 2018 16:55:00 GMT"
                },
                {
                    "text": "I saw it in my own father, shortly before he died. I was trying to show him how Twitter worked. He wasn't getting it. This is a guy who prided himself on understanding computers, in every way possible, his whole adult life. He told me he would be pushing up daisies soon, and there was no point. His words. He had given up. And he was within his rights to do that. I didn't argue.",
                    "created": "Wed, 21 Mar 2018 16:56:28 GMT"
                }
            ]
        },
        {
            "text": "That said, Brent and I, we're still kickin up some dirt every now and then! :rocket:",
            "created": "Wed, 21 Mar 2018 21:54:38 GMT"
        }
    ]
}