{
    "text": "Thread links",
    "created": "Tue, 13 Feb 2018 15:01:58 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I got on a roll this morning on Twitter. Sorry. I should put all my best thinking on the blog. In the meantime here are links to the threads with summaries. ",
            "created": "Tue, 13 Feb 2018 15:02:47 GMT"
        },
        {
            "text": "About the art of <a href=\"https://twitter.com/davewiner/status/963422924605706241\">linking</a> and how we're letting it go. It's not good enough to invent something, and drive adoption, you have to conserve it against monetization by private companies. ",
            "created": "Tue, 13 Feb 2018 15:02:48 GMT",
            "subs": [
                {
                    "text": "Sidebar: <a href=\"http://bloggercon.scripting.com/ruleoflinks.html\">The Rule of Links</a> from BloggerCon.",
                    "created": "Tue, 13 Feb 2018 15:03:54 GMT"
                }
            ]
        },
        {
            "text": "Steven Sinofski wrote a <a href=\"https://twitter.com/stevesi/status/963142502604779520\">thread</a> about Apple, and the realities of supersize tech companies. He has experience as product lead at Microsoft through the 90s. I <a href=\"https://twitter.com/davewiner/status/963421412735225862\">observed</a> that it might be nice if a leading web pub, with permission of course, adapted such threads to a more readable format, and added links. ",
            "created": "Tue, 13 Feb 2018 15:06:51 GMT"
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/963423711721291776\">Also</a> while Steven was leading Microsoft, the web was booming and they were cross-purposes. MS denied it then, but they lost an antitrust case about it, so I think we know they were. Thing is we need both open and proprietary, or we'd all still be using Unix command lines (I do, but wouldn't want to force it on anyone). We also need rules to keep the behemoths from trying to ingest the commons.",
            "created": "Tue, 13 Feb 2018 15:08:49 GMT"
        }
    ]
}