{
    "text": "Oy the humanity",
    "created": "Wed, 28 Apr 2021 15:41:40 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I have to keep my desktop Mac not-upgraded so I can keep running \"Frontier\" on it, so now I can't use it with my iPhone because I foolishly updated it to the latest version of iOS. I wish somehow I could get a Linux version of Frontier so I could dump the Mac. It's the wrong desktop OS for me, now. Has been for a while. And Frontier would be a great addition to Linux, imho. The source is on <a href=\"https://github.com/tedchoward/Frontier/releases\">Ted Howard's github</a>. ",
            "created": "Wed, 28 Apr 2021 15:40:07 GMT",
            "flInCalendar": true
        },
        {
            "text": "Mac to Dave: You fucked up! Loser!! :smile:",
            "created": "Wed, 28 Apr 2021 15:42:53 GMT",
            "inlineImage": "http://scripting.com/images/2021/04/28/oyMacSux.png",
            "flInCalendar": true
        },
        {
            "text": "How different it would have been if Apple loved Frontier instead of steering people away from it. Their idea of programming back in the day was English. Program in natural language. Oy my god. What a tragic mess that was. Instead our approach was to factor until you can factor no more. Make it as simple as possible, but no simpler. ",
            "created": "Wed, 28 Apr 2021 15:53:10 GMT",
            "flInCalendar": true
        },
        {
            "text": "Imagine a machine that was not only the best end user machine but also the best developer and power user machine. Remove the barriers from users becoming more powerful. End the prisethood. And make it easy to create personalized suites of apps. For a while the Mac was all that. The best machine for everyone. Then at some point Apple gave up on the Mac and decided to start over with iOS. Leaving the Mac in cash cow mode. And Mac users without a home (imho, ymmv).",
            "created": "Wed, 28 Apr 2021 15:54:24 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}