{
    "text": "<a href=\"http://scripting.com/2024/05/25/howIUsedChatGptThisMorning.m4a\">Podcast</a>: There's no <a href=\"https://futurism.com/the-byte/study-chatgpt-answers-wrong\">journalism</a> about the new things ChatGPT makes possible. Every day I'm trying to do it myself and encourage others to as well. Explain things we can do now that weren't approachable before. I did a <a href=\"http://scripting.com/2024/05/25/howIUsedChatGptThisMorning.m4a\">15 minute report</a> about this just now. I had to debug a complicated new configuration, setting up a new server with new code on both ends to implement a secure websocket connection. I've done it a dozen times, and you always make at least one mistake, and have to find it, and you need a checklist to go through, systematically, to find the problem, and it's really cool that ChatGPT can synthesize the checklist and give you instructions on tools that make it easy. There could never be anything like this on a Google/Stack Exchange type support system. It simply wasn't possible a year ago. We really need this story to get out too, but now it's all about how AI is a hoax. It is not. Yes Silicon Valley is run by monsters, doing basically the best they can. Riding a wave like this is thrilling but also you can't win on a personal level these days. It used to be the other way, you couldn't lose. They put the czars of tech on the covers of magazines and praised them as genius, godlike humans living at a much more elevated level than all of us schnooks, if you were one of the blessed. And always ignored are <i>the freaking users,</i> which is where the actual revolution is taking place. Too much work for the journalists, I guess? I would think if you were reporting in a time when new uses of technology are being discovered daily, real ones, transformative ones, you'd want to be in on that story. Nope I guess you don't get a Pulitzer these days for reporting news, just for finding hypocrisy, which is always in great supply, real or imagined. :smile:",
    "created": "Sat, 25 May 2024 14:52:45 GMT",
    "type": "outline",
    "enclosure": "http://scripting.com/2024/05/25/howIUsedChatGptThisMorning.m4a",
    "enclosureType": "audio/mpeg",
    "enclosureLength": "7659802",
    "image": "https://imgs.scripting.com/2024/05/25/steveJobsWiredCover.png",
    "flInCalendar": true
}