{
    "text": "I wrote yesterday <a href=\"https://twitter.com/davewiner/status/1388485567348985860\">on Twitter</a> that journalism does not cover the <a href=\"https://www.google.com/search?q=How+many+people+use+Facebook\">2.8 billion people</a> who use Facebook. Imagine a country with that many people with no journalism. A blind spot, imho. A potentially costly one for all of us, our journalism should be facing in that direction more, imho. <a href=\"https://twitter.com/TaylorLorenz\">Taylor Lorenz</a>, <a href=\"https://www.nytimes.com/by/taylor-lorenz\">NYT reporter</a> <a href=\"https://en.wikipedia.org/wiki/Taylor_Lorenz\">who</a> <a href=\"https://taylorlorenz.substack.com/\">covers</a> Facebook and Instagram and other online media (I think it's all <a href=\"https://www.google.com/search?q=site%3Ascripting.com+silo\">commercial</a> services, no open platforms) <a href=\"https://twitter.com/TaylorLorenz/status/1388487842360266758\">responded</a> with classic reporter reasoning, the same line I've been hearing since I took an interest in journalism in the mid-90s. After a few back and forths, I sent a DM saying I'd be happy to continue in a voice chat, was surprised when she sent back her number. I called and we talked for about an hour. It was a fast and interesting conversation with a talented and observant young (from my pov of course) person. She got her start as a <a href=\"https://taylorlorenz.tumblr.com/\">Tumblr blogger</a> believe it or not. She might be the only person in the world actually covering those 2.8 billion people. We talked about the NYT today, I talked a bit about tech reporting at the Times in the past, told stories of the old days in the Valley, it was refreshing. Memorable.  I'm going to read her more carefully now. BTW, I dropped <a href=\"https://www.google.com/search?q=site%3Ascripting.com+markoff\">Markoff's</a> name a couple of times, later I wondered if she knew who he is (<a href=\"https://www.nytimes.com/by/john-markoff\">NYT</a> star tech <a href=\"https://en.wikipedia.org/wiki/John_Markoff\">reporter</a> as the web was starting up). I realize we are deep into the next generations of tech journalism, now. Also imho TL should have a podcast, I said a couple of times. A book first, then a podcast. I think she'd be great. :boom:  ",
    "created": "Sun, 02 May 2021 12:56:04 GMT",
    "type": "outline",
    "image": "http://scripting.com/images/2021/05/02/taylor.png",
    "flInCalendar": true
}