{
    "text": "A bike safety idea. I noticed on my ride yesterday, a very nice day, in the week before Memorial Day, so lots of city folk are around, and they're out for a walk, in groups of 2 to 8 on the same roads I ride my bike on. They often occupy all the space, and move around a lot so it's impossible to know where I can safely go to get by them. I'm sure if I hit them they would get hurt, but unlike a car, I would get just as hurt. And I don't make much noise, so maybe they don't even hear me. I noticed that when a car approaches they get out of the way, presumably because 1. They can hear the car and 2. They know they'd get hurt and the car driver would just get a ticket, if that. I get a lot of thinking done while I ride, and I came up with a potential solution. I have a <a href=\"https://www.amazon.com/Tribit-Micro-Bluetooth-Speaker-Waterproof/dp/B07VSPPQXC/ref=asc_df_B07VSPPQXC/?tag=hyprod-20&linkCode=df0&hvadid=416694489735&hvpos=&hvnetw=g&hvrand=16093003404928166045&hvpone=&hvptwo=&hvqmt=&hvdev=c&hvdvcmdl=&hvlocint=&hvlocphy=1023511&hvtargid=pla-936549499154&psc=1&tag=&ref=&adgrpid=94693386915&hvpone=&hvptwo=&hvadid=416694489735&hvpos=&hvnetw=g&hvrand=16093003404928166045&hvqmt=&hvdev=c&hvdvcmdl=&hvlocint=&hvlocphy=1023511&hvtargid=pla-936549499154\">great little speaker</a> mounted on my handlebar. It's small but it produces a lot of sound. What if, as I was approaching a group of such people, I switched the sound to that of an accelerating car, headed straight for them. It would be fun to watch them scatter! It would be a valuable teaching experience and it would get them out of my way, quickly. I would get the same respect a car gets. I really like the idea. All I'd need to try it out is a recording of an approaching car to play on my iPhone. ",
    "created": "Wed, 26 May 2021 12:54:55 GMT",
    "type": "outline",
    "image": "http://scripting.com/images/2021/05/26/tribitSpeaker.png",
    "imageLink": "https://www.amazon.com/Tribit-Micro-Bluetooth-Speaker-Waterproof/dp/B07VSPPQXC/ref=asc_df_B07VSPPQXC/?tag=hyprod-20&linkCode=df0&hvadid=416694489735&hvpos=&hvnetw=g&hvrand=16093003404928166045&hvpone=&hvptwo=&hvqmt=&hvdev=c&hvdvcmdl=&hvlocint=&hvlocphy=1023511&hvtargid=pla-936549499154&psc=1&tag=&ref=&adgrpid=94693386915&hvpone=&hvptwo=&hvadid=416694489735&hvpos=&hvnetw=g&hvrand=16093003404928166045&hvqmt=&hvdev=c&hvdvcmdl=&hvlocint=&hvlocphy=1023511&hvtargid=pla-936549499154",
    "flInCalendar": true
}