{
    "created": "2022-01-07T05:00:00.000Z",
    "flInCalendar": true,
    "name": "07",
    "path": "2022/01/07",
    "text": "January 07",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I'm having a lot of trouble getting into the <a href=\"https://en.wikipedia.org/wiki/List_of_The_Expanse_episodes#Season_6_(2021%E2%80%9322)\">final season</a> of The Expanse. It seems really dry compared to what I've been tuning into lately. I will of course watch the whole thing, probably when it's done. Next Friday is the last episode. ",
            "created": "Fri, 07 Jan 2022 19:16:50 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "If I made <a href=\"https://www.youtube.com/watch?v=e0vJNp5asqc\">You're No Good</a> the song of the day, about <s>100</s> 250 people would think it was about them. It's not about you. You're great. I just like the song. ",
            "created": "Fri, 07 Jan 2022 19:11:52 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=e0vJNp5asqc",
            "flInCalendar": true
        },
        {
            "text": "I did a lot of personal development work over the years, mid-life crisis and stuff like that. I wanted to understand why I felt the way I did about things. One of my teachers told me a story about holding a baby and the baby smiled, and the person thought that the baby was saying something to them. But the truth is the baby might have just farted and thought it was cool. Whatever it is you're angsting over might not have anything to do with you. Most of the people on the planet are living their lives not thinking about you at all. Maybe they <i>should</i> be thinking about you, but they aren't. Sorry. ",
            "created": "Fri, 07 Jan 2022 19:12:47 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/01/11/drummer.png",
            "flInCalendar": true
        },
        {
            "text": "I love getting emails from PR people who offer to send me products based on what I write here. Not sarcastic. I got an message from a publicist at the <a href=\"http://knopfdoubleday.com/imprint/pantheon/\">Pantheon</a>, which publishes the <a href=\"https://www.penguinrandomhouse.com/books/239452/station-eleven-television-tie-in-by-emily-st-john-mandel/\">book</a> that the Station Eleven HBO series is based on. I thanked her for the offer. I read the book when it came out, still have it, and realize I may want to re-read it after seeing the series. But at first I was confused, I thought she was offering to send me the graphic novel (ie comic book) that's at the center of the story, Dr. Eleven, but that doesn't exist. I think it would be immensely popular if it did, that is of course if it was good. :boom:",
            "created": "Fri, 07 Jan 2022 17:26:24 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "How to stop air pollution",
            "created": "Fri, 07 Jan 2022 17:55:04 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I love this part of <a href=\"https://www.youtube.com/watch?v=-1pYKdqD1ls\">Respect Yourself</a> by the Staple Singers. ",
                    "created": "Fri, 07 Jan 2022 17:55:14 GMT",
                    "urlvideo": "https://www.youtube.com/watch?v=-1pYKdqD1ls",
                    "subs": [
                        {
                            "text": "If you're walking 'round think'n that the world owes you something 'cause you're here",
                            "created": "Fri, 07 Jan 2022 17:55:46 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "You goin' out the world backwards like you did when you first come here yeah",
                            "flInCalendar": true
                        },
                        {
                            "text": "Keep talkin' bout the president, won't stop air pollution ",
                            "created": "Fri, 07 Jan 2022 17:58:37 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Put your hand on your mouth when you cough, that'll help the solution",
                            "flInCalendar": true
                        },
                        {
                            "text": "Oh, you cuss around women and you don't even know their names, no",
                            "created": "Fri, 07 Jan 2022 17:58:36 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Then you're dumb enough to think that'll make you a big ol' man",
                            "created": "Fri, 07 Jan 2022 17:58:21 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}