{
    "created": "2022-01-08T05:00:00.000Z",
    "flInCalendar": true,
    "name": "08",
    "path": "2022/01/08",
    "text": "January 08",
    "type": "calendarDay",
    "subs": [
        {
            "text": "A <a href=\"https://github.com/scripting/drummerRFC/issues/4#issuecomment-1008016791\">status report</a> on support for Markdown in Drummer.  ",
            "created": "Sat, 08 Jan 2022 15:14:44 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "As you may know we're very close to having interop between Drummer and LogSeq. Just starting to think about what this opens up. Here's an example. We could set it up so a LogSeq user could edit and publish a Drummer blog from within LogSeq. The wiring would be easy (and fun).",
            "created": "Sat, 08 Jan 2022 16:39:03 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "It would be interesting if one of the paywall'd pubs also offered a <a href=\"http://daytona.scripting.com/?q=ez-pass&collection=scriptingnews\">tollbooth</a> or pay-as-you-go option. It's possible I could end up paying more per month that way, but as a reader I'd feel better about it. I have too many subscriptions for things I never use. That really tarnishes the brand in my mind, esp after I unsub, which I inevitably do.",
            "created": "Sat, 08 Jan 2022 14:49:42 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Why LogSeq?",
            "created": "Sat, 08 Jan 2022 15:39:04 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I'm sure some \"Drummer\" users are puzzled that the change notes outline all of a sudden has a bunch of stuff about LogSeq in it.",
                    "created": "Fri, 07 Jan 2022 14:54:10 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "To a web outliner user who might not have heard of the product, or of the nascent \"Tools For Thought\" category, it could seem odd. My interest comes from the growth of the TFT category, and its close proximity to my products, and the potential for interop.",
                    "created": "Fri, 07 Jan 2022 14:54:50 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I have put out a format for interop -- \"OPML\", but I've decided I don't want to wait for its broad adoption in the category to get interop. It's similar to  when RSS 0.90 came out when I already had <a href=\"http://daytona.scripting.com/?q=scriptingnews%20format&collection=scriptingnews\">scriptingNews format</a>. You have a choice at that point, you can have interop right now, or you can wait for a consensus that may never come. In the first case you have the chance to <i>create</i> the consensus, in the latter, you have to wait for others to agree. It's why I've noted in the past that the person who goes second has all the power. So I chose in this case to go second. ",
                    "created": "Fri, 07 Jan 2022 14:56:32 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "So if I want to interop with TFT products, why LogSeq?",
                    "created": "Fri, 07 Jan 2022 14:58:12 GMT",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "First, when I approached them, they responded, and listened, and followed up. ",
                            "created": "Fri, 07 Jan 2022 14:58:30 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Second, they have an open product, you can interop with it without getting in a locked trunk. What you look for in interop is a level playing field, that it be a peering arrangement, and that your interop partner can't shut off the connection without losing their users. LogSeq meets all those requirements. They are committed to being open. It's not just a thing they say, it's how they've built their product.",
                            "created": "Fri, 07 Jan 2022 14:59:24 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Third, the format is simple. I am familiar with it, having created a similar format for my outliners in the 80s called .HEAD. I know what it can and can't do. There's enough that we can do with the LogSeq format that makes for interesting projects built on the interop. ",
                            "created": "Fri, 07 Jan 2022 15:00:52 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Fourth, I like the team! They have a fresh can-do go-get-em attitude that is very refreshing. You don't see this very often in the US (they are in China). One thing that makes interop work better is if there's compatibility between the people. ",
                            "created": "Fri, 07 Jan 2022 15:02:28 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "Now I have to make a disclosure that I wish I had been able to make in November. I have made a small investment in the company. They have not announced this yet, and they asked me to wait until they do, but I feel I've already waited too long. I need people to know that I have a financial interest in the success of the company. But I also wanted to send a signal to them, to the users of our products, to the Tools For Thought category, to developers and others -- that we can compete and still see our success as beneficial to each other. This space is so large and under-developed that we can work for many years building on each others' strengths. ",
                    "created": "Fri, 07 Jan 2022 15:03:45 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I think what we're doing is substantially different. The focus of my projects tends to be in publishing and tools for development. I see their product as being useful in that context, but I don't think there's a big conflict. If we are able to co-exist with products that support OPML, surely we can do the same with Markdown.",
                    "created": "Fri, 07 Jan 2022 15:06:30 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PS: Here's a <a href=\"https://github.com/scripting/drummerRFC/issues/4#issuecomment-1008016791\">progress report</a> on the interop work. ",
                    "created": "Sat, 08 Jan 2022 19:43:16 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}