{
    "created": "2022-01-15T05:00:00.000Z",
    "flInCalendar": true,
    "name": "15",
    "path": "2022/01/15",
    "text": "January 15",
    "type": "calendarDay",
    "subs": [
        {
            "text": "<a href=\"https://www.wnycstudios.org/podcasts/otm/episodes/on-the-media-a-question-of-war\">Listening to NPR earlier</a>, talking about what the looming civil war is about. It's slavery. We never purged it from the American character. We never had truth and reconciliation. Slaveholders never paid for slavery. And their descendants are still among us, passing down the legend of slavery as an honorable institution, through the generations. We haven't dealt with it yet. And until we do, it will be the undercurrent of everything. It's just coming back to the surface now. It's always been there. ",
            "created": "Sat, 15 Jan 2022 22:08:34 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/09/11/kaepernick.png",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1482415914754654213\">Are you a devops person</a> who uses an <a href=\"http://outlinerhowto.opml.org/\">outliner</a> as part of <a href=\"https://github.com/scripting/drummerRFC/issues/19\">work</a>?",
            "created": "Sat, 15 Jan 2022 18:14:41 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I ordered a bread from a local baker and when I got it it was fresh out of the oven but not sliced. It was then, for the first time in my life I realized the truth that there is nothing like sliced bread. ",
            "created": "Sat, 15 Jan 2022 18:16:28 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://twitter.com/RonFilipkowski/status/1482355548565745670\">This is like</a> a mobster telling his people, in a (public!) video message, that it would be ok to hit the other mob boss.",
            "created": "Sat, 15 Jan 2022 15:52:29 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/RonFilipkowski/status/1482355548565745670",
            "flInCalendar": true
        },
        {
            "text": "Mac users who also use Ubuntu: Do you force the Mac to be like Unix, by mapping the Ctrl key to the Cmd key and vice versa? Or do you put up with the difference, and remember which machine you're using as you type? I'm hitting as I start using Ubuntu as my writing machine. Yesterday I <a href=\"https://twitter.com/davewiner/status/1482065198949318658\">tweeted</a>: \"I wish there were an easy way to exchange the Control and Alt keys on Ubuntu 20 so it works like a Mac.\" I failed to mention that I'm using VMWare Fusion to run Ubuntu, and it looks like there is a way to do it there. ",
            "created": "Sat, 15 Jan 2022 15:42:26 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The High Road",
            "created": "Sat, 15 Jan 2022 22:00:12 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "<i>Excerpt from <a href=\"http://scripting.com/davenet/1996/10/24/QueSeraSera.html#6\">Que Sera Sera</a>, October 1996.</i>",
                    "created": "Sat, 15 Jan 2022 22:00:18 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "To anyone who wants to lead -- show us software that's fun and empowering, get us interested and excited. Gates, McNealy, Ellison et al never do that. We've tried it their way before, look at the stagnation that resulted. We're at a crossroads now, do we go back to the mess of the past or do we learn to enjoy the que sera of it all, and stop seeing threats everywhere we look?",
                    "created": "Sat, 15 Jan 2022 22:00:38 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "So much of the energy is about defeating and destroying, so little is about creating. People believe in others, not themselves, and are disappointed when they are left out of the big plans. They forget that no matter how rich and intimidating each leader of our industry is, or would-be leader, none of them predicted the world we live in now, and by extrapolation they are powerless to control the world we will live in in 1997 and beyond.",
                    "flInCalendar": true
                },
                {
                    "text": "I'll do my part: here's an invitation to truly embrace the creativity of others. Instead of beating your breast about how great you are, try saying how great someone else is. Look for win-wins, make that your new religion. Establish a policy that nothing will be announced unless it can be shown that someone else will win because of what you're doing. How much happier we would be if instead of crippling each other with fear, we competed to empower each others' creativity.",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}