{
    "created": "2022-01-16T05:00:00.000Z",
    "flInCalendar": true,
    "name": "16",
    "path": "2022/01/16",
    "text": "January 16",
    "type": "calendarDay",
    "subs": [
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=-5DAQwL_eNE\">Video demo</a>: A new demo app called <a href=\"http://daytona.scripting.com/?q=treechart&collection=scriptingnews\">TreeChart</a> interactively displays beautiful SVG trees as you edit them in the Drummer outliner. This is a seat-of-the-pants preview. I hope to release the app tomorrow so people can see how it works for themselves and hopefully it'll give developers and users some ideas. ",
            "created": "Sun, 16 Jan 2022 20:34:54 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=-5DAQwL_eNE",
            "flInCalendar": true
        },
        {
            "text": "I'll post links to the tech as I document it tomorrow in <a href=\"https://github.com/scripting/drummerRFC/issues/20\">this thread</a>. ",
            "created": "Sun, 16 Jan 2022 21:24:35 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I’m famous for RSS, podcasting, blogging, but my life’s work has been outlining software, idea organizers, tools for thought and publishing systems based on outliners. The other stuff was either in support of idea processing, or an outgrowth of it.",
            "created": "Sun, 16 Jan 2022 12:54:00 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1482691926889574403",
            "flInCalendar": true
        },
        {
            "text": "Political marketing",
            "created": "Sun, 16 Jan 2022 17:31:48 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Do I have anyone following me who is a political marketer? Is there such a thing. We need them now.  The way you fight this, and it's getting late, is by demonstrating the opposite.   Famous people of different races visibly doing things to help each other. <a href=\"https://t.co/MU4F79oyfT\">[link]</a>",
                    "created": "Sun, 16 Jan 2022 15:47:40 GMT",
                    "tweetId": "1482741349778661383",
                    "urltweet": "https://twitter.com/davewiner/status/1482741349778661383",
                    "inReplyToId": "",
                    "tweetUserName": "davewiner",
                    "flInCalendar": true
                },
                {
                    "text": "There's more to do.  We should be wearing buttons, small ones, with MLK's image on it. People of all colors. Americans. Showing support for all of us, esp people whose ancestors were slaves.   We have to urgently heal this huge wound.",
                    "created": "Sun, 16 Jan 2022 15:47:40 GMT",
                    "tweetId": "1482741351448039427",
                    "urltweet": "https://twitter.com/davewiner/status/1482741351448039427",
                    "inReplyToId": "1482741349778661383",
                    "tweetUserName": "davewiner",
                    "flInCalendar": true
                },
                {
                    "text": "Another thing to do, we need to show each other that we are here, in great numbers.   I don't like huge national marches, what I'd love more than anything is people showing their passion for voting. Not just in November, but every Sunday.",
                    "created": "Sun, 16 Jan 2022 15:47:41 GMT",
                    "tweetId": "1482741352660180996",
                    "urltweet": "https://twitter.com/davewiner/status/1482741352660180996",
                    "inReplyToId": "1482741351448039427",
                    "tweetUserName": "davewiner",
                    "flInCalendar": true
                },
                {
                    "text": "Let's meet up at our polling places for coffee and a sandwich and good old political talk. Talk about what we want. Yes there will be trolls there. But let's hope we outnumber them. I think we will always outnumber them, but can we get out there and show it.",
                    "created": "Sun, 16 Jan 2022 15:47:41 GMT",
                    "tweetId": "1482741353796837384",
                    "urltweet": "https://twitter.com/davewiner/status/1482741353796837384",
                    "inReplyToId": "1482741352660180996",
                    "tweetUserName": "davewiner",
                    "flInCalendar": true
                },
                {
                    "text": "And we need to use online advertising.   Campaigns should NEVER GO OFF THE AIR.  This a vestige of TV-based media, last generation.  And they should raise money and pay for themselves.  And speak with power, not powerlessness.",
                    "created": "Sun, 16 Jan 2022 15:50:02 GMT",
                    "tweetId": "1482741945399140352",
                    "urltweet": "https://twitter.com/davewiner/status/1482741945399140352",
                    "inReplyToId": "1482741353796837384",
                    "tweetUserName": "davewiner",
                    "flInCalendar": true
                },
                {
                    "text": "We've lost the marketing war, with a Baby Huey type character as the other side's spokesperson. We have much better people, but we lack the political organization and understanding of how little time is left.",
                    "type": "tweet",
                    "created": "Sun, 16 Jan 2022 15:50:02 GMT",
                    "tweetId": "1482741946464583680",
                    "urltweet": "https://twitter.com/davewiner/status/1482741946464583680",
                    "inReplyToId": "1482741945399140352",
                    "tweetUserName": "davewiner",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Word games",
            "created": "Sun, 16 Jan 2022 14:28:08 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I've been doing crosswords for many years, but I'm still not great at them. They start out easy at the beginning of each week, and get harder progressively until the Sunday puzzle which only great crossword solvers can do, like my mom. It was one of the things we could do together. I'd fill in a few of the answers and come back later to find the whole puzzle solved. She said she didn't mind that I did the easy ones.",
                    "created": "Sun, 16 Jan 2022 14:28:13 GMT",
                    "image": "http://scripting.com/images/2022/01/16/crossword.png",
                    "flInCalendar": true
                },
                {
                    "text": "The Washington Post recently started publishing <a href=\"https://www.washingtonpost.com/crossword-puzzles/daily/\">free crosswords</a>. Even though I'm a paying NYT subscriber, their crosswords cost more, even for me. I find the Post crosswords are just as satisfying and clever as the NYT ones, and the price is great. ",
                    "created": "Sun, 16 Jan 2022 14:32:32 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "As far as I know I have never been the answer to a clue in a NYT puzzle, or for that matter on Jeopardy. And I've never written a NYT guest column. I will be able to die a happy man when I've checked all these boxes. :boom:",
                    "created": "Sun, 16 Jan 2022 14:38:43 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Now we turn to <a href=\"https://www.powerlanguage.co.uk/wordle/\">Wordle</a>. At first I looked at it and thought it was too much trouble, but then I read a <a href=\"http://oldschool.scripting.com/KenSmith/2022/01/13/164646.html?title=solvingWordleWithLetterFrequency\">piece</a> by my friend Ken Smith, the English professor from Indiana, who explained how to approach it mathematically. The idea is that your first word should have as many of the most likely characters as possible, which are the vowels and N, R, S, T etc. Then I don't know the best approach for the second word or third. What I've been doing is taking the matches from the first word, and there are bound to be one or two, and use them in the second word. If the position is correct, use that letter in that position, to make it a bit like a crossword, except there is no clue. Repeat in the third, fourth, etc.",
                    "created": "Sun, 16 Jan 2022 14:28:47 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I've played Wordle twice and both times got extremely lucky and solved the puzzle in the third word. ",
                    "created": "Sun, 16 Jan 2022 14:31:27 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "BTW, I <i>hate</i> Scrabble. No patience for it. ",
                    "created": "Sun, 16 Jan 2022 14:41:01 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}