{
    "created": "2022-01-17T05:00:00.000Z",
    "flInCalendar": true,
    "name": "17",
    "path": "2022/01/17",
    "text": "January 17",
    "type": "calendarDay",
    "subs": [
        {
            "text": "LogSeq plugin developer? As you may know, I've written a <a href=\"https://github.com/scripting/myLogseqBlog\">Node app</a> that flows LogSeq journal writing to a Drummer blog. Here's an <a href=\"http://oldschool.scripting.com/KLTransit/\">example</a>. It does the whole thing, except it should be baked into LogSeq. Setting up a Node app and running it externally is both too difficult for an average user and too many steps. We already have a <a href=\"https://github.com/scripting/myLogseqBlog/issues/1#issuecomment-1013997158\">great techie user</a> who I worked with me to get the Node app working, who is up to speed on using the software. He can guide the process, we just need a dev to work with him. I'm available to help too, to the extent that I can. If you are a LogSeq plugin dev, please post a note in <a href=\"https://github.com/scripting/myLogseqBlog/issues/1\">this thread</a>, and we can hopefully get started right away. <i>Thanks!</i>",
            "created": "Mon, 17 Jan 2022 14:43:34 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/09/17/simpsonsBeeGuy.png",
            "flInCalendar": true
        },
        {
            "text": "The <a href=\"https://twitter.com/davewiner/status/1483084855818784771\">keyboard saga</a> continues. I've decided to make the Mac work like Windows and Ubuntu, swapping the Ctrl and Cmd keys, but for some reason my Bluetooth keyboard is not showing up in the <a href=\"http://scripting.com/images/2022/01/17/modifierKeyboardDialog.png\">list of keyboards</a> whose modifier keys you can change. The list is empty. I tried disconnecting the keyboard and reconnecting, no luck. I guess I should try rebooting the machine. If you have an idea, reply to <a href=\"https://twitter.com/davewiner/status/1483084855818784771\">this tweet</a>. <i>Thanks!</i>",
            "created": "Mon, 17 Jan 2022 14:35:47 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I can tell today is going to be <i>one of those</i> days. My power went out overnight, but luckily I have a generator this winter (newly installed in the summer) and it automatically kicked in. But there are no outages listed on the Central Hudson outage map. Oy. I'll make the best of it.",
            "created": "Mon, 17 Jan 2022 14:34:28 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}