{
    "created": "2022-01-25T05:00:00.000Z",
    "flInCalendar": true,
    "name": "25",
    "path": "2022/01/25",
    "text": "January 25",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Starting a little tune-up work on <a href=\"http://daytona.scripting.com/?q=daytona&collection=scriptingnews\">Daytona</a>. First couple of changes, both for Scripting News only. 1. Fixed broken links to <a href=\"http://scripting.com/stories/2010/01/20/theSafeFutureOfRadioAndMan.html\">radio.weblogs.com</a> images. We lost control of the domain when Verisign sold weblogs.com. 2. Apply my glossary to the text, so references to special links and images now work, for example <a href=\"http://daytona.scripting.com/?q=%22curly%22&collection=scriptingnews\">references</a> to the <i>curly</i> image. I also want to fix up references to the <a href=\"http://daytona.scripting.com/?q=tagging&collection=scriptingnews\">tagging</a> feature I implemented which was superceded by Daytona. And a few other things while I'm in there. ",
            "created": "Tue, 25 Jan 2022 16:53:42 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The NYT had a <a href=\"https://www.nytimes.com/2022/01/20/opinion/biden-independent-voters.html\">focus group</a> with independent voters. Not surprisingly their opinions of American politics perfectly echo what they say on CNN. We can't get out of this awful loop until we add some new ideas to journalism. Big new ideas.",
            "created": "Tue, 25 Jan 2022 15:00:47 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I'm a Beatles-head",
            "created": "Tue, 25 Jan 2022 14:48:24 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2022/01/25/beatles.png",
            "description": "It's looking like 2022 is shaping up to be the year of the Beatles for me.",
            "subs": [
                {
                    "text": "What's the best history of the Beatles? I've been trying the <a href=\"https://en.wikipedia.org/wiki/The_Beatles:_The_Biography\">Spitz book</a>, but it's not very well written. Lots of hyperbole, the characters and their stories are pretty thin. I'd like one that stops and talks about the songs, and how they were written (if it's known) and what they're really about. ",
                    "created": "Tue, 25 Jan 2022 14:28:39 GMT",
                    "image": "http://scripting.com/images/2022/01/25/twistAndShout.png",
                    "flInCalendar": true
                },
                {
                    "text": "It's looking like 2022 is shaping up to be the year of the Beatles for me. <a href=\"https://www.disneyplus.com/series/the-beatles-get-back/7DcWEeWVqrkE\">Get Back</a> was really a transformative event. I had very little idea of who the Beatles are/were as people. ",
                    "created": "Tue, 25 Jan 2022 14:49:03 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Reading the 1970 <a href=\"http://www.johnlennon.com/music/interviews/rolling-stone-interview-1970/\">John Lennon interview</a> in Rolling Stone really brought it home. I know it's obvious, he's just a person, but the Beatle John Lennon was a huge figure in our culture, and in my own life. No one actually is that large. The cultural icon is another story. That's why the individual Beatles talked about <i>The Beatles</i> so often, as this thing separate from themselves. It was. And I suppose if you want to know why they <a href=\"https://timesmachine.nytimes.com/timesmachine/1970/04/11/357087772.html?pageNumber=20\">broke up in 1970</a>, that's probably the cause -- to become something approaching <a href=\"http://scripting.com/2016/05/31/1296.html\">human-size</a> again. I think it's fair to say they never achieved it. ",
                    "created": "Tue, 25 Jan 2022 14:49:26 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "My friend <a href=\"http://daytona.scripting.com/?q=dave%20jacobs&collection=scriptingnews\">Dave Jacobs</a>, who was a Dead-head, he traveled with the band, has all of a sudden become a Beatles-head too, as I have (again). He's listened to all their songs recently, and told me he was blown away by the sheer number of great songs. He said some bands have one or two hits, but the Beatles had hundreds of great songs. I don't think there's much doubt the Beatles are historic. ",
                    "created": "Tue, 25 Jan 2022 14:37:59 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Wikipedia: <a href=\"https://en.wikipedia.org/wiki/The_Beatles_timeline\">Beatles timeline</a>.",
                    "created": "Tue, 25 Jan 2022 14:43:00 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}