{
    "created": "2022-01-29T05:00:00.000Z",
    "flInCalendar": true,
    "name": "29",
    "path": "2022/01/29",
    "text": "January 29",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Today's songs: <a href=\"https://www.youtube.com/watch?v=HtUH9z_Oey8\">Strawberry Fields Forever</a> and <a href=\"https://www.youtube.com/watch?v=S-rB0pHI9fU\">Penny Lane</a>. Both were about places in Liverpool. McCartney wrote Penny Lane, the <a href=\"https://www.google.com/maps/@53.385517,-2.922201,3a,75y,218.78h,90t/data=!3m7!1e1!3m5!1suxfEgVSsvPtN86HT8-23eg!2e0!6shttps:%2F%2Fstreetviewpixels-pa.googleapis.com%2Fv1%2Fthumbnail%3Fpanoid%3DuxfEgVSsvPtN86HT8-23eg%26cb_client%3Dmaps_sv.tactile.gps%26w%3D203%26h%3D100%26yaw%3D205.606%26pitch%3D0%26thumbfov%3D100!7i16384!8i8192\">street</a> Lennon grew up on. Strawberry Field is also a <a href=\"https://www.google.com/maps/@53.380399,-2.8838764,3a,75y,137.11h,69.2t/data=!3m6!1e1!3m4!1sdvEAm-XFTRmkmqi-ZRC25g!2e0!7i16384!8i8192\">real place</a>. Lennon wrote the song while he was away from the group in Spain, acting in a <a href=\"https://en.wikipedia.org/wiki/How_I_Won_the_War\">movie</a> and pretty lost. The two songs were released together on a <a href=\"https://www.beatlesstory.com/blog/2016/11/24/song-facts-strawberry-fields-forever-penny-lane/\">double-a-side single</a>.  ",
            "created": "Sat, 29 Jan 2022 18:24:44 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2022/01/29/strawberryField.png",
            "flInCalendar": true
        },
        {
            "text": "Like everyone else, I'm addicted to <a href=\"https://www.powerlanguage.co.uk/wordle/\">Wordle</a>. Programming <a href=\"https://twitter.com/davewiner/status/1487328204410998786\">prepares</a> you for this game because there always comes a point where you have to stare at the code going over what you know and don’t know. Not guessing, but testing, gathering more data. Until you see it.",
            "created": "Sat, 29 Jan 2022 13:23:10 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Journalists who covered the aftermath of the 2008 crash, please take a similar look at what VCs are doing with crypto. I'm pretty technical and I think it's all buzzwords hiding a scam. Find the scam <i>before</i> the bubble bursts. Or make it burst before they're too big to fail.",
            "created": "Sat, 29 Jan 2022 16:01:05 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"http://scripting.com/stories/2008/09/23/theRealEstateBubble.html\">Here's what I wrote</a> about the bubble that had just burst in 2008. It goes quite a bit deeper than just the financial tricks that inflated the bubble. What's so depressing that we not only didn't wake up from what we were doing and start to fix it, we've drifted further into the morass. It's hard to believe the United States has any foundation left. And the world is on the verge of telling us to fuck off, bigtime. I think that's what Putin is trying to provoke now. Show the world we don't have the will to defend a country that obviously deserves our protection. ",
            "created": "Sat, 29 Jan 2022 16:07:52 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2022/01/29/fail.png",
            "flInCalendar": true
        },
        {
            "text": "Good morning and welcome to a big snow storm. We aren't getting anything like the worst of it in the Hudson Valley, that's <a href=\"https://www.nbcboston.com/news/local/first-alert-blizzard-to-drop-2-feet-of-snow-on-massachusetts/2627036/\">where Boston is</a>, but the snow is blowing and it's nasty out there. Just got a text message from Apple that my new iPhone will be delivered today. Somehow I think not.",
            "created": "Sat, 29 Jan 2022 13:12:30 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Yesterday I got a <a href=\"https://www.amazon.com/gp/product/B092QRLTZ3/ref=ppx_yo_dt_b_asin_title_o02_s00?ie=UTF8&psc=1\">new Macally keyboard</a>. It's their answer to the <a href=\"https://www.amazon.com/gp/product/B07S92QBCJ/ref=ppx_yo_dt_b_search_asin_title?ie=UTF8&psc=1\">Logitech MX</a>, which I also have. I love the MX, it has a very nice feel and most important the keys are backlit. I like working in a dark room, so it's important for me to be able to see the keys, esp as my eyesight weakens as I get older. I got the new keyboard because I was unable to switch the <a href=\"http://daytona.scripting.com/?q=Ctrl%20and%20Cmd&collection=scriptingnews\">Ctrl and Cmd</a> keys, so I could also use Windows and Linux on the same machine without breaking my brain. For some reason when I do the switch using the Control Panel or Karabiner, the mapping doesn't stick. I thought maybe the problem was with the keyboard, so it was worth $50 to find out. Sadly there's something wrong with the computer, this new keyboard has the same problem. If you have any ideas on what might be going wrong, or what I might try next, please send me a tweet or an email. In the meantime, I also got a <a href=\"https://www.amazon.com/gp/product/B072M4YLN6/ref=ppx_yo_dt_b_asin_title_o02_s00?ie=UTF8&th=1\">new mouse</a>, an upgrade from the cheap-feeling Microsoft mouse I got because I decided to try using a scroll wheel mouse and liked it. ",
            "created": "Sat, 29 Jan 2022 13:13:54 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I realize that in a sense this whole blog, all 27-plus years, has been about coming to terms with being creative in public, and how hard it is to be true to yourself while doing that. Nothing can prepare you for it. I've known quite a few people who dealt with this in tech and know very few who were happy about it. Before you're rich and famous you think it'll all be great, but once you're in it, it just spins you around and you struggle to try to stay human, but if your fame gets big enough everyone wants to own you, some even tell you to your face they want to own you, but they don't need <i>you</i> if you get what I mean. I have walked away from the adventure a couple of times myself. But learning about the Beatles, and I still have a lot to learn, has opened my eyes wider than anything, because before this investigation started, all I knew about the Beatles was the one that the public owns. ",
            "created": "Sat, 29 Jan 2022 15:51:39 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/12/11/mrsMaisel.png",
            "flInCalendar": true
        },
        {
            "text": "Photos of young Scott Love",
            "created": "Sat, 29 Jan 2022 13:27:52 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Back in the 80s at Living Videotext, I imagine us having a conversation about which of us would be first to die. That said, it wouldn't surprise me if <a href=\"http://daytona.scripting.com/?q=scott%20love&collection=scriptingnews\">Scott Love</a> wasn't the first, I didn't stay in touch with most of the people who worked there. But Scott was certainly the first of those who I did. I wrote about <a href=\"http://scripting.com/2021/11/08.html\">his passing</a> in November, but I didn't have any pictures of him from Living Videotext. My brother sent me a couple, so here they are. ",
                    "created": "Sat, 29 Jan 2022 13:45:59 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "<a href=\"http://scripting.com/images/2022/01/29/scottLoveKandesDave.png\">From left to right</a>, Scott Love, Kandes Bregman and myself. Not sure which office this was taken in, either Charleston Rd or Easy St, both in Mountain View, CA.",
                    "created": "Sat, 29 Jan 2022 13:32:38 GMT",
                    "inlineImage": "http://scripting.com/images/2022/01/29/scottKandesDave.png",
                    "flInCalendar": true
                },
                {
                    "text": "<a href=\"http://scripting.com/images/2022/01/29/scottLoveLeonWiner.png\">From left to right</a>, Leon Winer (my father) and Scott Love. ",
                    "created": "Sat, 29 Jan 2022 13:41:08 GMT",
                    "inlineImage": "http://scripting.com/images/2022/01/29/leonScott.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}