{
    "text": "June 2",
    "created": "Tue, 02 Jun 2020 14:23:59 GMT",
    "name": "02",
    "subs": [
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=kKj4L6GwL5Y\">Rodney King</a>: Can We All Get Along? ",
            "created": "Tue, 02 Jun 2020 21:27:53 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=kKj4L6GwL5Y"
        },
        {
            "text": "Haven't heard this discussed on Twitter or in the news. Police are in trouble, their salaries are paid by localities whose tax base has crashed. We can’t take them for granted. I have no agenda, other than a need to be safe, and know that the police are an important part of that. ",
            "created": "Tue, 02 Jun 2020 21:10:03 GMT",
            "type": "outline"
        },
        {
            "text": "Trump in charge! So there!",
            "created": "Tue, 02 Jun 2020 14:32:00 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2020/06/02/nothingburger.png",
            "description": "He would prove conclusively he was really in charge, even if his father didn't think he was good for anything. ",
            "subs": [
                {
                    "text": "The lights were out in the White House while the president hunkered in the bunker freaked out and humiliated. His enemy comes into focus, it's the people out there, complaining, again, like everyone else. They can't see how smart he is. He's got to do something about this. His speech on Saturday welcoming a new wave of space exploration didn't replace the protests as the top story. Alone in the dark White House, ignored, he hatched a plan to get the spotlight back on him.",
                    "created": "Tue, 02 Jun 2020 14:24:00 GMT",
                    "image": "http://scripting.com/images/2020/06/02/patton.png"
                },
                {
                    "text": "One of his aides had discovered that he could order the military into DC, due to a loophole in some law, so he was going to use that to bust out of the bunker, and get back in charge. I'll show him (er them) he said to himself (the <i>him</i> he was referring to was his long-dead father). I'll bring in the military and have them do something spectacular, even better than the <a href=\"https://www.cnn.com/2020/05/01/us/blue-angels-thunderbirds-trnd/index.html\">Blue Angels</a> flying over the cities to get all their attention (another of his spectacular plans that didn't win him the adulation he feels he deserves). ",
                    "created": "Tue, 02 Jun 2020 14:26:23 GMT"
                },
                {
                    "text": "Timed to perfectly coincide with his speech, like the music playing in <a href=\"https://www.youtube.com/watch?v=30QzJKCUekQ\">Apocyalypse Now</a> or <a href=\"https://www.youtube.com/watch?v=pByJkuv0q3Y\">Rocky</a> or <a href=\"https://www.youtube.com/watch?v=cg6MqWYyts0\">Patton</a>, the soldiers, on horseback, zoom in and clear the park for Trump's dramatic escape from the bunker! Super Trump. Accompanied by his sidekicks, The Law (Barr), The Gun (Esper) and The Troop (the Chairman of the Joint Chiefs of Staff). Wonder Woman, of course, and the The Boy Wonder (Ivanka and Jared). Should we bring the dogs? Nahh that's too much he thought to himself but accidentally said out loud.",
                    "created": "Tue, 02 Jun 2020 14:52:28 GMT"
                },
                {
                    "text": "He spent two full days planning it out, like <a href=\"https://www.youtube.com/watch?v=ZlV3oQ3pLA0\">Captain Queeg</a> and the strawberries. He would prove conclusively he was really in charge, even if his father didn't think he was good for anything. ",
                    "created": "Tue, 02 Jun 2020 14:31:06 GMT"
                }
            ]
        },
        {
            "text": "We wedge ourselves",
            "created": "Tue, 02 Jun 2020 14:59:15 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "We have to stop being so modal about the big social issues. ",
                    "created": "Tue, 02 Jun 2020 14:59:31 GMT"
                },
                {
                    "text": "We should be fighting to stop mass killings with guns -- all the time -- not just after a mass killing. "
                },
                {
                    "text": "Same with #blm and #metoo and fighting against the virus.",
                    "created": "Tue, 02 Jun 2020 14:59:44 GMT"
                },
                {
                    "text": "Asians are blamed for the virus, btw.",
                    "created": "Tue, 02 Jun 2020 14:59:43 GMT"
                },
                {
                    "text": "Letting the news cycle control our lives is ceding too much power to the media corporations, platforms, political parties.",
                    "created": "Tue, 02 Jun 2020 14:59:44 GMT"
                },
                {
                    "text": "We can see the wedges the Repubs create to try to separate us, but we don't see the wedges we put between ourselves.",
                    "created": "Tue, 02 Jun 2020 15:00:03 GMT"
                },
                {
                    "text": "We can mourn a black man killed by a cop at the same time we mourn a country music fan killed by a shooter in Las Vegas or a school teacher killed in Connecticut. And we can stand between a mob and Asian-American doctors trying to save us from the virus.",
                    "created": "Tue, 02 Jun 2020 15:00:12 GMT"
                }
            ]
        },
        {
            "text": "Warren's candidacy",
            "created": "Tue, 02 Jun 2020 15:19:09 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "BTW, after Elizabeth Warren pulled out, we could have had a  discussion about why her candidacy failed, but every time I tried to speak, I was told I couldn't understand because I am not a woman.",
                    "created": "Tue, 02 Jun 2020 15:19:18 GMT"
                },
                {
                    "text": "Too bad, but 1/2 the electorate is male, and if you want to win, you'll need a lot of male votes. It's the same old shit, drive a wedge in the electorate, <i>your own electorate,</i> as a supposed winning strategy? It's nuts to think that could work. ",
                    "created": "Tue, 02 Jun 2020 15:19:48 GMT"
                },
                {
                    "text": "Warren appealed to imho the worst in women, based on the belief that men should shut up and do what we say. Not unlike the flavor of the #blm discussion, btw. ",
                    "created": "Tue, 02 Jun 2020 15:20:38 GMT"
                },
                {
                    "text": "The women wanted some uninterrupted time to wallow about how fucked up the world is and how women would never gain full equality. There will never be a woman president, they explained, because Warren was the best, and she didn't get the nomination. But Warren wasn't the best, and that was not the message of the Warren failure. They didn't want to hear it, and some of them, people I (used to) respect were incredibly abusive about it. These people don't want to win, they want pity. They were pretty clear about it. But I don't offer my pity in situations like this, because I don't accept the premise. ",
                    "created": "Tue, 02 Jun 2020 15:20:56 GMT"
                },
                {
                    "text": "Warren wasn't a good-enough candidate. We aren't doomed to never having a woman president. But it isn't going to be Warren, until she's ready to be president for everyone. Obama did that, he didn't try to be the president for blacks, though blacks were rightfully proud, as I was, that our country had finally broken through on race, or so it seemed at the time. I will cry the day a woman is elected president, as I cried the day Obama won. ",
                    "created": "Tue, 02 Jun 2020 15:20:54 GMT"
                },
                {
                    "text": "I supported the hell out of HRC, and at first supported Warren, until she started dropping in nasty bits about men into her speeches. At that point I knew if she got the nomination, she'd never get enough votes from men to win. She would've gotten my vote, but I wouldn't have liked doing it. ",
                    "created": "Tue, 02 Jun 2020 15:41:07 GMT"
                },
                {
                    "text": "Yet my women friends in politics still don't see the wedge they're putting in the electorate, and possibly haven't considered the idea for next time there's a woman candidate with something to offer. Listen when a friend says you've made a mistake. You have to do it to win. If you won't do it, don't blame the world, take the blame yourself because you don't deserve to win.",
                    "created": "Tue, 02 Jun 2020 15:41:08 GMT"
                }
            ]
        }
    ]
}