{
    "text": "June 5",
    "created": "Fri, 05 Jun 2020 13:32:00 GMT",
    "name": "05",
    "subs": [
        {
            "text": "Every town in America should have a <a href=\"https://twitter.com/davewiner/status/1268953162381176835\">Black Lives Matter</a> street.",
            "created": "Fri, 05 Jun 2020 17:15:14 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/06/05/blackLivesMatterStreet.png"
        },
        {
            "text": "Where the BLM street is <a href=\"http://scripting.com/images/2020/06/05/whereTheBLMStreetIsRelativeToTheWhiteHouse.png\">relative</a> to the White House.  ",
            "created": "Fri, 05 Jun 2020 20:35:56 GMT",
            "type": "outline"
        },
        {
            "text": "Seriously, a guy who ignores the Constitution and gets away with it is going to have a real election? Is that what you think? ",
            "created": "Fri, 05 Jun 2020 13:32:01 GMT",
            "type": "tweet",
            "tweetId": "1268905753760477184",
            "tweetUserName": "davewiner"
        },
        {
            "text": "Maddow had a good point last night. If militia-like police are deployed by the government, without any identification, what's to stop civilians masquerading as police to start acting like government police? Maybe that's the point, if what you want is civil war. ",
            "type": "outline",
            "created": "Fri Jun 05 13:15:44 +0000 2020"
        },
        {
            "text": "I just cancelled my subscription to <a href=\"https://theathletic.com/\">The Athletic</a>. Congratulations, <a href=\"http://scripting.com/images/2020/06/05/unsubAthletic.png\">they made it easy</a>. As a result I will consider resubscribing if my interest in sports is re-kindled. I will now add another pub to the two I still subscribe to. (NYT and WP.) ",
            "type": "outline",
            "created": "Fri Jun 05 13:13:25 +0000 2020"
        },
        {
            "text": "Watching the <a href=\"https://twitter.com/DavidBegnaud/status/1268716877355810818\">Buffalo police shove</a> the tall 75-year-old man to the ground yesterday I was struck by two things.  1. If you put people with all the flaws of normal people in uniforms like that they're going to act like pigs. 2. Seeing an old white dude be almost killed that way was jarring, as an old white dude myself.",
            "type": "outline",
            "created": "Fri Jun 05 13:07:45 +0000 2020",
            "urltweet": "https://twitter.com/DavidBegnaud/status/1268716877355810818"
        },
        {
            "text": "BTW in the video of the Buffalo police almost killing a 75-year-old man, what is <a href=\"http://scripting.com/images/2020/06/05/copWithHugeLauncherOfSomeKind.png\">this police person</a> carrying? Looks like a machine gun.",
            "created": "Fri, 05 Jun 2020 14:21:49 GMT",
            "type": "outline"
        },
        {
            "text": "Have they found <a href=\"https://twitter.com/VicStoddard/status/1268620623489560576\">this guy</a> yet? I'd pay money to spit in his face.",
            "created": "Fri, 05 Jun 2020 14:56:05 GMT",
            "type": "outline"
        },
        {
            "text": "We live in a world where the \"tail wagging the dog\" has gotten completely out of control in every way imaginable.",
            "created": "Fri, 05 Jun 2020 15:26:49 GMT",
            "type": "outline"
        },
        {
            "text": "Listen to the critics",
            "created": "Fri, 05 Jun 2020 13:43:46 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Alan Kay <a href=\"https://www.fastcompany.com/40435064/what-alan-kay-thinks-about-the-iphone-and-technology-now#:~:text=Jobs%20always%20admired%20Kay%2C%20who,the%20Dynabook%20built%20in%20Cupertino.\">once said</a> the Macintosh is the first computer worth criticizing. Really eloquent, makes-you-stop-and-think type quote. ",
                    "created": "Fri, 05 Jun 2020 13:44:01 GMT",
                    "image": "http://scripting.com/images/2020/06/05/sneakers.png"
                },
                {
                    "text": "I was raised by parents who reacted as if criticism was an attack. If you don't deflect it, you will be hurt. They taught me that. I learned later in life that listening to criticism is the key to success. Alan Kay revealed a truth. We criticize something because we want it to be better. We are invested in it being better. Listen because you want to learn how to be better.",
                    "created": "Fri, 05 Jun 2020 13:55:05 GMT"
                },
                {
                    "text": "In software, we call such critiques <a href=\"http://scripting.com/stories/2010/06/30/writingGoodBugReports.html\">bug reports</a>.  Some problems only happen on the users' machines. Or you may have learned to not do something that they do because they never learned not to do it. Or they use features in a way you would never think to, that seem natural to them. Or they don't read the docs (and btw, neither do you). People see facets of your creation that you can't see because your point of view is different from theirs. If you want to improve, if you want to see things that are possible that are invisible to you, you must pay attention to criticism and brush aside the fear it invokes.",
                    "created": "Fri, 05 Jun 2020 13:46:06 GMT"
                }
            ]
        },
        {
            "text": "The NYT and criticism",
            "created": "Fri, 05 Jun 2020 13:57:59 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "In all mess around the Cotton op-ed -- to me, a lifetime reader, subscriber and former partner of the NY Times, someone with a complicated long-term relationship, the most important flaw in the pub that is its unwillingness to listen to criticism.",
                    "created": "Fri, 05 Jun 2020 13:48:07 GMT",
                    "image": "http://scripting.com/images/2020/05/29/train.png"
                },
                {
                    "text": "So there's a huge hole in the perception of the NY Times of the world it is contained in, the point of view of their community. What a loss, for all of us. We are smart, educated, thoughtful people. We, collectively, know and see far more than the people they employ. ",
                    "created": "Fri, 05 Jun 2020 13:48:49 GMT"
                },
                {
                    "text": "This has been the opportunity of blogging and news -- a way to tap the minds of the world in a way that supports journalism. An opportunity news people gave up on before they even understood that the net gave it a new life. ",
                    "created": "Fri, 05 Jun 2020 13:58:59 GMT"
                },
                {
                    "text": "We need journalism to be much smarter than it is. We know a free source of smarts. Use it. ",
                    "created": "Fri, 05 Jun 2020 13:50:21 GMT"
                },
                {
                    "text": "PS: Also we have <a href=\"http://scripting.com/2020/05/29.html#a135626\">more money for you</a> if you can listen. ",
                    "created": "Fri, 05 Jun 2020 13:59:58 GMT"
                }
            ]
        },
        {
            "text": "About points of view",
            "created": "Fri, 05 Jun 2020 14:38:34 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Men are never going to understand what it's like to be a woman."
                },
                {
                    "text": "White people are never going to understand what it's like to be black. "
                },
                {
                    "text": "But we can listen, empathize, and try to do what they ask us to do to help. That would be success imho."
                }
            ]
        }
    ]
}