{
    "text": "June 8",
    "created": "Mon, 08 Jun 2020 14:19:21 GMT",
    "name": "08",
    "subs": [
        {
            "text": "Mitt Romney, leading the Republican opposition.  ",
            "created": "Mon, 08 Jun 2020 20:39:23 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/06/08/romneyBlackLivesMatter.png"
        },
        {
            "text": "There was so much happening so quickly during the first days of the protests. I couldn't figure out what was going on in NYC. And that's just one city. <a href=\"https://www.nytimes.com/2020/06/08/podcasts/the-daily/police-brutality-protests.html\">This podcast</a> filled in some of the blanks, if you're confused I highly recommend it. It pays to watch <a href=\"https://en.wikipedia.org/wiki/The_Fog_of_War\">The Fog of War</a> every so often for a reminder of how confusing war is. In America, our military thought the Vietnam War was a <a href=\"https://en.wikipedia.org/wiki/Domino_theory\">war against communism</a>. On the other side it was a war for independence. We fought that war for years, at huge cost, and we didn't even agree on what the war was about. Think about that. ",
            "created": "Mon, 08 Jun 2020 20:10:07 GMT",
            "type": "outline"
        },
        {
            "text": "In a late night <a href=\"https://pressthink.org/2020/06/battleship-newspaper/\">blog post</a>, Jay Rosen tells the story of the editor in chief of the LA Times in the heyday of print news. He likens his publication to a huge battleship steaming along, and describes critics as swimmers throwing dead fish at the ship. Of no consequence. The ship will go where it wants to go, as fast as it cares to. Fast forward to the NY Times in 2020, being forced to listen to their reporters, a new class of critic. They say we might personally be hurt by this thing you did. And no one stops to notice that there are millions of other people who would be hurt, and the Constitution (which makes the idea of a news org possible), and a way of life. Not in <a href=\"https://mediagazer.com/200607/p6#a200607p6\">all the tweets</a>, op-eds, blog posts, no one sees the problem. In the analog of the LA Times editor, what matters is the ocean. Not the captain, or the deck hands, not the swimmers or the dead fish, or even the battleship. It everything. And that's what's so incomprehensible to an industry that has struggled to be blind to the people it's supposed to serve. Always inventing new distractions. Never showing up for the only job that matters, serving the people. ",
            "created": "Mon, 08 Jun 2020 14:19:22 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/09/21/goneWithTheWind.png"
        },
        {
            "text": "Have there been interviews with police, rank and file, saying why they support the officers caught on video torturing and killing American citizens? I'd like to hear, in clear language, the other side of this discussion. So far no one is speaking, as far as I know. ",
            "created": "Mon, 08 Jun 2020 15:26:49 GMT",
            "type": "tweet",
            "tweetId": "1270014592056463361",
            "tweetUserName": "davewiner"
        },
        {
            "text": "At Living Videotext, my first company, I used to pore over the regcards when they came back. After they were entered in the database they were cycled back to me a few months later, I would call a few and find out how they were doing with the product, and if they were really using it (I could tell) I'd ask what they wanted to see fixed or added. After a while there was a consensus, and they were usually the things I also wanted added or fixed (and they already had been, I was CEO and lead developer). I saw my job as using the product myself, and also listening to the other people who used it. Actually it was my favorite part of the job. :rocket:",
            "created": "Mon, 08 Jun 2020 15:55:37 GMT",
            "type": "outline"
        },
        {
            "text": "Medium has a <a href=\"http://scripting.com/images/2020/06/08/mediumHasAPaywall.png\">paywall</a>.",
            "created": "Mon, 08 Jun 2020 15:21:37 GMT",
            "type": "outline"
        }
    ]
}