{
    "text": "June 10",
    "created": "Wed, 10 Jun 2020 13:48:55 GMT",
    "name": "10",
    "subs": [
        {
            "text": "If you want to lead, you have to give away a lot of your ideas.",
            "created": "Wed, 10 Jun 2020 14:31:10 GMT",
            "type": "outline"
        },
        {
            "text": "If blogging didn’t exist we’d have to invent it.  “People writing what they know, fluidly, publicly, with an archive for the future.”  <a href=\"https://twitter.com/davewiner/status/1269645604159991808\">That’s it</a>. ",
            "created": "Wed, 10 Jun 2020 13:50:58 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1270781732313272320\">Poll</a>: The Repubs want to have a virus-free convention, no masks, no social distancing, the place packed with Trump supporters yelling <i>Lock Everybody Up Except Our Beloved Trump.</i> Now the question. Will this event actually happen?",
            "created": "Wed, 10 Jun 2020 18:17:14 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1270781732313272320"
        },
        {
            "text": "I still want an automatic blog indexer web app. I would pay you $50 a year to do this for my blog. Create a website that's organized like the <a href=\"http://scripting.com/images/2020/06/10/index.png\">index</a> in the back of a book. It digests my new stuff every day (or hourly, even better), and adds each item under topics in the index.<i> </i>I'd like to read everything I've written about the Voting Rights Act, for example, or Steve Jobs. But not as a search, as something I browse. Back when I used to read printed books, sometimes I'd spend hours reading a book via its index. A bootstrap. I'd love to help drive such a project. We need this. ",
            "created": "Wed, 10 Jun 2020 13:54:56 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/08/03/alice.png"
        },
        {
            "text": "I <a href=\"http://scripting.com/2020/04/08.html#a135424\">predicted</a> something like this. Yesterday at the supermarket, I glanced behind in the checkout line, saw a woman who had pulled her mask down. She seemed very naked, as if she had pulled her pants down and you could see everything. Sexual. Very forbidden. A month ago, it wouldn't have been a thing at all.",
            "created": "Wed, 10 Jun 2020 13:48:56 GMT",
            "type": "outline"
        },
        {
            "text": "Oy. I’ve been <a href=\"http://scripting.com/2017/06/06.html#a080649\">using</a> DuckDuckGo in my blog archive, thinking it’ll hold up better over time than Google searches, but I overlooked this, <a href=\"https://9to5mac.com/2020/06/08/apple-acquire-duckduckgo-analyst/\">Apple could buy them</a>, and I tend not to trust their links over the long haul. ",
            "created": "Wed, 10 Jun 2020 13:51:37 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/06/10/duckDuckLogo.png"
        },
        {
            "text": "One thing that's needed is a canonical place to point about news that isn't behind a paywall. I want to point to something definitive from my blog for Defund The Police. All that Google <a href=\"https://www.google.com/search?q=defund+the+police\">finds</a> are news articles on paywalled sites, or ones infused with spyware, or ones whose archives won't last.",
            "created": "Wed, 10 Jun 2020 14:11:19 GMT",
            "type": "outline"
        },
        {
            "text": "Yesterday I <a href=\"http://scripting.com/2020/06/09.html#a165548\">asked for tips</a> for patio lounge chairs. I got a lot of suggestions, but I should have been clear about what I want. Something that looks like this. ",
            "created": "Wed, 10 Jun 2020 14:33:19 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/06/10/patioLoungeChair.png"
        }
    ]
}