{
    "text": "June 15",
    "created": "Mon, 15 Jun 2020 13:11:01 GMT",
    "name": "15",
    "subs": [
        {
            "text": "I missed the anniversary again. <a href=\"http://scripting.com/2002/06.html#When:7:55:32AM\">18 years ago yesterday</a>, I quit smoking. The number of cigarettes I've had since, zero. Not one. Yet I still sometimes dream that I'm a smoker, buying packs of Marlboro Lights on the sly, feeling guilty that I'm lying to my friends when secretly I'm still a smoker. I quit smoking because the arteries on my heart were so clogged that they didn't work anymore. I had to get blood vessels from my legs and chest transplanted to bypass the blockages. These continue to work to this day, keeping me alive, riding my bike, writing software and blog posts that seem to make some people happy and piss other people off but are ignored by almost everyone. Makes sense. Anyway, I wrote <a href=\"http://scripting.com/2002/06.html#smoking\">something</a> on my blog a few days after I quit. \"I figured something out in the hospital. I'm the kind of person who likes to solve problems by smoking. How do I know this? Because every time my mind encounters a problem it says \"OK, I'll just have a cigarette then.\" I bet a lot of other cigarette smokers deal with problems the same way. Now that I don't smoke, I still have the idea that smoking will help me deal with problems. It's funny, one part of my brain has figured out that this is wrong (in fact smoking causes more problems than it solves) but a deeper part of my brain still believes it. This leads to some funny arguments inside my brain. But so far so good. I got to go through the worst of the withdrawal in a hospital where there was no possibility of smoking, and now the craving seems manageable. No doubt other people have smoking stories to tell. I was one of the lucky ones, I survived to tell my story. So far so good.\"",
            "created": "Mon, 15 Jun 2020 18:02:45 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/06/15/marlboroLights.png"
        },
        {
            "text": "This is the week <a href=\"http://scripting.com/2020/06/15/134950.html?title=whyThisIsTheWeekTrumpCrashesAndBurns\">when</a> it all falls apart for Trump.",
            "created": "Mon, 15 Jun 2020 13:12:45 GMT",
            "type": "outline"
        },
        {
            "text": "A <a href=\"http://scripting.com/2020/06/15/foreverAndPagepark.m4a\">podcast</a> about how I merged \"PagePark\" with <a href=\"https://www.npmjs.com/package/forever-monitor\">Forever</a>. A few weeks ago I did a podcast where I explained how the pieces <a href=\"http://scripting.com/2020/06/01.html#a204659\">came together</a> for Frontier in the late 80s and early 90s. I was thinking about that then because a similar thing was happening with PagePark and Forever. I was putting the two together and had an aha moment where the pieces snapped together. PagePark has a very simple idea of what a website is, it's a sub-folder of the <i>domains</i> folder. The name of the sub-folder is the domain that maps to that content. The aha was realizing that you could also put a Node app, to be managed by Forever, which is a package you can integrate into an app, in one of those folders too. Not only did it work at a technical level, but it also provides Frontier-like integration. It's very nice. I've been managing apps in this little world for a couple of weeks now. ",
            "created": "Mon, 15 Jun 2020 15:27:25 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2020/06/15/foreverAndPagepark.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "8963938"
        },
        {
            "text": "A random <a href=\"http://scripting.com/images/2020/06/15/ppCommandLineScreenShot.png\">screen shot</a> for docs I'm writing. This is what a table for the <a href=\"https://github.com/scripting/pagePark/tree/master/cli\">command line tool</a> I wrote for PagePark displays. It's equivalent to the table that Forever displays at the command line. ",
            "created": "Mon, 15 Jun 2020 20:46:51 GMT",
            "type": "outline"
        },
        {
            "text": "I read that <a href=\"https://www.zdnet.com/article/github-to-replace-master-with-alternative-term-to-avoid-slavery-references/\">GitHub</a> is going to get rid of the concept of master for repositories because it's a reference to slavery. According to their <a href=\"https://guides.github.com/activities/hello-world/\">docs</a>, \"By default your repository has one branch named <i>master</i> which is considered to be the definitive branch.\" A search of <a href=\"https://www.google.com/search?q=site%3Agithub.com+master\">github.com</a> finds a lot of uses of the word master. And in the rest of the world, there are master bedrooms and master's degrees. Courts appoint special masters. There are a lot of <a href=\"http://thesaurus.land/?word=master\">synonyms</a> in the thesaurus. ",
            "created": "Mon, 15 Jun 2020 13:19:57 GMT",
            "type": "outline"
        },
        {
            "text": "The <a href=\"https://github.com/scripting/Scripting-News/issues/177\">consensus</a> from yesterday's <a href=\"http://scripting.com/2020/06/14/144017.html?title=javascriptPromisesVsCallbacks\">query</a> is that adding promises to JavaScript wasn't much of a gain. Some people find promises more readable. There are some problems that are unwieldy with callbacks that are simpler with promises. There are already packages that have cast aside callbacks and only use promises in their APIs. If I need to use those packages <a href=\"https://github.com/scripting/Scripting-News/issues/177#issuecomment-643828855\">I will use</a> their promises-based API. No choice. My two cents. I wouldn't have supported this addition to the language. I much prefer tech that adds functionality in a clear understandable way. I would prefer if we could put our effort into (for example) making Dropbox work on Linux. Everywhere you look systems we depend on are in disrepair. It's like the way NYC worked when I was in high school. Burned out neighborhoods that people still live in. At some point you have to start thinking about the size and shape of the community you're serving and focus on making the language work better, not making it more complex. I still think there should be a JavaScript option to bury the synchronization functionality in the runtime, and let people write code in the natural way they do in pretty much every other language. Why JavaScript is different is something I've never heard a good answer to.",
            "created": "Mon, 15 Jun 2020 13:29:40 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/10/05/goldenGirlActionFigure.png"
        },
        {
            "text": "I ran out of of the ramen I stocked up on at the <a href=\"http://scripting.com/2020/04/05.html#a174159\">beginning</a> of the pandemic.",
            "created": "Mon, 15 Jun 2020 13:11:02 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/04/05/ramen.png"
        },
        {
            "text": "Why this is the week Trump crashes and burns",
            "created": "Mon, 15 Jun 2020 13:49:50 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2020/06/01/lightsOffWhiteHouse.png",
            "description": "By the end of this week there will be a consensus that Trump is no longer our biggest problem.",
            "subs": [
                {
                    "text": "Three things are going to happen this week. ",
                    "created": "Mon, 15 Jun 2020 13:49:58 GMT",
                    "flNumberedSubs": "true",
                    "subs": [
                        {
                            "text": "The rate of hospitalization will explode in red states. ",
                            "created": "Mon, 15 Jun 2020 13:50:02 GMT"
                        },
                        {
                            "text": "The stock market continues to crash.",
                            "created": "Mon, 15 Jun 2020 13:50:04 GMT"
                        },
                        {
                            "text": "Trump's rally in Tulsa is cancelled, or worse is a washout. ",
                            "created": "Mon, 15 Jun 2020 13:51:37 GMT"
                        }
                    ]
                },
                {
                    "text": "He threw a ridiculous and unnecessary <a href=\"https://en.wikipedia.org/wiki/Hail_Mary_pass\">Hail Mary pass</a> that could only have worked if the virus was done with us.",
                    "created": "Mon, 15 Jun 2020 13:52:20 GMT"
                },
                {
                    "text": "It's going to sink in with many more people, even some MAGAs, that we're going to hit this wall again and again until we hunker down and wait for the vaccine. Eventually everyone will understand this. And the market will crash more. A new lifestyle will take over the US as we transition into something less than a First World country.",
                    "created": "Mon, 15 Jun 2020 13:52:21 GMT"
                },
                {
                    "text": "And by the end of this week there will be a consensus that Trump is no longer our biggest problem. We're already well on the way there.",
                    "created": "Mon, 15 Jun 2020 14:00:40 GMT"
                }
            ]
        }
    ]
}