{
    "text": "June 22",
    "created": "Mon, 22 Jun 2020 12:40:28 GMT",
    "name": "22",
    "subs": [
        {
            "text": "<a href=\"https://github.com/foreversd/forever-monitor/issues/190\">Braintrust query</a>: I'm trying to catch the error in a Forever-managed app that caused it to restart. The error shows up when the app is run on its own. I want the same info when Forever is running it.",
            "created": "Mon, 22 Jun 2020 17:33:05 GMT",
            "type": "outline"
        },
        {
            "text": "Yesterday I <a href=\"http://scripting.com/2020/06/21.html#a161133\">linked</a> to a Joni Mitchell song, <a href=\"https://genius.com/Annie-ross-twisted-lyrics\">Twisted</a> -- not knowing it was a cover for a <a href=\"https://www.youtube.com/watch?v=l6OYSDYuvoA\">song</a> written by <a href=\"https://en.wikipedia.org/wiki/Annie_Ross\">Annie Ross</a>. A reader, <a href=\"https://twitter.com/pirx2691\">Richie B</a>, sent me a link, and I like <a href=\"https://www.youtube.com/watch?v=l6OYSDYuvoA\">this version</a> even better. Very sweet, jazzy. :boom:",
            "created": "Mon, 22 Jun 2020 12:40:29 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=l6OYSDYuvoA"
        },
        {
            "text": "I asked a friend who’s Jewish, as am I, how he’d feel if a statue of Hitler was in the middle of his town. He said it’s different. It’s not. Imagine, after surviving the war, getting your freedom, the people you lived with, who controlled the town you live in, celebrated your enslavers. ",
            "created": "Mon, 22 Jun 2020 12:51:37 GMT",
            "type": "outline"
        },
        {
            "text": "The people who flirt with <a href=\"https://en.wikipedia.org/wiki/Ku_Klux_Klan\">KKK</a> tactics, use the intimidation of <a href=\"https://en.wikipedia.org/wiki/Jim_Crow_laws\">Jim Crow</a>, we can’t cleanse their minds, but we can force them back into the shadows. Blacks are every bit as American as any of us. Stop worrying about the feelings of the evil people, start caring for their victims.",
            "created": "Mon, 22 Jun 2020 13:05:49 GMT",
            "type": "outline"
        },
        {
            "text": "My friend <a href=\"https://twitter.com/enochchoi?lang=en\">Enoch Choi</a>, a brave doctor who risks his life to save people all over the world, reminds us that racist terms like Kung Flu, coming from the filthy mouth of our president, give permission to evil people among us to target Asian Americans. Unacceptable.",
            "created": "Mon, 22 Jun 2020 12:52:39 GMT",
            "type": "outline"
        },
        {
            "text": "Today is WWDC day, and announcements from Apple. My longtime friend <a href=\"https://twitter.com/TheScottLove/status/1274898149161578504\">Scott Love</a> says Apple should focus on the user experience. I say it's even more basic. What matters to me is how broken everything is. Every day it seems my flow is stopped because I have to find a way around something someone broke that broke something else. Stop deprecating, stop changing, let’s spend a decade fixing breakage.",
            "created": "Mon, 22 Jun 2020 12:53:33 GMT",
            "type": "outline"
        },
        {
            "text": "The N-word",
            "created": "Mon, 22 Jun 2020 14:02:20 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2020/06/22/chappelle.png",
            "subs": [
                {
                    "text": "I watched a Dave Chappelle concert last night on Netflix. Great stuff. But. He says the N-word over and over. Even to talk about white people. It gets imprinted in your mind, that's just a fact. ",
                    "created": "Mon, 22 Jun 2020 14:02:23 GMT"
                },
                {
                    "text": "Another example, after watching The Wire, my brain starts using the N-word all the time as my mind drifts. God forbid the word should ever come out of my actual mouth. Someday it will and I will get excoriated. ",
                    "created": "Mon, 22 Jun 2020 14:02:34 GMT"
                },
                {
                    "text": "So maybe our black bros (another word DC uses a lot) could take this into account and maybe not use it so much, at least when the audience has a lot of white people in it. Just sayin. ",
                    "created": "Mon, 22 Jun 2020 14:02:41 GMT"
                }
            ]
        },
        {
            "text": "The weight of the world",
            "created": "Mon, 22 Jun 2020 13:53:12 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2020/06/22/trumpTired.png",
            "description": "This is how a president should look.",
            "subs": [
                {
                    "text": "This is how a president should look. With the weight of the world on his shoulders.  Finally, perhaps, it has dawned on him that he can't bluff his way out of this one. The virus doesn't intimidate. ",
                    "created": "Mon, 22 Jun 2020 13:53:25 GMT"
                },
                {
                    "text": "This is how a president should look. ",
                    "created": "Mon, 22 Jun 2020 13:50:47 GMT",
                    "inlineImage": "http://scripting.com/images/2020/06/22/trumpTired.png"
                }
            ]
        }
    ]
}