{
    "text": "June 29",
    "created": "Mon, 29 Jun 2020 13:57:17 GMT",
    "name": "29",
    "subs": [
        {
            "text": "Today's song: <a href=\"https://www.youtube.com/watch?v=c4KFf4J64nc\">The Good Thing</a> by the Talking Heads. ",
            "created": "Mon, 29 Jun 2020 14:33:35 GMT",
            "type": "outline"
        },
        {
            "text": "In October of last year, before impeachment, I proposed a <a href=\"http://scripting.com/2019/10/21/140215.html\">permanent citizen's occupation of DC</a>. 100K people constantly in protest in DC, rain or shine, 365 days a year, until Trump is gone. On a rotating basis. No one signs up for more than one day. Never more than 100K. Keep a constant presence there for the Democrats and Republicans to remember. To be in the way. To be loud and obnoxious. To help them remember who they work for. ",
            "created": "Mon, 29 Jun 2020 15:07:22 GMT",
            "type": "outline"
        },
        {
            "text": "Not wearing a mask is like not wearing pants.",
            "created": "Mon, 29 Jun 2020 15:38:44 GMT",
            "type": "outline"
        },
        {
            "text": "Is anyone but John Oliver talking about the <a href=\"https://www.youtube.com/watch?v=R652nwUcJRA\">eviction crisis</a>?",
            "created": "Tue, 30 Jun 2020 00:45:39 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=R652nwUcJRA"
        },
        {
            "text": "I try to keep focused on the bigger picture, and let the small stuff be background noise.",
            "created": "Mon, 29 Jun 2020 15:12:38 GMT",
            "type": "outline"
        },
        {
            "text": "People who love <a href=\"http://outliners.com/\">outliners</a>, esp <a href=\"http://outliners.scripting.com/more30.html\">MORE</a> from 30 years ago on the Mac, we could have an outliner renaissance on the web, now. I have a great <a href=\"http://littleoutliner.com/\">lab</a> for development, and the core outliner in JavaScript is <a href=\"https://github.com/scripting/concord\">open source</a>. I've always felt every app should have a nice outliner built-in. <i>Let's have fun!</i>",
            "created": "Mon, 29 Jun 2020 14:40:24 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/06/29/chevyTruck.png"
        },
        {
            "text": "Thanks to <a href=\"https://twitter.com/gruber/status/1277329886080905219\">Gruber</a>, there's renewed interest in \"Little Outliner\". I'd love to have an excuse to work more on its evolution. I have a series of steps in mind, but not enough of a user base to do it with. Gruber would be an excellent user to help drive development. Note that I did a fair amount of <a href=\"http://this.how/littleoutliner/versions.opml#1580502471000\">work</a> on it earlier this year, adding a <a href=\"http://this.how/littleoutliner/versions.opml#1582640454000\">feature</a> that I use every day, to grab all my tweets from the previous day. It's turned Twitter into a blogging tool for me, believe it or not. Pretty cool. ",
            "created": "Mon, 29 Jun 2020 14:08:38 GMT",
            "type": "outline"
        },
        {
            "text": "BTW I should add a feature to \"LO2\" that makes it possible for me to send the URL of an OPML file in a link and have it open in LO2. Might help people get the idea of what an outliner is. Heh. After I finish with Radio3. This is what I <a href=\"http://scripting.com/images/2020/06/29/sexy.png\">mean</a> by \"sexier and speculative\" ideas. :boom:",
            "created": "Mon, 29 Jun 2020 14:17:14 GMT",
            "type": "outline"
        },
        {
            "text": "Why work on \"Radio3\" now? I've had it on my list for a long time. It's long overdue for an overhaul. I wrote it when I was new to JavaScript and didn't really understand the rules, it's a weird language and the browser is a very weird runtime environment. But I always seem to find something sexier and more speculative to work on. Programmers notoriously hate to clean up their messes. I'm no different. Then I had a <a href=\"https://www.urbandictionary.com/define.php?term=come-to-Jesus%20moment\">Come to Jesus</a> moment. I use Radio3 all day every day. I use it on my iPad and iPhone as well as my desktop. It does a lot of my Twitter posts, it's the <a href=\"http://scripting.com/?tab=links\">Links tab</a> on scripting.com, and the links section of the <a href=\"http://scripting.com/email/\">nightly email</a>. It's an important piece of software. Staring me right in the face. Improving it could make everything better. And making it easier to work on the code means I could add improvements in the future. ",
            "created": "Mon, 29 Jun 2020 13:57:18 GMT",
            "type": "outline"
        },
        {
            "text": "Reading tea leaves",
            "created": "Tue, 30 Jun 2020 00:37:44 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Reading tea leaves and being a basically positive person, even when it might not make sense, I think what happened with Pence and masks is that the Repubs in the Senate are shitting their pants over the virus, and said to Trump you can keep trying to stoke race hate if you want, but Pence has to take over the virus and start actually trying to fight it and support the states, and stop undermining Repub governors. Trump said \"Whatever\" and Pence started, slowly, trying to do this job. Meanwhile get Governor Cuomo in there as a Guest President, and he can run the US effort against the virus, on loan from the Democratic Party. That would probably work, and if presented the right way Trump would probably be okay with it as long as he doesn't go to jail.",
                    "created": "Tue, 30 Jun 2020 00:37:55 GMT",
                    "image": "http://scripting.com/images/2020/06/29/alice.png"
                }
            ]
        }
    ]
}