{
    "text": "ChatGPT supports Amazon better than Amazon",
    "created": "Sun, 30 Jun 2024 21:55:14 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "<a href=\"https://www.google.com/search?q=site%3Ascripting.com+ChatGPT\">ChatGPT</a> provides better support for other people's products than they do. For example, I signed up for a trial subscription to <a href=\"https://www.britbox.com/\">BritBox</a> on Amazon Prime, and a few days later decided I didn't want to continue. Amazon is famous for having terrible docs, in every part of the system. They made it basically impossible for me to quickly find the place where you unsubscribe. Okay so I asked ChatGPT and it knew how to do it, and I was unsubscribed in a few seconds. This feature pays for the whole $20 this month, everything else is a bonus. ",
            "created": "Sun, 30 Jun 2024 21:48:54 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Another example. Something seemed screwed up in <a href=\"https://www.google.com/search?q=site%3Ascripting.com+caddy\">Caddy</a>, a wonderful product, makes it super easy to support HTTPS. But the docs were written by programmers, and thus lack a user's perspective. Pretty common thing, and hard to avoid. So I asked ChatGPT questions to help me dig into the problem. It's annoyingly overly verbose, it answers questions I didn't ask, and thus wastes time, but -- in about ten minutes it put something on a checklist which turned out to be the problem. It's hard to debug a system problem you weren't expecting to have. The robot doesn't need to have its memory refreshed, unlike my 69-year-old human brain. ",
            "created": "Sun, 30 Jun 2024 21:56:30 GMT",
            "image": "https://imgs.scripting.com/2024/06/30/closeYourEyesAndIllKissYou.png",
            "flInCalendar": true
        },
        {
            "text": "When I write these little stories I hope to counter the fear hype out there, because ChatGPT is an amazingly useful breakthrough product. I'm always finding new incredible uses for it. Products like this come along at most every twenty years or so. I've created some good software in my life, but nothing like this. This is like the Beatles or the web. It's that difference-making. ",
            "created": "Sun, 30 Jun 2024 21:58:19 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}