{
    "text": "December 2",
    "created": "Wed, 02 Dec 2020 15:54:58 GMT",
    "type": "calendarDay",
    "name": "02",
    "subs": [
        {
            "text": "I rearranged my office a few weeks ago so now I have room for a second monitor on my desk, something I had gotten accustomed to when I lived in Manhattan. But when I set up the second monitor, a <a href=\"https://www.amazon.com/gp/product/B00IZBIMLK/ref=ppx_yo_dt_b_search_asin_title?ie=UTF8&psc=1\">BenQ</a>, it was depressingly ugly. The text was fuzzy, the color was impossible to get right. On Cyber Monday, on Amazon, I spotted a deal for an <a href=\"https://www.amazon.com/gp/product/B0199W9UMS/ref=ppx_yo_dt_b_asin_title_o03_s00?ie=UTF8&psc=1\">HP montitor</a>, the same size, 27 inch, for $170. It arrived yesterday and I set it up this morning, and what a difference! It's a pleasure to look over to the left and see the readout windows I leave over there. Night and day difference. ",
            "created": "Wed, 02 Dec 2020 16:00:59 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/12/02/monitor.png",
            "flInCalendar": true
        },
        {
            "text": "If journalism is supposedly how we save democracy then I guess journalism isn't doing a great job. In other words, when you hear that hype, go through it. If I sold you a laundry detergent that gets out stains, you'd be right to ask if it actually gets out stains. ",
            "created": "Wed, 02 Dec 2020 21:06:28 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"http://scripting.com/images/2020/12/02/cokeAd.png\">This was the ad Coke had to run</a> after the <a href=\"https://en.wikipedia.org/wiki/New_Coke\">New Coke</a> debacle. It's almost an apology. It certainly is a retraction. Clever. Not enough to erase the scar on the revered brand, which is still there 30-plus years later.",
            "created": "Wed, 02 Dec 2020 22:43:27 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Our political system was hacked in 2016. The hackers got in and were running the show for four years. They installed all kinds of new back doors. So even when we close the front door (took us long enough!) and removed the old bug-infested OS, we are still hacked, and, in uncountable and many as-yet-to-be known ways. ",
            "created": "Wed, 02 Dec 2020 15:54:59 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "HBO Max is a historic mess",
            "created": "Wed, 02 Dec 2020 21:16:04 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I don't know what HBO Max is. I also don't know what HBO Go or HBO Now was. I do remember HBO. I started subscribing in the late 70s, when I was a grad student. It was a miracle. Home Box Office. First-run movies just after they finished in theaters. No commercials. Uncensored. The really good stuff. Much later they started producing their own shows, but for many years it was just movies. And it was great. Before that home entertainment was so awful, but we didn't know, until HBO showed us how it should really work.",
                    "created": "Wed, 02 Dec 2020 21:16:20 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Anyway, for a long time I got HBO with my cable subscription, until earlier this year I decided to <a href=\"https://www.cnet.com/how-to/how-to-cut-the-cable-tv-cord-in-2020/\">cut the cord</a>, and around the same time HBO cut the cord with Roku, the company that makes the operating system that my TV runs on, and at the same time introduced HBO Max and discontinued HBO Now and HBO Go. ",
                    "created": "Wed, 02 Dec 2020 21:17:50 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "So no more HBO for Davey. I missed it. I tried buying in as part of Hulu, but I didn't like that. HBO is its own thing, not something I want mixed in with all of Hulu's stuff. It would be like having to go through a minor cola brand to get a Coke. There's this institution called HBO. It's like the Statue of Liberty or the Eifel Tower, it's grand and revered, it's <i>not</i> something to be folded in with Hulu, which is great too, but it's just nowhere near the stature of HBO.",
                    "created": "Wed, 02 Dec 2020 21:35:27 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Then I saw something somewhere that maybe HBO and Roku are sort of getting it together, and I checked and lo and behold I can subscribe to HBO using the same HBO app that I love, not Go, Now, Pro or Max, just HBO. Maybe they've come to their senses! Okay, no Max but who cares, I never understood what it was anyway (probably because I don't care). Only when I tried to use it on my iPad, it wouldn't accept my login. It said something incomprehensible. I'll let you see if <a href=\"http://scripting.com/images/2020/12/02/hboerror.png\">you can decipher it</a>. ",
                    "created": "Wed, 02 Dec 2020 21:21:59 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "So I posted something <a href=\"https://twitter.com/davewiner/status/1333920269140889601\">on Twitter</a>, and they responded, I gave them the info and they did something no company should ever do, they told me to talk to Roku. ",
                    "created": "Wed, 02 Dec 2020 21:25:39 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "<i>HBO can't help you watch HBO. See if Roku cares. </i>",
                    "created": "Wed, 02 Dec 2020 21:28:09 GMT",
                    "inlineImage": "http://scripting.com/images/2020/12/02/hboCantHelp.png",
                    "flInCalendar": true
                },
                {
                    "text": "I get it. <a href=\"https://www.theverge.com/2019/3/4/18250075/att-restructures-warnermedia-hbo-turner-streaming\">A really shitty company</a> bought HBO, and they're remarketing it, and in doing so, taking something that once was grand and superior, above the fray, beyond reproach, the gold standard of quality and turning it into schlock and schmutz, a schmatte. We're watching a great brand slowly and deliberately dismantle itself. ",
                    "created": "Wed, 02 Dec 2020 22:34:30 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "One more thing. They should get rid of the Max stuff. Just plain old HBO was great. I don't understand what's so max about it. Maybe it would be better to call it HBO Mess. :boom:",
                    "created": "Wed, 02 Dec 2020 23:12:00 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}