{
    "text": "December 3",
    "created": "Thu, 03 Dec 2020 14:20:11 GMT",
    "type": "calendarDay",
    "name": "03",
    "subs": [
        {
            "text": "Tonight’s <a href=\"https://twitter.com/maddow\">Maddow</a> says clearly we‘re going over a cliff in the next weeks. If true, one way to save lives is for NBC and other networks to control the seasonal commercials they run, ones that show families gathering pre-Covid style. <a href=\"https://www.youtube.com/watch?v=LS8npcVD4Ik\">Example</a>. Commercials set the mood, everyone knows what Christmas season is, but this year has to be different or lots more people will suffer and die. I had this thought while watching her sobering presentation, followed by one of these feel-good everything's normal holiday commercials. ",
            "created": "Fri, 04 Dec 2020 03:26:51 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=LS8npcVD4Ik",
            "image": "http://scripting.com/images/2020/12/03/covidVaccineCandidate.png",
            "flInCalendar": true
        },
        {
            "text": "I like watching <a href=\"https://twitter.com/maddow\">Maddow</a>, but every once in a while, usually when she talks about Facebook, I am reminded that she can be as mean-spirited and dishonest as any Fox host, Hannity, Carlson or Ingraham. An example from last night. Trump recorded an unhinged video that they distributed via Facebook. Something anyone can do. You can, I can, anyone. This feature has been used in some amazing ways. A woman recorded her boyfriend being <a href=\"https://en.wikipedia.org/wiki/Shooting_of_Philando_Castile\">murdered by police</a> in Minneapolis using Facebook's live video. It was <a href=\"http://scripting.com/2016/07/10/1368.html\">remarkable</a> and I think even a journalist Facebook-hater would have to admit, revolutionary. The whole point of <i>everything</i> on Facebook is that <i>anyone</i> can do it. What Maddow said: \"Facebook would run it.\" Technically true, but irresponsibly misleading. She repeated it as she often does, with pauses and a look that was withering in contempt for Facebook. Her implication was that Fox wouldn't run it, Newsmax wouldn't run it, but Facebook, super slime that they are, would. There's an honest way to explore this, the way she does with other things she isn't expert on, have a discussion one night the tradeoffs of allowing anyone to post live video. But -- I what I really resent is that Maddow, who I want to believe is doing the best she can, in this case is misusing that trust and it makes me doubt the stuff she reports where I don't know enough to see through the bullshit. ",
            "created": "Fri, 04 Dec 2020 03:31:48 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I've been working on Categories lately, and referred to [%search: Radio UserLand%] for <a href=\"http://essaysfromexodus.scripting.com/priorArtDesignMethod\">prior art</a>. Radio's blogging functionality supported categories. Here's a <a href=\"http://static.userland.com/rack1/images/radiodiscuss/radioCategories.jpg\">screen shot</a>. Radio shipped in 2002, when blogs were still called \"weblogs.\"",
            "created": "Thu, 03 Dec 2020 22:57:21 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "For a simple gift for a friend with a taste for spice, try these <a href=\"https://www.amazon.com/gp/product/B001EO5YTS/ref=ppx_od_dt_b_asin_title_s01?ie=UTF8&psc=1\">spicy Wasabi Peas</a>. I can go through a whole can in one sitting! ",
            "created": "Thu, 03 Dec 2020 14:34:19 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Our collective approach to the pandemic is very weird. ",
            "created": "Thu, 03 Dec 2020 15:51:26 GMT",
            "type": "tweet",
            "tweetId": "1334525711852433408",
            "tweetUserName": "davewiner",
            "flInCalendar": true
        },
        {
            "text": "I need to buy new silverware, everyday stuff, nothing fancy. I've bought two sets from Amazon in the last few weeks, and both were too flimsy to use. They'd never stand up. All I want is some unbendable functional silverware. (Lots of great advice over <a href=\"https://twitter.com/davewiner/status/1334503052410314756?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1334503052410314756%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=http%3A%2F%2Fscripting.com%2F\">on Twitter</a>.)",
            "created": "Thu, 03 Dec 2020 14:20:12 GMT",
            "type": "tweet",
            "tweetId": "1334503052410314756",
            "tweetUserName": "davewiner",
            "flInCalendar": true
        },
        {
            "text": "A nightmarish thought. The next president is not Nikki Haley, Tom Cotton, Ted Cruz, Marco Rubio or Mike Pence. It's this. ",
            "created": "Thu, 03 Dec 2020 15:59:31 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/12/03/nextPresidentOhShit.png",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}