{
    "text": "December 9",
    "created": "Wed, 09 Dec 2020 15:17:06 GMT",
    "type": "calendarDay",
    "name": "09",
    "subs": [
        {
            "text": "BTW, yesterday <a href=\"https://twitter.com/jack\">Jack Dorsey</a> liked <a href=\"https://twitter.com/davewiner/status/1336423955826143235\">one of my tweets</a>. Not quite a RT, that would have been amazing, but in Silicon Valley I bet it's a funding event. People used to say that about [%search: John Doerr%]. If you ran into him at <a href=\"https://www.robertsmarket.com/\">Robert's</a> or <a href=\"https://www.paloaltoonline.com/blogs/p/2020/08/03/bucks-will-never-die-after-29-years-owner-passes-longtime-woodside-favorite-to-his-sons\">Buck's</a>, people would talk about it. It was a <a href=\"https://twitter.com/davewiner/status/1336423955826143235\">good tweet</a> for Jack to call attention to. ",
            "created": "Wed, 09 Dec 2020 17:32:01 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Sooo, the Dems are horrible at communicating with the people. You'd think that would be something a political party would be <i>great</i> at. But most Dems suck, even Obama, and definitely Clinton, going all the way back to Dukakis, which was the first presidential campaign I tried to give a free idea to (and a good one it was, in hindsight). Al Sharpton is great, as is Mayor Pete, and of course they're shipping him off to China. See how <i>ridiculous</i> they are. Oy!",
            "created": "Thu, 10 Dec 2020 14:42:27 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1336471655783292928\">Why didn’t Firefox</a> implement an identity system baked into their browser. Let devs build apps with that identity. Missed opportunity imho. [Turns out <a href=\"https://twitter.com/edtechfactotum/status/1336473821516218368\">they did</a>, but they never deployed it. The whole point is deploying! It's like the <a href=\"https://www.youtube.com/watch?v=2yfXgu37iyI\">Doomsday Machine</a> in Dr Strangelove.]",
            "created": "Wed, 09 Dec 2020 17:36:45 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Noteworthy: Scroll, which I <a href=\"http://scripting.com/2020/02/17/150159.html?title=whatIsScroll\">reviewed</a> in February, has gotten <a href=\"https://twitter.com/davewiner/status/1336448166636494850\">McClatchy to trust them</a>. As I said then, it's a big chicken and egg thing. Once the pubs sign on, they will be gold, we need Scroll to succeed. Well they scored with a big publisher. Good for them, and maybe good for us (people who want to be able to read everything on the web, without subscribing to every publication with a paywall, which is obviously not possible). ",
            "created": "Wed, 09 Dec 2020 17:37:18 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Google changed the icon for Chrome? It's as stupid a thing to do as a cigarette maker changing the taste or packaging of their product. It's an addiction you don't even know you have until they <i>make</i> you conscious of it. Going to the web is programmed so deep into my neurons, it's at the base of my spine, a total reflexive thing, addict behavior. Now I think about it every damn time. And the <a href=\"http://scripting.com/images/2020/12/09/iconbar.png\">Safari icon is next to it</a>, and btw it <i>hasn't</i> changed. Which browser you use is something they want you not to think about, as long as it's their browser. Maybe it's a bug, in which case never mind. But if it was deliberate, it's a stupid move. Read [%search: Positioning%] for the importance of what's in peoples' minds. ",
            "created": "Wed, 09 Dec 2020 17:19:47 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/12/09/chromeIcon.png",
            "flInCalendar": true
        },
        {
            "text": "I got some <a href=\"https://www.amazon.com/gp/product/B07PYMWPFH/ref=ppx_yo_dt_b_asin_title_o01_s00?ie=UTF8&psc=1\">headlamps</a>, very nice to have. Esp for taking out the garbage at night. You can carry all the bags and still see where you're going. One special feature is that the spy cam can't see your face, as <a href=\"https://www.youtube.com/watch?v=stQIznrn-1E\">illustrated in this video</a>.",
            "created": "Wed, 09 Dec 2020 15:17:07 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=stQIznrn-1E",
            "flInCalendar": true
        },
        {
            "text": "Apple zealots suck",
            "created": "Wed, 09 Dec 2020 18:19:25 GMT",
            "type": "outline",
            "description": "Headphones and iPhones aren't sex toys or drugs. They're products. They're good products, but they also suck like all products do. ",
            "metaImage": "http://scripting.com/images/2020/12/09/jobs.png",
            "subs": [
                {
                    "text": "I have a very pragmatic problem with the religious zeal people have for Apple products. I can't tell when I should take their advice if they always gush about everything. ",
                    "created": "Wed, 09 Dec 2020 18:19:35 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Two recent examples. ",
                    "created": "Wed, 09 Dec 2020 18:19:48 GMT",
                    "flNumberedSubs": "true",
                    "subs": [
                        {
                            "text": "A friend, a VC, told me that the XS Max was totally worth the $1500. So I got one. No way it was worth that. I replaced it this year with a new SE for $350, and I love it, actually more than the XS Max because it's only $350. I'm cheap that way.",
                            "created": "Wed, 09 Dec 2020 18:19:46 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Another friend told me last month I had to get the new earpods. $250. A little steep, but the way he was talking, it sounded like Moses had come down from the mountain with the secret to human happiness, and I could get it for only $250. So I did it, on an impulse. Well, they're nice enough, but there's absolutely nothing special about them. I like my <a href=\"https://www.amazon.com/Sony-WH-1000XM4-Canceling-Headphones-phone-call/dp/B0863TXGM3/ref=sr_1_1_sspa?dchild=1&keywords=WH-1000XM4+Wireless+Noise-Canceling+Headphones&qid=1607538440&sr=8-1-spons&psc=1&spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUEyVEtROTdWUkwwVVExJmVuY3J5cHRlZElkPUExMDEwMDc3MjJONDJPRklMN0dBMSZlbmNyeXB0ZWRBZElkPUEwODA4MjY1MjVEWVdBQ1VSVDBXNCZ3aWRnZXROYW1lPXNwX2F0ZiZhY3Rpb249Y2xpY2tSZWRpcmVjdCZkb05vdExvZ0NsaWNrPXRydWU=\">Sony overear headphones</a> better (almost exactly the same price, btw). I buy headphones on a whim, so I know what's good. These are ok, but didn't not deserve the review they got. ",
                            "created": "Wed, 09 Dec 2020 18:19:47 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "So all this ends up backfiring for people who want to help Apple sell product, which btw, I'm happy about since I bought Apple shares in 1997, and have watched them make me rich,. But as a user, I am offended by the way people go on and on about such bullshit. Headphones and iPhones aren't sex toys or drugs. They're products. They're good products, but they also suck like all products do. ",
                    "created": "Wed, 09 Dec 2020 18:21:21 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}