{
    "text": "December 13",
    "created": "Sun, 13 Dec 2020 16:39:10 GMT",
    "type": "calendarDay",
    "name": "13",
    "subs": [
        {
            "text": "On this day last year: <a href=\"http://scripting.com/2019/12/13/135739.html?title=theFormerUnitedStates\">The former United States</a>. ",
            "created": "Mon, 14 Dec 2020 02:14:06 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I'm working my way through <a href=\"https://en.wikipedia.org/wiki/Better_Things_(TV_series)\">Better Things</a>, just got to the episode where <a href=\"https://en.wikipedia.org/wiki/Randy_Rainbow\">Randy Rainbow</a> guest stars. He plays a serious role, and <a href=\"https://www.youtube.com/watch?v=nbLIYEXqWeA\">sings a song</a> that's so incredibly sweet. Viewing young love forty years later. I'm there right now. Remembering the women I've loved. And how ineptly I did that when I was young, but I really felt it and still do. ",
            "created": "Mon, 14 Dec 2020 02:41:29 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=nbLIYEXqWeA",
            "flInCalendar": true
        },
        {
            "text": "BTW, don't forget, just because Trump lost the election doesn't mean he isn't still playing his game. Control the story to draw our attention from where the real action is. This time it's pretty obvious that his Russian owners are <a href=\"https://www.memeorandum.com/201213/p71#a201213p71\">hacking the shit</a> out of the <a href=\"https://www.nytimes.com/2020/12/13/us/politics/russian-hackers-us-government-treasury-commerce.html\">US government</a>. That's going to have some serious consequences. You know what Trump says. \"They just let you do it.\" That's <a href=\"https://www.youtube.com/watch?v=HxFF6eKrH4s\">us</a>. ",
            "created": "Mon, 14 Dec 2020 02:15:35 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/07/01/orangeBlob.png",
            "flInCalendar": true
        },
        {
            "text": "Why didn't the Supreme Court do more? As keepers of the Constitution do they have to wait until they're asked a question. Couldn't they ask us a question -- The Constitution provides for a criminal president like Trump. Why isn't the country using it?",
            "created": "Mon, 14 Dec 2020 00:07:06 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "If you were wondering, I’m not rooting for the <a href=\"https://nypost.com/2020/12/11/nets-kyrie-irving-doubles-down-on-media-boycott/\">Brooklyn Nets</a>. I used to like <a href=\"https://en.wikipedia.org/wiki/Kevin_Durant\">KD</a> when he was at Oklahoma but lost interest when he went to Golden State, which was already a dominant franchise. Where's the sport in a superstar like Durant joining an all-star team. I’ve always thought <a href=\"https://en.wikipedia.org/wiki/Kyrie_Irving\">Kyrie</a> is an <a href=\"https://www.google.com/search?q=Kyrie+irving+is+an+ass\">ass</a>. It is not about winning it’s about philosophy, <i>especially</i> in <a href=\"https://en.wikipedia.org/wiki/Mookie_Wilson\">New York</a>. I wish them the best but they’re not my team",
            "created": "Mon, 14 Dec 2020 02:09:06 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"asparov63/status/1337800779990786059\">Garry Kasparov</a>: \"Don't dare say 'But the system worked' when a majority of Republicans in Congress support the overturning of a free and fair election. You don't celebrate a cancer not having killed you yet. You celebrate when you're cancer free.\"",
            "created": "Sun, 13 Dec 2020 17:31:56 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "When will journalism stop covering the disappointment of Trump supporters. They lost. They're having a hard time dealing with it. Meantime we're in the middle of a pandemic. Let them get over it on their own. My mother understood this. When my little brother was complaining about something, very unfairly, and loudly, my mother would say if you just ignore him he'll stop. She was right. ",
            "created": "Sun, 13 Dec 2020 17:13:31 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/07/07/ohYeah.png",
            "flInCalendar": true
        },
        {
            "text": "This is all too depressing so <a href=\"https://twitter.com/RexChapman/status/1338165209115013120\">here's a dog</a> that skateboards. ",
            "created": "Mon, 14 Dec 2020 02:26:27 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/RexChapman/status/1338165209115013120",
            "flInCalendar": true
        },
        {
            "text": "The moment CNN was not prepared for",
            "created": "Sun, 13 Dec 2020 17:38:44 GMT",
            "type": "outline",
            "description": "They are prepared for hurricanes, earthquakes, even another 9/11. But they have no idea what to do with a pandemic or a rebellion.",
            "metaImage": "http://scripting.com/images/2020/12/13/stelter.png",
            "subs": [
                {
                    "text": "<a href=\"https://twitter.com/Porter_Anderson/status/1338173209389240322\">CNN accuses Fox</a> of lack of proportionality. I've been watching CNN the last few weeks. I find it mind-numbing. (A good thing, for now, I play video games and watch Twitter while CNN is on.) They repeat the same two stories over and over since Election Day. Literally the same words, over and over. ",
                    "created": "Sun, 13 Dec 2020 17:39:10 GMT",
                    "urltweet": "https://twitter.com/Porter_Anderson/status/1338173209389240322",
                    "flInCalendar": true
                },
                {
                    "text": "Here's what's really going on imho.",
                    "created": "Sun, 13 Dec 2020 17:39:41 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Both Fox and CNN are paralyzed. ",
                    "flInCalendar": true
                },
                {
                    "text": "They are prepared for hurricanes, earthquakes, even another 9/11. But they have no idea what to do with a pandemic. ",
                    "created": "Sun, 13 Dec 2020 17:41:08 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Similarly the Trump rebellion is on a scale they have no concept of how to deal with.",
                    "created": "Sun, 13 Dec 2020 17:39:51 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "These are people <i>who do not improvise.</i>",
                    "created": "Sun, 13 Dec 2020 17:39:51 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "As Chris Hayes said, they all did very well in school. Rose through the ranks. Lots of book learning and discipline. They can make looking like a maverick as tame as a lamb, which is good for the cash flow of the network.",
                    "created": "Sun, 13 Dec 2020 17:40:21 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "But they can't improvise. They can only do what they were taught to do. They weren't taught how to do this job. So they are stuck. Paralyzed. Going round and round trying to catch a familiar beat, but they can't because it doesn't have one.",
                    "created": "Sun, 13 Dec 2020 17:40:22 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "The moment podcasting came into being",
            "created": "Sun, 13 Dec 2020 16:39:11 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2020/12/13/katzsDelicatessen.png",
            "description": "It helps to have a user in mind when you're developing. ",
            "subs": [
                {
                    "text": "It happened in <a href=\"http://scripting.com/2000/10.html\">October 2000</a> in NYC. I met with Adam Curry over a couple of days at a hotel in midtown on the west side. I mention the meeting in a <a href=\"http://scripting.com/2000/12.html#myUserlandOnTheDesktop\">post</a> on December 28, 2000. Here's an excerpt. ",
                    "created": "Sun, 13 Dec 2020 16:39:21 GMT",
                    "subs": [
                        {
                            "text": "It helps to have a user in mind when you're developing. In NY, when I met with Adam for two days he kept trying to explain what he wanted, but he's not a software developer, so to my ears it came across like hodgepodge. But I listened anyway, I kept trying to feed back what I heard, but we weren't connecting. ",
                            "created": "Sun, 13 Dec 2020 16:41:32 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "When I got back home I did what programmers do, I iterated, and kept showing it to him. Is this what you wanted? Eventually we got there, this software hits his button. It's also a framework for his vision for last yard connectivity. You can move huge pieces of content without any waiting and using the bandwidth that you don't use. When you're home sleeping in your bed your desktop system can get the big stuff, you won't even know it's there until it's fully downloaded on your hard disk.",
                            "created": "Sun, 13 Dec 2020 17:02:41 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "This is how video and music are going to move over the net in 2001. Who would have thought RSS would play a role in this? Adam did.",
                            "created": "Sun, 13 Dec 2020 17:03:29 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "This was the key idea on podcasting. How to distribute large bits of audio and video without having to wait for them to download. At the time, it was the slowness of the net that stood in the way of what we now call podcasting. ",
                    "created": "Sun, 13 Dec 2020 16:42:03 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The significance of this is that it was 20 years ago. It led to a new version of \"RSS\" which supported enclosures for the first time. I also <a href=\"http://scripting.com/2000/12/27.html\">wrote this up</a> on the blog that month. And the software called [%search: MUOTD%] became Radio UserLand, which was a two-way blogging and reading app for RSS. It's something the software industry hasn't replicated, not because it's so hard technically, it isn't. Not sure why. ",
                    "created": "Sun, 13 Dec 2020 16:42:58 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The two-day meetup was on <a href=\"http://scripting.com/2000/10/25.html\">October 25</a> and <a href=\"http://scripting.com/2000/10/26.html\">26</a>. It still took a couple of months from then before we had any real demos. It was competing with other projects we had at UserLand at the time. ",
                    "created": "Sun, 13 Dec 2020 16:54:23 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "There was also a Scripting News dinner at Katz's Deli on Houston St during the same visit on <a href=\"http://scripting.com/2000/10/25.html\">October 25</a>. ",
                    "created": "Sun, 13 Dec 2020 16:57:23 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}