{
    "text": "December 16",
    "created": "Wed, 16 Dec 2020 14:43:54 GMT",
    "type": "calendarDay",
    "name": "16",
    "subs": [
        {
            "text": "I've been beating this drum for years. We should be <a href=\"https://www.google.com/search?q=teaching+journalism+in+school+site%3Ascripting.com\">teaching journalism in school</a>. Not just for journalism majors. Everyone should have a semester of training. If we had started doing that ten years ago, we'd be in a much better place now. ",
            "created": "Wed, 16 Dec 2020 15:08:17 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/12/24/drummer.png",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://www.techmeme.com/#a201216p17\">Substack unveils</a> its <a href=\"http://reader.substack.com/\">RSS reader</a>. A few comments, off the top of my head. 1. They had to do something like this to compete with Medium who <a href=\"https://www.niemanlab.org/2012/08/13-ways-of-looking-at-medium-the-new-bloggingsharingdiscovery-platform-from-ev-and-obvious/\">sells discovery</a> as their big thing. 2. It's <i>good</i> that they built on a standard, RSS, instead of creating a closed system. 3. You can <a href=\"http://scripting.com/images/2020/12/16/subscribeScreenshot.png\">subscribe</a> to my <a href=\"http://scripting.com/rssNightly.xml\">nightly email feed</a> in Substack's reader. I checked, it works. :rocket:",
            "created": "Wed, 16 Dec 2020 16:51:39 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The key point that the Democrats keep missing is that we want to do more. We will give you money and we will vote, but that's not all we can do. Each of has special talents, abilities. Some of us have more time to give than others. But almost to a person, we want to be part of this, not spectators. Trump kind of got that, with his rallies. He didn't condescend. He included them in his speeches. Talked to them like humans. This stuff isn't hard, you have have to try to see things differently. We're not just dollars and votes. ",
            "created": "Wed, 16 Dec 2020 14:45:05 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I'd like to hear Biden say, when asked if the US can get rid of the virus, hell yeah we can. This is what we're <i>good</i> at. It's why we invested in the military and science, to protect our people from deadly threats. Here's the plan, here's the timetable, and here's how you particpate. ",
            "created": "Wed, 16 Dec 2020 14:43:55 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The Dems talk about Americans, but rarely talk <i>to</i> Americans.  ",
            "created": "Wed, 16 Dec 2020 19:56:07 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Poll: <a href=\"https://twitter.com/davewiner/status/1339221123477741575\">Who will Biden choose for Attorney General?</a>",
            "created": "Wed, 16 Dec 2020 14:49:48 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1339221123477741575",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}