{
    "text": "December 20",
    "created": "Sun, 20 Dec 2020 15:57:56 GMT",
    "type": "calendarDay",
    "name": "20",
    "subs": [
        {
            "text": "You have very little <a href=\"http://scripting.com/davenet/1999/03/27/submission.html\">power</a> over what comes next.",
            "created": "Sun, 20 Dec 2020 17:28:53 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The <a href=\"https://www.nba.com/news/nba-2020-21-season-faq\">NBA season</a> starts on Tuesday, and I, for one, am looking forward to it. I hear the [%search: Knicks%] will be <a href=\"https://www.yahoo.com/now/5-things-knicks-2020-holiday-181113376.html\">interesting</a> this year. Heh. Yeah. Okay, anyway. I just read about how <a href=\"https://nba.nbcsports.com/2020/12/14/report-james-harden-tells-rockets-hell-be-professional-and-engaged-still-wants-trade/\">James Harden</a> wants to be traded out of Houston. Here's a <a href=\"https://www.sbnation.com/nba/2020/12/17/22178792/james-harden-trades-proposals-76ers-celtics-raptors-blazers-heat\">rundown</a> of some of the possible deals. ",
            "created": "Sun, 20 Dec 2020 16:42:22 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/11/15/melo.png",
            "flInCalendar": true
        },
        {
            "text": "I finished watching [%search: Better Things%] a couple of days ago, still thinking, good sign. I like that, even though it is very much women’s POV, and they can be pretty harsh on men, the men sometimes have depth that women miss. I stuck with it through four seasons. ",
            "created": "Sun, 20 Dec 2020 16:34:24 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Listening to <a href=\"https://www.wnycstudios.org/podcasts/otm/episodes/on-the-media-facebook-owns-future\">On The Media</a> about Google and Facebook. Such hype and propaganda. When you hear \"news\" talk about something you understand better than they do, you can hear how evil they are. And they are very evil at NPR. For example, they talk about how Facebook is used by white supremacists to organize so they can kill protestors. They interview the girlfriend of one of the dead protestors. What they leave out is that it's also used to plan charity events in my hometown, and every hometown in the world. It's like saying the telephone is used to plan terrorism. Yes, it is, but most people would know that's bullshit. Unfortunately they are so good at sliming Facebook in journalism, and it is still relatively new, that they mislead a lot of people who could benefit from using it. I know because I hear the bullshit coming back through them. They're scared of it, that's for sure. They should let some people use their air to explain how NPR exploits <i>their</i> users. Yeah I don't see that happening anytime soon. :rocket:",
            "created": "Sun, 20 Dec 2020 15:57:57 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "BTW this is why blogging and podcasting are so important. They represent checks on the power of journalism. I was naive in the beginning to think this would negate the power of journalism to mislead, it hasn't had that effect. They are as oblivious to criticism as the Republicans in Congress are. But there's still hope. ",
            "created": "Sun, 20 Dec 2020 16:16:13 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Mike Masnick wrote a <a href=\"https://twitter.com/mmasnick/status/1340166822079840256\">similar thread</a> on this episode of OTM.",
            "created": "Sun, 20 Dec 2020 17:24:54 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/mmasnick/status/1340166822079840256",
            "flInCalendar": true
        },
        {
            "text": "Meanwhile <a href=\"http://scripting.com/2018/01/05/141003.html\">Facebook</a> and <a href=\"http://this.how/googleAndHttp/\">Google</a> <i>are</i> screwing us. If the people at NPR understand how, why aren't they reporting that. Both are choking the open protocols of the web, and keep competition from rising up to exploit their weakness. This is something that probably sounds \"technical\" to them. Most journalists are intimidated, for now at least, by the technology of the internet. To our detriment. Maybe over the years that will ease as the old folk move on and young people who grew up with the tech replace them. But I'm not really that hopeful about that. The young folk seem to have inherited the blindness and hypocrisy of previous generations of journalism.  ",
            "created": "Sun, 20 Dec 2020 16:03:38 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Vaccines work.",
            "created": "Sun, 20 Dec 2020 16:30:08 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/12/20/cartoon.png",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}