{
    "text": "December 21",
    "created": "Mon, 21 Dec 2020 14:51:22 GMT",
    "type": "calendarDay",
    "name": "21",
    "subs": [
        {
            "text": "Five <a href=\"https://en.wikipedia.org/wiki/List_of_Queens_neighborhoods\">neighborhoods</a> in Queens have more people than Wyoming. Here's the math. The five largest neighborhoods in <a href=\"https://statisticalatlas.com/county-subdivision/New-York/Queens-County/Queens/Population#figure/neighborhood\">Queens</a>, by population, are: Astoria, Jamaica. Corona, Elmhurst and Flushing -- for a total of 581K. Wyoming's population is 578K. The point being this is just part of one county in New York State. It gets zero senators, probably a total of one member of the House (hard to figure). This came up as part of a <a href=\"https://twitter.com/KMCRadio/status/1340816003203252224\">discussion</a> on how the counties, if votes were allocated to them, one per county, would have given Trump a landslide win over Biden. Yes, and if every one of my toes were worth $1 billion, I would be a billionaire. I'm sure you can tell a story that makes you sleep easier at night. But that's not how elections are won and lost. And of course everyone knows that. Oh can we stop being idiots some day, perhaps? That would be nice. :boom:",
            "created": "Mon, 21 Dec 2020 18:13:29 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/08/31/thisIsNextYear.png",
            "flInCalendar": true
        },
        {
            "text": "Yesterday I <a href=\"http://scripting.com/2020/12/20.html#a155757\">ranted about journalism</a> and the way they report on Facebook, from their own conflicted point of view. Toxic stuff, completely unrestrained by any effort at balance. I just came across a thread in a private FB group where a parent, considering buying a house in a small nearby town, asks what people think of local schooling. What came back is an incredible thread with real-life experiences. So far 70 comments. Not the kind of stuff you can get from journalism or books. Since it's private, I can't quote it, sorry.",
            "created": "Mon, 21 Dec 2020 14:51:23 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}