{
    "text": "December 22",
    "created": "Tue, 22 Dec 2020 12:37:14 GMT",
    "type": "calendarDay",
    "name": "22",
    "subs": [
        {
            "text": "I'd love to see a <a href=\"https://en.wikipedia.org/wiki/Waze\">Waze</a> for supermarkets. How it would work. I'd register with (for example) Google, and ask it to notify me when the <a href=\"https://www.google.com/maps/place/Adams+Fairacre+Farms/@41.9766612,-73.9882775,246m/data=!3m1!1e3!4m5!3m4!1s0x0:0x59f95f28dad1a9b2!8m2!3d41.9767848!4d-73.9881112\">parking lot</a> of my <a href=\"https://adamsfarms.com/\">favorite market</a> is mostly empty. I'd also like to know how long ago <a href=\"https://www.breadalone.com/about-us\">Bread Alone</a> delivered. I'd rather go when the store isn't packed full, and when my <a href=\"https://www.breadalone.com/peasant-bread\">favorite bread</a> is likely to be on the shelf. This would have saved me a trip earlier today, when literally every spot was taken. Not a good time to go shopping, esp during a pandemic. I did not even go in. ",
            "created": "Tue, 22 Dec 2020 22:25:48 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I read a lot of audiobooks. Sometimes the narrator is so excellent, it's worth calling out. I just got through <a href=\"https://www.audible.com/pd/One-Flew-Over-the-Cuckoos-Nest-Audiobook/B008N1TVDU\">One Flew Over the Cuckoo's Nest</a>, narrated by <a href=\"https://en.wikipedia.org/wiki/John_C._Reilly\">John C. Reilly</a>. The book is wonderful, <a href=\"https://en.wikipedia.org/wiki/Ken_Kesey\">Kesey</a> is a great writer, it's funny, warm, a great story beautifully told. Reilly does all the voices. Usually male narrators have trouble pulling off the female characters and vice versa. Somehow Reilly does it. Highly recommended. If you know of audiobooks that are great because of narration, let me know. I'm always looking for a good read. My next book is the <a href=\"https://www.amazon.com/Joe-Biden/dp/B08KFFWHR4/ref=tmm_aud_swatch_0?_encoding=UTF8&qid=&sr=\">Biden biography</a> by Evan Osnos. Also the <a href=\"https://www.amazon.com/Software-Rudy-Rucker-audiobook/dp/B00RBZFYF8/ref=tmm_aud_swatch_0?_encoding=UTF8&qid=&sr=\">first book</a> by Rudy Rucker. ",
            "created": "Tue, 22 Dec 2020 19:56:34 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/12/22/oneFlewOver.png",
            "flInCalendar": true
        },
        {
            "text": "The way Trump relates to his base reminds me a lot of the way big tech companies talk to their users. In tech it's called [%search: FUD%]. You can't tell who's lying a lot of the time. They take advantage of the fact that their customers are confused, and they try to keep them that way. <a href=\"https://en.wikipedia.org/wiki/Fear,_uncertainty,_and_doubt#:~:text=FUD%20is%20the%20fear%2C%20uncertainty,might%20be%20considering%20Amdahl%20products.&text=This%20is%20a%20recognized%20phenomenon,fired%20for%20buying%20IBM%20equipment%22.\">IBM</a> as an example made many billions off this approach over decades. There are exceptions, companies who value their customers and users enough to tell them the truth. Not many, and not always.",
            "created": "Tue, 22 Dec 2020 19:52:45 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "As you may have heard, I got a new <a href=\"http://scripting.com/2020/12/14/173714.html?title=myNewTv\">OLED tv last week</a>, and I'm starting to come to terms with it. I've added an old Roku stick to the device, and 99 percent of my interaction with the TV is through Roku. I'm not sure I'm getting the best video this way. Also the annoying LG user interface keeps popping up. And to adjust the hardware of the TV, I still need to use the LG remote. Which makes me wonder if there are any external devices, Apple TV, or some kind of Chromecast or something from Amazon that can also manage the hardware? I'd love to get it down to one remote. I still think [%search: Roku%] has the <a href=\"http://scripting.com/2019/04/17/144031.html\">best remote</a>. Almost as simple as possible. I loved the way my old TCL did everything from Roku. Perfectly integrated, and one less OS is better than two. ",
            "created": "Tue, 22 Dec 2020 19:31:45 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/04/17/roku2.png",
            "flInCalendar": true
        },
        {
            "text": "If <a href=\"https://en.wikipedia.org/wiki/Mission:_Impossible_(1966_TV_series)\">Mission Impossible</a> were still on the air, the old version with Barbara Bain and Martin Landau, they could do a mission to put Trump to sleep for 45 days. He wakes up in a sanitarium or monastery in Hungary or Rumania, maybe Russia, surrounded by incriminating evidence. Oh life was so much simpler during the <a href=\"https://en.wikipedia.org/wiki/Cold_War_(1962%E2%80%931979)#:~:text=The%20Cold%20War%20(1962%E2%80%931979,d%C3%A9tente%20in%20the%20late%201970s.\">Cold War</a>. ",
            "created": "Tue, 22 Dec 2020 19:24:21 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "We should be supporting Americans during the pandemic. A country that won't come together in a crisis like this isn't imho a country. We support rich people who don't need help -- and let people wait out the pandemic with no money for food or rent and no hope of getting out of debt, people who may have been middle class before Covid, who are now broke. The importance of health care is something everyone can understand now, even young people. We are a stupid country. We waste so much, yet we don't take care of our basic needs. A small number live so extravagantly, when there is only so much a <a href=\"http://scripting.com/2016/05/31/1296.html\">human</a> can use. This is about to come home in a huge way. This isn't working, hasn't for a long time, but it's getting worse, and about to get much worse. :boom:",
            "created": "Tue, 22 Dec 2020 18:11:47 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "It’s still true — we aren’t getting out of this pandemic until we work together and care about each other. Until we do, it’ll keep getting worse. I thought for a while the vaccine could eliminate the need to work together, but it’s just another me-first thing. Seeing <a href=\"https://www.dailymail.co.uk/news/article-9076349/Iowa-Sen-Joni-Ernst-fire-jumping-people-COVID-vaccination.html\">Joni Ernst</a>, <a href=\"https://www.cnn.com/videos/politics/2020/12/21/ana-navarro-marco-rubio-coronavirus-vaccine-sot-vpx-nr.cnn\">Marco Rubio</a> and <a href=\"https://wpde.com/news/local/help-is-on-the-way-sen-lindsey-graham-gets-the-covid-19-vaccine\">Lindsey Graham</a> (among <a href=\"https://www.axios.com/pelosi-covid-vaccine-af8dcbfc-846c-4e17-bc22-71d8a339d58f.html\">others</a>) getting their vaccines was all the proof needed. It’ll get worse. America is still stuck in selfish hell. And btw if you’re still trying to get ahead, when working together could save lives, you’re the problem.",
            "type": "tweet",
            "created": "Tue Dec 22 08:32:59 +0000 2020",
            "tweetId": "1341300692724625408",
            "tweetUserName": "davewiner",
            "flInCalendar": true
        },
        {
            "text": "Snowy Catskills mountain.",
            "created": "Wed, 23 Dec 2020 01:08:04 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/12/22/snowyCatskillsMountain.png",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}