{
    "text": "December 23",
    "created": "Wed, 23 Dec 2020 15:20:02 GMT",
    "type": "calendarDay",
    "name": "23",
    "subs": [
        {
            "text": "I wish someone would gamify the virus so people understand how it works, and how it's actually something like a game, and how we're completely blowing it. One of the skills the virus has is it can mutate. So it's in our collective interest to reduce the virus to almost nothing before it can mutate to something our vaccines can't deal with. The more virus is out there btw, the more mutations there will be. The way we're doing it now, it's like we have all the time in the world. So a million people travel by air to go to family gatherings and then a month later do it again, and fly home, spreading all mutations of the virus everywhere. We don't have a lot of time. We don't have time to worry about who Trump pardons. We need to worry about what the virus mutates to and how it might not be very human friendly, even compared to the virus as we now know it. ",
            "created": "Thu, 24 Dec 2020 01:24:05 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/12/16/santaCoke.png",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=efHCdKb5UWc\">Another great clip from Dark Night</a>. \"Some men just want to watch the world burn.\" We've known Trump was one of them from the start. That's why there was so much dread about him being elected. Somehow we pushed that fact to the side. ",
            "created": "Wed, 23 Dec 2020 18:01:38 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=efHCdKb5UWc",
            "flInCalendar": true
        },
        {
            "text": "I turned on the <a href=\"https://www.cbssports.com/nba/news/kevin-durant-kyrie-irving-justify-nets-championship-hopes-but-focus-must-remain-on-present/live/\">first NBA game</a> of the year last night, Golden State v Brooklyn. I had less than no interest. I couldn't even leave it on while I nerded around on my iPad. It was stealing energy from me. I don't like what happened there, in Brooklyn, nor in the NBA at large. It isn't a league of teams, it's a league of superstars and a weird form of narcissism. I lost the tune of the NBA. Maybe I'll get it back. It does come and go. ",
            "created": "Wed, 23 Dec 2020 17:55:01 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "A lot of people vote based on how comfortable the candidate is in his or her own skin. Trump, whatever else you can say about him is quite comfortable that way. Hillary and Joe are not. Trump lost because enough people woke up and realized that wasn't a good enough reason to vote for someone. Whether or not the candidate is a sociopath and would-be tyrant should have some weight. Imagine a candidate with the confidence of Trump and the depth of knowledge of HRC.",
            "created": "Wed, 23 Dec 2020 16:20:07 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/08/23/zombie.png",
            "flInCalendar": true
        },
        {
            "text": "I wish my <a href=\"http://www.greatvavavoom.com/\">hippie uncle</a> had lived to see legalized cannabis in the US. He also would have loved smart phones. He was always looking stuff up in his <a href=\"https://en.wikipedia.org/wiki/Time_Almanac_with_Information_Please\">Information Please almanac</a>. The idea of having all the information in the world in his pocket is something he could have imagined, as a voracious science fiction reader, but I don't think he would have seen it as coming so soon. He was born in 1945, would have been 75 now if he lived, but he died in 2003 at the age of 57.",
            "created": "Wed, 23 Dec 2020 15:52:08 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Just for fun. Peter O'Toole dances <a href=\"https://youtu.be/DzbWvmSMiNI?t=27\">The Varsity Drag</a> in <a href=\"https://en.wikipedia.org/wiki/The_Ruling_Class_(film)\">The Ruling Class</a>, one of my favorite movies as a teen (and still is).",
            "created": "Wed, 23 Dec 2020 20:39:30 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "It's a tech world now",
            "created": "Wed, 23 Dec 2020 16:34:49 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I left the Bay Area in 2003. ",
                    "created": "Wed, 23 Dec 2020 16:35:00 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Came back in 2006. Left for good in 2009. ",
                    "created": "Wed, 23 Dec 2020 16:36:28 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I think people got the idea I had left tech. ",
                    "flInCalendar": true
                },
                {
                    "text": "Never stopped developing. ;-)",
                    "flInCalendar": true
                },
                {
                    "text": "Now there's an exodus of tech from Silicon Valley.",
                    "flInCalendar": true
                },
                {
                    "text": "It's a tech world now.",
                    "flInCalendar": true
                },
                {
                    "text": "And there's still a lot to do.",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Trump kills Americans because he likes it.",
            "created": "Wed, 23 Dec 2020 15:33:18 GMT",
            "type": "outline",
            "description": "Sometimes there isn't a reason.",
            "metaImage": "http://scripting.com/images/2020/12/23/covidDeath.png",
            "subs": [
                {
                    "text": "We know the Trumps were trying to kill more Americans with Covid. We don’t know why, even though the news is reporting the reason as <a href=\"https://en.wikipedia.org/wiki/Herd_immunity\">herd immunity</a>.  What if it had nothing to do with herd immunity what if they just wanted to kill more Americans. ",
                    "created": "Wed, 23 Dec 2020 15:20:03 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "A friend asks what would be the point? A few answers. ",
                    "created": "Wed, 23 Dec 2020 15:23:06 GMT",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "Sometimes the point is sadism or being a sociopath. I remember that kids like to kill ants in creative ways. ",
                            "created": "Wed, 23 Dec 2020 15:34:05 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "As <a href=\"https://www.youtube.com/watch?v=NWeh4A600E0\">The Joker said</a> in The Dark Knight, sometimes people just \"do things.\" ",
                            "created": "Wed, 23 Dec 2020 15:39:02 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Working with and inside organizations of all sizes I was often impressed with how often people do things for personally selfish reasons. ",
                            "created": "Wed, 23 Dec 2020 15:34:30 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "I remember reading about the <a href=\"https://en.wikipedia.org/wiki/Warsaw_Ghetto\">Warsaw Ghetto</a> during WW II. A quote stayed with me, from one of the Jews imprisoned there (paraphrasing). \"We make money for the Nazis, so why should they kill us?\" They figured as long as they were useful they'd be kept alive, as if there was reason to the way things are. ",
                            "created": "Wed, 23 Dec 2020 15:34:42 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "<a href=\"https://www.youtube.com/watch?v=efHCdKb5UWc\">Some men</a> just want to watch the world burn.",
                            "created": "Wed, 23 Dec 2020 17:23:51 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Sometimes the answer is obvious. Once, when I lived in <a href=\"https://www.zillow.com/homedetails/425-Manzanita-Way-Woodside-CA-94062/181464824_zpid/\">California</a>, a neighbor called and said she was getting baby goats, and they would be making a bunch of noise for a while. I asked why are you getting goats. She said she always wanted goats. ",
                            "created": "Wed, 23 Dec 2020 15:31:50 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "And sometimes there just is no reason. ",
                            "created": "Wed, 23 Dec 2020 15:34:50 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "Anyway, perhaps it's too much for people to consider Trump wanted to kill Americans because he liked it. ",
                    "created": "Wed, 23 Dec 2020 15:33:13 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PS: No spoilers, but Kurt Vonnegut's <a href=\"https://en.wikipedia.org/wiki/The_Sirens_of_Titan\">Sirens of Titan</a>, a wonderful book, is about the purpose of life on earth, one that would be consistent with the theme of this blog post. :boom:",
                    "created": "Wed, 23 Dec 2020 15:44:22 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}