{
    "text": "December 24",
    "created": "Thu, 24 Dec 2020 15:46:24 GMT",
    "type": "calendarDay",
    "name": "24",
    "subs": [
        {
            "text": "It would be great to have a simple page somewhere that listed the changes on the major streaming services in reverse chronologic order. Even better if there was a preference where you could say which services you care about. ",
            "created": "Thu, 24 Dec 2020 21:07:55 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://podcasts.apple.com/us/podcast/gov-cuomos-briefing-for-december-23/id1506413883?i=1000503360090\">Today's</a> <a href=\"http://this.how/cuomo/\">Cuomo Podcast</a> is worth a listen. He wonders why the US government is doing nothing to restrict air traffic from the UK. Made me think what Cuomo will do, as a Democrat, when the president is a Democrat on the 20th of next month. Also, I wonder if Biden offered him a position in the government. He's been an incredible crisis leader for New York State. ",
            "created": "Thu, 24 Dec 2020 18:55:51 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/08/29/borisJohnson.png",
            "flInCalendar": true
        },
        {
            "text": "The epitaph of the United States may be that the idea of the <a href=\"https://www.digitalhistory.uh.edu/disp_textbook.cfm?smtID=3&psid=1334\">rugged individualist</a> was a lie, there never were any, and in the age of air travel and medicine we’re all very connected, our well-being depends on other people’s well-being.",
            "created": "Thu, 24 Dec 2020 16:15:15 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "If we’re disbanding Silicon Valley that’s a good thing imho. Where ever it reassembles, if it does, hopefully tech will be motivated by more than money. In California, money has dominated everything. I found that intolerable.",
            "created": "Thu, 24 Dec 2020 15:52:56 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"http://scripting.com/images/2020/12/24/diskNotEjected.png\">This is something</a> that's waiting for me every morning when I log on my Mac. I of course have ejected the drive properly since this started. Anyone know what's up??",
            "created": "Thu, 24 Dec 2020 15:46:25 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1342134509328805888",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://optimism.substack.com/p/howling-about-trump-isnt-enough\">Howard Weaver</a> is a longtime friend, ex-journalist, blog-curious, and journo-arrogant. From Alaska and then Sacramento. Well he now has a blog. And he's ranting like an idealist. I knew he'd come around. :rocket:",
            "created": "Thu, 24 Dec 2020 15:50:15 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "My <a href=\"http://scripting.com/2020/12/23.html#a012405\">gamifying post</a> is getting a bunch of comment. I was thinking of an app like <a href=\"https://en.wikipedia.org/wiki/SimCity\">SimCity</a>. I was already a programmer when it came out, but it taught me so much about the interconnection of systems. Something like that with the virus and people interacting, and people dying or the virus dying (better outcome of course) would probably save lives. And even more important it would teach us the value of working together. Since gaming is something people do in all states, red and blue, it might also help us find common ground. ",
            "created": "Thu, 24 Dec 2020 15:54:41 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/12/24/simcity.png",
            "flInCalendar": true
        },
        {
            "text": "BTW, there is something called <a href=\"https://hwright.com/simvirus/\">SimVirus</a>. Not what I was looking for, but interesting. ",
            "created": "Thu, 24 Dec 2020 15:57:47 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}