{
    "text": "December 26",
    "created": "Sat, 26 Dec 2020 15:12:06 GMT",
    "type": "calendarDay",
    "name": "26",
    "subs": [
        {
            "text": "Today's song: <a href=\"https://www.youtube.com/watch?v=3xlo1NvEdAw\">Mandolin Wind</a>.",
            "created": "Sat, 26 Dec 2020 15:43:59 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I got a <a href=\"https://www.nytimes.com/2020/12/23/sports/basketball/amare-stoudemire-brooklyn-nets.html\">pointer</a> from Lew Perin to a NYT article about how the Nets have Mike D'Antoni and Amar'e Stoudemeyer on their coaching staff this year, supporting Steve Nash. I do have respect for Mike D, and of course Amar'e. But I have a <a href=\"http://scripting.com/2020/12/23.html#a175501\">feeling</a> about the NBA this year that isn't too good. It isn't just the Nets, it's also the Lakers, who went from nowhere to champions. The Clippers. Harden. Etc. And Kyrie Irving who was too good to play for the Celtics, I guess. Basketball is a team sport, that's what's beautiful about it to me, but we aren't rooting for teams anymore, the franchises are the players. That's fine, I guess -- good for them, but the only player I've felt loyalty to in the NBA recently is <a href=\"https://nypost.com/2020/12/18/jeremy-lin-signing-with-warriors-g-league-team/\">Jeremy Lin</a>, and he's playing in the G league for Golden State this year. And at this point there isn't much left there, anyway -- other than the bitterness at how the Knicks screwed it up. Maybe something will happen, no one saw Linsanity coming, so there's always hope. :boom:",
            "created": "Sat, 26 Dec 2020 15:32:15 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/12/26/mandolin.png",
            "flInCalendar": true
        },
        {
            "text": "Also I feel loyalty to <a href=\"https://en.wikipedia.org/wiki/Carmelo_Anthony\">Melo</a>. I thought he was a bad choice for the Knicks, all through his career in NY, but how can you not feel affection for a man who keeps coming back, presumably because he loves playing. I hope that's it. I wish he had the humility back then that he has now. He might not have objected to Lin, who anyone would have to admit was <a href=\"http://scripting.com/2014/11/13/jeremyLinWasACoralReef.html\">good for a team</a> that was going nowhere, both before and after. ",
            "created": "Sat, 26 Dec 2020 15:38:54 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Before you complain about 2020, you may tempt whoever decides these things to make next year even more <a href=\"https://en.wikipedia.org/wiki/May_you_live_in_interesting_times\">interesting</a>. Remember we thought there could never be a year worse than 2016.",
            "created": "Sat, 26 Dec 2020 15:12:07 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Jeremy Lin (L) and Carmelo Anthony, near the end of Linsanity.",
            "created": "Sat, 26 Dec 2020 15:47:28 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/12/26/meloAndLin.png",
            "flInCalendar": true
        },
        {
            "text": "I'm surprised I'm not a character in someone's book, yet. ",
            "created": "Sat, 26 Dec 2020 15:52:50 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}