{
    "text": "December 28",
    "created": "Mon, 28 Dec 2020 14:55:12 GMT",
    "type": "calendarDay",
    "name": "28",
    "subs": [
        {
            "text": "I've been hearing Serious Things about my writing here, and that's a bit intimidating. Now when I read over what I've published, I see all the mis-capitalized proper nouns, missing words, chopped out accidentally in rushed edits. Please note the <a href=\"http://scripting.com/images/2020/12/28/evenWorse.png\">caveat</a> at the top of every page on <a href=\"http://scripting.com/\">this blog</a>: It's even worse than it appears. That means what it appears to mean. However it is lovely to hear from people who read this stuff. I esp like to hear what time you read it. In Europe they read it with their breakfast it seems and in California, before retiring for the night. I tend to read it in the middle of the night, around 2AM or so. Yes, weird as it seems, I do read my own blog. :rocket:",
            "created": "Mon, 28 Dec 2020 19:51:57 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/06/23/blackLab.png",
            "flInCalendar": true
        },
        {
            "text": "What's the difference between a <a href=\"https://www.nytimes.com/2020/12/28/world/asia/china-Zhang-Zhan-covid-convicted.html\">citizen journalist</a> and a journalist? It's not a useful term. A distinction without a difference. Are journalists who work for AP or the Washington Post not citizens? I like to walk. That doesn't make me a citizen walker. Putting an adjective in front of it is a priesthood thing. Condescending. Do they think somehow it's acceptable for the Chinese government to jail a citizen journalist, but it would be a problem if they jailed a real journalist?",
            "created": "Mon, 28 Dec 2020 14:55:13 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"http://scripting.com/misc/metadatademo/\">Somewhat editable tweets</a>. An interesting idea from <a href=\"https://twitter.com/AlecMuffett/status/1343192656470568961\">Alec Moffat</a>. As you may know, you can put metadata in a web page that Twitter will display when you link to it in Twitter. For example, here's a <a href=\"http://scripting.com/misc/metadatademo/\">page</a> with an <a href=\"http://scripting.com/images/2020/12/28/htmlScreenShot.png\">obvious spelling error</a> in the metadata. And here's a <a href=\"https://twitter.com/davewiner/status/1343581454186459138\">tweet</a> that links to the page (<a href=\"http://scripting.com/images/2020/12/28/tweetScreenShot.png\">screen shot</a>). If I correct the spelling error in the metadata, and eventually Twitter will notice, and the tweet will include the changed version. Voila. I've corrected a spelling error in a tweet. It's a really roundabout way to do it, but it works. :boom:",
            "created": "Mon, 28 Dec 2020 15:05:29 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I won't add new Spectrum services",
            "created": "Mon, 28 Dec 2020 20:30:54 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2020/12/28/iWontAddNewSpectrumServices.png",
            "description": "I'm still looking for a way to stream the Knicks, without spending too much, but Spectrum ain't the answer.",
            "subs": [
                {
                    "text": "I was determined a few nights ago to find a way to watch the Knicks, but I didn't want to pay a ridiculous amount of money for it. I saw that <a href=\"https://www.spectrum.net/\">Spectrum</a> now has a streaming option, with no set top box. I remember before I cut the cable, they had <a href=\"https://www.msgnetworks.com/\">MSG</a>, which is the broadcast network for the Knicks. So I thought there was a decent chance they had it on their streaming app. ",
                    "created": "Mon, 28 Dec 2020 20:31:05 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Of course they make you sign up to find out what the channels are. I was stupidly impulsive. I clicked the button. A minute later I was looking through their channel guide. MSG is not included. So now I figured I'd just go click another button to kill the 7-day free trial. Nowhere to be found. Typical. ",
                    "created": "Mon, 28 Dec 2020 20:31:51 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I ended up on hold for an hour, <a href=\"https://twitter.com/davewiner/status/1343601622975475712\">documented</a> on Twitter, where they were polite but couldn't help. There was no other way to cancel the trial without calling. The operator was a jerk, raised her voice, tried to upsell, asked me to explain myself, I said I just don't want it, which is a legal reason for cancelling a free trial imho. All of it, the wait, the bad manners must be scientifically proven to drive people to keeping their subscription and even buying more, when they called to cancel. But I wouldn't discuss it. I called to cancel and that's it.",
                    "created": "Mon, 28 Dec 2020 20:32:04 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "This approach is no longer competitive. Hulu, Disney, HBO, YouTube -- they all make it one click to unsub. Maybe with a confirmation, but that's all. They get that if it's not easy to unsub no one is going to sign up because we understand how this bullshit works. ",
                    "created": "Mon, 28 Dec 2020 20:33:10 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I will remember hopefully never to sign up for anything with Spectrum again. Let me <a href=\"http://www.ranzey.com/generators/bart/index.html\">say</a> it a few times to let it sink in. ",
                    "created": "Mon, 28 Dec 2020 20:34:04 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I won't add new Spectrum services.",
                    "created": "Mon, 28 Dec 2020 20:34:07 GMT",
                    "inlineImage": "http://scripting.com/images/2020/12/28/iWontAddNewSpectrumServices.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}