{
    "text": "December 30",
    "created": "Wed, 30 Dec 2020 15:57:12 GMT",
    "type": "calendarDay",
    "name": "30",
    "subs": [
        {
            "text": "At the beginning of a blogging day, I have no idea what will end up on the page when the day is done. ",
            "created": "Wed, 30 Dec 2020 16:26:02 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://twitter.com/RexChapman/status/1344103520790831107\">Watch this tweet</a>. You won't be disappointed. <span class=\"spSpoiler\">How did they do it? My guess is a high quality drone controlled by someone who is as good a skier as the subject, and intimately familiar with the course, and can ski it backwards with no visibility, unless the drone also had a camera looking forward. How many times did the have to rehearse it?)</span>",
            "created": "Wed, 30 Dec 2020 16:48:12 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/RexChapman/status/1344103520790831107",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://twitter.com/AnthonyHopkins/status/1344008299490861056\">Anthony Hopkins</a>: “Today is the tomorrow you were so worried about yesterday.\"",
            "created": "Wed, 30 Dec 2020 17:29:36 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I like when news gives us lifesaving clues. For example, there’s a new more communicable form of the virus. It’s <a href=\"https://www.cnn.com/2020/12/30/health/colorado-uk-coronavirus-variant/index.html\">here</a>, of course. This was inevitable, I learned from <a href=\"http://scripting.com/2020/08/19.html#a160302\">reading</a> about the <a href=\"https://www.cdc.gov/flu/pandemic-resources/1918-pandemic-h1n1.html\">1918 pandemic</a>. Question: Does this invalidate current practice? Can I still go food shopping on my own? Gas up my car? Of course no one knows yet. But the question hasn’t even been raised as far as I know. ",
            "created": "Wed, 30 Dec 2020 15:59:49 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "On MSNBC last night I heard that white privilege means you know if you’re descended from royalty. I knew my grandparents, all lived into my young adulthood. I have pictures from my father, of relatives going back one or two more generations, but don’t know anything about them. That’s it. There is no doubt there is privilege in being white. I see it in my own attitudes, inside me. But knowing your ancestors, well that's a very particular kind of privilege that very few people have, imho. ",
            "created": "Wed, 30 Dec 2020 16:00:31 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I've never been to Seoul, but thanks to modern tech, a dramatic moment of my life happened in the Seoul airport, earlier this year. NakedJen had gone on vacation to Bali, just as the virus was becoming a world catastrophe. I talked with her over Facetime in Bali and said Jen it's time to come home. She said I know I know. We talked at every step of the trip, from Bali to Seoul to Seattle to Salt Lake. At every stop, there was serious doubt as to whether there would be a flight home. Like Ingrid Bergman in Casablanca. In Seoul, she made a wise decision. She'd defer and let Delta Airlines decide if she stayed there to wait out the pandemic or returned home. If there was a flight she'd get on it, if not she'd stay. Last night I had a dream that I was stuck in Seoul, trying to get home. I'd wait in a line, only to find I was no longer in the airport. Seoul was, in my dream, an ideal place full of happy playing children and huge pristine swimming pools. An enormous arcade of pinball machines. Why are there so many? Promenades with people in formal attire, out for a walk on a spring afternoon, with umbrellas, or reading old-style newspapers. All surrounding the airport. In the airport were people I knew in Silicon Valley in the 80s and 90s, familiar and friendly, as if we had been friends ever since. I don't usually write about dreams on my blog, but this one was so vivid, such a throwback to a tense moment from earlier this year, so what the f. :boom:",
            "created": "Wed, 30 Dec 2020 16:10:36 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/06/29/alice.png",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://www.edwardhopper.net/automat.jsp\">Automat</a>, by Edward Hopper.",
            "created": "Wed, 30 Dec 2020 15:57:13 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/12/30/automat.png",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}