{
    "text": "The Melo Era is now officially over",
    "created": "Sun, 17 Dec 2017 18:27:10 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Last night's Knicks game vs OKC was confusing. I am so accustomed to Melo being a Knick, I really did at times have trouble remembering which team was mine. ",
            "created": "Sun, 17 Dec 2017 18:27:14 GMT",
            "image": "http://scripting.com/images/2017/12/17/melo.png"
        },
        {
            "text": "Amazingly, the <a href=\"https://nypost.com/2017/12/16/carmelo-homecoming-wrecked-by-dominant-knicks-victory/\">Thunder lost</a> the way the Knicks always lose, and the actual Knicks won the way teams always beat the Knicks. It seems we did a karma swap with the Thunder. We gave them our superstar, and the Knicks became an NBA team. ",
            "created": "Sun, 17 Dec 2017 18:34:12 GMT"
        },
        {
            "text": "In all the years Melo was with the Knicks, he never had a sidekick. Never had a Scottie Pippen or Dwyane Wade. The closest he came was (sorry Melo) with Jeremy Lin, and for some reason he couldn't handle it. Both the coach and Lin had to go. And the Knicks settled into a run of mediocre years. ",
            "created": "Sun, 17 Dec 2017 18:28:37 GMT"
        },
        {
            "text": "It was telling that in the Melo remembrance video played at the Garden last night, the main thing we remember about Melo are his personal accomplishments. There was no glory for the team, for the city, for the legacy. ",
            "created": "Sun, 17 Dec 2017 18:29:51 GMT"
        },
        {
            "text": "Last night the door finally closed on the Melo Era of Knicks basketball. The transfer is complete. Oklahoma now owns the Melo Way. Yes, we do love him. We'll still follow and root for him. He is a sweet person, with a nice smile and a good friend to the superstars of the NBA. But he's an individual and basketball is a team sport. Teams win, not players. Greatness in baskeball is in the team's spirit, not the accomplishments of an individual.",
            "created": "Sun, 17 Dec 2017 18:30:56 GMT"
        }
    ]
}