{
    "text": "You're supposed to know",
    "created": "Fri, 15 Dec 2023 15:55:58 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Not sure if you all know, I was a math major in college. ",
            "created": "Fri, 15 Dec 2023 15:51:28 GMT",
            "flInCalendar": true
        },
        {
            "text": "It was the weirdest choice for me because, until my first semester of college, not been interested in math. I thought it was boring. ",
            "created": "Fri, 15 Dec 2023 16:04:54 GMT",
            "flInCalendar": true
        },
        {
            "text": "Turns out math <i>wasn't</i> boring, the teachers were boring. ",
            "created": "Fri, 15 Dec 2023 16:05:12 GMT",
            "flInCalendar": true
        },
        {
            "text": "I had a math professor in freshman year, at Lehman College, in the Bronx, who showed me first that I could do it, and then led me to the discovery that hey this is amazing. So I majored in it. ",
            "created": "Fri, 15 Dec 2023 16:05:22 GMT",
            "flInCalendar": true
        },
        {
            "text": "I didn't do great, B-minus average. But there was one class I got an A in, a summer class (in New Orleans), and it was the only class I took. I think that made a big difference, I could just focus on this one subject. My mind has always been like that, I like to zoom in on things. ",
            "created": "Fri, 15 Dec 2023 16:05:43 GMT",
            "flInCalendar": true
        },
        {
            "text": "Anyway, I remember one day, almost 50 years ago, the professor was standing in front of the class, fuming, angry. We had all turned in proofs that didn't work and that included grad students, he pointed out (I was an undergrad). ",
            "created": "Fri, 15 Dec 2023 15:59:49 GMT",
            "flInCalendar": true
        },
        {
            "text": "He said this: \"You're supposed to know when you've proven it.\" ",
            "created": "Fri, 15 Dec 2023 16:00:15 GMT",
            "flInCalendar": true
        },
        {
            "text": "Might be the most important thing I learned from all the math. ",
            "created": "Fri, 15 Dec 2023 16:00:19 GMT",
            "flInCalendar": true
        },
        {
            "text": "It's not math if your proof doesn't work. ",
            "created": "Fri, 15 Dec 2023 16:00:24 GMT",
            "flInCalendar": true
        },
        {
            "text": "<b>Next story</b>",
            "created": "Fri, 15 Dec 2023 16:00:27 GMT",
            "flInCalendar": true
        },
        {
            "text": "A few years later I'm a grad student in Computer Science, and a teaching assistant for a class in assembly language. First semester I was learning it along with the students, although I had already had a class in assembly, you don't really learn it until you teach it. ",
            "created": "Fri, 15 Dec 2023 16:00:34 GMT",
            "flInCalendar": true
        },
        {
            "text": "Anyway, I promised to post example code on the door of my office for students to copy if they needed help on an assignment. I did. When I got back, one of my office mates, whose name I remember to this day, was, like my math prof at Tulane, fuming, this time at me. ",
            "created": "Fri, 15 Dec 2023 16:09:05 GMT",
            "flInCalendar": true
        },
        {
            "text": "She said this -- you have to run your code before you post it. ",
            "created": "Fri, 15 Dec 2023 16:03:13 GMT",
            "flInCalendar": true
        },
        {
            "text": "There was fire coming out of her eyes. ",
            "created": "Fri, 15 Dec 2023 16:03:19 GMT",
            "flInCalendar": true
        },
        {
            "text": "She was right. I was shamed. And obviously never forgot it.",
            "created": "Fri, 15 Dec 2023 16:03:25 GMT",
            "flInCalendar": true
        },
        {
            "text": "Same story really. A proof that doesn't work isn't math. And code that doesn't run isn't software.  ",
            "created": "Fri, 15 Dec 2023 16:04:25 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}