{
    "text": "Likes considered harmful?",
    "created": "Mon, 09 Jan 2023 16:30:16 GMT",
    "type": "outline",
    "description": "On Micro.blog there's a debate about whether Likes are harmful. ",
    "subs": [
        {
            "text": "On <a href=\"https://micro.blog/\">Micro.blog</a> there's a <a href=\"https://retrodivergent.com/2023/01/07/the-problem-with.html\">debate</a> about whether Likes are harmful. ",
            "created": "Mon, 09 Jan 2023 16:31:35 GMT",
            "flInCalendar": true
        },
        {
            "text": "Some of my observations from the thread, all in favor of Likes. ",
            "created": "Mon, 09 Jan 2023 16:31:55 GMT",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "The Like button on various systems is a way of acknowledging that you saw something and thought it was noteworthy. Since micro.blog doesn't have a Like button, what's the proper way of saying that? ",
                    "created": "Mon, 09 Jan 2023 16:34:45 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "As a person who writes posts that get zero response here (and not on other systems) I wish people had a less-committed way of saying they saw something I wrote. That would be a little bit of feedback where currently I get none.",
                    "created": "Mon, 09 Jan 2023 16:42:26 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "If I see something on Micro.blog that I would Like on another system, I don't comment, I just do nothing, not because I'm bashful or overly quiet, rather because this is a language, and a comment has different meaning from a Like. ",
                    "created": "Mon, 09 Jan 2023 16:32:11 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "In real life there's all kinds of non-verbal communication. you can nod your head, smile. We've come up with a similar language online, I don't think there's any more meaning in this. We're being human. Not a huge surprise.",
                    "created": "Mon, 09 Jan 2023 16:33:14 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Here's a parallel. My TV doesn't have a brightness control. It's an expensive screen, and I imagine that the designers of the system figured \"we have a computer in this that knows how to automatically adjust brightness based on room light.\" But it doesn't work properly, I don't know what the problem is, but there are times the TV is useless because you just can't see what's on the screen, because the lack of a brightness control. Maybe if TVs never had brightness controls I wouldn't miss it, but they do in my mind, require one. Same thing here. <i>Like</i> is something that's part of the language of social media. To try to deny that at this stage is kind of pointless imho.",
                    "created": "Mon, 09 Jan 2023 16:33:49 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I've been in this position myself in the past, trying to buck a larger trend, and the pressure really does get you to support the common way, the sooner you do it, the sooner the pain goes away. ",
                    "created": "Mon, 09 Jan 2023 16:38:42 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "BTW, \"considered harmful\" is borrowed from a famous <a href=\"https://homepages.cwi.nl/~storm/teaching/reader/Dijkstra68.pdf\">letter</a> by <a href=\"https://en.wikipedia.org/wiki/Edsger_W._Dijkstra\">Edsger Dijkstra</a> entitled \"goto statement considered harmful.\"",
            "created": "Mon, 09 Jan 2023 17:13:12 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}