{
    "text": "I'm from Queens too",
    "created": "Mon, 22 Jul 2024 16:56:52 GMT",
    "type": "outline",
    "metaImage": "http://scripting.com/images/2024/07/22/utopiaParkway.png",
    "subs": [
        {
            "text": "I grew up in the same part of Queens as Trump, about ten years after he did. His family was in Jamaica, mine in Flushing. Here's a <a href=\"https://www.google.com/maps/dir/2931+170th+Street,+Queens,+NY/85-15+Wareham+Pl,+Jamaica,+NY+11432/@40.74413,-73.7982607,14z/data=!3m1!4b1!4m14!4m13!1m5!1m1!1s0x89c28a8078136589:0xcdf1c8651455269a!2m2!1d-73.7948958!2d40.7696471!1m5!1m1!1s0x89c2611ad4d2c6a5:0xfe60c1b9262c3e04!2m2!1d-73.7858048!2d40.7170409!3e0?entry=ttu\">map</a> that shows you where the two houses are. 4.0 miles apart if you take <a href=\"https://en.wikipedia.org/wiki/Utopia_Parkway\">Utopia Parkway</a>. A great name for a street, but it's not a parkway and it's nice but definitely not a utopia.",
            "created": "Mon, 22 Jul 2024 16:57:00 GMT",
            "flInCalendar": true
        },
        {
            "text": "People who aren't from huge cities like New York don't know that Trump what our losers look like. They probably have their own loser types. I think that's where 99% of the confusion is. They really don't believe he's so bad. Don't hold that against them, that's nowhere near as bad as knowing what he is and being okay with that. ",
            "created": "Mon, 22 Jul 2024 17:00:50 GMT",
            "flInCalendar": true
        },
        {
            "text": "He's a mean bully type. The name-calling is a big clue. Distracts from <i>his</i> weaknesses, which are very obvious. I don't believe in <a href=\"https://en.wikipedia.org/wiki/Body_shaming\">body shaming</a>, because I care about other people's feelings. If I criticize his appearance it might reflect poorly on nice people who have his body type who may not be mean bully losers like Trump. ",
            "created": "Mon, 22 Jul 2024 17:01:09 GMT",
            "flInCalendar": true
        },
        {
            "text": "He's also a really good comedian if you don't think he wants to have the power to kill millions of people and control many more people. Last time he was our president just through incompetence, without trying, he was responsible for the deaths of hundreds of thousands of Americans in the Covid disaster. He also wanted the army shoot protestors, that's the mean part of our former president. Luckily the people who worked for him told him to fuck off. They saved us from going into a very deep hole that would have been hard to escape from.",
            "created": "Mon, 22 Jul 2024 17:02:04 GMT",
            "flInCalendar": true
        },
        {
            "text": "I watched the coverage of the aftermath of the assassination attempt, and listened to the Americans they interviewed, not the actors they put behind him on stage, to make him look like a badass I guess, these were just normal people who mostly like Trump, but seem pretty likeable themselves. The one thing you heard over and over was how If you don't like a candidate vote against them don't shoot them. That's American and it's not fascist at all. I don't think they know that he wants to make big changes in how our politics work. People think if he's bad they can just vote him out next time. He tells them this will be the last election if he wins, he actually says that, but somehow it doesn't seem to register. ",
            "created": "Mon, 22 Jul 2024 17:03:47 GMT",
            "flInCalendar": true
        },
        {
            "text": "Do Trump supporters understand what they support?",
            "created": "Mon, 22 Jul 2024 17:12:37 GMT",
            "inlineImage": "https://imgs.scripting.com/2024/07/22/massDeportationNow.png",
            "flInCalendar": true
        },
        {
            "text": "Of course the journalists are distorting who Trump supporters are. Trump is deplorable if you take him at his word. Some of Trump's followers are deplorable too, like the ones who rioted at our Capitol and January 6 and the people who are lined up to work in his next administration if he wins. They are awful people who want to control all of us. They're already doing it via the Supreme Court. It's going to get a lot worse if we go the wrong way. We shouldn't accept that we're horribly divided. The powerful media people want us to be divided, I don't know why and I don't care, I just know they do, based on their actions. ",
            "created": "Mon, 22 Jul 2024 17:06:13 GMT",
            "flInCalendar": true
        },
        {
            "text": "Anyway I know we're at a high moment, we're excited, and I'm going to enjoy the feeling. We all seem to be pulling the same way, at least on \"our side\" but I hold out hope that being an American still means something, that we can be friends, and fellow countrymen, and work together. I think that's still our greatest challange and our greatest opportunity. Yeah I am woke, that means I care about all of us. I think most of us do no matter who you vote for.",
            "created": "Mon, 22 Jul 2024 17:08:37 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}