{
    "text": "We like Twitter. So blogging must be dead.",
    "created": "Wed, 01 Oct 2025 15:12:33 GMT",
    "type": "outline",
    "metaImage": "https://imgs.scripting.com/2025/10/01/failwhale.png",
    "subs": [
        {
            "text": "I was having a conversation with Dan Knauss from the WordCamp Canada team. He said that people in the WordPress world don't think of it as a blogging community. I can see why they resist that, blogging has gotten a lot of bad PR in the last 19 years. The same bad PR that RSS got, and I felt that was so wrong, as wrong as what people said about blogging. ",
            "created": "Wed, 01 Oct 2025 15:12:37 GMT",
            "flInCalendar": true
        },
        {
            "text": "We like Twitter. So blogging must be dead. I understand -- I get it. But that's marketing, and only necessary because Twitter wouldn't let blogging be part of what they did. I'd be happy to talk about that during my keynote if people want to hear why I think that. ",
            "created": "Wed, 01 Oct 2025 15:16:57 GMT",
            "flInCalendar": true
        },
        {
            "text": "Anyway until 2017 I tried to fit in between the silos. 2017 is when I realized it was hopeless. I couldn't write for the web and for the silos at the same time, I had to choose, so I went with the web. Instant happiness. ",
            "flInCalendar": true
        },
        {
            "text": "Okay so you don't emphasize blogging in the WordPress community. This imho is a mistake. ",
            "flInCalendar": true
        },
        {
            "text": "Even if it was a community built around a style of sneakers or audio equipment I would say it's a mistake not to build a custom blogosphere just for the community. In the past we would have used Twitter for this, but I don't think anyone in their right mind wants to try to do that now. Esp a community, like WordPress, that has open web built into its bones. ",
            "flInCalendar": true
        },
        {
            "text": "I don't have a lot of time to write this morning, so let me leave you with this story. It took years to boot up blogging as a community. I thought everyone would want to do it as soon as they saw what it was, but there needed to be a critical mass before there could be a critical mass. Logically impossible, right, but somehow it happened anyway. But slowly, in fits and starts. ",
            "created": "Wed, 01 Oct 2025 15:15:37 GMT",
            "flInCalendar": true
        },
        {
            "text": "But podcasting, in contrast, happened much more quickly. The reason? We already had blogging to build on. We had a way to communicate without the press in the middle. That's the power of blogging. We build our own news system. Do things the journalists don't understand or are counter to conventional wisdom. ",
            "created": "Wed, 01 Oct 2025 15:16:16 GMT",
            "flInCalendar": true
        },
        {
            "text": "So imho it's only coincidence that WordPress happens to be a great blogging tool. It can be that and all the other things it is. It's going to be something else too, if I have my way -- it's going to define the basic software that powers the social web. Not peripheral, but central. That and RSS. Incredibly powerful combination, and I think ready to be a strong alternative to the silos. In order for that to work, we have to reboot the blogosphere, so we will do that. :-)",
            "created": "Wed, 01 Oct 2025 15:12:48 GMT",
            "flInCalendar": true
        },
        {
            "text": "Cross-posted from <a href=\"https://canada.wordcamp.org/2025/we-like-twitter-so-blogging-must-be-dead/\">WordCamp Canada</a>. ",
            "created": "Wed, 01 Oct 2025 15:12:49 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}