{
    "text": "Frum's dilemma",
    "created": "Wed, 01 Oct 2025 21:11:01 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Listening to today's <a href=\"https://www.theatlantic.com/podcasts/archive/2025/10/the-david-frum-show-sam-harris/684424/\">David Frum podcast</a>, from a journalist who says he reps the facts-only brand of journalism. He says his guest invented podcasting in 2014, about 14 years after we started it. ",
            "created": "Wed, 01 Oct 2025 21:15:38 GMT",
            "flInCalendar": true
        },
        {
            "text": "He then says that anyone in tech in the late 1990s made hundreds of millions of dollars. I didn't make very much money on those terms in the 90s, but I did a lot of the creating in that period. ",
            "flInCalendar": true
        },
        {
            "text": "Both of which tell you more about who he pays attention to than anything resembling the truth.",
            "flInCalendar": true
        },
        {
            "text": "Maybe the first thing journalism can do is let up on the arrogance, they represent their own point of view and nothing more. Humility.",
            "flInCalendar": true
        },
        {
            "text": "Regardless I find that Frum is worth listening too, because he asks questions that are worth thinking about. ",
            "flInCalendar": true
        },
        {
            "text": "In today's podcast he asks if the Dems ever get control of government, should they use the new norms to punish the Repubs who so damaged our system. He says it's a tough question, I say he's made it unnecessarily complicated.",
            "created": "Wed, 01 Oct 2025 21:21:49 GMT",
            "flInCalendar": true
        },
        {
            "text": "The same people are also breaking laws that are on the books. Let the reconstituted DoJ do their jobs. And if there's one thing I'd insist on, they get an AG who doesn't dream a lot about how everyone means well, and they kick off the prosecutions immediately on taking office. And if the courts have been corrupted, then you have to deal with Frum's Dilemma, but not until then.",
            "flInCalendar": true
        },
        {
            "text": "And of course I'm not one of the people he can hear, but if you're one of the people he does listen to could you send this his way. Thanks! :-)",
            "created": "Wed, 01 Oct 2025 21:15:59 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}