{
    "text": "Anna and Stallman",
    "created": "Mon, 01 Oct 2018 14:16:20 GMT",
    "type": "outline",
    "description": "We should have a better pitch for the kids, not all-or-nothing like Stallman, and not total sell-out like the VCs, rather here's how you can help make things better, improve chances for freedom. ",
    "subs": [
        {
            "text": "I just saw my friend <a href=\"https://it.wikipedia.org/wiki/Anna_Masera\">Anna Masera</a> interviewing <a href=\"https://en.wikipedia.org/wiki/Richard_Stallman\">Richard Stallman</a> on <a href=\"https://twitter.com/annamasera/status/1046761759476985856\">Twitter</a>. She asked the right question. I wonder if he knows that he has to sell people on his vision. But it's amazing to see all those young minds show up where ever he does.",
            "created": "Mon, 01 Oct 2018 14:16:26 GMT",
            "image": "http://scripting.com/images/2018/10/01/parrot.png"
        },
        {
            "text": "I had a similar experience when I went to <a href=\"https://www.startupschool.org/\">Startup School</a> in Palo Alto a few years ago. They had all these rich successful entrepreneurs on stage saying how they did it, but during the breaks I was always surrounded by young folk who wanted to know about open technology.  ",
            "created": "Mon, 01 Oct 2018 14:21:54 GMT"
        },
        {
            "text": "We should have a better pitch for the kids, not all-or-nothing like Stallman, and not total rape-and-pillage like the VCs, rather here's how you can help make things better, improve chances for freedom. Because that's how imho you solve the conundrum Anna pointed out. Who goes first, business or education? Well the answer is when you have something open, use it and understand the value in it and protect it. ",
            "created": "Mon, 01 Oct 2018 14:17:24 GMT"
        },
        {
            "text": "So many people who are involved in podcasting for example don't understand how the fact that it's open means they have opportunities. Later when Amazon or Apple or Google take control, they'll wonder how to make it open. That won't work, but keep it open? That can work. ",
            "created": "Mon, 01 Oct 2018 14:18:10 GMT"
        },
        {
            "text": "See also, from 2011: <a href=\"http://scripting.com/stories/2011/10/31/whyIStandUpForStallman.html\">Why I stand up for Stallman</a>. ",
            "created": "Mon, 01 Oct 2018 14:27:52 GMT"
        }
    ]
}