{
    "text": "MTP Daily is the worst cable show ",
    "created": "Fri, 12 Jan 2018 14:05:54 GMT",
    "type": "outline",
    "flDisqusComments": "true",
    "description": "There was a time, believe it or not, when both parties elected people who were fairly competent.",
    "subs": [
        {
            "text": "I watched <a href=\"http://www.msnbc.com/mtp-daily\">MTP Daily</a> yesterday. For a few minutes, and then went back to work. It's an awful awful show. The worst of the worst. ",
            "created": "Fri, 12 Jan 2018 14:18:43 GMT"
        },
        {
            "text": "I hate the show because <a href=\"https://en.wikipedia.org/wiki/Chuck_Todd\">Chuck Todd</a> only talks about the horse race. I swear, the day after the 2016 election he was already talking about how people were \"positioned\" for 2020. This kind of analysis never means anything. Go back and listen to the talk about the 2016 election <a href=\"https://www.youtube.com/watch?v=FHkPadFK34o\">in 2015</a> for a clue.",
            "created": "Fri, 12 Jan 2018 14:10:22 GMT",
            "urlvideo": "https://www.youtube.com/embed/FHkPadFK34o"
        },
        {
            "text": "And they don't even think about elections in a realistic way. Yesterday they were talking about how the Dems failed to sell competence last time (Hillary), so they probably shouldn't try that again. I wonder if they listen to themselves. There was a time, believe it or not, when both parties nominated people who were fairly competent. Even Ronald Reagan, who people thought was a joke, had served as governor of California before becoming president. ",
            "created": "Fri, 12 Jan 2018 14:10:58 GMT"
        },
        {
            "text": "Anyway, assuming competence is an attribute like hair color or gender, height or whatever, the next election is <i>exactly</i> the time to be selling competence. Why? Because the electorate <a href=\"http://scripting.com/2018/01/09/145558.html\">flip flops</a>. We always elect the opposite of what we elected last time.",
            "created": "Fri, 12 Jan 2018 14:12:14 GMT"
        },
        {
            "text": "For example, we elected Trump to follow Obama. ",
            "created": "Fri, 12 Jan 2018 14:08:42 GMT",
            "flNumberedSubs": "true",
            "subs": [
                {
                    "text": "Obama is black and Trump is a racist.",
                    "created": "Fri, 12 Jan 2018 14:12:41 GMT"
                },
                {
                    "text": "Trump throws tantrums and Obama's nickname is \"No Drama.\"",
                    "created": "Fri, 12 Jan 2018 14:12:50 GMT"
                },
                {
                    "text": "Trump is a complete idiot, drooling at the mouth, and Obama has a law degree, is a professor, a total technocrat who probably aced every test he took. Trump probably bought his grades with money or blackmail (probably blackmail).",
                    "created": "Fri, 12 Jan 2018 14:13:09 GMT"
                }
            ]
        },
        {
            "text": "Extrapolating, the next president will probably be a woman, obviously -- but bland and reliable, not too old, known for listening and studious, even pious, and not rich. And <i>not</i> a celebrity.  ",
            "created": "Fri, 12 Jan 2018 14:12:38 GMT"
        },
        {
            "text": "Although I don't know much about her, I would take a good look at <a href=\"https://en.wikipedia.org/wiki/Amy_Klobuchar\">Amy Klobuchar</a> from Minnesota. She's intelligent, passionate, confident, speaks well, has a sense of humor, is well-educated, young but not too young, thoughtful, and has the right values to start to undo the damage done by Repubs during the reign of Trump.",
            "created": "Fri, 12 Jan 2018 14:16:13 GMT"
        },
        {
            "text": "Why not <a href=\"https://en.wikipedia.org/wiki/Kirsten_Gillibrand\">Kirsten Gillibrand</a>? She has many of the same qualities as Klobuchar, but she's from New York. I come from NY too, but I don't think our president should. NY is our largest city, but it's actually a pretty small place. Trump stood out in NY, but we're seeing how that doesn't work globally. But even if it's great to have a president from NY, remember we flip-flop, and I'd say the odds of two consecutive presidents from NY is pretty slim. ",
            "created": "Fri, 12 Jan 2018 14:20:11 GMT"
        },
        {
            "text": "Anyway, as you can see, there are some interesting things to think about for 2020, even though it's so far away. Of course they discussed none of this on MTP Daily yesterday.",
            "created": "Fri, 12 Jan 2018 14:23:02 GMT"
        },
        {
            "text": "PS: You want a courageous Democratic ticket? Klobuchar for president with <a href=\"https://en.wikipedia.org/wiki/Keith_Ellison\">Keith Ellison</a> as VP. Unlike most Democrats these two can complete a sentence without sounding like an idiot. Both from Minnesota, btw, but look at how different they are. They say to white men who vote Trump, fuck you -- you had your chance, this is the way things look now. Get a pair, growth the fuck up and let's really start winning. ",
            "created": "Fri, 12 Jan 2018 14:35:02 GMT"
        }
    ]
}