{
    "text": "Apologize to customers",
    "created": "Tue, 29 Jul 2025 20:28:23 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "<a href=\"https://bsky.app/profile/kevinkelly.bsky.social/post/3lv4vlgcpkp22\">Kevin Kelly writes</a>: \"When a customer of yours complains, always apologize first and ask, 'What can we do to resolve this?' even if it is not your fault. Acting as if the customer is right is a small tax to pay to grow a business.\"",
            "created": "Tue, 29 Jul 2025 20:28:32 GMT",
            "flInCalendar": true
        },
        {
            "text": "Amen. Google sent an email saying my Google Fi account was going to be cancelled if i didn't do something, so I clicked the link, everything looked fine. They sent more emails like this, again everything seemed in order. I contacted them via support (hard to find) and they said everything looked fine. They also said I should be sure there was enough credit in the account. I wrote back saying that was insulting, I've been a customer for a long time, and have never missed a payment, and they should apologize for the threats and wasted time. I got back a <a href=\"https://imgs.scripting.com/2025/07/29/googleFiLotsOfWords.png\">long email</a> that did everything but apologize. They also threw in a little gaslighting, talking about my emotional state (frustrated, unsettled). Companies aren't allowed to have opinions about customers' emotions, esp over email.",
            "created": "Tue, 29 Jul 2025 20:29:01 GMT",
            "flInCalendar": true
        },
        {
            "text": "Google needs to take a basic lesson in how to treat customers. ",
            "created": "Tue, 29 Jul 2025 20:32:15 GMT",
            "inlineImage": "https://imgs.scripting.com/2025/07/29/googleNeedsHelpWithThis.png",
            "flInCalendar": true
        },
        {
            "text": "PS: My feeling was more <i>surprise</i> that Google, a large company with billions of users and millions of customers couldn't get something this simple right. ",
            "created": "Tue, 29 Jul 2025 20:34:31 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}