{
    "text": "August 2",
    "created": "Mon, 02 Aug 2021 12:30:05 GMT",
    "type": "calendarDay",
    "name": "02",
    "subs": [
        {
            "text": "Should we be excited about big silos and podcasting? Apple, Spotify, etc. Well if you like the way news works now on the web, I'm sure you'll love what they do to podcasting. On the other hand, what we have now is what most sane users want. So I say resist them if you can.",
            "created": "Mon, 02 Aug 2021 14:53:33 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Watching the [[Olympics]] is ridiculously hard given that it's 2021 and our entire entertainment system is computerized and networked. They've had plenty of time to adapt, but the entertainment industry is stuck in the 1980s cable model, where ever they can get away with it. Thankfully [[Netflix]] and [[Amazon]] helped to budge them. There should be, if everything were sane, a network location I can go to where I see the schedule of the whole event, past, present and future. I can schedule reminders for upcoming events. And go back, like using YouTube to watch events I missed. Instead I have to hunt and peck, and depend on luck, and the programmer's sense of what'll be popular, and endure NBC's business model, like only making some events available on Peacock, a service I don't use and do not want to subscribe to. It's the same mess as with <a href=\"http://scripting.com/2020/08/06/133617.html?title=moneyForNews\">news on the web</a>. I subscribe to services I never watch. There are a hundred thousand shows on and nothing I want to see, and the stuff I do want to see is inaccessible. Come on. Isn't there a person in power somewhere in TV-Land who is just as fed up as everyone else must be? Meanwhile we should give up the pretense that the athletes represent the USA, they rep NBC and should wear a <a href=\"http://scripting.com/images/2021/08/02/nbcLogo.png\">peacock</a> on their uniforms and salute the NBC flag and their anthem whatever that might be. ",
            "created": "Mon, 02 Aug 2021 14:41:17 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/08/02/nbcLogo.png",
            "flInCalendar": true
        },
        {
            "text": "New header graphic -- <a href=\"http://scripting.com/images/2021/08/02/joeDiMaggio.png\">Joltin Joe</a> hitting one out of the park.",
            "created": "Mon, 02 Aug 2021 14:28:47 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "There's a great <a href=\"https://en.wikipedia.org/wiki/Simon_%26_Garfunkel\">Simon and Garfunkel</a> <a href=\"https://en.wikipedia.org/wiki/Mrs._Robinson\">song</a> called <a href=\"https://www.youtube.com/watch?v=9C1BCAgu2I8\">Mrs Robinson</a> that has this <a href=\"https://pagesix.com/2014/03/07/paul-simon-clears-mystery-behind-joe-dimaggio-lyric/\">lyric</a> -- Where have you gone Joe DiMaggio, a nation turns its lonely eyes to you. I am too young to have been a <a href=\"https://en.wikipedia.org/wiki/Joe_DiMaggio\">Joe DiMaggio</a> fan, and I never loved the <a href=\"https://en.wikipedia.org/wiki/New_York_Yankees\">Yankees</a> (ugh) but I know what it feels like to be missing a hero. Where is <a href=\"http://scripting.com/2021/02/15/172451.html?title=mcneilTheJeremyLinOfTheNyt\">Donald McNeil</a>? The [[Covid]] crisis is still with us. We knew it wasn't going away that easily. If the [[NYT]] hadn't canned him, I'm sure he would have told us that. Now what? We miss him. At least this former Daily podcast listener turn our lonely eyes to him. Where is his Twitter account? How about a weekly podcast with him and someone to play the role of <a href=\"https://en.wikipedia.org/wiki/Michael_Barbaro\">Michael Barbaro</a>, an interested neophyte to represent us, to quiz the hardened Old Man of Covid, [[Donald McNeil]]? A weekly commentary on what's going on with Covid. That's a [[podcast]] I'd pay money for, if only for the peace of mind and the chance that his wisdom will save my life, and the lives of others.",
            "created": "Mon, 02 Aug 2021 12:30:06 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/12/24/rooster.png",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}