{
    "text": "August 3",
    "created": "Tue, 03 Aug 2021 17:21:33 GMT",
    "type": "calendarDay",
    "name": "03",
    "subs": [
        {
            "text": "If you want to understand the utility of outliners, you have to understand renderers and processors. More about this soon.",
            "created": "Tue, 03 Aug 2021 21:44:52 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1422660407890747392\">In my humble opinion</a>, the thing to do is insist on being able to buy cable service without paying for Fox. But none of the talking heads will call for this because they all depend on a good relationship with the cable system owners. A very deep conflict of interest, across the board. It's like software devs can't afford to piss off Google or Apple, or else they'll figure out a way to kick them out of their app stores. There was a famous slogan at Microsoft back in the day, \"No version of DOS will ship until Lotus doesn't run.\" I'm sure it was just a joke. :smile:",
            "created": "Tue, 03 Aug 2021 21:40:39 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/11/30/apple.png",
            "flInCalendar": true
        },
        {
            "text": "I went to a <a href=\"https://www.yelp.com/biz/migliorelli-farm-stand-phoenicia\">farm produce stand</a> on 28 in <a href=\"https://www.google.com/maps/place/Migliorelli+Farms/@42.0329671,-74.2749173,15z/data=!4m5!3m4!1s0x0:0xdd7ed88ac0c706ec!8m2!3d42.0329439!4d-74.2749978\">Mt Tremper</a> yesterday to get fresh local peaches, just now coming into season, and everyone was masked up. I think we're doing the wise thing in NY state. It's easy to put a mask on, much easier than being intubated and dying. The peaches are the best part of the year except for the apple harvest. On the other hand at the hardware store, I was the only one wearing a mask. So maybe it's not <i>all</i> peaches yet. ",
            "created": "Tue, 03 Aug 2021 20:04:00 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The [[NBA]] free agent season started last night. The [[Knicks]] are <a href=\"https://elitesportsny.com/2021/08/02/new-york-knicks-2021-free-agency-tracker-signings/\">sticking</a> mostly with the players that made last season so much fun. This Knicks fan approves. <a href=\"https://theknickswall.com/knicks-prioritize-re-signing-veteran-core-during-free-agency/\">Steady</a> as it goes, no superteam-building in Manhattan. ",
            "created": "Tue, 03 Aug 2021 17:21:34 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}