{
    "text": "August 5",
    "created": "Thu, 05 Aug 2021 12:32:00 GMT",
    "type": "calendarDay",
    "name": "05",
    "subs": [
        {
            "text": "Obviously <a href=\"https://www.vox.com/policy-and-politics/2021/8/5/22607465/tucker-carlson-hungary-orban-authoritarianism-democracy-backsliding\">Tucker Carlson</a> wants to the <a href=\"https://en.wikipedia.org/wiki/Viktor_Orb%C3%A1n\">Viktor Orbán</a> of the US. ",
            "created": "Thu, 05 Aug 2021 17:56:37 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I recently got [[Drummer]] to work reasonably well on a tablet like an iPad. But I'm thinking about doing something different for phones. I wonder if you think any note-taking tool on a phone is doing a particularly great job. Just the right size. Not too complicated. Easy to make notes, easy to refer to notes. If so, could you post a screen shot <a href=\"https://twitter.com/davewiner/status/1423267186794246154\">here</a>. BTW -- I don't <a href=\"https://twitter.com/davewiner/status/1423269337763303427\">insist</a> on doing this app. In fact I'd prefer not to.",
            "created": "Thu, 05 Aug 2021 12:54:06 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/06/14/strongman.png",
            "flInCalendar": true
        },
        {
            "text": "I just had an [[idea]]. What if you could view my blog in a special mode where you could tag individual words. Create your own index for my writing. It wouldn't be easy to spam it, or be abusive. Maybe at first your tags would just be aggregated with your other tags, but they would be publicly visible. Fan sites might develop, that remix blogs in different ways. I've been looking for ways to make my blog more participatory, without opening it up to too much uglyness. :boom:",
            "created": "Thu, 05 Aug 2021 12:49:02 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "There's a renewed <a href=\"https://twitter.com/davewiner/status/1423261135021740034\">interest</a> in people getting \"verified\" blue checkmark on [[Twitter]]. It's interesting that [[Jack Dorsey]] who is also the founder and CEO of a big successful payments company, can't get it together for Twitter to verify the identity of users in a routine way.The post office does it using credit cards. I can have my mail forwarded simply by paying them $1 with a credit card that has the address being forwarded from as its registered address. BTW, I got verified myself a few years back by doing nothing. They sent me an email saying they know who I am and that the account I registered really is me, so they went ahead and gave me the blue checkmark. I'm sure Dorsey et al know how valuable that asset is for them, and the people who have them. ",
            "created": "Thu, 05 Aug 2021 12:45:19 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "This must-read <a href=\"https://donaldgmcneiljr1954.medium.com/what-is-biden-waiting-for-193df3fb4ac9\">piece</a> is by [[Donald McNeil]], the [[NYT]] reporter they fired, probably for telling the truth about [[Covid]], stuff that none of their new Covid reporters would ever say. Read it, you’ll get fresh ideas on what the US government must have the courage to do now to save your life.",
            "created": "Thu, 05 Aug 2021 12:35:26 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}