{
    "text": "August 7",
    "created": "Sat, 07 Aug 2021 14:28:07 GMT",
    "type": "calendarDay",
    "name": "07",
    "subs": [
        {
            "text": "[[Rick and Morty]] -- one of the best <a href=\"https://en.wikipedia.org/wiki/Rick_and_Morty\">TV series</a> ever. It had barely registered with me until about a week ago, when I, in a fit of boredom, decided to give it a try. I was hooked almost from the beginning. Rick, Morty's grandfather, has spent his life exploring the universe, and has a really depraved sense of everything, but he also loves to party. Morty, who is high school age, sort of puts up with Rick, and he always has issues with him. Every episode has at least a couple of really novel and funny scifi themes involving alien civilizations who are truly weird, and horrible situations Rick gets them into. It's like a lot of sitcoms, the <a href=\"https://en.wikipedia.org/wiki/The_Honeymooners\">Honeymooners</a> for example, where Rick is Ralph Cramden and Morty is Ed Norton. Or <a href=\"https://en.wikipedia.org/wiki/I_Love_Lucy\">I Love Lucy</a> where Rick is Lucy and Morty is Ethel Mertz. Or <a href=\"https://en.wikipedia.org/wiki/Breaking_Bad\">Breaking Bad</a> where Rick is Walter White and Morty is Jesse Pinkman. It is LOL funny almost every episode. The people who do this show are off the scale creative. How do they keep thinking up these things? So perverse, sexual, vain, moronic, pathetic, depraved, mean, evil, pointless -- all the funniest crazy things we laugh at humanity over. I'm just through season 2, there are <a href=\"https://en.wikipedia.org/wiki/List_of_Rick_and_Morty_episodes\">five seasons</a>. Archive is on HBO and <a href=\"https://showrss.info/show/44.rss\">other</a> places. Season 5 is on <a href=\"https://www.adultswim.com/\">Adult Swim</a>. ",
            "created": "Sat, 07 Aug 2021 15:26:15 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/08/07/rickAndMorty.png",
            "flInCalendar": true
        },
        {
            "text": "I'm starting to get some concrete ideas on what to tag and what not to tag. In the piece about Rick and Morty, above, I tagged the name of the show. I did not tag the names of the shows I compared it to. In the post about the Olympics gold medal game, I tagged the Brooklyn Nets, because I have an issue with them, and that issue a pivotal reason I didn't love the US Olympic team as much as I would have if they were more of a team. The Nets aren't a team either, maybe they will at some point. We're going to keep watching them, so I think there's a reasonably good chance I'll write about them again and again in this same context. They're an ongoing thread on my blog. And I have an issue with the Olympics, so I tagged them too. I did not tag any of these things in this post, but I did tag [[tagging]], because that's what this is about. 💥",
            "created": "Sat, 07 Aug 2021 20:55:21 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I got to watch the second half of last night's gold medal game between France and the US. Something strange happened, almost immediately I was rooting for France, because the USA team reminded me of the [[Brooklyn Nets]]. A team formed quickly with star NBA players for the sole purpose of winning a championship. The French team, on the other hand, while they had a <a href=\"https://en.wikipedia.org/wiki/Rudy_Gobert\">star</a> or two from the NBA, and a <a href=\"https://en.wikipedia.org/wiki/Evan_Fournier\">future</a> and <a href=\"https://en.wikipedia.org/wiki/Frank_Ntilikina\">former</a> Knick, practiced together for quite some time, and had the fluidity that comes from being a team. The American all-stars did not. But they did have [[Kevin Durant]], and that made the difference. He is an awesome talent, maybe the best to ever play the game, certainly in the top ten. And the <a href=\"https://www.nytimes.com/live/2021/08/06/sports/olympic-basketball-usa-france\">USA did win</a>, and I can't say I'm sad about that, because I'm a nephew of Uncle Sam, but I did like the spirit of the <a href=\"https://en.wikipedia.org/wiki/France_men%27s_national_basketball_team#2020_Olympic_roster\">French team</a>, and I would have been happy if they won. I am not a fan of the [[Olympics]]. I think they are playing for NBC and their advertisers, and I also think they should have one great venue for summer and winter, and stop all the waste. We have to change the way we run our civilization, or we won't have a civilization. ",
            "created": "Sat, 07 Aug 2021 14:28:08 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/08/07/kevinDurant.png",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}