{
    "text": "August 8",
    "created": "Sun, 08 Aug 2021 13:53:33 GMT",
    "type": "calendarDay",
    "name": "08",
    "subs": [
        {
            "text": "We spend a trillion on defense, but it doesn’t protect us against Russia or the virus. Humbly suggest perhaps we‘re spending all that money preparing for the <a href=\"https://en.wikipedia.org/wiki/Maginot_Line\">wrong war</a>.",
            "created": "Sun, 08 Aug 2021 16:01:39 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "When I was in grad school I was famous for writing great error messages. That was from their point of view, and the time (mid-late 70s). From my point of view, then and now -- I was making tools that made computer science useful for people, not just better compilers and databases. My error messages <i>were</i> better, because I was writing them to try to communicate something to the user. This, at the time, was a relatively new idea. They certainly didn't teach it in CS grad school. I wonder if they do now?",
            "created": "Sun, 08 Aug 2021 15:58:28 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I completely forgot about this <a href=\"https://github.com/scripting/myRoute53\">Node script</a> I wrote that lists all your Route 53 names, <a href=\"http://scripting.com/2016/08/08/makingAmazonsDnsApiSimple.html\">five years ago</a>. This would make a very nice addition for Drummer scripting. ",
            "created": "Sun, 08 Aug 2021 14:48:56 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Excuse me, but if <a href=\"https://www.thecity.nyc/2021/8/3/22608713/could-cuomo-face-jail-time-following-attorney-generals-harassment-report\">Cuomo can be arrested</a>, and why not, then please arrest the Trump who was recorded trying to commit a fraud against the voters of Georgia and to overthrow the elected government of the US. Let's go already police, wtf are you waiting for.",
            "created": "Sun, 08 Aug 2021 14:08:18 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/08/08/starbucks.png",
            "flInCalendar": true
        },
        {
            "text": "I have a great <a href=\"https://www.amazon.com/dp/B07S92QBCJ?psc=1&ref=ppx_yo2_dt_b_product_details\">Logitech keyboard</a>, but the keys started sticking due to humidity so I bought a replacement. Just set it up. The instructions were horrible, just diagrams, no words. And the whole thing doesn't work if you plug the keyboard into charge it up before doing the setup. You gotta wonder if they test the instructions with human beings. I like products that just work. But. Now that it's set up, having a brand new keyboard is one of the great pleasures of life. Like having a new car to drive. Every keystroke feels wonderful. But then one of my neighbors is cutting down trees, and making huge loud noise doing so, at unpredictable times. There goes my concentration! Oy. ",
            "created": "Sun, 08 Aug 2021 13:53:34 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}