{
    "text": "February 1",
    "created": "Fri, 01 Feb 2019 13:12:22 GMT",
    "name": "01",
    "subs": [
        {
            "text": "Porzingas",
            "created": "Fri, 01 Feb 2019 13:16:39 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Is it worth it being a fan of sports? Yesterday in NYC we learned first that Kristaps Porzingas, our young star, was not convinced that the culture of the Knicks had changed. Then minutes later, rumors of a trade to Dallas, a move that just clears cap space, that doesn't get the Knicks a star that's comparable in any way to the one we're giving up.  A few minutes later the deal is confirmed. ",
                    "created": "Fri, 01 Feb 2019 13:21:26 GMT",
                    "image": "http://scripting.com/images/2017/11/15/kristaps.png"
                },
                {
                    "text": "It was a shock. Then after letting it settle in a bit, I realized how much I had looked forward to seeing him blossom as a Knick. That all the young players the team was accumulating and developing were his team to lead, and it wasn't good enough for him. After a few years of him saying how much he loved New York, he goes to Dallas of all places, because they have a player there he'd like to play with. The ones we drafted, for him, weren't good enough, I guess. ",
                    "created": "Fri, 01 Feb 2019 13:22:08 GMT"
                },
                {
                    "text": "The Knicks are not the Mets. I can handle the Mets sucking year after year, because eventually they pull it together and make history, again. There's something to hope for, to root for. But the Knicks are mired, ever since they dealt the whole roster to Denver to get Melo. Ever since then it's been one <a href=\"http://static.scripting.com/larryKing/images/2014/02/25/meloLin.gif\">disappointment</a>, mostly self-inflicted, after another. ",
                    "created": "Fri, 01 Feb 2019 13:22:36 GMT"
                }
            ]
        },
        {
            "text": "I wrote this for a friend",
            "created": "Fri, 01 Feb 2019 13:12:23 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "In 2015 a friend was going through a tough time. The bottom had dropped out of his tech industry life. It had happened to me. I gave him the advice that worked for me, that helped me go on after my dreams of grandeur had been revealed to be foolish. I posted it <a href=\"https://www.facebook.com/dave.winer.12/posts/887204091486997?notif_id=1549026273419642&notif_t=feedback_reaction_generic\">on Facebook</a> for some reason, which proves I guess that despite what so many say, it has or at least had a purpose. ",
                    "created": "Fri, 01 Feb 2019 13:12:28 GMT",
                    "subs": [
                        {
                            "text": "I have a friend who's going thru a familiar struggle. I have some advice that's imho worth sharing.",
                            "created": "Fri, 01 Feb 2019 13:15:12 GMT"
                        },
                        {
                            "text": "Go some place natural. Alone. Where no one knows you or who you know. Subtract everything that defines you as a pundit or friend of the rich and famous. No gadgets."
                        },
                        {
                            "text": "Swim. Get massaged. Try being quiet. Talk about your childhood. Find yourself, the person you've been hiding from."
                        },
                        {
                            "text": "Just be another random person, one of seven billion, because that is the truth. That is who you are. Who I am. Who everyone is. When you really feel it a weight comes off. None of this shit matters."
                        }
                    ]
                }
            ]
        }
    ]
}