{
    "text": "February 8",
    "created": "Fri, 08 Feb 2019 20:07:08 GMT",
    "name": "08",
    "subs": [
        {
            "text": "There was a point in the development of \"RSS\", after a few VCs invested in startups, that the consensus among them (the founders and the investors) was that RSS was theirs, and they told me to my face they weren't going to listen, because I was the old way, and they were the new. (Famous last words.) Even some people who thought they were friends did this, perhaps not so bluntly. Okay now fast forward, all the startups are gone, they were so stupid they failed for many other reasons, not just their arrogance and closed minds. Stupid people. Here's a better rule. Listen by default. Tech is filled with idiotic arrogance. It's a kind of narcissism. I am the only one who can think. Bullshit. Look at all you're building on. The people who created that not only had an idea, <i>but they were right. </i>That's a very rare combination. And until you have built something like that, you are <i>not</i> smarter. And once you have, you know other people are smart, because that's what you learn. ",
            "created": "Fri, 08 Feb 2019 20:53:48 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/02/08/oklahoma.png"
        },
        {
            "text": "New header image -- a <a href=\"http://scripting.com/images/2019/02/08/driveway.png\">snowy driveway</a>. Previous: <a href=\"http://scripting.com/images/2018/01/14/mlkAtRally.png\">MLK</a>.",
            "created": "Fri, 08 Feb 2019 20:32:13 GMT",
            "type": "outline"
        },
        {
            "text": "New York should just buy a team, coaches, players, owner -- the whole thing, and move it into the Garden. The <a href=\"https://twitter.com/TheAthleticNYC/status/1093963720877842432\">other city</a> can have all the rookies and draft picks. New York is the greatest city in the US. It should have the greatest NBA team. We can afford it. Failing that, if Bloomberg doesn't run for president, could he just fucking buy the Knicks and manage it in an interesting way? I don't know if he's a basketball fan, but somehow I think he <i>might</i> do better than Dolan. ",
            "created": "Fri, 08 Feb 2019 20:07:09 GMT",
            "type": "outline",
            "image": "http://static.scripting.com/larryKing/images/2013/12/07/knicksTeam.gif"
        }
    ]
}