{
    "text": "February 15",
    "created": "Fri, 15 Feb 2019 14:56:34 GMT",
    "name": "15",
    "subs": [
        {
            "text": "There's been a lot of discussion Twitter lately about how it can become a better system to conduct an interview, after a hard-to-follow interview between Kara Swisher and Jack Dorsey. Maybe Twitter is a publishing medium and not a chat room. Every product has design choices built in, if you make it a great chat app you end up with something other than what Twitter is. No product is everything to everyone, a lesson learned when integration was a huge push in the software business. A better approach is to use Twitter tech to glue together a variety of apps, each with their focus on one aspect of networked communication and publishing.",
            "created": "Fri, 15 Feb 2019 14:56:35 GMT",
            "type": "outline",
            "image": "http://scripting.com/2019/02/15/houseOfCards.png"
        },
        {
            "text": "Future of journalism, part 1",
            "created": "Fri, 15 Feb 2019 16:57:59 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "<i>Note: I am keynoting the <a href=\"https://isoj.org/symposia/2019/\">ISOJ conference</a> in Austin in April, and am gathering my thoughts in advance in the form of blog posts (of course). Here's the first nugget. </i>",
                    "created": "Fri, 15 Feb 2019 16:58:05 GMT"
                },
                {
                    "text": "Journalism should ask itself this question -- why is Facebook making billions in profit every year and growing at such a huge rate, when journalism is stuck in the mud on the verge of collapse.",
                    "created": "Fri, 15 Feb 2019 16:58:33 GMT"
                },
                {
                    "text": "If this were tech, the CEOs of the journalism companies would be trying to figure out how to grab some of that growth.",
                    "created": "Fri, 15 Feb 2019 16:59:44 GMT"
                },
                {
                    "text": "That's where we start our exploration. :boom:",
                    "created": "Fri, 15 Feb 2019 16:59:54 GMT"
                }
            ]
        }
    ]
}