{
    "text": "February 19",
    "created": "Tue, 19 Feb 2019 19:53:16 GMT",
    "name": "19",
    "subs": [
        {
            "text": "If I were CEO of the NYT",
            "created": "Tue, 19 Feb 2019 19:53:17 GMT",
            "type": "outline",
            "description": "I had a dream that I was CEO of the NYT. I was ready to take on Facebook and to bring fresh ideas into the journalism we make and the news we report.",
            "subs": [
                {
                    "text": "I was recently asked what I would do if I were in charge of a major news org like the NY Times. This is a game I love to play. (I've done it <a href=\"http://scripting.com/davenet/1996/01/08/gottabearetha.html\">before</a>, in 1996, with Apple.) ",
                    "created": "Tue, 19 Feb 2019 19:55:30 GMT"
                },
                {
                    "text": "Here's what I would do.  ",
                    "created": "Tue, 19 Feb 2019 19:55:56 GMT",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "I would start a blog hosting service, with NYT branding, it would be carefully designed so that people knew this was blog space and not editorial space. The Times editorial people do not control what's said here. These are our sources. Maybe the site would be called sources.nytimes.com. ",
                            "created": "Tue, 19 Feb 2019 19:56:00 GMT"
                        },
                        {
                            "text": "I would offer a blog to every person who was quoted in a NYT story. This would give people an extra reason to work with our reporters. It would also serve as  vetting. If their ideas or experiences are valuable enough to be quoted in our news flow, we want to stay in touch, and this is a great way to do that. ",
                            "created": "Tue, 19 Feb 2019 19:56:44 GMT"
                        },
                        {
                            "text": "There would be a central place where the posts of all the sources are aggregated. Reverse chronologic. Until it became overwhelming, then you could opt out of the full flow, and subscribe to individual blogs. <i>All this would be under reader control.</i>",
                            "created": "Tue, 19 Feb 2019 19:58:41 GMT"
                        },
                        {
                            "text": "Of course all the NYT reporters, editors, managers, board members, everyone who gets a paycheck from the NYT, would have a blog here too. However they would not have any special access. It's a level playing field.",
                            "created": "Tue, 19 Feb 2019 19:59:29 GMT"
                        },
                        {
                            "text": "It's not a silo. Every blog has an RSS feed so it can be subscribed to independently of the others.",
                            "created": "Tue, 19 Feb 2019 20:00:05 GMT"
                        },
                        {
                            "text": "It's the place of record on the web. We'd partner with several long-lived institutions as backups. archive.org, obviously. Several universities, other news orgs, spread around the world, a hedge against a failure of the American government. ",
                            "created": "Tue, 19 Feb 2019 20:00:33 GMT"
                        },
                        {
                            "text": "The user interface would be simple and clean. Fast. You should feel as if you already know how to use it. ",
                            "created": "Tue, 19 Feb 2019 20:01:28 GMT"
                        },
                        {
                            "text": "Behind the scenes we would encourage our editorial people to quote sources directly from the NYT-hosted blogs. Other news orgs of course would also be welcome to quote from them. :smile:",
                            "created": "Tue, 19 Feb 2019 20:01:59 GMT"
                        },
                        {
                            "text": "Of course as soon as we move, other news orgs will want to do what we do. That's great. We should be compatible with them. None of the tech is proprietary. Lots of room for innovation. People will come to the NYT because we are the NYT. We don't need to own our readers or our sources. ",
                            "created": "Tue, 19 Feb 2019 20:13:08 GMT"
                        }
                    ]
                },
                {
                    "text": "Discussion",
                    "created": "Tue, 19 Feb 2019 20:06:04 GMT",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "This represents a compromise. We're not going directly after Facebook, though I'd certainly think about ways to do that. This is a level playing field within the community we define. Maybe being quoted in the NYT isn't enough, or maybe it's too much. ",
                            "created": "Tue, 19 Feb 2019 20:02:41 GMT"
                        },
                        {
                            "text": "Make sure the elite aren't over-represented. Let's find future @AOC's out there. And the journalism equiv of AOC. ",
                            "created": "Tue, 19 Feb 2019 20:03:37 GMT"
                        },
                        {
                            "text": "News will be made on this system. That's good. After all, that's the business we're in -- news. More news? Make my day. ",
                            "created": "Tue, 19 Feb 2019 20:03:45 GMT"
                        },
                        {
                            "text": "Once it catches on, I'd open a physical space in midtown Manhattan. It would be set up as a newsroom for sources and reporters and a place for press events. The writers don't pay to participate, but the people with messages for them do. This is the <a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+hypercamp&t=h_&ia=web\">Hypercamp</a> idea, that has yet to happen. News can't be all virtual. There's huge power in physical spaces for idea flow. Once the NY one catches on, open one in another major city. They will never be as plentiful as Starbucks, but there could be a lot of them. News is made everywhere, after all.",
                            "created": "Tue, 19 Feb 2019 20:29:09 GMT"
                        },
                        {
                            "text": "It also helps get some fresh thinking into the NYT, something it desperately needs. Times reporters do not engage with people who they don't see as peers. This sucks for the health of our society and political system. Not only aren't good ideas the exclusive province of the elites, the elites are often too scared to say what they really think, if they haven't already had the creativity beaten out of them. People with nothing to lose (i.e. non-elites) have good ideas too and are more free to express them. ",
                            "created": "Tue, 19 Feb 2019 20:04:13 GMT"
                        },
                        {
                            "text": "There's not much time to waste. ",
                            "created": "Tue, 19 Feb 2019 20:16:07 GMT"
                        }
                    ]
                }
            ]
        }
    ]
}