{
    "text": "February 21",
    "created": "Thu, 21 Feb 2019 14:56:40 GMT",
    "name": "21",
    "subs": [
        {
            "text": "<a href=\"http://scripting.com/2019/02/21/possibleOpeningForIsojTalk.m4a\">Podcast</a>: Possible opening for my \"ISOJ\" talk. If journalism is about democracy, then the role it has for citizens is too limited. Give us money. We have so much more to give. Approx 6 minutes.  ",
            "created": "Thu, 21 Feb 2019 18:11:21 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2019/02/21/possibleOpeningForIsojTalk.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "3245371"
        },
        {
            "text": "We all feel disempowered",
            "created": "Thu, 21 Feb 2019 17:33:44 GMT",
            "type": "outline",
            "description": "Paying $100 a year to the NYT doesn't do it for me. I have to do more. ",
            "subs": [
                {
                    "text": "I <a href=\"https://twitter.com/davewiner/status/1098591900796403715\">responded</a> to a tweet by Sarah Kenzdior re normalcy bias, which was right on, with an observation that we feel disempowered. We don't think we can do anything to change, so we don't do anything.",
                    "created": "Thu, 21 Feb 2019 17:33:51 GMT",
                    "urltweet": "https://twitter.com/davewiner/status/1098591900796403715"
                },
                {
                    "text": "I forwarded this to my file for the \"isoj\" conference, with a comment.",
                    "created": "Thu, 21 Feb 2019 17:34:45 GMT",
                    "subs": [
                        {
                            "text": "Bottom line -- paying $100 a year to the NYT doesn't do it for me. I have to do more. And the NYT is totally part of the problem. They do actually post a lot of fake news. It's so screwed up that Trump actually is right about this. I'm not saying the Times can or should change, I don't think they can. But I also don't accept that all I can do is sit on the sidelines and watch the world descend deeper into the abyss. These conferences tend to generate their own reality, as does the news industry. Problem is that reality is getting further and further from what's actually happening. ",
                            "created": "Thu, 21 Feb 2019 17:36:27 GMT"
                        }
                    ]
                },
                {
                    "text": "<a href=\"http://timothysnyder.org/\">Timothy Snyder</a> has good advice about this. Invest in local news. And btw, I have a lot more to invest than money. We have to get more going here than us giving money to reporters who don't listen to us. That's basically the answer the news industry has for me. Give us money. Well you have to do better than that. ",
                    "created": "Thu, 21 Feb 2019 17:46:37 GMT"
                }
            ]
        },
        {
            "text": "Feature request for Twitter",
            "created": "Thu, 21 Feb 2019 14:56:41 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "When a link goes to a paywall site, indicate that clearly on the tweet. Even better, give me a filter so I don’t have to see them. ",
                    "created": "Thu, 21 Feb 2019 14:56:46 GMT",
                    "urltweet": "https://twitter.com/davewiner/status/1098583450452443138"
                },
                {
                    "text": "Then, a couple of interesting observations...",
                    "created": "Thu, 21 Feb 2019 14:57:12 GMT",
                    "subs": [
                        {
                            "text": "David Teicher: \"Or, let me pay like $.25 to access that one article directly thru twitter. Split the revenue with the publisher\"",
                            "created": "Thu, 21 Feb 2019 14:58:31 GMT",
                            "subs": [
                                {
                                    "text": "This is an interesting idea. Not sure I'd go for it. But Twitter might have the Netflix-for-News platform. I honestly had never thought of this. ",
                                    "created": "Thu, 21 Feb 2019 14:59:44 GMT"
                                }
                            ]
                        },
                        {
                            "text": "Dennis Kennedy: \"I try not to retweet links to articles that are on paywall or subscription sites, or that I know will run a reader through an ad maze to try to read the article. I, too, wish an automatic marking of these kinds of sites was a feature on Twitter.\" ",
                            "created": "Thu, 21 Feb 2019 14:57:28 GMT",
                            "subs": [
                                {
                                    "text": "I responded: \"Interestingly if they were marked, you wouldn't mind passing on the link. I know I would. I post links to NYT stories, knowing I might be costing people some of their free stories. I'd do it more often if readers were properly warned.\"",
                                    "created": "Thu, 21 Feb 2019 14:58:11 GMT"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}