{
    "text": "February 23",
    "created": "Sat, 23 Feb 2019 11:42:22 GMT",
    "name": "23",
    "subs": [
        {
            "text": "<a href=\"http://scripting.com/2019/02/23/strikingABalance.m4a\">Podcast</a>: Coverage of the Democratic candidates for 2020 has to be tempered by this reality: The Republican candidate is not capable of doing the job. If an issue doesn't cripple the Dem candidate to the level the Repub candidate, then don't report it. 12 minutes.",
            "created": "Sat, 23 Feb 2019 13:01:49 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2019/02/23/strikingABalance.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "6343435",
            "image": "http://scripting.com/2019/02/23/idiocracy.png"
        },
        {
            "text": "Proposed criteria for reporting a scandal in a presidential candidate. If it's something a foreign government could blackmail them for, and thereby take control of the government, then report it. Under this criteria, if \"ate salad with a comb\" is the worst you could find, keep looking.",
            "created": "Sat, 23 Feb 2019 19:18:53 GMT",
            "type": "outline"
        },
        {
            "text": "Behind a paywall, <a href=\"https://www.washingtonpost.com/opinions/adam-schiff-an-open-letter-to-my-republican-colleagues/2019/02/21/9d411414-3605-11e9-af5b-b51b7ff322e9_story.html?fbclid=IwAR2hDGqqKZ9SEJGtTJd8pdPtMc7isBmjtvBo8O09wD1H1a2Ilzo2Q2LXmRo&utm_term=.91eb5aa2989c\">Adam Schiff</a> writes a supposedly “open” letter to his Republican colleagues. This is wrong. As a US government employee, a member of Congress, his writing should be accessible to every American. Putting it behind a paywall is not open. They must stop using private websites to communicate publicly. The US government should provide a well-archived public website for them to post their thoughts on. A place of record. This is not rocket science in 2019. I cc'd this to my friend <a href=\"http://jeremyzilar.com/\">Jeremy Zilar</a> who works for the US at <a href=\"http://jeremyzilar.com/work/digitalgov/\">Digital.gov</a>, which is responsible for these kinds of projects.  ",
            "created": "Sat, 23 Feb 2019 12:00:26 GMT",
            "type": "outline"
        },
        {
            "text": "I cancelled my NYT subscription",
            "created": "Sat, 23 Feb 2019 11:42:23 GMT",
            "type": "outline",
            "description": "Klobuchar’s comb was a bridge too far. ",
            "subs": [
                {
                    "text": "<a href=\"https://www.memeorandum.com/190222/p72#a190222p72\">Klobuchar’s comb</a> was a bridge too far. She's going to be asked about the comb in every interview from now on. Every time they talk about her, the analysts on TV will ask if she can overcome the comb factor. When she tries to get past it, they'll say she is uncomfortable or unlikeable. That is, if it goes like other trash scandals the NYT has started. ",
                    "created": "Sat, 23 Feb 2019 11:43:18 GMT",
                    "image": "http://scripting.com/images/2019/02/23/herEmails.png"
                },
                {
                    "text": "I was paying them $15 a month. I had been a digital subscriber since 2010.",
                    "created": "Sat, 23 Feb 2019 12:00:58 GMT"
                },
                {
                    "text": "Until now I have chosen to stay with the NYT as a subscriber each time they do something like this, figuring there was still enough value to continue. But this was too much, too deliberate, too unnecessary. She was hungry, so she ate a salad with a comb instead of her fingers, because there was no fork, and then told her assistant to get it cleaned. This is how they open a story about what a shitty boss she is. I don't have to read the rest if this is what they thought was the strongest point. I suspect that's not why they put it up front. Rather it's an image that stays with you, for me because there's another image of a politician putting his comb in his mouth, many years ago. It was horribly embarrassing, it was impossible to shake the image, and it was wrong that the press made that an issue too. ",
                    "created": "Sat, 23 Feb 2019 11:44:51 GMT"
                },
                {
                    "text": "At this point this isn't a news org I care to read, or support. They brought us Hillary's Emails and the Iraq war, and lots of fake scandals. I don't know how people get so depraved, because now our country is in deep trouble and our political system is at the core of it. And the NYT and other supposed high integrity news orgs are at the center of problem in our political system. I won't be reading the NYT, and I won't be passing on links. I'll freeze the NYT river. I guess I will continue to listen to the Daily podcast, it's not behind a paywall. Which is the shame of it, there are still journalists at the NYT doing good work. But they work alongside some irresponsible out of control people. ",
                    "created": "Sat, 23 Feb 2019 11:47:58 GMT"
                },
                {
                    "text": "Also here's a <a href=\"http://scripting.com/images/2019/02/23/cancelTheAccount.png\">screen shot</a> of the transcript I had with their chatbot, who was trying to convince me to stay. I mistakenly entered my name as <i>Cancel my subscription</i> at the beginning of the chat. Heh. That actually makes the transcript more interesting. :boom:",
                    "created": "Sat, 23 Feb 2019 11:50:29 GMT"
                },
                {
                    "text": "Update: I recorded a 12-minute <a href=\"http://scripting.com/2019/02/23/strikingABalance.m4a\">podcast</a> with bigger lesson from where we're at in the 2020 election and not letting the major news orgs make the same mistake they made in 2016. ",
                    "created": "Sat, 23 Feb 2019 13:42:49 GMT"
                }
            ]
        }
    ]
}