{
    "text": "February 28",
    "created": "Thu, 28 Feb 2019 13:11:54 GMT",
    "name": "28",
    "subs": [
        {
            "text": "<a href=\"https://twitter.com/rawkstarr/status/1101142809657073665\">Michael Calore</a>: \"Thanks, but I'll continue with my ad blocker turned on. No I don't want desktop notifications. No I don't want your newsletter. No I don't want to see this video. No I don't want to chat with the bot. <--- the first 10 seconds of every visit to your website.\"",
            "created": "Thu, 28 Feb 2019 17:00:00 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/rawkstarr/status/1101142809657073665"
        },
        {
            "text": "Cohen was such a <a href=\"https://www.youtube.com/watch?v=mDbQCw3_R-w\">compelling witness</a> and had his tragic story so down, you could take a few excerpts of his testimony and turn it into a play. The best part was when he said the Repub inquisitor had no shame and how soon enough he would be in his Cohen's place.",
            "created": "Thu, 28 Feb 2019 14:23:51 GMT",
            "type": "outline"
        },
        {
            "text": "Yesterday's <a href=\"https://github.com/scripting/Scripting-News/issues/110\">braintrust query</a> has not yielded an answer. I've never seen such a thing where an HTTP request works over the net but doesn't work locally. This is a problem for an app like <a href=\"https://github.com/scripting/serverMonitor\">serverMonitor</a>. It only seems to happen on Digital Ocean servers, which is where most of my servers are these days. I worked around the problem by putting serverMonitor on its own machine, a $5 per month minimal setup. It's a waste of money, amounting to $60 a year, it shouldn't be needed. But I can't keep my servers running without the serverMonitor app, so I'm paying the price until we figure out what the problem is. ",
            "created": "Thu, 28 Feb 2019 13:12:27 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/02/28/snake.png"
        },
        {
            "text": "My new <a href=\"https://cars.usnews.com/cars-trucks/subaru/forester\">Subaru</a> has the ability for me to control it remotely. I can start the engine, or make it flash its lights and honk its horn. This is worrisome of course, because if I can do it, so can a hacker. But it's also fun, since it's in a parking garage in Manhattan, I could just start the engine and freak out the people who work there. Not that I would be the first to do that. (Note: I'm not going to do it.)",
            "created": "Thu, 28 Feb 2019 13:11:55 GMT",
            "type": "outline"
        },
        {
            "text": "They also offer <a href=\"http://scripting.com/images/2019/02/28/subaruFamilyFeatures.png\">features</a> that allow the owner to set up their own authoritarian state (aka family).",
            "created": "Thu, 28 Feb 2019 13:26:57 GMT",
            "type": "outline"
        },
        {
            "text": "Only good news please",
            "created": "Thu, 28 Feb 2019 20:53:26 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I remember as a college student in New Orleans I felt lost. I was pretty unhappy. I had a pain in my stomach most of the time. New Orleans was not a great choice for a kid from the northeast in the early 70s. New Orleans, partly an international city and partly the Deep South, was a really strange culture for a Queens kid, a culture that I never really adjusted to.",
                    "created": "Thu, 28 Feb 2019 20:53:33 GMT",
                    "image": "http://scripting.com/images/2019/02/28/krebs.png"
                },
                {
                    "text": "Even so, when I called home every week from a pay phone in the student union, I'd always put on a happy face. I'd tell stories of how great everything was, even though the grades I was getting pretty much proved it wasn't. I was unhappy. Lonely. ",
                    "created": "Thu, 28 Feb 2019 20:54:39 GMT"
                },
                {
                    "text": "But if I ever said anything about not being happy, my parents would explode, maybe they thought I was holding them responsible or something. I never could get them to explain why they reacted so explosively, if I tried to ask that they would really explode. They'd deny any wrong-doing, thinking I was accusing them of something. They'd probably turn it back on me, talk about something I did that was wrong. I learned it was easier to just make everything sound great. And that made my stomach ache even more. ",
                    "created": "Thu, 28 Feb 2019 20:55:36 GMT"
                },
                {
                    "text": "It wasn't just my family. I was visiting a friend in another part of the US a few years ago, on my way through his home town to visit another friend in another town down the road. I was really drifting. I didn't have a job, nothing to do every day. What friends I had were generally pretty busy, and my family, well they were still as I described above, even though by then most of them were gone. So my friend asked me to tell him how was great everything was for me. An invitation to impersonal conversation. I thought for a moment and decided to tell the truth. Everything is kind of nothing, I said. He seemed to have no idea what to do. We're about the same age, in full adulthood, we had both dealt with considerable pain and struggle in our lives. But I broke protocol and told the truth. I'm pretty aimless. Could use some structure in my life. Not sure what I'm doing. No it's not great. ",
                    "created": "Thu, 28 Feb 2019 20:56:35 GMT"
                },
                {
                    "text": "I think we're also dealing with that approach in our political culture. <a href=\"https://twitter.com/sarahkendzior/status/1099352110272049152\">Sarah Kendzior</a> explains it this way. \"People have normalcy bias. They thought: 'If Manafort is really such a criminal, clearly someone would do something.' Well guess what? No one did anything and now we have a Russian asset as <span style=\"font-size: .8em\">POTUS</span> backed up by a transnational crime syndicate!\"",
                    "created": "Thu, 28 Feb 2019 20:59:58 GMT"
                },
                {
                    "text": "In other words everything must be okay because it's always okay because we wouldn't know what to do if it's not. Not a good way to run a family, or friendships, or the world. Shit is always falling apart. It'd be better if we were truthful about that, imho.",
                    "created": "Thu, 28 Feb 2019 21:02:41 GMT"
                }
            ]
        }
    ]
}