{
    "text": "The Oatmeal and RSS",
    "created": "Sat, 10 Jul 2021 14:52:09 GMT",
    "type": "outline",
    "description": "RSS could be fun again if people would work with each other. ",
    "subs": [
        {
            "text": "<i>This piece started as a Twitter <a href=\"https://twitter.com/davewiner/status/1413871847238782990\">thread</a>. </i>",
            "created": "Sat, 10 Jul 2021 14:55:09 GMT",
            "flInCalendar": true
        },
        {
            "text": "A few days ago the <a href=\"https://twitter.com/Oatmeal\">Oatmeal</a> person <a href=\"https://twitter.com/Oatmeal/status/1412854719475712002\">lamented</a> that \"RSS\" was not a wave anymore. It's more like a big lake not a roiling ocean.   People go boating, have a picnic, swim in RSS-land, but it isn't like a moon mission or even a Sting concert. :-) ",
            "created": "Sat, 10 Jul 2021 14:44:51 GMT",
            "flInCalendar": true
        },
        {
            "text": "I <a href=\"https://twitter.com/davewiner/status/1412856765083947019\">responded</a> that RSS could be fun again if people would work with each other. Instead of being in it for their own glory, only -- people have to see the benefit of other people and products winning alongside them.  ",
            "created": "Sat, 10 Jul 2021 14:44:51 GMT",
            "flInCalendar": true
        },
        {
            "text": "This is not the way tech thinks, or news. They all build self-contained castles. And very rarely do people work together. And that's why RSS stays where it is. Its growth feeds off collaboration.",
            "created": "Sat, 10 Jul 2021 14:44:51 GMT",
            "flInCalendar": true
        },
        {
            "text": "People don't know this, but RSS got its initial wave, the one you all remember so fondly, from a collaboration between UserLand Software and the New York Times.",
            "created": "Sat, 10 Jul 2021 14:44:52 GMT",
            "flInCalendar": true
        },
        {
            "text": "We're still coasting off the energy unleashed in that combo. That's how stuff like this happens.   People still have the myth of The Great Visionary who sees the right path and leads us out of the wilderness. But that's not how it works.",
            "created": "Sat, 10 Jul 2021 14:44:52 GMT",
            "flInCalendar": true
        },
        {
            "text": "Instead, two parties with enough power and influence decide, consciously and deliberately, to work together.",
            "created": "Sat, 10 Jul 2021 14:44:52 GMT",
            "flInCalendar": true
        },
        {
            "text": "If you want to win big, put aside self-glorification and getting ahead for a brief moment, and focus on how you and someone else can break through, creating something that could never exist otherwise. For everyone, not just yourself.",
            "created": "Sat, 10 Jul 2021 14:44:52 GMT",
            "flInCalendar": true
        },
        {
            "text": "And if someone offers to work with you, think of reasons to say yes.",
            "created": "Sat, 10 Jul 2021 14:44:52 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}