{
    "text": "A blog's consiglieri, much like a public editor?",
    "created": "Fri, 09 Jun 2017 13:11:47 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I now understand the idea of a public editor by analogy with an idea I had for blogs back when I was regularly getting embroiled in personal battles about stuff I posted on my blog. ",
            "created": "Fri, 09 Jun 2017 13:28:30 GMT",
            "image": "http://scripting.com/2015/10/26/mrmet.png",
            "permalink": "http://scripting.com/2017/06/09.html#a090630"
        },
        {
            "text": "Back then I assumed everyone meant well, so I would rebut their personal comments. Over time I learned that 99 times out of a hundred the point of a personal comment was to draw you out into defending yourself in public, so more people could pile on, creating a boredom-relieving \"accident\" the Internet has become <a href=\"https://www.nytimes.com/2017/05/20/technology/evan-williams-medium-twitter-internet.html?_r=0\">famous</a> for. ",
            "created": "Fri, 09 Jun 2017 13:12:13 GMT",
            "permalink": "http://scripting.com/2017/06/09.html#a090613"
        },
        {
            "text": "The idea was this. Every blogger would have a designated <a href=\"https://duckduckgo.com/?q=consigleiri&t=hz&ia=definition\">consiglieri</a>. If you have an issue with a blogger, first you had to bring it to the counselor, who would then decide if the issue should be brought to the blogger, i.e. if it had merit, wasn't personal, wasn't an attempt to draw the blogger into a time-wasting personal defense. The person acting as the buffer would insulate the blogger from personal attacks. Thus tamping them down, it was hoped. ",
            "created": "Fri, 09 Jun 2017 13:14:38 GMT",
            "permalink": "http://scripting.com/2017/06/09.html#a090638"
        },
        {
            "text": "I imagined my consigliere would be Doc. And I would offer to reciprocate. ",
            "created": "Fri, 09 Jun 2017 13:16:27 GMT",
            "permalink": "http://scripting.com/2017/06/09.html#a090627"
        },
        {
            "text": "As I watch Jay <a href=\"https://twitter.com/jayrosen_nyu/status/873162861765427200\">make</a> an issue of the NYT's new lack of a public editor, about times when having a public editor would be handy, I recognize the role. (One which we never implemented btw.)",
            "created": "Fri, 09 Jun 2017 13:16:43 GMT",
            "permalink": "http://scripting.com/2017/06/09.html#a090643"
        }
    ],
    "permalink": "http://scripting.com/2017/06/09.html#a090647"
}