{
    "text": "Why this year's NBA Playoffs are such a dud",
    "created": "Fri, 09 Jun 2017 16:51:18 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "When I'm working on a project and encounter no resistence, it doesn't feel right, and I get lost, distracted easily. It's the challenge that keeps pulling me forward, the potential sense of accomplishment, the growing, the learning. Achieving potential is exciting.",
            "created": "Fri, 09 Jun 2017 16:51:30 GMT",
            "image": "http://static.scripting.com/larryKing/images/2014/05/28/arrrrgh.gif",
            "permalink": "http://scripting.com/2017/06/09.html#a120630"
        },
        {
            "text": "That's why watching two teams get through the playoffs, one with a perfect record, and the other near-perfect, there's no suspense, no achievement. Nothing interesting, nothing to root for. They've been there before. ",
            "created": "Fri, 09 Jun 2017 16:52:28 GMT",
            "permalink": "http://scripting.com/2017/06/09.html#a120628"
        },
        {
            "text": "But there's hope!",
            "created": "Fri, 09 Jun 2017 16:53:43 GMT",
            "permalink": "http://scripting.com/2017/06/09.html#a120643"
        },
        {
            "text": "This year many of the stars on both teams will be free agents, and all the teams on the outside, all 28 of them, all with just as much if not more money than Golden State and Cleveland, are going to be bidding up the prices. Some are surely going to leave to make more money, to have a chance of escaping from behind the bright glow of the superstars, Curry, James, Durant, Irving, Thompson, Green, etc.",
            "created": "Fri, 09 Jun 2017 16:53:46 GMT",
            "permalink": "http://scripting.com/2017/06/09.html#a120646"
        },
        {
            "text": "Anyway, what <i>would</i> have been exciting? How about Jeremy Lin leading the Nets to the finals? Haha. Well the Celtics would have been a lot of fun. Maybe next year. This year, it's like Ford vs GM. No matter who wins, it's fucking boring. ",
            "created": "Fri, 09 Jun 2017 16:55:30 GMT",
            "permalink": "http://scripting.com/2017/06/09.html#a120630"
        }
    ],
    "permalink": "http://scripting.com/2017/06/09.html#a120618"
}