{
    "text": "About the angry lawyer",
    "created": "Thu, 17 May 2018 18:21:36 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "<i>This is a lightly edited version of a <a href=\"https://twitter.com/davewiner/status/997152468084641792\">Twitter thread</a> I posted earlier.</i>",
            "created": "Thu, 17 May 2018 18:21:52 GMT"
        },
        {
            "text": "My grandparents, all citizens of the US, and taxpayers, spoke English and their native languages. My paternal grandparents spoke Russian. On my mother's side, they spoke German, Polish, Yiddish, probably some Russian too. To get by they had to speak lots of languages.",
            "created": "Thu, 17 May 2018 18:22:30 GMT"
        },
        {
            "text": "The <a href=\"https://forward.com/fast-forward/401320/pro-trump-jewish-lawyer-caught-ranting-spanish-new-york-deli/\">lawyer</a> who got so angry has a Jewish last name, and if he's like a lot of second or third generation Jews in the US, has recent ancestors, that he may have known, who spoke English with an accent and it wasn't their only language.",
            "created": "Thu, 17 May 2018 18:22:51 GMT"
        },
        {
            "text": "And I bet he was embarrassed by his grandparents. I know I was. And now, as an adult, I regret this. They had hard lives. They got swept up in the Holocaust. That fucked up our family in many ways. And I bet the lawyer got some of that too.",
            "created": "Thu, 17 May 2018 18:23:00 GMT"
        },
        {
            "text": "So even though we got screwed, we lived. That's huge. I wouldn't exist if it weren't for their perseverance and courage. Determination. That's why the immigrants who actually make it here are such intelligent and capable people. They had to be, or they wouldn't have made it.",
            "created": "Thu, 17 May 2018 18:23:06 GMT"
        },
        {
            "text": "As always people focus on the number of people killed. Six million. But many more people survived, but were damaged by the experience. We live with them. We are them. And that's just us. What about African-Americans. They rose from slavery! Can you imagine.",
            "created": "Thu, 17 May 2018 18:23:11 GMT"
        }
    ]
}