{
    "text": "Frontier love",
    "created": "Thu, 26 Apr 2018 15:18:33 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Hearing from lots of <a href=\"http://scripting.com/frontier/beginning/whatFrontierIs.html\">Frontier</a> users after Gruber's <a href=\"https://daringfireball.net/linked/2018/04/25/30-years-of-frontier\">writeup</a> yesterday. ",
            "created": "Thu, 26 Apr 2018 15:18:46 GMT"
        },
        {
            "text": "I didn't know that he had used Frontier. It was really interesting to read his perspective. The connection between the language and the object database is something so simple it can be hard to explain. :boom:",
            "created": "Thu, 26 Apr 2018 15:22:31 GMT"
        },
        {
            "text": "Some people wish it would \"come back.\" For them I have good news. Thanks to solid engineering and generous work from Ted C Howard, Frontier runs on today's Macs, except now it's called The OPML Editor, because it's configured as an outliner. Long story. It's totally Frontier.",
            "created": "Thu, 26 Apr 2018 15:21:17 GMT"
        },
        {
            "text": "I'm using v10.1b19 as my IDE for my JavaScript work. I've built a real sweet code deployment environment, it's as if S3 is my file system. All this to say that Frontier is as rock-solid as ever. If you're a Mac user and want a Frontier experience, it's available to you. Not as a memory.",
            "created": "Thu, 26 Apr 2018 15:19:14 GMT"
        },
        {
            "text": "Ted maintains a GitHub <a href=\"https://github.com/tedchoward/Frontier/releases\">repository</a> with the latest version. The list is in reverse chronologic order.",
            "created": "Thu, 26 Apr 2018 15:20:11 GMT"
        },
        {
            "text": "There is a Windows version, I don't know how well it runs. You can download it from <a href=\"http://home.opml.org/\">home.opml.org</a>. ",
            "created": "Thu, 26 Apr 2018 15:21:24 GMT"
        },
        {
            "text": "PS: For questions, there's a rebooted <a href=\"https://groups.google.com/forum/?fromgroups#!forum/frontier-user\">Frontier-user list</a> on Google Groups.",
            "created": "Thu, 26 Apr 2018 20:41:34 GMT"
        }
    ]
}