{
    "text": "A friend said I should check out a new movie on Netflix entitled <a href=\"https://www.metacritic.com/movie/you-are-so-not-invited-to-my-bat-mitzvah!\">You Are So Not Going to my Bat Mitzvah</a>. She said I'd like it because the rabbi is played by my favorite SNL performer, <a href=\"https://en.wikipedia.org/wiki/Sarah_Sherman\">Sarah Sherman</a>. I watched it and highly recommend. It's not a great movie but it is amazing for me, a 3/4 Jewish boy from Queens, son of holocaust survivors, and I found out from this movie someone who is more uncomfortable with being Jewish than I previously understood. Everything about this movie is Jewish. The same way <a href=\"https://www.metacritic.com/tv/atlanta\">Atlanta</a> or <a href=\"https://www.metacritic.com/tv/insecure\">Insecure</a> are thoroughly black. The teenagers in the movie are 100 percent comfortable with being Jewish. I don't think there ever has been a movie that approached being Jewish so naturally without any sense that they have to explain themselves. And I kept having the thought -- Why Not? -- as my discomfort came up and then faded out -- why shouldn't there be movies that share modern Jewish culture in America using comedy, without being embarrassed by it? To me this is proof that antisemitism is strong inside me, and I don't understand how it got there. If Blacks have the same thing about their race, they have used culture to help dismantle it. I watch <a href=\"https://www.metacritic.com/tv/the-wire\">their</a> <a href=\"https://www.metacritic.com/tv/swagger\">shows</a>, why shouldn't I also watch a show about my own people, and accept that we have a right to love ourselves as much as anyone else does? So to me, YASNGTMBM was amazing, and did something huge. And btw, the girls who play the lead roles are incredibly sweet and cute, and I expect we'll see more from them. And yes, <a href=\"https://www.google.com/search?q=site%3Ascripting.com+Sarah+Sherman\">Sarah Sherman</a>, as  the rabbi was wonderful too. ",
    "created": "Mon, 28 Aug 2023 13:48:47 GMT",
    "type": "outline",
    "image": "https://imgs.scripting.com/2022/07/10/sarahSquirm.png",
    "flInCalendar": true
}