{
    "text": "February 6",
    "created": "Sat, 06 Feb 2021 15:21:07 GMT",
    "type": "calendarDay",
    "name": "06",
    "subs": [
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=C1cMdXs6wG0\">Video of the day</a>. Mac sounds performed <a href=\"https://en.wikipedia.org/wiki/A_cappella\">a cappella</a> by a Korean group. I've watched it at least a dozen times.",
            "created": "Sun, 07 Feb 2021 02:02:12 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=C1cMdXs6wG0",
            "flInCalendar": true
        },
        {
            "text": "A long time ago my friend \"Doc Searls\" and I agreed that you don't make money <i>from</i> a blog or podcast, but you can make money <i>because of</i> a blog or podcast. It's a subtle but important difference.",
            "created": "Sat, 06 Feb 2021 16:58:34 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/09/15/uhuru.png",
            "flInCalendar": true
        },
        {
            "text": "They have so many awards for journalism, why don't we have anti-awards, for acts of great cowardice, hubris or greed, at the expense of the public. It probably would do more good than the other kind of awards. ",
            "created": "Sat, 06 Feb 2021 16:21:17 GMT",
            "type": "tweet",
            "tweetId": "1358088425145008129",
            "tweetUserName": "davewiner",
            "flInCalendar": true
        },
        {
            "text": "I can see how the second <a href=\"https://en.wikipedia.org/wiki/Second_impeachment_trial_of_Donald_Trump\">impeachment trial</a> could backfire. Trump has been obscured, pushed to the side. He used to be the focus of everyone's attention, but now it feels like years ago that he was a menace. The trauma could be substantial. On the other hand, it has to be done.",
            "created": "Sun, 07 Feb 2021 02:48:00 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I often am asked to invite people to [%search: Clubhouse%] because I've written so much about it. To invite people you have to share your contacts with them. I'm not willing to do that, so I can't invite anyone. You have to find someone who is ok with sharing their contacts.",
            "created": "Sat, 06 Feb 2021 16:16:05 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://news.ycombinator.com/item?id=26044889\">McNeil's statement</a>: “I was asked at a dinner by a student whether I thought a classmate of hers should have been suspended for a video she had made as a 12-year-old in which she used a racial slur. To understand what was in the video, I asked if she had called someone else the slur or whether she was rapping or quoting a book title. In asking the question, I used the slur itself. I should not have done that. Originally, I thought the context in which I used this ugly word could be defended. I now realize that it cannot. It is deeply offensive and hurtful. The fact that I even thought I could defend it itself showed extraordinarily bad judgment. For that I apologize.”",
            "created": "Sat, 06 Feb 2021 16:10:03 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "NY Times fires Donald McNeil",
            "created": "Sat, 06 Feb 2021 15:47:05 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2021/02/06/mcNeil.png",
            "description": "I hope McNeil lands somewhere where there is a daily podcast he can be interviewed on, and who will sponsor his reporting.",
            "subs": [
                {
                    "text": "Yesterday the NY Times <a href=\"https://www.memeorandum.com/210206/p6#a210206p6\">fired Donald McNeil</a>, a reporter I've written about <a href=\"https://www.google.com/search?q=site%3Ascripting.com+McNeilhttps://www.google.com/search?q=site%3Ascripting.com+McNeil\">here</a>, in glowing terms, many times. There isn't another reporter in the world that I have so much respect for. He taught me about viruses, in clear language that I understood, that didn't insult my intelligence. In a time where all our lives are threatened by a virus, his reporting and advice was potentially life-saving. ",
                    "created": "Sat, 06 Feb 2021 15:21:08 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I remember well the first time I heard him interviewed on the <a href=\"https://www.nytimes.com/2020/03/12/podcasts/the-daily/coronavirus-pandemic.html\">Daily podcast</a>. I was driving on the <a href=\"https://en.wikipedia.org/wiki/Kingston%E2%80%93Rhinecliff_Bridge\">Rhinebeck bridge</a> across <a href=\"https://www.google.com/maps/place/Kingston-Rhinecliff+Bridge/@41.9776606,-74.0860387,11z/data=!4m5!3m4!1s0x89dd095c9557317b:0x4e76e90146cedab!8m2!3d41.9776606!4d-73.945963\">the Hudson</a>. I had just heard a WHO press conference where they said the virus had gotten out of control and now was a pandemic. For that moment I felt like we were defenseless, completely at the mercy of the virus. ",
                    "created": "Sat, 06 Feb 2021 15:47:38 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I didn't know anything about pandemics. Then I listened to McNeil <a href=\"https://www.nytimes.com/2020/03/12/podcasts/the-daily/coronavirus-pandemic.html\">explain</a> how the Chinese were already getting it under control. Testing, isolation, contact tracing. I could see how these three together, efficiently administered, could actually isolate the virus and thus destroy it. Now I knew it wasn't impossible to solve the problem, but it did require us all to work together. ",
                    "created": "Sat, 06 Feb 2021 15:48:04 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "From that point on, every time <a href=\"https://www.nytimes.com/by/donald-g-mcneil-jr\">McNeil</a> wrote something or appeared on the podcast, I stopped everything and read and listened carefully. His reporting is full of information and history, it was more than great reporting. They don't have a prize for this, but they should. Reporting that's useful. In this case very timely and useful, life-saving and useful. A gift. ",
                    "created": "Sat, 06 Feb 2021 15:48:49 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Yesterday the NY Times <a href=\"https://www.nytimes.com/2021/02/05/business/media/donald-mcneil-andy-mills-leave-nyt.html\">fired McNeil</a>. Here's what I understand happened, based on <a href=\"http://scripting.com/2021/02/06.html#a161003\">McNeil's statement</a>. He was asked by a group of high school students a question about whether it was okay for a friend of theirs to say a racial slur in a video. In answering the question McNeil himself used the word. This is a word that is used publicly, often as a term of endearment, in a lot of contexts to refer to all kinds of people, and it's not controversial, it's accepted. He didn't aim the racial slur at anyone. Grammatically it was the subject of a sentence, not an adjective. He said the word. And now, many months later he was fired for it. ",
                    "created": "Sat, 06 Feb 2021 15:41:02 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Maybe this isn't what happened. I'm open to hearing more. But if this is it, the Times should apologize and offer him his old job back. Apparently some reporters will object, and somehow threaten the Times. <i>They</i> should be fired. It's an honor to work at the Times, and if you don't like it, leave. ",
                    "created": "Sat, 06 Feb 2021 16:29:11 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "What the Times did here is disgusting. This isn't the first time I've said the Times is disgusting. I think it virtually every day as they flaunt their conflict of interest re tech, never offer an opposing view to rebut their nonsense. They either naively or corruptly promote stories that put our country in danger, based on lies, just like the ones Fox is being <a href=\"https://www.nytimes.com/2021/02/05/podcasts/the-daily/smartmatic-fox-news.html\">sued</a> for now. These are well-known. The Times doesn't seem to care. ",
                    "created": "Sat, 06 Feb 2021 15:52:27 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I don't expect the Times will reverse itself. So I hope McNeil lands somewhere where there is a daily podcast he can be interviewed on, and who will sponsor his reporting, which was exceptional, deep, informed by an enormous base of experience, thoughtful and caring. Let's make sure he's still viable as a source of information and encouragement to us. ",
                    "created": "Sat, 06 Feb 2021 15:45:43 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "A socially distanced lift line",
            "created": "Sat, 06 Feb 2021 17:25:47 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "At <a href=\"https://www.steamboat.com/\">Steamboat Springs</a> <a href=\"https://twitter.com/unicorn/status/1358086129933815808/photo/1\">today</a>.",
                    "created": "Sat, 06 Feb 2021 17:25:55 GMT",
                    "inlineImage": "http://scripting.com/images/2021/02/06/liftline.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "NakedJen lusts for this jacket",
            "created": "Sun, 07 Feb 2021 02:16:19 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Look at all the pockets!",
                    "created": "Sun, 07 Feb 2021 02:16:26 GMT",
                    "inlineImage": "http://scripting.com/images/2021/02/06/jacketWithPocketsForNakedJen.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}