{
    "text": "February 11",
    "created": "Thu, 11 Feb 2021 15:05:20 GMT",
    "type": "calendarDay",
    "name": "11",
    "subs": [
        {
            "text": "<a href=\"https://github.com/scripting/jsPreprocessor/blob/main/compile.js\">New code</a>. I've been looking for good sample code for a JavaScript pre-processor, couldn't find, so I wrote. ",
            "created": "Thu, 11 Feb 2021 16:19:06 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I love [%search: Fresca Blackberry Citrus%] sparkling soda water. I tried it because I like regular <a href=\"https://www.flickr.com/photos/scriptingnews/945757610/#comment72157601091354345\">Fresca</a>. My first taste was yuck this is like water with just a little hint of flavor. So I kept drinking my Diet Dr Pepper, my current go-to carbonated beverage. But then I ran out of chilled DDP, so I went with the backup, and the second time, wow, it was a super refreshing, bubbly instant thirst quench. I know this sounds like a commercial, but that's really where I'm at now. I'd pick Fresca Blackberry Citrus over <i>anything</i> at this point. Have to get some more. :boom:",
            "created": "Thu, 11 Feb 2021 16:41:53 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/02/11/frescaBlackberryCitrus.png",
            "flInCalendar": true
        },
        {
            "text": "I've been watching the impeachment trial on and off. It's excellent. They thought of everything. Just asked a big question -- what if Trump had succeeded. He came close. What if they had killed a few senators, the VP, the Speaker. What would have happened next? Clearly this whole thing was planned, probably around the time Barr left. Did he see how it was shaping up and decided to get out then. Are the only ones who stood with Trump up to the coup, Hawley and Cruz? Were they surprised when the mob got into the Capitol? So many questions. A lot of them are off-topic for the impeachment, but historians are going to want to know how this came together. ",
            "created": "Thu, 11 Feb 2021 19:11:42 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "It's about power, not feelings",
            "created": "Thu, 11 Feb 2021 15:05:21 GMT",
            "type": "outline",
            "description": "Cancel culture is back, and it's ripping us apart, kind of like Trump.",
            "metaImage": "http://scripting.com/images/2021/02/06/mcNeil.png",
            "subs": [
                {
                    "text": "I have never watched <a href=\"https://www.hollywoodreporter.com/news/the-mandalorian-star-gina-carano-fired-amid-social-media-controversy\">The Mandalorian</a>, never wanted to. I saw the big comeback Star Wars movie a few years ago and was bored. All the comic book movies are boring. So I have no idea who the actress is who got cancelled, I don't know what she said. But the reaction to her being fired is huge and obnoxious, as usual. So I know it's wrong. Whatever she said, the response is not appropriate to the offense. It's like one of those <a href=\"https://en.wikipedia.org/wiki/Cytokine_storm\">cytokine storms</a> that kills you when you get Covid. ",
                    "created": "Thu, 11 Feb 2021 15:05:30 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "In other words, she's been fired, you won, you can shut up now. ",
                    "created": "Thu, 11 Feb 2021 15:20:16 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It's supposedly all about your feelings. But that's bullshit, right? It's really about power. You like being part of a mob. It's primal. It's probably the same rush the people who invaded the Capitol got. You didn't get sad and depressed, you were excited.",
                    "created": "Thu, 11 Feb 2021 15:07:57 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The Trumpers say they don't give a fuck about <a href=\"http://scripting.com/images/2021/02/11/trumpersAreObnoxious.png\">your feelings</a>. That gets them hot, and I bet it gets you hot too. The conflict is what you love, right? Here's your chance to have power over someone else. ",
                    "created": "Thu, 11 Feb 2021 15:08:01 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I am a big fan of <a href=\"http://scripting.com/2021/02/06/154705.html?title=nyTimesFiresDonaldMcneil\">Donald McNeil</a>. i've read everything i can get my hands on about his cancelling by the NY Times. There isn't much out there. They say 150 staffers at the NYT wrote a letter where they say that he said a word that makes them feel bad and because of that McNeil must go. And he is gone. ",
                    "created": "Thu, 11 Feb 2021 15:11:36 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Balance that against the huge good that keeping him at the NYT does for people who want to be informed about the pandemic. His <a href=\"https://www.nytimes.com/2021/01/24/health/fauci-trump-covid.html\">interview</a> of Anthony Fauci on the Daily podast was amazing. i don't doubt that he saved people's lives in the last year in the podcasts he did and the reports he wrote in the Times. i don't know if he saved my life, but it's possible. I was thirsty to know what was going on, and he has been learning about this his entire career. And he knows how to explain things. Really powerful stuff, right up there with Fauci. He was cancelled. no transparency, no consideration of anyone outside their elite bubble at the NYT. They're royalty so their feelings rule. ",
                    "created": "Thu, 11 Feb 2021 15:12:04 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "So we replace one Trump with another. ",
                    "created": "Thu, 11 Feb 2021 15:13:03 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Please just stop. ",
                    "created": "Thu, 11 Feb 2021 15:13:49 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}