{
    "text": "February 12",
    "created": "Fri, 12 Feb 2021 15:39:45 GMT",
    "type": "calendarDay",
    "name": "12",
    "subs": [
        {
            "text": "Are you a first-generation something? ",
            "created": "Fri, 12 Feb 2021 16:54:58 GMT",
            "type": "tweet",
            "tweetId": "1360271223104626691",
            "tweetUserName": "davewiner",
            "flInCalendar": true
        },
        {
            "text": "Love the new <a href=\"http://scripting.com/images/2021/02/12/newWhiteHouseMessage.png\">Valentine's Day look</a> for the <a href=\"https://twitter.com/NBCNews/status/1360238441582260236\">White House</a>. :heart: ",
            "created": "Fri, 12 Feb 2021 18:54:35 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "This is what I posted on the <a href=\"http://scripting.com/urgent/2020/03/05.html\">home page</a> of my blog on <a href=\"http://scripting.com/2020/03/05.html\">March 5</a> last year. \"A deadly virus is taking over the world and the United States doesn't have a government.\" It occurs to me now that the United States does now have a government.",
            "created": "Fri, 12 Feb 2021 19:11:44 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I don't believe in the death penalty for people, no matter how enraged I am at what they did. But I do believe in the death penalty for political parties. If the Repubs don't vote to convict, a small gesture of respect for the Constitution, we must condemn the party to death. ",
            "created": "Fri, 12 Feb 2021 19:17:45 GMT",
            "type": "tweet",
            "tweetId": "1360307326943522817",
            "tweetUserName": "davewiner",
            "flInCalendar": true
        },
        {
            "text": "I asked my <a href=\"http://scripting.com/2021/02/12/164054.html?title=myImmunity\">biomedtech friend</a> to review my immunity <a href=\"http://scripting.com/2021/02/12/164054.html?title=myImmunity\">post</a>: \"You’re good to go anywhere a week after the second shot, don’t worry about it! Even if you’re that 5% yes you almost certainly have some immune training that will keep you out of the hospital. Now is the time to enjoy your life and not worry, at some point a nastier variant could evade the vax but not yet man so go enjoy the spring and summer!\"  ",
            "created": "Fri, 12 Feb 2021 18:57:52 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I tried watching Trump's impeachment defense, but the instant I tuned in I heard the lie. I immediately turned it off. This is the moment of truth when the Republican Party, or most of it, legally, openly and on the record becomes <i>the party of sedition.</i>",
            "created": "Fri, 12 Feb 2021 17:15:24 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Another update in the [%search: Airpods%] saga. Recall that I <a href=\"http://scripting.com/2021/02/10.html#a163710\">gave up</a> on the <a href=\"https://www.amazon.com/Jabra-Elite-75t-Earbuds-Comfortable/dp/B07X9VG6ZJ/ref=asc_df_B07X9VG6ZJ/?tag=hyprod-20&linkCode=df0&hvadid=366402654398&hvpos=&hvnetw=g&hvrand=5599194572670142815&hvpone=&hvptwo=&hvqmt=&hvdev=c&hvdvcmdl=&hvlocint=&hvlocphy=1023511&hvtargid=pla-852536612290&psc=1&tag=&ref=&adgrpid=74513439285&hvpone=&hvptwo=&hvadid=366402654398&hvpos=&hvnetw=g&hvrand=5599194572670142815&hvqmt=&hvdev=c&hvdvcmdl=&hvlocint=&hvlocphy=1023511&hvtargid=pla-852536612290\">Jabra</a> and Skullcandy earbuds. They both sounded horribly tinny, like an old style AM radio. Actually I didn't give up, it turns out. While watching impeachment hearings, I searched for reports on the Jabra earpods and the word <a href=\"https://www.google.com/search?q=jabra+elite+75t+tinny\">tinny</a>, and read <a href=\"https://www.reddit.com/r/Jabra/comments/hf1z9k/should_the_jabra_elite_75t_sound_very_tinny/\">this thread</a> on Reddit. Basically they said do a bunch of voodoo, put them back in their case, take them out, do it again, change the silicon fits, do it all again, say a prayer, and sooner or later they will sound like you thought they should based on the glowing <a href=\"https://www.nytimes.com/wirecutter/reviews/best-wireless-earbuds/\">review</a> in Wirecutter. It worked! Unreal. This is another example of the way we used to fix broken Apple II's, just take them for a drive in the car, and they start working again. Anyway, good enough. And in the interim I ordered a new pair of Apple Airpod Pros, because I got hooked, and had headset-envy every time I saw someone on TV wearing them. As I've said many times, I collect headsets the same way some <a href=\"https://pagesix.com/2021/02/03/kanye-west-moves-500-pairs-of-shoes-out-of-home-shared-with-kim-kardashian/\">people</a> collect shoes. ",
            "created": "Fri, 12 Feb 2021 15:39:46 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/02/12/jabraElite.png",
            "flInCalendar": true
        },
        {
            "text": "BTW, Google search is getting worse all the time. I know I've told the story of how we used to fix Apple II's by driving around (they always seemed to work when we got to the repair shop), and I've also said many times that I collect headphones the way some people collect shoes, but Google can no longer find either. I've been using Google search since 1998. I hate Google for the way <a href=\"http://scripting.com/2019/12/21/170042.html#a170258\">they treated RSS</a>, and the way they are doing the same <a href=\"http://this.how/googleAndHttp/\">to the web</a>, but I've been using their search engine for 23 years, and it's a hard habit to break, but one way to break it is to break search, which they seem to be doing. They should shrug this off at their own peril. Imagine Coke taking the fizz out of their cola. Same basic idea imho.",
            "created": "Fri, 12 Feb 2021 16:00:51 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Math",
            "created": "Fri, 12 Feb 2021 18:22:29 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "It seems likely say 8 Repubs are going to vote to convict.",
                    "created": "Fri, 12 Feb 2021 18:22:33 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "That means 58 out of 100, a solid bipartisan majority.",
                    "flInCalendar": true
                },
                {
                    "text": "That's pretty damning imho for the 42 who voted to acquit. ",
                    "flInCalendar": true
                },
                {
                    "text": "I bet that puts pressure on *some* of the 42 to either be sick the day of the vote, or vote to convict.",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "My immunity",
            "created": "Fri, 12 Feb 2021 16:40:54 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Next week I'm getting the second dose of the Moderna vaccine. ",
                    "created": "Fri, 12 Feb 2021 16:40:58 GMT",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "I had mild side-effects with the first shot, which I got on January 20, also Inauguration Day. I expect it to be worse this time, but I'm excited and a little disoriented by the new reality. ",
                            "created": "Fri, 12 Feb 2021 16:42:18 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "A couple of weeks later, say by March 3, according to the science, I will be at 95% immunity. This means the probability of me getting infected, everything else constant, is only 5% of what it was before January 20.",
                            "created": "Fri, 12 Feb 2021 16:41:36 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "A bit of info I don't have -- if I were to get infected would it be less likely to be severe or deadly?",
                            "flInCalendar": true
                        },
                        {
                            "text": "Of course I'm going to continue to be masked. I ordered some new Docker brand masks for the event. ",
                            "created": "Fri, 12 Feb 2021 16:45:43 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "What should I risk after immunity? Go to the movies? Drive down to the city, just to get some bagels perhaps or ride a CitiBike in Central Park? These would seem very exotic now. ",
                            "created": "Fri, 12 Feb 2021 16:44:15 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "It's been 1.5 years since I've been to a city larger than Kingston, NY. I'm actually quite happy about that. I like life in the mountains.  ",
                            "created": "Fri, 12 Feb 2021 16:44:26 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Suggestion to movie theater owners. Offer 1/2 price to anyone who is fully vaccinated. Or Olive Garden, or Applebee's.",
                            "created": "Fri, 12 Feb 2021 17:12:01 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "And yes this is yet another boomer privilege. It's fair to hate me but only for this. :rocket:",
                            "created": "Fri, 12 Feb 2021 16:44:49 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}