{
    "text": "February 14",
    "created": "Sun, 14 Feb 2021 13:43:03 GMT",
    "type": "calendarDay",
    "name": "14",
    "subs": [
        {
            "text": "<a href=\"http://scripting.com/2021/02/14/theTrumpWeKnewIsGone.m4a\">Podcast</a>: It's the day after the death of the thing we called Donald Trump. In this podcast I explain how magical things happen in the days after someone you're close to dies. It feels that way with Trump. We got one last look at him, not in person, because the person is gone, the Trump who watched TV and tweeted all day from the White House. Gone, not forgotten, becoming a distant memory. What little is left is finishing up old business, and then will depart for good. It's a 20 minute series of stories. Hope you enjoy!",
            "created": "Sun, 14 Feb 2021 14:59:01 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2021/02/14/theTrumpWeKnewIsGone.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "10068905",
            "image": "http://scripting.com/images/2019/11/02/barrett.png",
            "flInCalendar": true
        },
        {
            "text": "I just released a new <a href=\"https://github.com/scripting/everyMinute\">everyMinute</a> script. It's now incorporated into the <a href=\"http://scripting.com/email/\">nightly emailer</a>. So the <a href=\"http://scripting.com/2021/02/09.html#a151330\">drift I wrote about earlier</a> should now be gone. Fingers crossed. Knock wood. I am not a lawyer. Praise Murphy. My mother loves me. ",
            "created": "Sun, 14 Feb 2021 18:24:59 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Jason Calacanis <a href=\"https://twitter.com/Jason/status/1361016929993908227\">says</a> the Knicks are good at basketball again. They really are. They have two full teams now. I love the way they did it, not like the Nets, Clippers, Lakers. They didn't buy a team of rental players. It's a home grown team. There are a half dozen Jeremy Lins on this team. So much fun to watch. ",
            "created": "Sun, 14 Feb 2021 18:29:51 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/Jason/status/1361016929993908227",
            "flInCalendar": true
        },
        {
            "text": "I think Apple could make a diff in cars. The other day I was on a longish drive and wanted to listen to the NPR coverage of the Senate hearings. I went in and out of range of various NPR stations. Something the car could have handled for me. A data processing function.",
            "created": "Sun, 14 Feb 2021 16:26:33 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "My friend Cathleen Rittereiser says <a href=\"http://scripting.com/images/2021/02/14/trumpIsOJ.png\">Trump is the new OJ</a>. Both were guilty, but they got off with what amounts to <a href=\"https://en.wikipedia.org/wiki/Jury_nullification#:~:text=members%20of%20a%20criminal%20trial%20jury%20believe%20that%20a%20defendant%20is%20guilty,%20but%20choose%20to%20acquit\">jury nullification</a>.  ",
            "created": "Sun, 14 Feb 2021 15:57:53 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The fact is Trump is guilty, regardless of what the Senate decided.",
            "type": "tweet",
            "created": "Sun Feb 14 10:27:25 +0000 2021",
            "tweetId": "1360898435654832130",
            "tweetUserName": "davewiner",
            "flInCalendar": true
        },
        {
            "text": "Listening to pundits yesterday, it was remarkable they forgot how scared we were on <a href=\"http://scripting.com/2021/01/07.html\">January 7</a> that this wasn’t the end of the insurrection. Something had to be done and impeachment was the only option. That’s why I keep <a href=\"http://scripting.com/2021/01/07/152745.html?title=morningCoffeeNotes\">a blog</a>, it’s like a time machine.  ",
            "created": "Sun, 14 Feb 2021 13:43:04 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "There is a silver lining to Trump's acquittal. He can now go back to his new occupation of Former Pain In The Ass. Let the bill collectors and district attorneys have him. And Hawley, Cruz and Cotton can go back to their Hitler lessons. Maybe a new reality show that every week gives you a glimpse of the miserable life of a would-be despot, who failed.",
            "created": "Sun, 14 Feb 2021 13:46:01 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "BTW, having served on a [%search: jury%], next time maybe they should require deliberation among the jurors. ",
            "created": "Sun, 14 Feb 2021 14:20:41 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I'm not too depressed",
            "created": "Sun, 14 Feb 2021 13:57:44 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Net-net I'm not too depressed about the Senate acquittal because I remember how the impeachment happened. It was the only instant response possible. (Except as <a href=\"https://www.theatlantic.com/ideas/archive/2021/01/remove-trump-tonight/617576/\">David Frum</a> pointed out at the time, the Senate could have met and voted him out of office the same day, that would have been awesome. Wish they had the guts to do it.) ",
                    "created": "Sun, 14 Feb 2021 13:53:15 GMT",
                    "type": "outline",
                    "flInCalendar": true
                },
                {
                    "text": "The inauguration was two weeks away. The concern was what would happen next. People say McConnell refused to have the trial before Trump left, but actually that was somewhat rational. They needed to clean up the Capitol, it was trashed, covered in blood and human excrement, and secure it. It sure looked like there would be more attacks at the time. Also don't forget that then-VP Pence refused to consider the 25th Amendment. He gets his share of the credit, if you want to blame McConnell.",
                    "created": "Sun, 14 Feb 2021 14:04:26 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "We know how it turned out now, but we did not know then. And of course a conviction wouldn't have had much practical value. I think it's better if Trump fades into obscurity. Let minor government officials harass him now. He'll protest. \"But but I'm the great Trump!\" No, you're now a defendant in criminal and civil trials. Then, no you are a bankrupt resident of a federal or state prison. ",
                    "created": "Sun, 14 Feb 2021 13:59:03 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Let's give him something to really complain about. ",
                    "created": "Sun, 14 Feb 2021 13:59:50 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "It's time to say goodbye",
            "created": "Sun, 14 Feb 2021 14:43:40 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "It's time to say goodbye to 45.",
                    "created": "Sun, 14 Feb 2021 14:43:46 GMT",
                    "inlineImage": "http://scripting.com/images/2021/02/14/byebye45.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}