{
    "text": "February 16",
    "created": "Tue, 16 Feb 2021 15:23:17 GMT",
    "type": "calendarDay",
    "name": "16",
    "subs": [
        {
            "text": "I thought \"cutting the wire\" would save me money, but it actually costs a lot more for the same programming. I am currently spending $65 for both YouTube TV and Fubo, and $12 for Hulu, and no HBO, though I really want it. If you add it up, it's about $150 a month. So I called Spectrum to see if I could get that without the set top box, and if so, how much would it cost. Turns out it's about $40 on top of my internet service, with all the local sports, weather, news, CNN, MSNBC and HBO. I'm going to cancel the others, I'm sure I'll miss something, but one thing I won't miss is having to remember where to go for each of the shows I'm interested in. And of course I still have Netflix and Amazon. So I'm back to where I was before I naively threw all my cards in the air. Back to Roku and Spectrum. I guess I learned a lot. :heart:",
            "created": "Tue, 16 Feb 2021 17:49:55 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/12/15/myOrangeJelloBox.png",
            "flInCalendar": true
        },
        {
            "text": "It's ridiculous at this time to say that Clubhouse will be a raging success. But people like <a href=\"https://stratechery.com/2021/clubhouses-inevitability/\">verdicts</a>. I remember when [%search: push technology%] was the rage, and Wired proclaimed the web dead as a result. 1997. ",
            "created": "Tue, 16 Feb 2021 17:02:49 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "BTW, I forgive Wired for doing that. That was the culture at the time. [%search: Web Energy%] -- I called it. I drank the Kool Aid <a href=\"http://scripting.com/davenet/97/review/push.html\">myself</a>. But it's especially important to keep your own scorecard, so next time you temper your enthusiasm and negativity with a proper amount of self-doubt.",
            "created": "Tue, 16 Feb 2021 17:04:11 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Power outages and an internet outage. We're having the same weather here half the country is having. Freezing rain and fog. Dramatic!",
            "created": "Tue, 16 Feb 2021 15:23:18 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Facebook and journalism, yet again",
            "created": "Tue, 16 Feb 2021 17:16:04 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Here's the disconnect with journalism and Facebook.",
                    "created": "Tue, 16 Feb 2021 17:16:20 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Facebook is not journalism. And that's not an insult to Facebook. ",
                    "flInCalendar": true
                },
                {
                    "text": "It's not journalism the way the telephone is not journalism. ",
                    "flInCalendar": true
                },
                {
                    "text": "Facebook says you can publish on our site. Go right ahead. That's the opposite of journalism which says, you want to publish on our site, get in line, and conform to our values, look like us, and then 1 out 10000 will get in. It's even tougher than Harvard or Princeton. ",
                    "flInCalendar": true
                },
                {
                    "text": "So journalism keeps trying to fit Facebook into their model. Facebook says this can't work. Journalism calls them names. That's where we are right now in this great fight between the people and journalism. ",
                    "flInCalendar": true
                },
                {
                    "text": "The real force here is not Facebook the company or their servers, which are impressive and very valuable -- it's the people who use Facebook.",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}