{
    "text": "February 19",
    "created": "Fri, 19 Feb 2021 16:03:00 GMT",
    "type": "calendarDay",
    "name": "19",
    "subs": [
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1362566978922250243\">Question</a>: Is there a movie you’ve watched a dozen or more times, that you’d watch right now if it were on? Lots of responses. ",
            "created": "Fri, 19 Feb 2021 17:09:24 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1362566978922250243",
            "flInCalendar": true
        },
        {
            "text": "How much carbon am I emitting with <a href=\"https://twitter.com/davewiner/status/1362869318766239745\">this tweet</a>?  ",
            "created": "Fri, 19 Feb 2021 20:59:41 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I just cancelled Fubo and YouTube TV. I was able to replace both for <i>much</i> less money by re-hooking up with Spectrum, my cable provider. So <a href=\"http://scripting.com/2021/02/16.html#a174955\">cutting the wire</a> is not economic. That word should get around. When you look at the set top box and think \"I can save money by getting rid of that,\" that's probably wrong. This is an ever more divided space, where big media companies use their content to keep you in their networks. And since many of them also own movie companies, and the pandemic has destroyed their distribution system, they;'re all trying, cautiously,  to use their streaming services to unclog their new movie pipelines. I guess because of history, the cable providers can offer the best deals? Not sure why it is that way but it is. YouTube TV still has the most comfortable UI in this category, btw. Spectrum's is awkward, but I'm guessing I'll get used to it.",
            "created": "Fri, 19 Feb 2021 16:57:39 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/02/19/blueJello.png",
            "flInCalendar": true
        },
        {
            "text": "The Disney streaming universe. (Typical)",
            "created": "Fri, 19 Feb 2021 17:12:41 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2021/02/19/disney.png",
            "flInCalendar": true
        },
        {
            "text": "Why I sympathize with McNeil",
            "created": "Fri, 19 Feb 2021 16:08:31 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "One of the reasons I'm so sympathetic with [%search: Donald McNeil%] is that I have a friend whose career was ruined by something not all that different from what happened to McNeil. And unlike McNeil, he's still got a number of productive years before retirement, has three children to provide for, and more important deserve to look up to their father.  ",
                    "created": "Fri, 19 Feb 2021 16:03:01 GMT",
                    "type": "outline",
                    "image": "http://scripting.com/images/2020/11/25/smallmap.png",
                    "flInCalendar": true
                },
                {
                    "text": "There are some people whose loyalty is so valued that no matter what happens I'll stand by them. There aren't many in my life. There was a time in 2002 when I was really sick, and had a long recovery in front of me. I made it is because of the help of three friends. And one of them is this person, who I'm not going to name, because I think there's a chance doing so would make it worse for him, and that's the last thing I want. ",
                    "created": "Fri, 19 Feb 2021 16:09:32 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "This is something \"the left\" does, and it's real. They're pretending they don't do it. But they do. It's just as awful imho as the people who attacked the Capitol, at least they had the guts to try to ruin things out in the open. The people who attacked my friend had nothing against him. It was all laid out in a Medium post, crafted to make no specific charges, just to phrase things that made him seem like a <a href=\"https://en.wikipedia.org/wiki/Harvey_Weinstein\">Harvey Weinstein</a> type, when he is nothing of the sort. ",
                    "created": "Fri, 19 Feb 2021 16:09:50 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Anyway another friend who reads my blog pointed this out. You are taking a lot of notice of McNeil, she said in a phone conversation. It's true. I love what McNeil did during the early days of the pandemic. I will miss his commentary as we go forward, but hopefully he can find another path to the podcast universe. I also like the rapport he had with Michael Barbaro, and I guess that's gone. I think the NYT is a lost cause. ",
                    "created": "Fri, 19 Feb 2021 16:12:08 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "But friendship, that's still the whole thing. The personal connection. The knowing your friend is deeply flawed but still he's your friend. I can openly advocate for McNeil without much risk, but the issue is much bigger than McNeil and the NY Times. ",
                    "created": "Fri, 19 Feb 2021 16:18:59 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "If I recall correctly, everything is in bloom in California this time of year.",
                    "created": "Fri, 19 Feb 2021 17:14:47 GMT",
                    "type": "outline",
                    "inlineImage": "http://scripting.com/images/2021/02/19/pacificCoast.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}