{
    "text": "February 20",
    "created": "Sat, 20 Feb 2021 15:31:54 GMT",
    "type": "calendarDay",
    "name": "20",
    "subs": [
        {
            "text": "Finally a future-of-journalism <a href=\"https://thelogic.co/opinion/letter-from-the-editor-publishers-fight-with-big-tech-shows-the-risk-of-giving-away-your-most-valuable-asset/\">pundit</a> who sees (and says) that the users are a huge asset that the news industry has ceded to Facebook and Twitter. There's simply too much news happening for the journalists try to cover it all. We need a cooperative effort. And despite all the trash talk from journalism about Facebook, a lot of very important stuff happens there, without their awareness or help. ",
            "created": "Sat, 20 Feb 2021 15:42:14 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/02/08/nancy.png",
            "flInCalendar": true
        },
        {
            "text": "My perspective has shifted since being twice-vaccinated. ",
            "created": "Sat, 20 Feb 2021 15:41:30 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://www.metacritic.com/movie/i-care-a-lot\">I Care a Lot</a> is a fine movie, in a way, the best movie I've seen in a long time. The beginning is hard to watch, but if you're getting on in years, you should know that what they depict actually happens, out of the blue people are committed, by strangers, and their assets stolen, legally. Anyway, once you get over that hump, almost every time you turn a corner, there's something new and wonderful. I haven't had my attention held by a movie like this in a long time. ",
            "created": "Sat, 20 Feb 2021 17:40:48 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I was once invited to speak at an \"RSS\" conference in NY. I was living in Florida, they refused to pay my expenses, so I sold advertising for my speech. The promoters were offended. Of course all that anyone wanted to talk about at the conference was how to add advertising to RSS.",
            "created": "Sat, 20 Feb 2021 15:31:55 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Trump supporters after the insurrection",
            "created": "Sat, 20 Feb 2021 21:12:31 GMT",
            "type": "outline",
            "description": " If after Jan 6 you still support Trump, you're an enemy of America.",
            "metaImage": "http://scripting.com/images/2021/02/20/trumpInsurrection.png",
            "subs": [
                {
                    "text": "A recital of some facts. ",
                    "created": "Sat, 20 Feb 2021 21:12:49 GMT",
                    "flNumberedSubs": "true",
                    "subs": [
                        {
                            "text": "The US is great at elections. We have been running them <a href=\"https://en.wikipedia.org/wiki/1788%E2%80%9389_United_States_presidential_election\">since inception</a>, longer than any other country in the world. We are the gold standard in elections. ",
                            "created": "Sat, 20 Feb 2021 21:13:02 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Our elections are not perfect, but their imperfections heavily favor Republicans. ",
                            "created": "Sat, 20 Feb 2021 21:23:39 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "The 2020 election was a standard US presidential election. ",
                            "created": "Sat, 20 Feb 2021 21:33:58 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "It was secure, fair and not in any way rigged. ",
                            "created": "Sat, 20 Feb 2021 21:13:36 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Joe Biden won the election, in terms of votes, and in the Electoral College.  ",
                            "created": "Sat, 20 Feb 2021 21:13:54 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "On January 6, Trump supporters attacked the US Congress, and came close to overthrowing the elected government of the United States. This was and still is shocking. We have not fully processed yet what happened on January 6. ",
                            "created": "Sat, 20 Feb 2021 21:14:20 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Whether you think Trump caused it or not doesn't matter for this question. Trump supporters did it, in his name. It seems impossible for one to support Trump at this point, and not also support and accept the insurrection. If you self-proclaim as a Trump supporter, you also support the overthrow of the elected government of the United States by force. Sorry if this is news to you but you are not a patriot, you are a traitor. ",
                            "created": "Sat, 20 Feb 2021 21:14:00 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Before the insurrection you could possibly shrug off our \"differences\" but now your friends who are Trump supporters are no longer willing to accept the result of a fair election, and their response to the fair election is to try to overthrow the government. You can't accept this. Even if they are family members. You have to turn your back on them. ",
                            "created": "Sat, 20 Feb 2021 21:18:29 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "I thought Julian Castro said it brilliantly at the impeachment trial. Asked if he was concerned about Trump winning in 2024, he said no --  he was afraid of Trump losing. He's afraid of a repeat of what happened on January 6. He's right to be afraid. ",
                            "created": "Sat, 20 Feb 2021 21:30:10 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Trump supporters live in an incompatible alternate country. The two cannot co-exist. We have to defeat them. It's not just about the people who crashed the Capitol, it's about the people who accept that. No excuses, not interested in discussing. We do not co-exist. ",
                            "created": "Sat, 20 Feb 2021 21:30:15 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}