{
    "text": "February 21",
    "created": "Sun, 21 Feb 2021 15:18:19 GMT",
    "type": "calendarDay",
    "name": "21",
    "subs": [
        {
            "text": "I released a new <a href=\"https://github.com/scripting/folderToJson\">Node package</a> earlier today.",
            "created": "Sun, 21 Feb 2021 21:04:05 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Just read the name \"ivanka\" in a Facebook message and had to try hard to remember where I had heard that name before. Another thing I'm having trouble with is remembering if and when \"intent\" matters with the NYT. They run an op-ed from a troll, I guess intent is irrelevant?",
            "created": "Sun, 21 Feb 2021 18:03:08 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "A platform like Facebook is very hard to build. Serving billions of users, hundreds of millions at the same time, is a mostly unheralded accomplishment, probably like putting a man on the moon. Yet this never comes up in the public analysis. ",
            "created": "Sun, 21 Feb 2021 17:18:54 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I don't watch a lot of movies these days thanks to the pandemic I guess. But in the last two days I watched two, <a href=\"https://en.wikipedia.org/wiki/Nomadland_(film)\">NomadLand</a> and <a href=\"https://en.wikipedia.org/wiki/I_Care_a_Lot\">I Care a Lot</a>. It's hard to imagine two more different movies. NomadLand is a character study, played by a 63-year-old <a href=\"https://en.wikipedia.org/wiki/Frances_McDormand\">Frances McDormand</a>. Her age is important. I understand this somewhat because I'm 65, and it's like that great <a href=\"https://www.youtube.com/watch?v=_Z_7eu64y6c\">Al Pacino speech</a> in <a href=\"https://en.wikipedia.org/wiki/Any_Given_Sunday\">Any Given Sunday</a>, as you get older <a href=\"https://youtu.be/_Z_7eu64y6c?t=102\">things are taken</a> from you. Parents, friends, lovers, and then pieces of yourself start going, and you're left wondering what the fuck. That's NomadLand in a nutshell. The acting is beautiful, the scenery, the characters, the feelings (somewhat) -- but the story? It's like viewing a work of art in a museum. It's just there. It's for you to decide what it means and a lot of that will depend on how old you are, I imagine. I Care a Lot is very much the opposite, but interestingly it's also about things being taken away from an old person, in this case played by 72-year-old <a href=\"https://en.wikipedia.org/wiki/Dianne_Wiest\">Dianne Wieste</a>. So much happens in the first few minutes of the movie, and it's so anger-making, I turned it off at least three times to regain my composure to continue watching. But then it becomes a rollicking ultra-violent comedy, kind of like a Quentin Taratino movie, but funnier. If you want entertainment, I Care a Lot is for you. I will watch NomadLand again. Sometimes movies like this don't grab me on the first viewing, for example, <a href=\"https://en.wikipedia.org/wiki/There_Will_Be_Blood\">There Will Be Blood</a>, which i panned after a first viewing, then <i>loved</i> after a second. I'll let you know.  ",
            "created": "Sun, 21 Feb 2021 15:18:20 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/02/21/nomadland.png",
            "flInCalendar": true
        },
        {
            "text": "BTW, the title, I Care a Lot, is a joke. :boom:",
            "created": "Sun, 21 Feb 2021 16:04:35 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Blogging is still with us",
            "created": "Sun, 21 Feb 2021 16:10:31 GMT",
            "type": "outline",
            "description": "It may be somewhat vestigial, may be a virtual dinosaur, but blogging's genes are still in ciculation.",
            "metaImage": "http://scripting.com/images/2021/02/21/flyingDinosaurBig.png",
            "subs": [
                {
                    "text": "My friend <a href=\"https://twitter.com/jeffjarvis\">Jeff Jarvis</a> is going on CNN shortly to talk about Google, Facebook, Australia and Murdoch. ",
                    "created": "Sun, 21 Feb 2021 16:10:44 GMT",
                    "image": "http://scripting.com/images/2021/02/21/flyingDinosaur.png",
                    "flInCalendar": true
                },
                {
                    "text": "Had a thought. Simple arithmetic. There was a fantastic boom, blogging made a lot of stuff happen. Where did it all go? The thesis from journalism seems to be all that is over, ancient history. I think the evidence is to the contrary. Blogging reshaped the world. Not only for good, of course. ",
                    "created": "Sun, 21 Feb 2021 16:22:01 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Journalism plays a magic trick, ignoring the changes, and the good, and only focusing on how the new tech (yes it still is new) can be used for evil. ",
                    "created": "Sun, 21 Feb 2021 16:11:15 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Perhaps possibly because of their conflict of interest.",
                    "flInCalendar": true
                },
                {
                    "text": "Jarvis is going on with <a href=\"https://twitter.com/brianstelter\">Brian Stelter</a> who I understand got his start in <a href=\"https://www.adweek.com/convergent-tv/how-a-cable-news-blog-turned-into-a-top-source-for-the-highs-and-lows-of-broadcast-media/\">blogging</a>. So it would be interesting if Jeff asked him a question. Do you think the flow is just one way, from journalism to Facebook, or perhaps something more is going on. ",
                    "created": "Sun, 21 Feb 2021 16:11:28 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "My thesis is that blogging may be somewhat vestigial, may be a virtual dinosaur, but its genes are still in ciculation, the equivalent of <a href=\"https://www.scientificamerican.com/article/how-dinosaurs-shrank-and-became-birds/\">online birds</a>.  ",
                    "created": "Sun, 21 Feb 2021 16:15:57 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}