{
    "text": "February 22",
    "created": "Mon, 22 Feb 2021 14:47:56 GMT",
    "type": "calendarDay",
    "name": "22",
    "subs": [
        {
            "text": "I love English Muffins, but <a href=\"https://twitter.com/davewiner/status/1363858221694398465\">are they really muffins</a>?",
            "created": "Mon, 22 Feb 2021 18:24:06 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I keep sharing this idea with my friends at <a href=\"https://radioopensource.org/\">Radio Open Source</a>, but I don't think they get it. It's the same advice I'd give to any professional news org. Build more community around your podcast. If you do a weekly show, say on a Thursday, compile a set of emails from listeners and publish it on Tuesday, via email, as a newsletter. That way you get to know who's listening, and we get to know each other. Chris's podcast no doubt has some very interesting listeners, who are they and what do they think, what do they know? They've set up, imho, a too-narrow pipe, necessitated by the technology <i>we used to use</i> for radio. Today's tech makes so much more possible. You just have to want to do it. I don't doubt they could find volunteers to read and curate the emails, so only the really interesting stuff goes out. What made me think of this was <a href=\"https://radioopensource.org/write-like-the-russians/\">last week's show</a>, with a famous <a href=\"https://en.wikipedia.org/wiki/George_Saunders\">English prof</a>, going through how short stories work. It was just a tiny sliver of a scratch of the surface. I want to know much more about this. Also glad to get away at least for a moment of end-of-the-world stories, which tend to dominate the podcast-o-sphere these days. :boom:",
            "created": "Mon, 22 Feb 2021 18:52:08 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/02/22/englishMuffins2.png",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://en.wikipedia.org/wiki/Lizzie_Vann\">Lizzie Vann</a>, a famous entrepreneur, did something bold, she bought and renovated <a href=\"https://en.wikipedia.org/wiki/Bearsville,_New_York\">Bearsville</a>, a town-like <a href=\"https://en.wikipedia.org/wiki/Hamlet_(place)\">entity</a> that's next to and part of Woodstock, NY. The theater, studio and restaurants at the center of Bearsville were built by <a href=\"https://en.wikipedia.org/wiki/Albert_Grossman\">Albert Grossman</a> in the 60s and 70s as a place for the musicians he worked with to gather. He died in 1986, eventually Bearsville was abandoned. But now, it's beautiful again, an up to date and very attractive venue, what a great gathering place, as it once was, esp for people who produce audio (eg podcasters). Watch this <a href=\"https://www.youtube.com/watch?v=5FEpT8INVn8&feature=emb_logo\">video</a> to get an idea. A beautiful place. Lovely in summer. An idea, as we come out of the pandemic of course. :rocket:",
            "created": "Mon, 22 Feb 2021 18:58:46 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "There should be a way to opt out of Fox on cable. I realized recently that I've been paying them as much as the most MAGA person in the world, <i>for decades. </i>I want to stop paying them. I want my money back too. Let's organize this. Fox is something that truly needs to be cancelled. ",
            "created": "Mon, 22 Feb 2021 16:36:19 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Ex-Repubs should join the Democratic Party. What matters most is a commitment to the Constitution and rule of law. We can work on the rest.",
            "created": "Mon, 22 Feb 2021 14:47:57 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I posted this on Facebook five years ago. I thought it was funny then, it's even funnier now. I hope.",
            "created": "Mon, 22 Feb 2021 17:39:30 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2021/02/22/zuckTheNewOverlord.png",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}