{
    "text": "February 23",
    "created": "Tue, 23 Feb 2021 15:48:59 GMT",
    "type": "calendarDay",
    "name": "23",
    "subs": [
        {
            "text": "I spent much of the day at the eye doctor, and left with my eyes dilated, still feeling weird. So you are forewarned this is not the usual \"Scripting News\" fare. No doubt many typos.",
            "created": "Tue, 23 Feb 2021 22:54:02 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Scoble is trying to convince me to buy a <a href=\"https://www.tesla.com/\">Tesla</a>. Confession: I'm starting to lust after one. But I'm also lusting after a Ford 150. Oy such problems. This is what I meant about feeling reborn after being double-vaccinated. I'm wearing a mask, frankly I think we should all wear masks from now on, for the foreseeable future. The way they did in Asia. People just wore them. I always thought it was weird. Then Covid happened, and they did a lot better than we did in mask-averse America. I think part of the return to \"normal\" is to understand that normal means something else now. ",
            "created": "Tue, 23 Feb 2021 22:40:08 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/02/23/tesla.png",
            "flInCalendar": true
        },
        {
            "text": "About normalcy. I was telling a friend how there was a party atmosphere at the place we all got our vaccines. She pointed out that it might have been that we had been so deprived of social contact, and I slapped my hand on my forehead. Of course. I am not usually as gregarious as I've been in the last year, when I have had a chance to be with other people. I thrive on it.So we were all high at the vaccination site not just with relief at gaining some immunity, but also because here were some real live humans to talk with! It's why I think, no matter how dire the reality is, when we achieve new kinds of social interaction we will be a happy place, probably for quite a while or hopefully. I remember how it felt after 9-11, but the togetherness was short-lived. Maybe we should think about what kind of normal we want?",
            "created": "Tue, 23 Feb 2021 22:43:03 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "One more thing. I had to spend a few hours at an eye doctor today for a checkup. I wanted to be chatting with people, but they weren't interested. Then I realized they work in a busy office, to them there's nothing unusual about having someone to chat with. As I waited for my eyes to dilate, I heard lots of random conversations, and didn't realize then how unusual that was, a fairly normal thing in the past, but foreign to me now. ",
            "created": "Tue, 23 Feb 2021 22:46:43 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Okay yet another thing. Apparently after the 1918 pandemic no one wrote about it, no songs were written, no great movies or novels about life in the pandemic. I wonder if it'll be like that this time. ",
            "created": "Tue, 23 Feb 2021 22:48:13 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The exam room at the eye doctor.",
            "created": "Tue, 23 Feb 2021 22:52:55 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2021/02/23/eyeDoctorExamRoo.png",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}