{
    "text": "February 25",
    "created": "Thu, 25 Feb 2021 15:35:40 GMT",
    "type": "calendarDay",
    "name": "25",
    "subs": [
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1365006719374548993\">Poll</a>: If you were a Republican who believes in the rule of law and the Constitution, what would you do?",
            "created": "Thu, 25 Feb 2021 15:35:41 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/11/27/kamala.png",
            "flInCalendar": true
        },
        {
            "text": "If you don't believe such a thing exists, listen to this <a href=\"https://cafe.com/stay-tuned/trumpeachment-with-david-frum/\">discussion</a> between David Frum and Preet Bharara, all the way through. Obviously Frum, a Republican, passionately believes in the rule of law, and he is staying a Republican, he says so clearly. I read Frum's <a href=\"https://www.amazon.com/gp/product/B07XKVQ2MJ/ref=dbs_a_def_rwt_bibl_vppi_i0\">latest book</a>, I read all his Atlantic columns. I cringe when he talks about Republican campaigns he worked on, and his experience in the Bush II administration. How could someone so honest be so corrupt? Somehow it works for him. Who am I to question. I have a philosophy. I don't ask how you got to the party. I don't care if you took the subway, or cam in a limo or an Uber, or you walked, rode a bike, or hijacked a bus. You're at the party, that's all that matters. Let's work together to get back to a place where we can respectfully disagree, and retain our honor. I'm pretty sure Frum would agree.",
            "created": "Thu, 25 Feb 2021 16:12:04 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=ab5zTLltXh4&feature=youtu.be\">A video demo</a> shows how un-disruptive it would be for Twitter to go beyond 280 chars.",
            "created": "Thu, 25 Feb 2021 19:40:20 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=ab5zTLltXh4",
            "flInCalendar": true
        },
        {
            "text": "If you work at a tech company and hear someone say that you're going for world domination, tell them I said it's okay but you should plan for co-existence and working with your competitors for the benefit of users. Just in case you don't achieve world domination. Always good to have a Plan B. :smile:",
            "created": "Thu, 25 Feb 2021 16:39:47 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Following up on the <a href=\"http://scripting.com/2021/02/22.html#a182406\">question</a> about <a href=\"https://www.amazon.com/Thomas-Original-English-Muffins-Value/dp/B003G8DA9G\">English Muffins</a>. The <a href=\"https://twitter.com/davewiner/status/1363858221694398465\">consensus</a> is they are not muffins. This, believe it or not, is a practical question. I was at the grocery store, loading up the conveyer belt for checking out. I dropped a pack of English Muffins on the belt, and accidentally dropped the other on the floor. I said \"there are two packs of muffins, please run that through twice.\" When I finished she said she didn't see any muffins. I laughed, and pointed to the <i>English</i> muffins. We had a nice discussion about whether or not they really are muffins. I thought I should ask my Twitter followers and Scripting News readers. We are mostly in agreement. 👎",
            "created": "Thu, 25 Feb 2021 17:04:28 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/02/25/realMuffin.png",
            "flInCalendar": true
        },
        {
            "text": "Twitter has a newsletter service. I signed up to see how it works. <a href=\"https://www.getrevue.co/profile/dave-winer/issues/weekly-newsletter-of-dave-winer-issue-1-79432\">You can subscribe</a>, but there probably will only be this one issue. Functionally it's very similar to the others. You have to use their editor. I already have an editor that's customized for the way I work, so there's no way I'm using their editor. I already have <a href=\"http://scripting.com/email/\">email distribution</a> of my own. It's ridiculous. They must not understand how writers work. We find the tool that's right for us and it becomes part of our bodies. Too much world domination as a strategy in tech, as always. That's how we get situations like this. ",
            "created": "Thu, 25 Feb 2021 16:34:22 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "These few years will determine the fate of the world in so many ways. It’s like a comedy, a very dark one, that so many focus their attention elsewhere. From Repubs trying to rig the elections so they win even if they don't have the votes, to liberals trying to enforce philosophical purity in journalism. Meanwhile <a href=\"https://www.youtube.com/watch?v=efHCdKb5UWc\">the world burns</a>. ",
            "created": "Thu, 25 Feb 2021 15:36:51 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Let my tweets breathe!",
            "created": "Thu, 25 Feb 2021 19:10:07 GMT",
            "type": "outline",
            "description": "More than 280, simple styling, links, titles, enclosures. Let tweets breathe!",
            "metaImage": "http://scripting.com/2016/10/01/silos.png",
            "subs": [
                {
                    "text": "My wish list for Twitter itself follows, not any of the things they announced today, all of which could be done just as well by others, and have been. ",
                    "created": "Thu, 25 Feb 2021 19:20:40 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "To the core product, this is what I want. ",
                    "created": "Thu, 25 Feb 2021 19:18:54 GMT",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "Tweets with more than 280 chars. ",
                            "created": "Thu, 25 Feb 2021 19:10:17 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Tweets with titles.",
                            "created": "Thu, 25 Feb 2021 19:11:07 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Simple styling, bold/italic.",
                            "created": "Thu, 25 Feb 2021 19:11:16 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Links.",
                            "created": "Thu, 25 Feb 2021 19:11:21 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Enclosures (for podcasting).",
                            "created": "Thu, 25 Feb 2021 19:11:24 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "<a href=\"http://scripting.com/2015/10/02/whatWouldAFatTweetLookLike.html\">A \"more\" button after 280</a>, so it's functionally equivalent to today's limits.",
                    "created": "Thu, 25 Feb 2021 19:11:32 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Would be enabling, explosive, powerful, society-transforming, useful, something only Twitter can do. Why not.",
                    "created": "Thu, 25 Feb 2021 19:12:08 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Let my tweets breathe! ",
                    "created": "Thu, 25 Feb 2021 19:13:41 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}