{
    "text": "February 26",
    "created": "Fri, 26 Feb 2021 13:30:59 GMT",
    "type": "calendarDay",
    "name": "26",
    "subs": [
        {
            "text": "How would you feel if Biden supporters invaded the CPAC meeting on Sunday when El Orange is speaking, and shot up the place, killed a cop, beat up a few more. Par for the course? Shit happens? Move on? Get over it? MAGA! Why not? Look who's up there on stage. Individual 1.",
            "created": "Fri, 26 Feb 2021 20:30:48 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1365382336616034309",
            "flInCalendar": true
        },
        {
            "text": "Perhaps my favorite thing about my <a href=\"http://scripting.com/2020/11/26.html#a201945\">Subaru Forester</a> is how well it fits me: \"It has more headroom than any car I've owned, which is cool because my torso is huge. In most cars, designed for normal-size people, I hit my head getting in, and have to scrunch my body uncomfortably just to fit. I sail in and out of the Forester, and I can sit any way I want.\" Is the same true of a Tesla, if so which one? I would certainly have to verify. ",
            "created": "Fri, 26 Feb 2021 20:33:50 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "One answer to all the new Republican voter suppression is to move Presidents’ Day holiday to the Tuesday after the first Monday in the month of November.",
            "created": "Fri, 26 Feb 2021 15:54:15 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "That huge crashing sound was..",
            "created": "Fri, 26 Feb 2021 13:31:00 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2021/02/26/ice.png",
            "description": "I was surprised the house could be rocked so hard and still be standing. ",
            "subs": [
                {
                    "text": "The other night it was super windy, and my house makes pretty nasty sounds when it's windy, but nothing like what it did that night. A huge crashing sound from the roof, like a big tree had hit the house. I was surprised the house could be rocked so hard and still be standing. ",
                    "created": "Fri, 26 Feb 2021 14:17:46 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "In the morning, I checked. No tree. This really weirded me out. ",
                    "flInCalendar": true
                },
                {
                    "text": "I had no idea what had happened until a few minutes ago, when I saw on the upstairs patio off my office there were these huge chunks of ice. I tried picking one up, and it wouldn't budge. Hundreds of pounds of ice, all over the place. ",
                    "created": "Fri, 26 Feb 2021 14:18:06 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Clearly what had happened that night was a chain reaction of ice that had accumulated through all the storms this winter, dislodging and crashing down off the porch at once. Right over my poor sleeping head! ",
                    "created": "Fri, 26 Feb 2021 14:18:36 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Oy at least it wasn't a tree. And the house is still standing!",
                    "created": "Fri, 26 Feb 2021 14:35:07 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The culprit. Lots of heavy ice.",
                    "created": "Fri, 26 Feb 2021 14:19:52 GMT",
                    "inlineImage": "http://scripting.com/images/2021/02/26/ice.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}