{
    "text": "February 28",
    "created": "Sun, 28 Feb 2021 14:11:21 GMT",
    "type": "calendarDay",
    "name": "28",
    "subs": [
        {
            "text": "If a software developer from the 80s were transported to the 2020s by a time machine, the first thing imho that he or she would want to know is what happened to all the word processors. why do people mostly use such shitty software to write online.",
            "created": "Sun, 28 Feb 2021 16:55:57 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Sometimes I write <a href=\"http://scripting.com/images/2021/02/28/facebookthread1.png\">good</a> <a href=\"http://scripting.com/images/2021/02/28/facebookthread2.png\">stuff</a> on Facebook and that kinds of sucks because it's hard to point to. If we had a good scripting tool for the internet as a whole, then we could pull together all our creations, so at least we could archive, index and make them searchable. I hate when I deposit a good idea on Facebook or Twitter. They often are impossible to find even 24 hours after I write them. We can do much better.  ",
            "created": "Sun, 28 Feb 2021 16:06:32 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "My Twitter newsletter is not off to a roaring start",
            "created": "Sun, 28 Feb 2021 14:11:22 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I started a newsletter using <a href=\"https://blog.twitter.com/en_us/topics/company/2021/making-twitter-a-better-home-for-writers.html\">Twitter's newly acquired service</a>, just to see how it worked. Four people subscribed. The email went out last night at midnight. Here's the <a href=\"http://scripting.com/images/2021/02/28/reportForNewsletter.png\">report</a>.",
                    "created": "Sun, 28 Feb 2021 14:11:29 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Since <i>no one</i> read the newsletter, I thought I should post the content here. Why waste some good off-the-top-of-my-head writing? ",
                    "created": "Sun, 28 Feb 2021 14:14:38 GMT",
                    "subs": [
                        {
                            "text": "What I want, and will accept no less, is to be able to use my editor, my writing space. Ask any writer how they like to write, and they’ll tell you that they like to write where they write. Forcing me to use your tool says you have an attitude of world domination. Unfortunately quite a few other tech companies have the world domination strategy. This is how we get silos, and how we create weak tools and limit communication. At a time where we need better communication tools.",
                            "created": "Sun, 28 Feb 2021 14:15:34 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Also one other question? Why don’t they suck in my tweets? What a missed opportunity. In my editor, I have a command that gets all my recent tweets, so I can use them as a starting point for more writing. Twitter now makes a pretty good place to drop an idea for exanding on later. You’d think Twitter itself would understand that.",
                            "flInCalendar": true
                        },
                        {
                            "text": "One more thing. Their writing app needs automatic vertical scroll. I don’t want to take my hands off the keyboard while writing to do something like scrolling the screen vertically, that the software should be doing for me.",
                            "flInCalendar": true
                        },
                        {
                            "text": "Anyway that’s enough for one issue of this proto-newsletter.",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "PS: I am one of the four subscribers and as far as I can tell I did not get a copy of the newsletter via email. It says I subscribed over three years ago. That's pretty weird. Maybe I tried it once before they were acquired by Twitter? I tend to do that. Oh well. :boom:",
                    "created": "Sun, 28 Feb 2021 14:16:05 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}