{
    "text": "Why they like guns",
    "created": "Fri, 06 Oct 2017 19:20:46 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "After listening to this <a href=\"https://www.nytimes.com/2017/10/05/podcasts/the-daily/bump-stock-las-vegas-guns.html?rref=collection%2Fcolumn%2FThe%20Daily&action=click&contentCollection=Podcasts&module=Collection&region=Marginalia&src=me&version=column&pgtype=article\">podcast</a>, I understand why people like guns. I get it. And I think I can explain it. Let's give it a try. ",
            "created": "Fri, 06 Oct 2017 19:21:24 GMT",
            "image": "http:///scripting.com/images/2017/10/06/gunsDontKillPeople.png"
        },
        {
            "text": "I used to have a fetish for stereo equipment when I was a kid. I'd go into the city to  high end stereo stores and get demos of the best equipment. I went to the electronics show at the Coliseum. I studied the equipment bands used. I became a sound engineer. I loved everything about it. The sound systems I lusted after were more power than I could afford, the systems cost thousands and I was just a kid. ",
            "created": "Fri, 06 Oct 2017 19:21:51 GMT"
        },
        {
            "text": "I also had fantasies about guns as a kid, like a lot of my young friends, we'd play soldier, or The Man from UNCLE, or James Bond, or Star Trek. There were lots of guns in the kid culture of the 60s and 70s.  When I was in college, at Tulane, in New Orleans, typically my roommates had guns. One took me to a firing range to learn how to shoot. I hated it. I didn't trust myself with the power. I realized I could just turn to the left and shoot someone. And they could shoot me. I couldn't wait to get out of there. I felt like I sometimes do on subway platforms. I could just jump in front of the train and be killed instantly. I step back from the platform and hold on to something to reassure myself that it's just fantasy. ",
            "created": "Fri, 06 Oct 2017 19:23:40 GMT"
        },
        {
            "text": "To some people the guns must be a combination of the lust I felt for the powerful sound systems and the weird way you feel when you can end it all with one irrevocable act. The fantasy gets better -- your country needs you to defend The Constitution. You have your guns ready for the day when you're called on. The NRA feeds the fantasy by saying who you will be defending the Constitution against. We're fighting for freedom, and our guns make it possible. More guns, get more guns. Because the country (in your fantasy) needs you. ",
            "created": "Fri, 06 Oct 2017 19:27:27 GMT"
        },
        {
            "text": "The reality is the country doesn't need you. If you ever start shooting people with your guns, you may kill others, like the guy in Las Vegas did, but you will be dead yourself a few minutes later. You are not responding to a threat. It's all in your mind. ",
            "created": "Fri, 06 Oct 2017 19:29:27 GMT"
        }
    ]
}