{
    "text": "Hayes and Swisher",
    "created": "Fri, 06 Oct 2017 15:08:50 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "<i>An earlier version of this piece remembered last night's MSNBC show incorrectly. I have since fixed the piece. Still diggin! :boom:</i>",
            "created": "Fri, 06 Oct 2017 17:07:30 GMT"
        },
        {
            "text": "It was fascinating to watch Chris Hayes and Kara Swisher together on Hayes' show last night, talking about Facebook. Swisher kept saying she thinks Facebook can get fake news under control. That idea deserves exploration, I wanted to hear more about why she thinks that. I suspect it might be right, and it's necessary imho for their survival. But I suspect they won't do it, because tech giants, and Facebook is that, don't see the <a href=\"http://scripting.com/2015/10/10/supportingStandardsWithoutAllThatNastyInterop.html\">cycle</a>.",
            "created": "Fri, 06 Oct 2017 15:09:46 GMT"
        },
        {
            "text": "Both Hayes and Swisher talked about the <a href=\"http://scripting.com/stories/2007/04/07/isMicrosoftDeadFeh.html#p6\">cycle</a>. They talked about how once we thought Microsoft was the big threat, but now not so much. One of the other guests said it was the antitrust suit that knocked them down, but I don't think that was the reason for them becoming not-dominant. ",
            "created": "Fri, 06 Oct 2017 15:10:50 GMT"
        },
        {
            "text": "Here's what happened in a nutshell. Microsoft achieved its moment of dominance on the shipping of <a href=\"https://en.wikipedia.org/wiki/Windows_3.0\">Windows 3.0</a>. No threats in sight. They must have had quite a party that night. IBM vanquished. Lotus, Apple, left in the dust. That was about it. Microsoft rules. ",
            "created": "Fri, 06 Oct 2017 15:12:22 GMT"
        },
        {
            "text": "At the same time the web was booting up. Microsoft responded in a scrappy highly competitive way. And they won, for a bit. They managed to replace Netscape as the dominant browser. Then they tried to turn the web into a feature of <a href=\"https://en.wikipedia.org/wiki/Microsoft_Office\">Office</a>. That was their basic posture re the upstarts, Google, blogs, all the things that were popping up around that time. All were apps that ran inside MSIE. A threat? Nah. Only the blogs turned into Facebook and Twitter, and Google was the glue that tied the web together. And where MSIE was stagnant and not moving (kind of like Facebook today) Firefox became the browser everyone used because it was fast and the bugs weren't so bad.",
            "created": "Fri, 06 Oct 2017 15:33:13 GMT"
        },
        {
            "text": "The bugs were, imho, the real downfall of Microsoft. Adware, malware, virii, they had lots of names, everyone was getting hit, and Microsoft didn't consider security their problem. It was a \"third party opportunity.\" I remember realizing in a SLC hotel once that my laptop had been infected through the wifi network in the hotel. That's how bad it was then. Microsoft wake up, your platform is dying. They ignored all the signals. ",
            "created": "Fri, 06 Oct 2017 15:17:11 GMT"
        },
        {
            "text": "I switched to the Mac in 2005 and never went back. No problems with malware. For me there wasn't anything intrinsically better about the Mac, it just worked and Windows and its browser was always broken or about to break. Firefox on the Mac was a great browsing experience. A lot of people switched in that period. ",
            "created": "Fri, 06 Oct 2017 15:39:03 GMT"
        },
        {
            "text": "Microsoft missed lots of opportunities to win back users, they didn't seem to care.  I don't think it was any single thing that took them down, rather a lack of awareness of the world around them, a lack of interest, curiosity. In other words they became a big company. They generate their own gravity, and people who work there become focused on that, rather than the rest of the world. That was how Microsoft knocked down IBM, by being agile and scrappy, and how Google et al did the same to Microsoft.",
            "created": "Fri, 06 Oct 2017 15:41:16 GMT"
        },
        {
            "text": "Facebook has done a great job of preventing the kind of malware that hit Microsoft so hard. That's like the <a href=\"https://en.wikipedia.org/wiki/Maginot_Line\">Maginot Line</a>. We always prepare to fight the last war. I guess fake news is to Facebook as malware was to Microsoft. And if Facebook can't clean up this aspect of their product, they could suffer the same fate as Microsoft. Or it could be just a symptom of a larger problem, too much internal gravity and not enough outward curiosity. ",
            "created": "Fri, 06 Oct 2017 15:20:16 GMT"
        },
        {
            "text": "I think it's great that the MSNBC hosts are interested in the history of big tech. It's not hard to understand. They're just stories like gods, royalty, sex, empires and great wars, victory and vindication. In other words, it's a human story. ",
            "created": "Fri, 06 Oct 2017 15:21:43 GMT"
        },
        {
            "text": "Ultimately the reason why Microsoft lost dominance and Facebook will is that no one gets to be dominant forever. ",
            "created": "Fri, 06 Oct 2017 17:13:35 GMT"
        }
    ]
}