{
    "created": "2022-10-04T04:00:00.000Z",
    "flInCalendar": true,
    "name": "04",
    "path": "2022/10/04",
    "text": "October 04",
    "type": "calendarDay",
    "subs": [
        {
            "text": "My friend Anton Zuiker has been one of the early users of \"FeedLand\" and his news product is the <a href=\"http://dukeriver.co/\">Duke River</a>. He works in the Duke University medical school. He's been a long-time user of my software (much appreciated). When he visited me in NYC a few years ago we rode Citibikes in Manhattan, even right through the middle of Times Square. Anton doesn't flinch at adventure. :boom:",
            "created": "Tue, 04 Oct 2022 17:31:16 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I like a <a href=\"https://twitter.com/Will_Bunch/status/1577235837028560897\">man</a> who's ok <a href=\"http://scripting.com/images/2022/10/04/boots.png\">looking</a> like an idiot wearing white rain boots.",
            "created": "Tue, 04 Oct 2022 15:43:34 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/Will_Bunch/status/1577235837028560897",
            "flInCalendar": true
        },
        {
            "text": "BTW, the Mets were rained out yesterday and the Braves lost, so technically the Mets are not yet eliminated in the race for the NL East. But it takes just one Mets loss or Braves win to do the deed, though, so we're hanging on by the thinnest possible thread. ",
            "created": "Tue, 04 Oct 2022 15:29:00 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "FeedLand",
            "created": "Tue, 04 Oct 2022 14:22:01 GMT",
            "type": "outline",
            "description": "The name of the project is FeedLand. You'll be hearing a lot about that in the weeks and months to come.",
            "subs": [
                {
                    "text": "Well here we are, the project I've been working on all year is now ready to show itself, a little. ",
                    "created": "Tue, 04 Oct 2022 14:24:55 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The name of the project is \"FeedLand\". You'll be hearing a lot about that in the weeks and months to come. ",
                    "created": "Tue, 04 Oct 2022 14:25:45 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It was a big effort, to take a fresh look at the world defined by \"RSS\", twenty years later. ",
                    "created": "Tue, 04 Oct 2022 15:01:08 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "In its first twenty years, RSS has become an established part of the open web. It got blogging and podcasting off the ground. It changed the world. Now we get started on the second twenty years.",
                    "created": "Tue, 04 Oct 2022 15:03:05 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "FeedLand defines two roles -- reader and developer. ",
                    "created": "Tue, 04 Oct 2022 14:28:50 GMT",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "People who read the news as prepared by others.",
                            "created": "Tue, 04 Oct 2022 14:29:12 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "The people who prepare the news.",
                            "created": "Tue, 04 Oct 2022 14:29:28 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "Most people fall into the first category. ",
                    "created": "Tue, 04 Oct 2022 14:29:33 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "FeedLand focuses on the second category. ",
                    "created": "Tue, 04 Oct 2022 14:29:43 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "So the first thing I want to show you is the result. ",
                    "created": "Tue, 04 Oct 2022 14:29:52 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "A new presentation of the news I read, attached to this blog.",
                    "created": "Tue, 04 Oct 2022 14:30:03 GMT",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "<a href=\"http://news.scripting.com/\">http://news.scripting.com/</a>",
                            "created": "Tue, 04 Oct 2022 14:32:10 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "This site has been <a href=\"http://scripting.com/river/\">attached</a> to Scripting News for years. ",
                    "created": "Tue, 04 Oct 2022 14:24:51 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It's the same site, except now it's managed by FeedLand.",
                    "created": "Tue, 04 Oct 2022 14:30:36 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "If you have questions, I've started a <a href=\"https://github.com/scripting/Scripting-News/issues/239\">thread</a> here. ",
                    "created": "Tue, 04 Oct 2022 14:30:47 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "<i>Still diggin!</i>",
                    "created": "Tue, 04 Oct 2022 14:45:42 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "\"curly\"",
                    "created": "Tue, 04 Oct 2022 14:45:55 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PS: I saved a <a href=\"http://scripting.com/river/backup/\">copy</a> of the river as it was before this change.",
                    "created": "Tue, 04 Oct 2022 14:41:51 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PPS: A <a href=\"http://scripting.com/images/2022/10/04/newsScreenShot.png\">screen shot</a> of what the new <a href=\"http://news.scripting.com/\">news.scripting.com</a> looked like on opening day.",
                    "created": "Tue, 04 Oct 2022 14:59:39 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "How EZ-Pass for news would work",
            "created": "Tue, 04 Oct 2022 13:04:38 GMT",
            "type": "outline",
            "description": "As a reader as far as I can tell I'm doing everything I'm supposed to, yet I can't read most of the stories I want to.",
            "metaImage": "http://scripting.com/images/2022/10/04/ezpass.png",
            "subs": [
                {
                    "text": "If there were a rational system for online news, imho, how would it work? I know news orgs don't think this way, but what if they did?",
                    "created": "Tue, 04 Oct 2022 13:04:49 GMT",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "A news org would put its local news stories behind a paywall, accessible via subscription only. ",
                            "created": "Tue, 04 Oct 2022 13:05:16 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Stories that are reprints of wire service stories could also be behind the paywall if they want, but I wonder what's the point. The same exact text is available from lots of other sources, often by local TV stations -- but they are thorougly saturated with horrific advertising. Want to do something original? Put these outside the paywall and get a reputation for being a \"good\" place to go for wire service stories.",
                            "created": "Tue, 04 Oct 2022 13:05:51 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "The tricky stuff are the stories that people from outside your area would want to read. For example, I live near NYC, these would include stories from the Boston, Chicago or Los Angeles local news orgs. For these, I suggest they could be behind your paywall too, if you want, but you should also make them available through a respected distributor, maybe a service run by one of the largest news orgs or wire services. They would charge on a per-read basis, to people who had registered a credit card with the distributor. The revenue would be shared with the distributor of course. Not sure what the price would be, you could try out a variety of prices and see which prices maximize revenue. This would be found money. Most people who live near New York are not going to subscribe to the big Atlanta news org.",
                            "created": "Tue, 04 Oct 2022 13:07:17 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "The final category are stories that are so important that you want to make sure everyone can read them without limit. At the height of the Covid pandemic some news orgs were putting their stories on the virus outside the paywall and they didn't count against your monthly limit. Of course this raises the question of why do you publish any stories that wouldn't be in this category? Isn't everything you publish vital? (Obviously not, but that's not something many news orgs would probably want to admit.)",
                            "created": "Tue, 04 Oct 2022 13:19:37 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "What got me thinking about this is that I recently discovered a New Jersey news org that does a good job of covering the Mets. They are a local team for New Jersey too. What a kick esp since the NYT which I do subscribe to has, for some reason, stopped covering the Mets. I wonder why. Anyway, to my chagrin that was short-lived. I guess they gave me a cookie and were counting the number of articles I was seeing, and now I can't read them any longer. There basically is no journalism I can read about the team, even though they are having an incredible year, and there's a lot to say about them and I am subscribed to one of the local news orgs. As a reader as far as I can tell I'm doing everything I'm supposed to, yet I can't read most of the stories I want to, and not just about the Mets, about <i>everything.</i>",
                    "created": "Tue, 04 Oct 2022 13:12:18 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I have found some bloggers that are filling the gap, a little. But we have a long way to go. We are already living in the age of news blackouts for a lot of what we're interested in, and when an important issue comes up, it's just another chance for news orgs outside our local area to remind us that we can't read their stories unless we subscribe, which is not possible, economically. ",
                    "created": "Tue, 04 Oct 2022 13:14:35 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "BTW, this blog has no paywall, it's free to read for everyone, and there are a number of things I write about that are as good as anything you'll read by a pro.",
                    "created": "Tue, 04 Oct 2022 13:16:03 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}