{
    "created": "2022-10-06T04:00:00.000Z",
    "flInCalendar": true,
    "name": "06",
    "path": "2022/10/06",
    "text": "October 06",
    "type": "calendarDay",
    "subs": [
        {
            "text": "When I'm in a groove programming, I find myself saying out loud, \"perfect\" and  \"thank you\" regularly. When I'm paying attention I can hear myself doing it. ",
            "created": "Thu, 06 Oct 2022 16:45:23 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Now that I have \"FeedLand\" running reliably, I am reading more of the few bloggers I've found that are blogging regularly. That includes <a href=\"https://www.manton.org/\">Manton Reece</a>, who I know from early \"Frontier\" days. One of our best developers, and a steady fellow, which was much appreciated. I know he's a sports fan too, living in Texas he follows the <a href=\"https://en.wikipedia.org/wiki/San_Antonio_Spurs\">San Antonio Spurs</a>, which is of course a legendary team. I am, as you know, a Knicks fan. But I have to say, until the Mets are finished, and probably a few weeks after that, I'm focused only on baseball. I'm very modal with my sports. I'm either in or not. I can't love two teams at the same time. It's just who I am. Anyway, Manton has written a <a href=\"https://book.micro.blog/\">book about microblogging</a> and he runs a service called <a href=\"https://micro.blog/\">micro.blog</a> which hosts blogs, running his software. I feel that his blog and my new reading software have brought us closer. And I look forward to reading his book. ",
            "created": "Thu, 06 Oct 2022 15:53:35 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2022/10/06/microblog.png",
            "flInCalendar": true
        },
        {
            "text": "Comments and <a href=\"https://github.com/scripting/Scripting-News/issues/239\">questions</a> re FeedLand continue to be welcome. ",
            "created": "Thu, 06 Oct 2022 17:13:07 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "BTW, here's my <a href=\"http://feedland.org/opml?screenname=davewiner&catname=bloggers\">list of bloggers</a>. But most of them aren't updating. I hope to add to this list, to find bloggers who are writing about interesting stuff with good <a href=\"http://scripting.com/davenet/1996/01/26/webenergy.html\">web energy</a>. ",
            "created": "Thu, 06 Oct 2022 16:02:55 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "For all the ups and downs the Mets ended the season with <a href=\"http://scripting.com/images/2022/10/06/standings.png\">exactly the same record</a> as the Braves, 101 wins and 61 losses. The only reason the Mets are in the wild card and the Braves get to wait for the next round, is that they won one more game against the Mets this year than they lost. It's like the <a href=\"https://www.youtube.com/watch?v=_b7bgtu2O4E\">game of inches</a> Al Pacino's character rants about in <a href=\"https://en.wikipedia.org/wiki/Any_Given_Sunday\">Any Given Sunday</a>. Life is made of inches. ",
            "created": "Thu, 06 Oct 2022 15:42:57 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=_b7bgtu2O4E",
            "flInCalendar": true
        }
    ]
}