{
    "created": "2022-10-09T04:00:00.000Z",
    "flInCalendar": true,
    "name": "09",
    "path": "2022/10/09",
    "text": "October 09",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Will the Mets have to tear down <a href=\"https://en.wikipedia.org/wiki/Citi_Field\">Citi Field</a> after this desecration?",
            "created": "Mon, 10 Oct 2022 02:13:01 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "When I was going home from the last game of the <a href=\"https://en.wikipedia.org/wiki/2000_World_Series\">2000 World Series</a> on the 7 train into Manhattan, there was a kid crying. I looked at the kid and thought, son, if you're going to be a Mets fan, you're going to be doing a lot of that. ",
            "created": "Mon, 10 Oct 2022 02:17:07 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "On the bright side, the Knicks season starts on Oct 19 in Memphis. Of course their season will probably end much like the Mets season did, but that's a long long way off. ",
            "created": "Mon, 10 Oct 2022 02:18:55 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I am testing <a href=\"https://www.google.com/search?q=site%3Ascripting.com+rsscloud\">rssCloud</a> support in FeedLand now. ",
            "created": "Sun, 09 Oct 2022 16:14:30 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Of course people will want to know why do <a href=\"http://home.rsscloud.co/\">rssCloud</a> when the W3C diss'd RSS by reinventing something that already works great. I think the question answers itself. :smile:",
            "created": "Sun, 09 Oct 2022 16:28:22 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "This kind of disrespect is very popular among techies. They want to say they invented something, which is a lie -- but if they never tell anyone about the things that came before, they kind of hope to get away with it. It's one of the worst things about tech, and why progress takes so long, why we're still \"solving\" problems that were solved when I was in school, and that was a long time ago. It's not just big companies that do this, sometimes one-person companies do it. Shaking my head. It would work so much better if we built on each others' work.",
            "created": "Sun, 09 Oct 2022 16:29:31 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "There's a great movie, <a href=\"https://en.wikipedia.org/wiki/Any_Given_Sunday\">Any Given Sunday</a>, just about this. I re-watched it yesterday. There's so much truth in it. Young people, men especially, want to be the hero and ignore that winning requires that people work together, and that the real joy of being human comes not from being the great conqueror (as young men imagine), but having 12 people in a huddle fighting for something worth fighting for, together -- as a team. I don't want to be Don Quixote, but if the tech world doesn't want to collaborate, I'm not going to stop being creative, or stop hoping that someday other techies see things <a href=\"http://scripting.com/stories/2008/07/26/listeningRespectAndTeamwor.html\">the way I do</a>. Working together is where it's at. BTW, that's really the point of <a href=\"http://this.how/standards/\">Rules for Standards-Makers</a>, in case that wasn't obvious.",
            "created": "Sun, 09 Oct 2022 16:31:54 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2022/10/09/anyGivenSundayPoster.png",
            "flInCalendar": true
        }
    ]
}