{
    "created": "2022-10-17T04:00:00.000Z",
    "flInCalendar": true,
    "name": "17",
    "path": "2022/10/17",
    "text": "October 17",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Tonight's final game between the Yankees and Guardians was <a href=\"https://www.espn.com/mlb/story/_/id/34819494/guardians-yankees-alds-game-5-moved-tuesday-afternoon\">rain-delayed</a>, but while they were waiting to see if the game would be played, they had a panel of four baseball experts talking for a long time about absolutely nothing because there was nothing to say. It's raining at Yankee Stadium. How many ways can you say that. I felt sorry for them, but they were kind of people who even when they had the normal amount of time to fill said nothing but platitudes. That's their job. I did a bit of channel switching, looked in on MSNBC and CNN, and they had the usual panels, just like the one for the rain-delayed baseball game. I finally landed on a lovely sweet <a href=\"https://www.metacritic.com/movie/juno\">movie</a> I had seen before, <a href=\"https://en.wikipedia.org/wiki/Juno_(film)\">Juno</a>, and was reminded that humans can tell powerful, funny, touching stories using this medium. It doesn't all have to be sad, mindless, soulless bullshit. I think that's why we're all so unhappy with our lives and each other. We're addicted to watching the same actors saying the same old boring bullshit day after day, and we're angry about that, and have to blame someone, anyone but ourselves, for putting up with it. ",
            "created": "Tue, 18 Oct 2022 02:32:02 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2022/10/17/clevelandIndian.png",
            "flInCalendar": true
        },
        {
            "text": "Ignorance is <a href=\"https://en.wiktionary.org/wiki/Appendix:Glossary#surface_analysis\">derived</a> from the word ignore. It's the act of ignoring, or ignore-ance. ",
            "created": "Tue, 18 Oct 2022 02:52:59 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Right now my favorite song in creation is <a href=\"https://www.youtube.com/watch?v=Gz5mI6tqm_Q\">Can't You Hear Me Knocking</a>. It's got everything, but most important, a driving bass and drums and a steady beat. It's always in my Peloton playlist, every time -- it's when I drive the bike fastest and steadiest, with a huge grin on my face. And it's two songs in one. First it's the hit as conceived by <a href=\"https://en.wikipedia.org/wiki/Mick_Jagger\">Jagger</a> and <a href=\"https://en.wikipedia.org/wiki/Keith_Richards\">Richards</a>. But then it just goes into a jam, not part of the song, but they loved it so much they kept it. It's got a Santana sound. I never seem to get tired of it. The lead on the second half is <a href=\"https://en.wikipedia.org/wiki/Mick_Taylor\">Mick Taylor</a> not Keef. ",
            "created": "Mon, 17 Oct 2022 17:07:28 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2022/10/17/sticky.png",
            "flInCalendar": true
        },
        {
            "text": "How will the fascist autocracy be put down or will we go all the way, as Germany did in the 1930s? Will Kanye West be the minister of extermination for the American Nazi Party? Will this year's election, where the press still reports this as Repubs vs Dems, be the turning point?",
            "created": "Mon, 17 Oct 2022 12:33:49 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "FeedLand screen shot",
            "created": "Mon, 17 Oct 2022 17:18:09 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "This is the main page, your feed list, but it's also a new kind of news reader.<br>If you have questions, this is <a href=\"https://github.com/scripting/Scripting-News/issues/240\">the place</a>. ",
                    "created": "Mon, 17 Oct 2022 17:13:24 GMT",
                    "inlineImage": "http://scripting.com/images/2022/10/17/feedListScreenshot.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}