{
    "created": "2022-10-19T04:00:00.000Z",
    "flInCalendar": true,
    "name": "19",
    "path": "2022/10/19",
    "text": "October 19",
    "type": "calendarDay",
    "subs": [
        {
            "text": "The first segment on <a href=\"https://www.iheart.com/podcast/1119-countdown-with-keith-olbe-99705496/episode/make-the-commercial-before-its-too-103467900/\">today's</a> Countdown with Keith Olbermann asks where are the Democrats' commercials warning of what happens if we lose the legislature in the upcoming election. It's going to be tragic, people ought to have a chance to know the consequences of voting Republican.",
            "created": "Wed, 19 Oct 2022 21:33:08 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I'm writing FeedLand docs today, preparing for some new users. My hope is they'll actually read the docs, but -- well at least I hope they read the Getting Started docs. I try to make the writing interesting, with lots of screen shots and side-stories. Easter eggs where possible. Once I get going I do actually enjoy this kind of writing. I've only been doing it for 35 or so years. Heh. Ooops. ",
            "created": "Wed, 19 Oct 2022 14:35:04 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://twitter.com/KenSmith/status/1582730901460750336\">I agree</a> -- the formats that are with us forever are [[RSS]] and [[HTML]]. It's not because I love [[XML]] over [[JSON]], I don't -- but I also don't argue with reality. A waste of time.",
            "created": "Wed, 19 Oct 2022 14:49:45 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Imagine",
            "created": "Wed, 19 Oct 2022 12:53:23 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2022/10/19/pond.png",
            "subs": [
                {
                    "text": "Imagine if journalism really did their jobs, and to be fair this includes Fox News and their kin. ",
                    "created": "Wed, 19 Oct 2022 12:53:25 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Perhaps a lot less than a <a href=\"https://ourworldindata.org/covid-deaths\">million Americans</a> would have died from Covid. But even if they had all died, people would know that incompetence of the US government response was largely responsible. That who you choose to run the government very much matters. It could be life and death for you and your family and friends. ",
                    "created": "Wed, 19 Oct 2022 12:54:44 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "People would also know about the game the Repubs play with the debt limit, holding the wealth of the US hostage, in return for concessions that make their benefactors richer, and support the empire that Putin is trying to reboot. ",
                    "created": "Wed, 19 Oct 2022 12:55:30 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "And on and on. So many huge problems we only begin to deal with when there's a Democratic government, and sometimes they survive the Repubs, but one of these times they won't. ",
                    "flInCalendar": true
                },
                {
                    "text": "People don't understand the role government plays in our lives. Journalism should be helping them figure it out, instead it only reinforces the errors, telling the people only what they expect to hear. ",
                    "created": "Wed, 19 Oct 2022 12:57:16 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}