{
    "created": "2022-10-21T04:00:00.000Z",
    "flInCalendar": true,
    "name": "21",
    "path": "2022/10/21",
    "text": "October 21",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I love this <a href=\"https://www.imdb.com/title/tt2193215/characters/nm0000093\">quote</a> <a href=\"https://www.nytimes.com/2013/10/25/movies/the-counselor-a-cormac-mccarthy-tale-of-mostly-evil.html?\">from</a> <a href=\"https://en.wikipedia.org/wiki/The_Counselor\">The Counselor</a>. \"They don't really believe in coincidences. They've heard of them. They've just never seen one.\" He's talking about the mob, and how they don't listen to excuses. If you owe them money you pay them or they kill you. But it's clever the way it was <a href=\"https://www.amazon.com/Counselor-Cormac-McCarthy/dp/1447227646\">written</a>. I think we need more of that in how we judge <a href=\"https://www.youtube.com/watch?v=TqNaJxRC9NM&t=27s\">malfeasance</a> by Trumpers. Stop being so fucking patient. <i>Trump stole the documents because he has customers for them. </i>That's all he cares about. Stop defending him. These aren't coincidences. ",
            "created": "Fri, 21 Oct 2022 19:43:11 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "If I were in charge of the Democratic Party's advertising leading up to the midterms, I'd zero in on <a href=\"https://www.politico.com/news/2022/06/24/thomas-constitutional-rights-00042256\">Clarence Thomas's opinion</a> on the Dobbs case which said the insane part out loud. The next things that are going to be made illegal, after abortion -- contraception, same-sex marriage. The other conservatives say no, but we've been down <a href=\"https://www.nbcnews.com/politics/supreme-court/supreme-court-justices-said-roe-abortion-confirmations-rcna35246\">that road</a>. People expect to be told about the evilness of the other side, and if there is no evil in the advertising, it's reasonable to assume there is no evil. ",
            "created": "Fri, 21 Oct 2022 16:15:52 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Watching last night's playoff game between the Yankees and Astros, there was a moment when the camera zero'd in on the Houston pitcher, doing nothing. The announcers describe the scene. Someone from the crowd had run out on the field and <a href=\"https://twitter.com/AriA1exander/status/1583287947469918208\">tried to hug</a> the Houston infielder <a href=\"https://en.wikipedia.org/wiki/Jos%C3%A9_Altuve\">José Altuve</a>. They described how the police were trying to catch the guy. How much would his lawyers cost for this? $10K another announcer thought. And he'll spend the night in jail, another collegue guessed. But we didn't see any of this. The camera never pointed at the action because to do so, <a href=\"https://www.mlb.com/\">MLB</a> felt, would encourage people to do more of this. It's a rule for a kind of journalism, <a href=\"https://en.wikipedia.org/wiki/Sports_commentator#Main/play-by-play_commentator\">sports play-by-play</a>. I don't think there's much actual journalism in the coverage of professional sports (I can go into that another time). Okay so what if there were a similar rule to political journalism, if they were not allowed to run stories based only on polling. For a different reason, because polling has proven to be wildly wrong in the last few elections. Polls were almost certain <a href=\"https://en.wikipedia.org/wiki/Nationwide_opinion_polling_for_the_2016_United_States_presidential_election\">HRC</a> would win. They got whole sections of the country wildly wrong. Many other examples. There are theories about why this is, but no one knows. So it seems hugely damaging, even unprofessional to report poll results as news, esp when it isn't disclaimed in the headline, so it's clear they're writing about fiction and the story is almost certainly 100% [[bullshit]]. ",
            "created": "Fri, 21 Oct 2022 15:51:50 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2022/10/21/altuve.png",
            "urltweet": "https://twitter.com/AriA1exander/status/1583287947469918208",
            "flInCalendar": true
        },
        {
            "text": "One of the big lessons I learned from selling what people now call [[Tools For Thought]] a long time ago, that there's a very limited market of people who see their job as thinking, even if there's a lot of thought to what they do. If you go to a Monday staff meeting and when it's your turn to speak you say \"I spent the week thinking about stuff\" you might be the first one they cut when it's time for layoffs or promotions. Bosses want to hear what you did, not what you thought about. The secret is this -- production applications. Things they <i>do</i> with your product as opposed to thinking about things. If you find one of those that resonates, sell the shit out of it. For us it was presentations. It kept showing up near the top of lists of what people used [[ThinkTank]] for. When we made features specifically for presenting, the product took off. We went from selling \"idea processing\" to presenting. Sure there's a lot of thinking in preparing presentations, that's why the product worked so well for that. It's like saying there's a lot of steering in driving the car. What you're doing is driving. Steering is just part of it. ",
            "created": "Fri, 21 Oct 2022 15:40:34 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "[[FeedLand]] is not yet released. It is currently being used by about twenty people, since early August. I don't want to add more yet, because this product is about community. We're not ready yet for a lot of new people. We're going slow and deliberately. I remember from past experience how community cultures develop. I want to get this right.",
            "created": "Fri, 21 Oct 2022 14:03:09 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}