{
    "text": "Sex in Silicon Valley",
    "created": "Sun, 02 Jul 2017 11:45:21 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I've watched with interest  p <a href=\"http://nymag.com/selectall/2017/06/vc-chris-sacca-apologizes-to-women-amid-binary-lawsuit.html\">the</a> <a href=\"https://500hats.com/im-a-creep-i-m-sorry-d2c13e996ea0\">issue</a> <a href=\"https://techcrunch.com/2017/07/01/500-startups-dave-mcclure-apologizes-for-multiple-advances-toward-women-and-being-a-creep/\">of</a> <a href=\"http://www.techmeme.com/170630/p14#a170630p14\">sexual harassment</a> in the VC world has come up. This is something I've never experienced personally, because I was never a VC and am not a woman. But I did live in the valley between 1979 and 2003. I dated women, and people did pitch me ideas from time to time. So the lines did cross. It's inevitable in a world with adults and business-obsessed people. ",
            "created": "Sun, 02 Jul 2017 11:45:26 GMT",
            "image": "http://scripting.com/2016/05/25/monopolyDude.png",
            "permalink": "http://scripting.com/2017/07/02.html#a070726"
        },
        {
            "text": "I have a suggestion for how to deal with this when everyone's intentions are good. Guys, if the woman is talking about her business ideas, that means it isn't about sex, no matter where it is. You need to hear that and respect it. A meeting in a business setting, a conference room at an office for example, is business. Flirting and sex talk, even complimenting a woman on her appearance is not OK. Don't do it. You may think it's innocent, it's not. ",
            "created": "Sun, 02 Jul 2017 11:49:28 GMT",
            "permalink": "http://scripting.com/2017/07/02.html#a070728"
        },
        {
            "text": "On the other hand if it's a date, don't pitch your product. That feels really dirty. It's not fair. I've been there, it makes me angry. I believe in a level playing field. Mixing sex and business in inappropriate ways is not good. Make sure everyone knows what's going on and is okay with it.",
            "created": "Sun, 02 Jul 2017 11:51:30 GMT",
            "permalink": "http://scripting.com/2017/07/02.html#a070730"
        }
    ],
    "permalink": "http://scripting.com/2017/07/02.html#a070721"
}