{
    "text": "Live Like An American",
    "created": "Fri, 27 May 2022 14:26:30 GMT",
    "type": "outline",
    "metaImage": "http://scripting.com/images/2022/05/27/texasGunFolk.png",
    "description": "They either bristle with anger or badly fake feelings of regret. ",
    "subs": [
        {
            "text": "Some people have an idea that you should \"live like an American\" as if there is such a thing. But that seems to be what we're arguing about.",
            "created": "Fri, 27 May 2022 14:26:36 GMT",
            "flInCalendar": true
        },
        {
            "text": "There are some basically dishonest people who act like living like an American means Be Like Me. And some of the things about them are impossible for other people to be like. If being like an American means white, that let's out a lot of people. Be Christian. I'm not that, and can't pretend I am, so that let's me out. The idea of how an American lives is actually very narrow, and there probably isn't a single person anywhere that fits in. ",
            "created": "Fri, 27 May 2022 14:26:47 GMT",
            "flInCalendar": true
        },
        {
            "text": "It's deep confusion about the meaning of life. They pretend to know the answer, it means Live Like An American and you're doing it. ",
            "flInCalendar": true
        },
        {
            "text": "Here's a picture of some of those people, btw. ",
            "created": "Fri, 27 May 2022 14:27:55 GMT",
            "inlineImage": "http://scripting.com/images/2022/05/27/texasGunFolk.png",
            "flInCalendar": true
        },
        {
            "text": "Yes I know I'm judging them, fine -- they judge everyone else, so imho it's fair. They either bristle with anger or badly fake feelings of regret. To them that's what it means to Live Like An American. All of it an imitation of living. I honestly have no idea what it's like to be one of those people, what their inner life must be like, what a hell it must be. That's how I imagine it. ",
            "created": "Fri, 27 May 2022 14:30:13 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}