{
    "text": "October 3",
    "created": "Sat, 03 Oct 2020 14:16:38 GMT",
    "name": "03",
    "subs": [
        {
            "text": "If Trump's <a href=\"https://twitter.com/realDonaldTrump/status/1312525833505058816\">talk</a> from the hospital this evening was meant to reassure it had the opposite effect. And you can tell he doesn't actually do anything, because the only thing he came up with for what he does is Make (sigh) America Great Again. Oh really. Is that what we're doing. ",
            "created": "Sun, 04 Oct 2020 00:50:55 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/08/02/francoAplenty.png"
        },
        {
            "text": "Imagine you're a kid in a house where they love Trump. It's weird because they're admiring a bully, yet trying to make sure their kid knows bullies are bad. Every family has to deal with this one way or another. I wonder how they do it. Now there's a moral to the story. See, even the bully needs help from other people.",
            "created": "Sat, 03 Oct 2020 15:05:57 GMT",
            "type": "outline"
        },
        {
            "text": "Trump needs science to save his life. Not \"as if by magic it'll disappear.\" If his life is saved it'll be saved by science.",
            "created": "Sat, 03 Oct 2020 14:51:09 GMT",
            "type": "outline"
        },
        {
            "text": "It’s kind of amazing CNN hasn’t figured out that there was a  <a href=\"http://scripting.com/2020/10/02.html#a125941\">previous president</a> who got a virus in a pandemic. Woodrow Wilson in 1918, got the Spanish flu and was disabled for the rest of his life as a result.",
            "created": "Sun, 04 Oct 2020 00:53:29 GMT",
            "type": "outline"
        },
        {
            "text": "Something weird is happening. I woke up this morning with nothing to say. For a moment at least the world seems to be straightening itself out. I might take a well-deserved break.",
            "created": "Sat, 03 Oct 2020 14:16:39 GMT",
            "type": "outline"
        },
        {
            "text": "This was all so preventable.",
            "created": "Sun, 04 Oct 2020 00:34:31 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/10/03/thisWasAllSoPreventable.png"
        }
    ]
}