{
    "text": "October 4",
    "created": "Sun, 04 Oct 2020 13:59:48 GMT",
    "name": "04",
    "subs": [
        {
            "text": "<a href=\"https://twitter.com/TeamPelosi/status/1312778024119611392\">Speaker Pelosi</a>. \"Crush the virus.\"",
            "created": "Sun, 04 Oct 2020 15:38:41 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1312853945300267010\">Poll</a>: How sick is Trump, do you guess? ",
            "created": "Mon, 05 Oct 2020 01:53:43 GMT",
            "type": "outline"
        },
        {
            "text": "Did you see the movie <a href=\"https://www.youtube.com/watch?v=E9eAshaPvYw&feature=emb_logo\">Death of Stalin</a>? I have a feeling something like that is going on behind the scenes here in the US. ",
            "created": "Sun, 04 Oct 2020 15:29:45 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=E9eAshaPvYw"
        },
        {
            "text": "I saw <a href=\"https://en.wikipedia.org/wiki/Al_Franken\">Al Franken</a> on MSNBC yesterday. He talked for several minutes uninterrupted. Riveting. No doubt he's the best communicator the Dems have. <a href=\"https://en.wikipedia.org/wiki/Alexandria_Ocasio-Cortez\">AOC</a> is great too, as is <a href=\"https://en.wikipedia.org/wiki/Joe_Trippi\">Joe Trippi</a> (he should run for something). <a href=\"https://en.wikipedia.org/wiki/Elizabeth_Warren\">Elizabeth Warren</a> excels, esp the last few weeks. But Franken is tops.",
            "created": "Sun, 04 Oct 2020 14:27:50 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/08/04/melo.png"
        },
        {
            "text": "Also, I tried listening to <a href=\"https://alfranken.com/listen\">Al Franken's podcast</a>. He has a long ad at the beginning, and I don't do that. He should find a different revenue model. He's got a long road ahead to come back. The podcast should be instrumental in that, but the advertising disgusted me, and I won't listen to it. Too many people with something to say do this. Shame. Podcasting wires you directly into people's brains when they have the attention to really listen. Don't waste that selling some cheesy house ornament or utility. ",
            "created": "Sun, 04 Oct 2020 14:28:45 GMT",
            "type": "outline"
        },
        {
            "text": "Right now it would be interesting to have 10K permanent protestors in DC, until the election, to make sure the Repubs know and feel that the people are watching.  ",
            "created": "Sun, 04 Oct 2020 14:31:16 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://www.axios.com/las-vegas-shooting-kills-at-least-20-injures-more-than-100-2491911641.html\">Three years ago</a>.",
            "created": "Sun, 04 Oct 2020 14:46:57 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/10/04/itShouldntBeThatEasy.png"
        },
        {
            "text": "Checking in on Twitter",
            "created": "Sun, 04 Oct 2020 13:59:49 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I started writing in Twitter just now and it turned into a short list of where Twitter is at from my point of view. Likes and dislikes.",
                    "created": "Sun, 04 Oct 2020 13:59:55 GMT",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "One thing I dislike in Twitter is seeing links to interesting stories that I can't read because they're behind a paywall.",
                            "created": "Sun, 04 Oct 2020 14:00:32 GMT",
                            "subs": [
                                {
                                    "text": "This is happening more, it seems. I expect it is because the pubs are getting better at building circulation that way.",
                                    "created": "Sun, 04 Oct 2020 14:00:52 GMT"
                                },
                                {
                                    "text": "It seems Twitter could do something to help here. Either work out a deal with publishers that would allow Twitter users to read articles on a per-story basis. Act as a distribution platform. ",
                                    "created": "Mon, 05 Oct 2020 01:39:07 GMT",
                                    "subs": [
                                        {
                                            "text": "Or give users the ability to say \"I don't want to see links to these pubs, because I don't subscribe to them.\" If we can't have the former, I want the latter. I'm tired of seeing links to stories I can't read. And subscribing to all the pubs with paywalls is ridiculous, of course. ",
                                            "created": "Mon, 05 Oct 2020 01:39:47 GMT"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "text": "I also dislike that Twitter is so hierarchic. ",
                            "created": "Sun, 04 Oct 2020 14:01:21 GMT",
                            "subs": [
                                {
                                    "text": "People decide whether something is important based on who the writer is. There doesn't seem to be much room for ideas to circulate on their own merit. ",
                                    "created": "Sun, 04 Oct 2020 14:05:56 GMT"
                                },
                                {
                                    "text": "There is a circle of commentators and you're either in or out. I'm out and you are probably too. (And I have a blue checkmark and tens of thousands of followers.) ",
                                    "created": "Sun, 04 Oct 2020 14:06:04 GMT"
                                },
                                {
                                    "text": "You can say all you want, but if it's outside your perceived area of expertise, no one will hear it. ",
                                    "created": "Sun, 04 Oct 2020 14:06:17 GMT",
                                    "subs": [
                                        {
                                            "text": "I'm an expert in using and building the kind of networks we use today. ",
                                            "created": "Mon, 05 Oct 2020 01:42:02 GMT"
                                        },
                                        {
                                            "text": "But everyone thinks they're an expert in this, so that expertise counts for little. ",
                                            "created": "Mon, 05 Oct 2020 01:42:16 GMT"
                                        }
                                    ]
                                },
                                {
                                    "text": "Having money automatically conveys value to your ideas. ",
                                    "created": "Sun, 04 Oct 2020 14:06:54 GMT",
                                    "subs": [
                                        {
                                            "text": "It's the most transportable form of expertise, because (I guess) people think you can buy whatever expertise you personally don't have?",
                                            "created": "Mon, 05 Oct 2020 01:42:26 GMT"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "text": "I like writing in Twitter, and that makes me think a tool something like this for offline writing might be good.",
                            "created": "Sun, 04 Oct 2020 14:02:11 GMT",
                            "subs": [
                                {
                                    "text": "It's a lot like an outliner. Chunks of text. Twitter has fuzzy ways of navigating the structure. Hard to feel it. Outliners are pretty clear about the structure. And the structure is editable in an outliner. ",
                                    "created": "Sun, 04 Oct 2020 14:07:40 GMT"
                                },
                                {
                                    "text": "I've often wondered if an outliner wouldn't make a good writing tool for Twitter. I don't do it that way, so obviously at that level it's not there. ",
                                    "created": "Mon, 05 Oct 2020 01:44:26 GMT"
                                }
                            ]
                        },
                        {
                            "text": "I dislike how hard it is to find something I wrote on Twitter. I pretty much have to get an idea into my blog so it can be indexed by the search engines. That's the only way I have any hope of finding it in the future. ",
                            "created": "Sun, 04 Oct 2020 14:02:43 GMT"
                        }
                    ]
                }
            ]
        }
    ]
}