{
    "text": "October 5",
    "created": "Mon, 05 Oct 2020 14:15:40 GMT",
    "name": "05",
    "subs": [
        {
            "text": "If you want to follow my development work, I've created a <a href=\"http://instantoutliner.com/k5\">public outline</a> where I report my daily work, when I can. Click the link, and the outline will open in LO2 as a read-only live-updating outline. ",
            "created": "Mon, 05 Oct 2020 16:48:12 GMT",
            "type": "outline"
        },
        {
            "text": "If Fauci had a podcast we'd hear what he thinks every day. You wouldn't have to go hunting for him. The public needs a pulse for guidance about what's going on. Not getting him on the podcast network at the time that say Cuomo was booting up was a mistake. I think it would have saved a lot of lives. I don't know, maybe he's being so effective inside the government that they can't spare him. But I've seen his main value this year as a reliable communicator.  ",
            "created": "Mon, 05 Oct 2020 14:20:45 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/05/01/fauciHead.png"
        },
        {
            "text": "I don't understand why the debaters have to be in the same physical place. The whole thing would be much more manageable if they did it electronically.",
            "created": "Mon, 05 Oct 2020 17:40:17 GMT",
            "type": "outline"
        },
        {
            "text": "Saddest moment yesterday was when Trump said he was learning all about Covid. This is why the world should pity us. We have a no-president president. Can you imagine how much Obama would know by now if he were president. Oy.  ",
            "created": "Mon, 05 Oct 2020 14:23:57 GMT",
            "type": "tweet",
            "tweetId": "1313122931875160066",
            "tweetUserName": "davewiner"
        },
        {
            "text": "It's hard to believe but Repubs plan to challenge every absentee ballot in swing states. When they say it might take months to get a result, that's because they plan to make it take months. More info like this in <a href=\"https://www.npr.org/2020/10/01/919131327/what-happens-if-trump-contests-the-election\">Thursday's episode</a> of Fresh Air. You probably have no idea how screwed up this election is going to be, <i>by design.</i> (Update: <a href=\"https://apnews.com/article/virus-outbreak-election-2020-donald-trump-local-elections-lawsuits-4298a514550323d39931f3e5fff2ccae\">Check out</a> what they're doing in North Carolina.)",
            "created": "Mon, 05 Oct 2020 14:15:41 GMT",
            "type": "outline"
        },
        {
            "text": "You know how sometimes your brain as it scans sees one word but the word that's actually there is something else? It happens every time I see NakedJen's logo on Twitter. It says \"nakedjen anarchist & agitator.\" But my brain always sees \"antichrist\" in place of anarchist. It keeps happening, finally I had to mention it. Sorry Jen, I have no idea what it means, if anything.",
            "created": "Mon, 05 Oct 2020 15:23:24 GMT",
            "type": "outline"
        },
        {
            "text": "It really does say anarchist, but my mind sees something else.",
            "created": "Mon, 05 Oct 2020 15:26:55 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/10/05/nakedJenOnTwitter.png"
        },
        {
            "text": "What's wrong with Facebook",
            "created": "Mon, 05 Oct 2020 15:03:32 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Yesterday I <a href=\"http://scripting.com/2020/10/04/135949.html?title=checkingInOnTwitter\">wrote</a> about what's right with Twitter these days. ",
                    "created": "Mon, 05 Oct 2020 15:03:38 GMT"
                },
                {
                    "text": "Today -- Facebook. ",
                    "created": "Mon, 05 Oct 2020 15:03:49 GMT"
                },
                {
                    "text": "One thing overshadows all other considerations. They swapped out the old user interface in favor of a new more modern-looking one. It is more attractive, better use of fonts, the text is generally more readable, and it has a brighter look. ",
                    "created": "Mon, 05 Oct 2020 15:03:54 GMT"
                },
                {
                    "text": "But that's all that I can say about it that's good.",
                    "created": "Mon, 05 Oct 2020 15:04:52 GMT"
                },
                {
                    "text": "What's bad? The product is depressing. Almost everything it shows you is junk. They must be trying to get us to stop using Facebook. ",
                    "created": "Mon, 05 Oct 2020 15:05:02 GMT"
                },
                {
                    "text": "This isn't the usual thing, users hate redesigns, but get used to them and after a while see that it's better in some ways, worse in others. I've been using it for a while, and it's every bit as ridiculous today as it was a few weeks ago. ",
                    "created": "Mon, 05 Oct 2020 15:20:32 GMT"
                },
                {
                    "text": "First all the spam friend requests are treated as super important, higher priority than anything else.",
                    "created": "Mon, 05 Oct 2020 15:09:55 GMT"
                },
                {
                    "text": "It's like opening your real-world mailbox and all you get are catalogs, mailers, special offers, political ads, notices, most of it goes in the garbage, but you have to look at everything, because there will be things you have to pay attention to. ",
                    "created": "Mon, 05 Oct 2020 15:12:14 GMT"
                },
                {
                    "text": "How can their code fail to see that all the friend requests I get are spam? ",
                    "created": "Mon, 05 Oct 2020 15:06:31 GMT"
                },
                {
                    "text": "No one with any influence inside Facebook is using the version of the software we are using or they'd revert it immediately and then fix it. I've seen companies ship upgrades so bad the company failed, and this one is right up there. ",
                    "created": "Mon, 05 Oct 2020 15:07:46 GMT"
                }
            ]
        }
    ]
}