{
    "text": "October 7",
    "created": "Wed, 07 Oct 2020 12:38:40 GMT",
    "name": "07",
    "subs": [
        {
            "text": "This <a href=\"http://scripting.com/\">blog</a> started <a href=\"http://scripting.com/2020/10/07/001509.html?title=26YearsBlogging\">26 years</a> ago today. Here's <a href=\"https://www.youtube.com/watch?v=mKKLIrOGfUo\">the song</a> for that occasion. I was so much older then I'm younger then that now. Of course when I woke up I had no idea. Totally spaced it out. Thanks to my friend Geraldine, one of my constant readers, for pointing it out. :heart:",
            "created": "Wed, 07 Oct 2020 15:41:49 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=5AoY6RRfMZM\">Randy Rainbow and Patty Lupone</a>. The best thing ever. ",
            "created": "Wed, 07 Oct 2020 16:07:16 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=5AoY6RRfMZM"
        },
        {
            "text": "Today's song: <a href=\"https://www.youtube.com/watch?v=tpNy6xqoQa8\">Don't cry for me Argentina</a>.",
            "created": "Wed, 07 Oct 2020 12:38:41 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=tpNy6xqoQa8"
        },
        {
            "text": "The fourth and final season of <a href=\"https://www.amazon.com/Mr-Robot-Season-4/dp/B07X1V834N\">Mr Robot</a> is now on Amazon Prime. It was so good, one of the best shows ever. But a lot of people stopped watching the show during the second and third seasons, which dragged on, were slow, arduous at times and always dark. This also happened with The West Wing, it languished in its late seasons, but the <a href=\"https://en.wikipedia.org/wiki/The_West_Wing_(season_7)\">final season</a>, the campaign for Bartlet's successor, was riviting, emotional, idealistic, optimistic. A lot of people missed it. I rated both shows tops on <a href=\"http://my.bingeworthy.io/davewiner/\">my BingeWorthy list</a>. The finale of Mr Robot was a joy. I know it's hard to believe. :boom:",
            "created": "Wed, 07 Oct 2020 12:56:49 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/06/21/ourDemocracyHasBeenHacked.png"
        },
        {
            "text": "From December of last year, which feels like a decade ago, my <a href=\"http://scripting.com/2019/12/23.html#a120326\">writeup</a> of the very last episode of Mr Robot. It's so vague and general it's not really a spoiler. ",
            "created": "Wed, 07 Oct 2020 13:16:40 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"http://bingeworthy.io/tv/?id=https percent3A percent2F percent2Fwww.metacritic.com percent2Ftv percent2Fkilling-eve\">Killing Eve</a> wasn't on BingeWorthy. Amazing. Please rate it, it should be among the top programs, even if the first season was better than the subsequent seasons. ",
            "created": "Wed, 07 Oct 2020 13:23:21 GMT",
            "type": "outline"
        },
        {
            "text": "Today's parody song: <a href=\"https://twitter.com/latelateshow/status/1313673445188620288\">Maybe I'm Immune</a>. ",
            "created": "Wed, 07 Oct 2020 13:50:20 GMT",
            "urltweet": "https://twitter.com/latelateshow/status/1313673445188620288",
            "type": "outline"
        },
        {
            "text": "Breaking up tech companies",
            "created": "Thu, 08 Oct 2020 00:12:00 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "When they contemplate breaking up a tech company, this is how you should do it. Find the component of the company that really is open tech. Something that was open before they came along, that they foreclosed on, and used their monopoly to put everyone else out of business.",
                    "created": "Wed Oct 07 17:16:58 +0000 2020"
                },
                {
                    "text": "That's where you draw the line of separation. The core should be spun off into a new company that's well funded, with a charter to commercialize the tech while maintaining zero lock-in. Totally replaceable. Defined APIs that don't break.",
                    "created": "Wed Oct 07 17:16:58 +0000 2020"
                },
                {
                    "text": "If the company is viable with these constraints, great. If not, they have enough money to plan their own demise. The key thing is they cannot use their dominance to launch new products. Just the open tech.",
                    "created": "Wed Oct 07 17:16:58 +0000 2020"
                },
                {
                    "text": "You would find people willing to staff such a company, there are lots of idealistic developers, still, who believe in the open internet.",
                    "created": "Wed Oct 07 17:16:58 +0000 2020"
                },
                {
                    "text": "In Microsoft's case, in the 90s this would have meant spinning out the browser. ",
                    "created": "Wed Oct 07 17:16:59 +0000 2020"
                },
                {
                    "text": "Today with Facebook it would mean spinning out the open graph.",
                    "created": "Thu, 08 Oct 2020 00:18:27 GMT"
                },
                {
                    "text": "With Google, it would have to be at least the core search engine. If Alphabet wanted to run ads on search, they'd have to get in line and compete with others who did. This is the price they pay for trying to use their dominance in search to control everything.",
                    "created": "Wed Oct 07 17:16:59 +0000 2020"
                },
                {
                    "text": "Google would also have to spin out Chrome, same way Microsoft would have spun out MSIE in the 90s.",
                    "created": "Wed Oct 07 17:16:59 +0000 2020"
                },
                {
                    "text": "That's the basic idea. Look for the old open tech buried in the company, that is the source of their monopolistic control, and extract it. Hopefully it's <i>very</i> painful, to keep successors from tying to do it in the future.",
                    "created": "Wed Oct 07 17:16:59 +0000 2020"
                }
            ]
        },
        {
            "text": "26 years blogging",
            "created": "Thu, 08 Oct 2020 00:15:09 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "To get to to 25 years it could be stubbornness, the desire to reach a goal. To get to 26 is something different. It says I was really born to do this. I just cruised through the last year, of course I blogged it, through all the crazy shit, and beauty, why wouldn't I?",
                    "created": "Wed Oct 07 15:56:27 +0000 2020"
                },
                {
                    "text": "It might be time to change the motto from \"It's even worse than it appears\" to the motto of Battlestar Galactica.\" All this has happened before, and all this will happen again.\" Because it really is a loop. Back at the beginning it was Microsoft, Apple, Sun, IBM, etc.",
                    "created": "Wed Oct 07 15:48:50 +0000 2020"
                },
                {
                    "text": "Today the stories are mostly about Google, Apple, Facebook, Amazon, Netflix.But amazingly the stories are exactly the same. Which is the story of humanity. And tech. \"smile\"",
                    "created": "Wed Oct 07 15:48:50 +0000 2020"
                },
                {
                    "text": "I got the blogging gene from my mother, and great-uncle. I am a software developer, I do love doing that, but I'm also a NBB, a Natural Born Blogger.  Not sure what that's good for exactly. That at $2.50 gets you on the subway. I think.",
                    "created": "Wed Oct 07 15:56:27 +0000 2020"
                }
            ]
        },
        {
            "text": "Julia Child was a Natural Born Blogger.",
            "created": "Thu, 08 Oct 2020 00:34:56 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/10/07/juliaChild.png"
        },
        {
            "text": "Dutch artist Siegfried Woldhek’s pen drawing of Trump.",
            "created": "Wed, 07 Oct 2020 16:32:52 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/10/07/trumpOnSteroids.png"
        }
    ]
}