{
    "text": "October 9",
    "created": "Fri, 09 Oct 2020 13:14:04 GMT",
    "name": "09",
    "subs": [
        {
            "text": "A <a href=\"http://scripting.com/2020/10/09/theViewFromNowhere.m4a\">podcast</a> about the View From Nowhere, and how journalism has given up on it, and that's a good thing. I did this podcast as an adjunct to the piece, <a href=\"http://scripting.com/2020/10/09/151128.html?title=packingTheCourt\">below</a>, on packing the court. ",
            "created": "Fri, 09 Oct 2020 21:35:16 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2020/10/09/theViewFromNowhere.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "8449835",
            "image": "http://scripting.com/images/2020/10/09/dietCoke.png"
        },
        {
            "text": "Whenever you eat something with some mass to it, a big Diet Coke is great because it gets in underneath all that and moves it around. I don't know why that feels so good but it does. ",
            "created": "Fri, 09 Oct 2020 18:22:13 GMT",
            "type": "outline"
        },
        {
            "text": "Why do <a href=\"https://www.nytimes.com/2020/09/14/nyregion/ny-police-unions-racial-disparity-trump.html\">police unions support Trump</a> when Repubs aren't funding local governments. I don't see how that's good for police.",
            "created": "Fri, 09 Oct 2020 18:06:52 GMT",
            "type": "outline"
        },
        {
            "text": "If I had a column in a publication that people respected and read, my first piece would be about this. The power in the United States comes from the people. When we make everything about the parties and their personalities we lead the country to authoritarianism. ",
            "created": "Fri, 09 Oct 2020 16:12:53 GMT",
            "type": "outline"
        },
        {
            "text": "If Trump gives me any money to try to buy my vote, I’m going to give it all to Democratic candidates.",
            "created": "Fri, 09 Oct 2020 14:26:20 GMT",
            "type": "outline"
        },
        {
            "text": "I hope Trump does his rally in Florida tomorrow. His supporters should see him in his all his <a href=\"https://www.youtube.com/watch?v=KekChFdIe00\">Captain Queeg</a> paranoia. Explaining the strawberries and how no one listens to him. Calling for a former president who many of them voted for to be put in jail, or perhaps worse. Maybe some of them will be shaken out of their entertainment stupor and realize this is the president of the United States, a formerly great country that is being flushed down the toilet because people in the middle of the country feel unappreciated, bored and purposeless. ",
            "created": "Fri, 09 Oct 2020 13:14:05 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/09/28/trumpOnTheRun.png",
            "imageLink": "http://scripting.com/images/2020/10/09/trumpAsSuperman.png"
        },
        {
            "text": "Packing the court",
            "created": "Fri, 09 Oct 2020 15:11:28 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2020/09/23/supremeCourt.png",
            "description": "The court at 6-3, if it gets to that, will be far out of sync with the people they're meant to govern. ",
            "subs": [
                {
                    "text": "The court at 6-3, if it gets to that, will be far out of sync with the people they're meant to govern. This has to be resolved somehow.",
                    "created": "Fri, 09 Oct 2020 15:12:10 GMT"
                },
                {
                    "text": "The Constitution doesn't say what we should do, but it isn't up to the Dems, and I wish Harris had said that in the debate, it's up to the people.",
                    "created": "Fri, 09 Oct 2020 15:12:18 GMT"
                },
                {
                    "text": "The people will demand it, as soon as it becomes apparent that the court as configured is going to reverse Roe v Wade.",
                    "created": "Fri, 09 Oct 2020 15:12:38 GMT"
                },
                {
                    "text": "Further, if it is a huge win for Dems, they will be mandated to do something else. Change the Constitution so we have a democracy, not something that can be so easily hijacked.",
                    "created": "Fri, 09 Oct 2020 15:12:49 GMT"
                },
                {
                    "text": "The press has a lot of gall trying to pin the Dems to \"packing\" the court. The press are citizens too, and voters, and have an interest in how the country works.",
                    "created": "Fri, 09 Oct 2020 15:12:56 GMT"
                },
                {
                    "text": "They should ask themselves, before trying to make a controversy, in alliance with the Repubs, do they accept a 6-3 conservative majority?",
                    "created": "Fri, 09 Oct 2020 15:13:06 GMT"
                },
                {
                    "text": "This circles back to <a href=\"https://en.wikipedia.org/wiki/View_from_nowhere\">Jay Rosen's</a> <a href=\"http://scripting.com/2020/10/09/theViewFromNowhere.m4a\">View From Nowhere</a>. Now is the time for the press to stop and think, am I in favor of the United States? That is not too big a conflict of interest to carry. Then you should be careful when you try to create controversy.",
                    "created": "Fri, 09 Oct 2020 15:13:17 GMT"
                },
                {
                    "text": "Remember how the press set up the [%search: Hillary's Emails%] thing. Don't back us into a corner. We're going to have to reconfigure the court if the Repubs do what they plan to do.",
                    "created": "Fri, 09 Oct 2020 15:13:47 GMT"
                },
                {
                    "text": "We will have to do it. President Biden will do it for us. Stop ignoring the people. We are the government. We really are. That will be more clear at the end of the year. ",
                    "created": "Fri, 09 Oct 2020 15:13:51 GMT"
                }
            ]
        }
    ]
}