{
    "text": "October 12",
    "created": "Mon, 12 Oct 2020 14:40:47 GMT",
    "name": "12",
    "subs": [
        {
            "text": "Today's song: <a href=\"https://www.youtube.com/watch?v=j1Ij3rV_ZS4\">Home</a>. ",
            "created": "Mon, 12 Oct 2020 16:02:13 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=j1Ij3rV_ZS4"
        },
        {
            "text": "When you think about how Trump became president, it could be that from now on we elect people to play the role of president, more than <i>be</i> the president, and maybe they should be separate jobs. Seems a good defensive move, in case this <i>is</i> the future, would be to start a few shows with characters who are powerful <i>Democratic</i> ideals for president. We have Martin Sheen, but he's a little old, and he is doing Trump-like <a href=\"https://www.youtube.com/watch?v=YF3yi41gfgA\">cheezy commercials</a> now for cheap drugs. I like <a href=\"https://en.wikipedia.org/wiki/Geena_Davis\">Geena Davis</a>. She played the first (and only?) <a href=\"https://en.wikipedia.org/wiki/Commander_in_Chief_(TV_series)\">woman president</a> in a TV series in the US. ",
            "created": "Mon, 12 Oct 2020 15:38:53 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/10/12/commanderInChief.png"
        },
        {
            "text": "Is your ballot property? If someone steals your vote, have they <a href=\"https://sfist.com/2020/10/12/california-gop-putting-out-bogus-ballot-boxes-in-at-least-three-counties/\">stolen</a> your property? Can you stand your ground? If someone tries to steal your ballot can you shoot them? If you kill them, will you be forgiven? Just wondering if Republican values apply to Republicans.",
            "created": "Tue, 13 Oct 2020 00:55:44 GMT",
            "type": "outline"
        },
        {
            "text": "Voting should be online, like banking. ",
            "created": "Mon, 12 Oct 2020 20:02:51 GMT",
            "type": "outline"
        },
        {
            "text": "A blog should be a document, not a collection of documents. ",
            "created": "Mon, 12 Oct 2020 20:03:53 GMT",
            "type": "outline"
        },
        {
            "text": "Perhaps what Trump voters are saying is they want a monarchy like Britain, where they can have strong opinions about people who are of no consequence (though I imagine some Brits might disagree).",
            "created": "Mon, 12 Oct 2020 15:53:52 GMT",
            "type": "outline"
        },
        {
            "text": "My friend Peter Politi said of the new BingeWorthy watchlist: \"A very useful <a href=\"http://scripting.com/2020/10/11/150652.html?title=watchlistFeatureForBingeworthy\">feature</a> as it allows someone with fleeting memory to create a list of shows that they may want to see in the future, based on others' recommendations.\"",
            "created": "Mon, 12 Oct 2020 19:32:59 GMT",
            "type": "outline"
        },
        {
            "text": "I was writing enthusiastically about [%search: Clubhouse%], then I stopped writing, because I stopped using it. At first, for no particular reason. I wasn't finding conversations that interested me, and when I started them myself, usually <a href=\"http://scripting.com/2020/09/02/173236.html?title=clubhouseAfterAMonth#a174138\">nothing</a> happened. Then came the <a href=\"https://www.theverge.com/2020/9/30/21495419/clubhouse-conversation-antisemitism-content-moderation\">anti</a>-<a href=\"https://www.tabletmag.com/sections/news/articles/clubhouse-app-anti-semitism\">Semitism</a> <a href=\"https://www.algemeiner.com/2020/09/30/elite-tech-app-clubhouse-under-fire-for-hosting-antisemitic-discussion-on-black-jewish-relations/\">meltdown</a>.  It was depressing to find out that fighting for equality, to the extent that it works, would not end the hatred for my people. After that I looked at every conversation there differently. Never spoke again. I still have the app, am still a member, so this all could change, but I thought it was good to update. ",
            "created": "Mon, 12 Oct 2020 19:45:00 GMT",
            "type": "outline"
        },
        {
            "text": "I bet you could do a <a href=\"http://scripting.com/frontier/manual/chapter04.html\">UserTalk</a> interpreter in JavaScript.",
            "created": "Mon, 12 Oct 2020 15:18:16 GMT",
            "type": "outline"
        },
        {
            "text": "The only high-level language I've ever used that had <a href=\"https://www.cs.yale.edu/homes/aspnes/pinewiki/C(2f)Macros.html\">macros</a> was <a href=\"https://en.wikipedia.org/wiki/C_(programming_language)\">C</a>. It was really useful. Why doesn't JavaScript come with one? It could easily make code only readable by the author, but it might make it possible to smooth over design issues without waiting for the language to change. ",
            "created": "Mon, 12 Oct 2020 15:17:08 GMT",
            "type": "outline"
        },
        {
            "text": "I woke in the middle of the night with an idea. What if your soul, my soul, if all our souls exist in a different dimension from our bodies? We can't physically find our souls with microscopes or <a href=\"https://www.webmd.com/a-to-z-guides/what-is-an-mri#1\">MRIs</a>, or electron microscopes, perhaps because they aren't visible where those tools exist? Reminds me of an experience I had many years ago at an outdoor bar in Austin. There was a big tree in the middle of the stage. They had built the stage around it. There was a band playing, something lively and Texan, and I was thinking, I wonder if that tree even knows we're here. Can it sense the music, and the people, and the beers, and the relaxed mood? And if it can, what must it think is going on? So it's possible that our souls may not even be in another dimension, they may only exist in a manner that our senses can't detect. Or maybe we can only detect them as feelings, as intuitions, as middle-of-the-night dreaming epiphanies?",
            "created": "Mon, 12 Oct 2020 14:40:48 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/03/19/beet.png"
        },
        {
            "text": "One day, like a miracle.",
            "created": "Mon, 12 Oct 2020 20:14:35 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/10/12/oneDayLikeAMiracle.png"
        }
    ]
}