{
    "text": "October 14",
    "created": "Wed, 14 Oct 2020 14:10:37 GMT",
    "name": "14",
    "subs": [
        {
            "text": "I wonder how many people saw Trump's last town hall.It was amazing in that he couldn't answer any of the questions actual voters have.",
            "created": "Wed, 14 Oct 2020 20:18:09 GMT",
            "type": "outline"
        },
        {
            "text": "Why isn't there a <a href=\"https://en.wikipedia.org/wiki/CAPTCHA\">CAPTCHA</a> for voice? ",
            "created": "Wed, 14 Oct 2020 20:09:27 GMT",
            "type": "outline"
        },
        {
            "text": "Usually when we're watching a travesty happen in Washington, a gun massacre, starting a war, giving money to the rich, there isn't much we can do but say \"Remember to vote two years from now.\" This time everyone gets to stick it to the Repubs in real time.",
            "created": "Wed, 14 Oct 2020 16:56:58 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/05/05/personWithTablet.png"
        },
        {
            "text": "Thanks to <a href=\"https://wordpress.com/blog/2020/10/13/a-new-way-to-publish-your-blog-posts-simultaneously-as-twitter-threads/amp/\">WordPress</a> for shipping their twitter-threader tool. It gives me something to compare my software to. I wrote [%search: Little Pork Chop%] back in 2014. It was the one of the first Node-based web apps I shipped. A little thing I whipped up in a few days and finished while I was traveling in Europe. It was a lot of fun. After a while spammers found out about it, and used it to spray messages through accounts with no real followers, to influence some algorithm, presumably. Kind of humiliating. Now I'm ready to make it useful for people and not useful for spamming. I think. Also considering making it a personal tool for people to deploy on Glitch. I'm looking for something to put into that pot. :boom:",
            "created": "Wed, 14 Oct 2020 14:43:41 GMT",
            "type": "outline"
        },
        {
            "text": "PS: WordPress should do a tool that goes the other way. Lets you write a blog post in a series of tweets. I know that probably seems counter-intuitive, but I learned today a fair number of users don't like the new block editor. And Twitter is, these days, a fairly fluid writing tool",
            "type": "tweet",
            "created": "Wed Oct 14 20:16:42 +0000 2020",
            "tweetId": "1316473023634067457",
            "tweetUserName": "davewiner"
        },
        {
            "text": "I got my New York absentee ballot in the mail today. Still not sure whether I'll vote by mail or at the community center in ten days. ",
            "created": "Wed, 14 Oct 2020 14:10:38 GMT",
            "type": "outline"
        },
        {
            "text": "I mostly write without typos, but they get introduced when I edit. I've noticed more typos than usual in the last few days. I think it's the changing of the seasons. Swimming is over until late spring. Still bike riding but some days it's too cold or wet, so I walk instead. And I'm no longer good at walking. This summer was the first time since I left California in 2003 that I was swimming every day. It's very good for me. And its absence is very unsettling. I thnk that's why I feel a bit off now.",
            "created": "Wed, 14 Oct 2020 14:15:02 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/10/14/swimmer.png"
        },
        {
            "text": "I think we're at the point where virtually everyone who isn't Russian or a lonely loser has decided they've finally had enough of Trump. He isn't funny anymore.",
            "created": "Wed, 14 Oct 2020 14:23:16 GMT",
            "type": "outline"
        },
        {
            "text": "So here's a question for <a href=\"https://twitter.com/davenewworld_2/status/1316398093877772288\">Trump supporters</a> who <a href=\"https://nymag.com/intelligencer/2020/07/republican-response-coronavirus.html\">enjoy</a> making <a href=\"https://en.wiktionary.org/wiki/libtard\">libtards</a> cry. Do you think they're crying because you hurt their feelings? Is that what you're into? Do you also like to hurt yourself? Because the thing the libtard probably is crying about is how you're going to lose your health care, or job, or freedom, in other words how your injured dignity is going to hurt <i>even more.</i> If you make me sad it isn't because you called me a name, it's because our once-great country has been reduced to jealousy as a popular form of political expression. I wish you were happier with your life, I really do, but I don't think trying to give your pain to others is actually going to make you feel better. I think if anything it'll make you feel worse. ",
            "created": "Wed, 14 Oct 2020 14:23:32 GMT",
            "type": "outline"
        },
        {
            "text": "Theory about Georgia",
            "created": "Wed, 14 Oct 2020 20:17:14 GMT",
            "type": "outline",
            "description": "A theory why the Repubs are tanking in Georgia.",
            "metaImage": "http://scripting.com/images/2020/10/14/tara.png",
            "subs": [
                {
                    "text": "I have a theory why the Repubs are tanking in Georgia. ",
                    "created": "Wed Oct 14 20:12:01 +0000 2020"
                },
                {
                    "text": "At least a few Republican voters in Georgia are pissed off about voter suppression of blacks. It might not be the final straw for a majority of Repubs, but it probably is for some.",
                    "created": "Wed, 14 Oct 2020 20:19:50 GMT"
                },
                {
                    "text": "This is based on something I learned in software in 1984. We shipped ThinkTank for the Mac in April. One of the first products to ship for the Mac. How did we do it so fast? We left out a lot of features, figuring we're getting a fresh start on the Mac. Nope.",
                    "created": "Wed Oct 14 20:15:08 +0000 2020"
                },
                {
                    "text": "Everyone knew what ThinkTank could do on the Apple II and IBM PC, and they felt ripped off that the ThinkTank they bought for the Mac was less capable. We rushed out another version by the end of the year that came closer to matching what they expected.",
                    "created": "Wed Oct 14 20:15:08 +0000 2020"
                },
                {
                    "text": "How does this apply to Georgia? ",
                    "created": "Wed Oct 14 20:15:08 +0000 2020"
                },
                {
                    "text": "Well the Repubs never thought how some of their supporters would feel about voter suppression. Sure there aren't many blacks who vote Republican, but some of the whites don't want to vote for a party that would do what they're doing.",
                    "created": "Wed, 14 Oct 2020 20:20:44 GMT"
                },
                {
                    "text": "The thing to remember is that while Georgia didn't go for Obama, there were probably a fair number of Republicans who voted for him in Georgia in 2008 and 2012. People who had gotten over their fear of blacks enough to vote for one. The US is changing. As much as we emphasize that racism is still here, and it is -- we also had a black president for eight years. That is change. ",
                    "created": "Wed, 14 Oct 2020 20:21:03 GMT"
                },
                {
                    "text": "That, and people know more than you think they do. ",
                    "created": "Wed Oct 14 20:15:08 +0000 2020"
                }
            ]
        }
    ]
}