{
    "text": "October 16",
    "created": "Fri, 16 Oct 2020 14:16:55 GMT",
    "name": "16",
    "subs": [
        {
            "text": "I've never seen Americans so turned on by voting.",
            "created": "Fri, 16 Oct 2020 19:23:36 GMT",
            "type": "outline"
        },
        {
            "text": "The ads are <a href=\"https://twitter.com/justicedems/status/1316773313587404801\">getting great</a>. Each one is the best ever. ",
            "created": "Fri, 16 Oct 2020 17:09:51 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/justicedems/status/1316773313587404801"
        },
        {
            "text": "The primary rule of trolls is the rage has to build. Immunity to outrage builds up over time. What pissed people off six months ago will barely show up as a blip today. That's the problem with Trump as a troll. He got stuck. He's trying to entertain with the same schtick he used four years ago. Yawn. Been there done that. ",
            "created": "Fri, 16 Oct 2020 17:40:32 GMT",
            "type": "outline"
        },
        {
            "text": "\"Black Lives Matter\" is the meekest way to put it. And yet the reaction is as if a simple slogan is trying to take something from them. What? The right to kill black people? Take a step back and a deep breath and think.",
            "created": "Fri, 16 Oct 2020 18:06:52 GMT",
            "type": "outline"
        },
        {
            "text": "I once had an office on <a href=\"https://www.google.com/maps/@37.3927319,-122.0678613,3a,75y,116.68h,91.83t/data=!3m6!1e1!3m4!1sr8HvxIgLU3OfA-BA5EcZOw!2e0!7i16384!8i8192\">Easy St</a>. Checking in at an airport, the clerk asked: \"Easy St, isn't that in Anytown?\" :smile:",
            "created": "Fri, 16 Oct 2020 16:45:41 GMT",
            "type": "outline"
        },
        {
            "text": "I wonder if The Lincoln Project should do an ad just for Georgia that tells voters that the state has become famous for suppressing African-American votes. People overlook just where we're at on racism in this country, even a state like Georgia where a fair number of Repubs must've voted for a black man, who was elected president, and did a decent job, esp compared to the shitshow of a Republican who's president now. Remind them that there is no honor in preventing an equal citizen of your state from voting.",
            "created": "Fri, 16 Oct 2020 14:59:07 GMT",
            "type": "outline"
        },
        {
            "text": "When I was in high school I cut most days of school in the first half of my senior year. When the end of the semester came my report card looked like <a href=\"http://scripting.com/2020/10/16/142934.html?title=trumpsMagnificentShitshow\">Trump's town hall</a> last night. Straight F's.",
            "created": "Fri, 16 Oct 2020 16:41:07 GMT",
            "type": "outline"
        },
        {
            "text": "Trump's magnificent shitshow",
            "created": "Fri, 16 Oct 2020 14:29:34 GMT",
            "type": "outline",
            "description": "Trump thinks it's 2016, but we've had four years of him as president, a job he has never shown up for. ",
            "metaImage": "http://scripting.com/images/2020/10/16/trumpShitShow.png",
            "subs": [
                {
                    "text": "I <a href=\"http://scripting.com/2020/10/15.html#a130631\">told you</a> that Trump would suck at the town hall yesterday, whether or not Biden was there. NBC did us all a favor by putting it on. People, you have to think. This is not 2016, when Trump was a juggernaut. Like it or not, Trump is president now, and reality has caught up with him, and with us, his subjects. The economy is wrecked, huge numbers of Americans are dead, many more seriously sick, and there's no end in sight. We're all either huddled in our houses in isolation, or out getting infected, and there isn't much of an inbetween. If there's a car accident in Wisconsin they won't be able to help the victims because there's no room in the hospitals. Trump is much more familiar with the conspiracy theories than he is with what's actually happening in the country he's supposed to govern.",
                    "created": "Fri, 16 Oct 2020 14:16:56 GMT",
                    "image": "http://scripting.com/images/2020/09/04/trumpCartoon.png"
                },
                {
                    "text": "So how did a meetup with actual American voters go? It was a shitshow. A glorious, Trump-humiliating shitshow. It was obvious that was how it was going to go. There's an old <a href=\"https://www.quora.com/What-does-it-mean-by-generals-always-fight-the-last-war\">adage</a> about people always fighting the last war. 2020 is not 2016. Trump isn't the same candidate he was then. In 2016 you would be right to be pissed at NBC. But in 2020, we should be thanking them for giving full exposure to the fake president we sadly have, and happily have a chance to remove. ",
                    "created": "Fri, 16 Oct 2020 14:30:20 GMT"
                },
                {
                    "text": "Thanks to Maddow I didn't even have to watch the Trump town hall. She did an incredible post-town-hall review of all the ridiculousness of Trump trying to talk to normal voters about his role as their commander in chief. Hers was the inverse of a shitshow. She was cleaning up the shit after the show. ",
                    "created": "Fri, 16 Oct 2020 14:28:11 GMT"
                }
            ]
        },
        {
            "text": "Woody Guthrie's machine",
            "created": "Fri, 16 Oct 2020 19:28:45 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "It <a href=\"https://ushistoryscene.com/article/woody-guthrie/\">kills</a> fascists.",
                    "created": "Fri, 16 Oct 2020 19:28:53 GMT",
                    "inlineImage": "http://scripting.com/images/2020/10/16/woodyGuthrie.png"
                }
            ]
        }
    ]
}