{
    "text": "October 19",
    "created": "Mon, 19 Oct 2020 14:16:41 GMT",
    "name": "19",
    "subs": [
        {
            "text": "<a href=\"https://en.wikipedia.org/wiki/Craig_Newmark\">Craig Newmark</a> is becoming the <a href=\"https://en.wikipedia.org/wiki/Andrew_Carnegie\">Andrew Carnegie</a> of our era.",
            "created": "Mon, 19 Oct 2020 16:17:08 GMT",
            "type": "outline"
        },
        {
            "text": "Every <a href=\"http://scripting.com/2014/10/30/developingBetterDevelopers.html\">university</a> should be home to an open source development project.",
            "created": "Mon, 19 Oct 2020 16:29:47 GMT",
            "type": "outline"
        },
        {
            "text": "Here's a <a href=\"https://www.youtube.com/watch?v=tmzEIJBGQfg\">video</a> that demos how I edit my blog. I created it last October, and thought it might be worth another look. The big deal is fluidity. The user interface hangs on a framework that's designed for writers. Most of what goes into a blog is writing, so it's worth setting it up this way. ",
            "created": "Mon, 19 Oct 2020 16:23:49 GMT",
            "type": "outline"
        },
        {
            "text": "As a Roku user, HBO clearly doesn't want my money. I tried getting HBO as part of Hulu and it's awful. There was a program I wanted to watch, the <a href=\"https://www.cnn.com/2020/10/16/opinions/the-west-wing-reunion-we-didnt-need-yang/index.html\">West Wing reunion</a>, but their search only showed the original series. I found it on my iPad, which HBO still has its own app for, so that worked. Later, I cancelled my HBO subscription. Subscriptions are madness. Every service has its own user interface. Three services are locked in for me. 1. Netflix, because it's Netflix. 2. Amazon, because I pay nothing extra for it, so why not. 3. YouTube TV so I can watch cable news and have learned its UI. There are plenty of other brands that have shows that I want to watch and would be willing to pay for, but there's a limit to how many packages I'm going to buy and how many UIs I can learn. Can the people who run these businesses not understand this? There's going to be a huge culling and one or two will remain. Probably Netflix and Amazon. If you don't think so, look around. How many product categories have more than one or two products with any market share?",
            "created": "Mon, 19 Oct 2020 16:17:14 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/04/27/bidenActionFigure.png"
        },
        {
            "text": "<a href=\"https://en.wikipedia.org/wiki/Scott_Atlas\">Dr Scott Atlas</a> is even more scary than Attorney General <a href=\"https://www.justice.gov/ag/staff-profile/meet-attorney-general\">William Barr</a>. Now imagine if they got together, and figured out how to kill all the of the president's political enemies with the virus. That's why the virus is such a strong ally of Trump. If we lose the election, they won't need to build death camps. There's never been a situation anything like this. Just a week ago it seemed the president was doomed, due for a long recovery perhaps, certainly no longer a threat. I wish [%search: Fauci%] had left the government and was independent now, and had a strong communication channel of his own. ",
            "created": "Tue, 20 Oct 2020 00:54:05 GMT",
            "type": "outline"
        }
    ]
}