{
    "text": "October 20",
    "created": "Tue, 20 Oct 2020 14:31:47 GMT",
    "name": "20",
    "subs": [
        {
            "text": "Started a web and voice conversation with <a href=\"https://blog.andrewshell.org/rethinking-blogs/\">Andrew Shell</a> about ideas for rethinking blogs and feeds. I found, as others have, that I need another kind of document to include in my personal CMS other than a story that's part of the blog. Everything about blogs are set up to be written, then lightly edited, and never touched again. Like a <a href=\"https://en.wikipedia.org/wiki/Fresco\">fresco</a> painting. It's <i>temporal</i> writing. But there are other things that I want to develop over time, keep coming back to, revising. A few years back I started this.how to hold those docs. It's worked out really well. I wrote the <a href=\"http://this.how/googleAndHttp/\">Google and HTTP</a> faq as a <a href=\"http://this.how/\">this.how</a> doc. We also had this in \"Manila\", right from the start. We wrote, published and maintained the <a href=\"http://frontier.userland.com/\">docs</a> for Frontier using the same CMS we used for blogging. In the end the data structures are the same, what was confusing is how we think about them. But once you make a decision to put non-temporal docs \"over there\" then things start working. ",
            "created": "Tue, 20 Oct 2020 14:53:31 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/10/20/sistine.png",
            "imageLink": "https://mymodernmet.com/fresco-definition/"
        },
        {
            "text": "BTW, about 20 years ago I was writing about [%search: timeless weblogs%]. I vaguely remember it. Some of the stuff I wrote is offline, but possibly in archive.org. But I'm pretty sure I have the right solution now. How can I tell? I use it. Why? Because I know <i>when</i> to use it. That's the trick to iterating this stuff. The tech is easy compared to the workflow. ",
            "created": "Tue, 20 Oct 2020 15:01:55 GMT",
            "type": "outline"
        },
        {
            "text": "[%search: Hover%] is a great domain company, highly recommend them. I've even given them an <a href=\"http://scripting.com/2019/12/16/170209.html\">award</a> for a very clever no-brainer DNS feature that no one else does, as far as I know. On Sunday I registered a new domain and wasn't able to access it. So I contacted their support, they said they needed permission to go into my account to see how I had it configured. By then the problem had cleared on its own, but it was puzzling why they would need permission. The DNS setup is, by design, totally public info. Anyone could look to see how my domain is set up.  I assumed they were doing that when there have been support issues in the past. ",
            "created": "Tue, 20 Oct 2020 14:31:48 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/02/17/sandersOnCnn.png"
        },
        {
            "text": "If you went to a polling place and saw <a href=\"https://www.nbcmiami.com/news/local/city-of-miami-officer-photographed-wearing-trump-mask-inside-polling-location/2309350/\">this cop</a>, you'd think...",
            "created": "Tue, 20 Oct 2020 18:14:53 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/10/20/inlineImage.png"
        }
    ]
}