{
    "text": "October 23",
    "created": "Fri, 23 Oct 2020 13:39:18 GMT",
    "name": "23",
    "subs": [
        {
            "text": "I added a note to my <a href=\"http://instantoutliner.com/k5\">status outline</a> with an update on my work on pork.io, which is getting a new name.  ",
            "created": "Fri, 23 Oct 2020 16:15:34 GMT",
            "type": "outline"
        },
        {
            "text": "I like promoting other people's products when they're good. I am unhappy when I see bad products promoted by people I respect. If I think a product is not good, unless I think people will be hurt by it, or if the badness can be fixed and the product would then be useful, I'll generally say nothing. ",
            "created": "Fri, 23 Oct 2020 16:54:40 GMT",
            "type": "outline"
        },
        {
            "text": "When I was growing up, there was a purpose that even I, a kid, <a href=\"https://youtu.be/ouRbkBAOGEw?t=351\">could understand</a>. I think that's been missing ever since we got to the moon. Since then we haven't had a reason to be a country. ",
            "created": "Fri, 23 Oct 2020 15:55:07 GMT",
            "type": "outline",
            "urlvideo": "https://youtu.be/ouRbkBAOGEw?t=351"
        },
        {
            "text": "Maybe there should be real debates on TV every week between leaders on issues that Congress is going to vote on. And a way of measuring public opinion. No personal attacks allowed. Strict control via Mute button. This week the debate would be about the merits of approving a new radical Supreme Court justice in the middle of an election when everyone's attention is focused elsewhere. Some actions are so important they deserve everyone's focus. ",
            "created": "Fri, 23 Oct 2020 14:11:49 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/03/28/hillary.png"
        },
        {
            "text": "New in Bingeworthy: <a href=\"http://bingeworthy.io/tv/?id=https%3A%2F%2Fwww.metacritic.com%2Ftv%2Flovecraft-country\">Lovecraft Country</a> and <a href=\"http://bingeworthy.io/tv/?id=https%3A%2F%2Fwww.metacritic.com%2Ftv%2Fthe-queens-gambit\">Queen's Gambit</a>. ",
            "created": "Fri, 23 Oct 2020 13:39:19 GMT",
            "type": "outline"
        },
        {
            "text": "I am so exhausted from US politics, this state going back to the summer of 2016. I made it through about 15 minutes of last night's debate before I couldn't stand it. All it took was one gaffe from Biden to shred all hope of a reprieve from this [%search: shitshow%]. Then I had a thought, what if Amazon released the <a href=\"https://www.metacritic.com/movie/borat-subsequent-moviefilm-delivery-of-prodigious-bribe-to-american-regime-for-make-benefit-once-glo\">new Borat movie</a> a few hours early? Wouldn't that be great. So I looked. And they had! So I watched the first half, returned to the debate, which still was not over, and went back and watched a bit more, and returned to the debate just in time to hear the wrapup. Then I listened to Maddow's review of Trump's lies about Covid (the part  I had heard) and I felt better so I went to bed. Only to wake up this morning and find that the feeling if utter misery was even worse. The election is 11 days from now. ",
            "created": "Fri, 23 Oct 2020 13:40:51 GMT",
            "type": "outline"
        },
        {
            "text": "BTW, the <a href=\"https://www.metacritic.com/movie/borat-subsequent-moviefilm-delivery-of-prodigious-bribe-to-american-regime-for-make-benefit-once-glo\">new Borat movie</a> is good. I laughed all the way. Out loud. ",
            "created": "Fri, 23 Oct 2020 13:46:54 GMT",
            "type": "outline"
        },
        {
            "text": "Re 2-factor-authentication",
            "created": "Fri, 23 Oct 2020 14:00:28 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Has anyone ever thought what happens when you lose control of the phone that is your second factor? ",
                    "created": "Fri, 23 Oct 2020 14:00:46 GMT"
                },
                {
                    "text": "So, how hard is it to hijack a phone?"
                },
                {
                    "text": "A few years back I had a phone hijacked via AT&T."
                },
                {
                    "text": "I never got it back. But I was able to terminate the account. "
                }
            ]
        }
    ]
}