{
    "text": "October 24",
    "created": "Sat, 24 Oct 2020 14:44:04 GMT",
    "name": "24",
    "subs": [
        {
            "text": "<a href=\"https://www.voteearlyny.org/\">Early voting</a> started <a href=\"https://elections.ulstercountyny.gov/early-voting/\">in</a> New York State today.",
            "created": "Sat, 24 Oct 2020 14:44:05 GMT",
            "type": "outline"
        },
        {
            "text": "We may be, right now, as sure as we're ever going to be that Trump was removed by the people in the 2020 vote. ",
            "created": "Sat, 24 Oct 2020 15:20:26 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/12/24/santa.png"
        },
        {
            "text": "I wanted to send an <a href=\"http://scripting.com/publicfolder/misc/trailblazersPodcastAboutPodcasting.mp3\">MP3</a> of the <a href=\"https://cdn.simplecast.com/audio/8b65b9/8b65b975-4895-4f5c-a140-81398900f4af/ff089f73-0e44-465b-aa58-a05a037fda46/trailblazers-s10e06-podcasting-vfinal-with-metadata_tc.mp3?aid=rss_feed&feed=excgs68S\">Trailblazers podcast</a> about podcasting to a friend, but couldn't easily find it, and then realized I'd better download a copy and upload it to <a href=\"http://scripting.com/publicfolder/misc/trailblazersPodcastAboutPodcasting.mp3\">my server</a>, because who knows how easy it'll be to find in a year or more. The web is pretty ephemeral.",
            "created": "Sat, 24 Oct 2020 15:31:59 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/publicfolder/misc/trailblazersPodcastAboutPodcasting.mp3",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "13772670"
        },
        {
            "text": "I posted a very short question on Facebook. <a href=\"https://www.facebook.com/dave.winer.12/posts/1361834694023932\">Do you know anyone like Trump? </a>I asked because I do. I grew up in Queens, a couple of miles from where Trump grew up, only ten years after. So there were lots of Trump-like people in my area. I'm constantly reminded, by something Trump does, of someone I knew in childhood. Anyway, after a dozen or so predictable responses, a former Apple exec, one who did a very good thing for my troubled company back in 1986, said yes he's had golfed with Trump, voted for him in 2016, and was going to vote for him in 2020. He lives in California, so his vote is symbolic, as is mine (I live in NY). It was jarring. No debate has followed, thankfully, and I hope it doesn't. I'm just going to leave it there.",
            "created": "Sat, 24 Oct 2020 14:44:37 GMT",
            "type": "outline"
        },
        {
            "text": "A couple of hours later, the thread is still peaceful. Thankfully. My friend from the past refers to Trump as a businessman, which causes me to write this screed, which I did not add to the thread. I was curious to know, how does this businessman see the <a href=\"https://twitter.com/MollyJongFast/status/1320026106494332928\">retired people packed</a> into his audience, no distancing, no masks. Are they his customers? His team? His employees? Competitors? Serfs? Prisoners? Slaves? What kind of animal do you treat the way Trump is treating these people? To Trump are they even people?",
            "created": "Sat, 24 Oct 2020 15:45:56 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/MollyJongFast/status/1320026106494332928"
        },
        {
            "text": "I realized Trump has killed a lot more Americans than Osama bin Laden.",
            "created": "Sat, 24 Oct 2020 14:46:27 GMT",
            "type": "outline"
        },
        {
            "text": "ğ˜›ğ˜©ğ˜ªğ˜´ ğ˜ªğ˜´ ğ˜¢ ğ˜µğ˜¦ğ˜´ğ˜µ. ğ˜ğ˜°ğ˜³ ğ˜µğ˜©ğ˜¦ ğ˜¯ğ˜¦ğ˜¹ğ˜µ ğ˜´ğ˜ªğ˜¹ğ˜µğ˜º ğ˜´ğ˜¦ğ˜¤ğ˜°ğ˜¯ğ˜¥ğ˜´ ğ˜µğ˜©ğ˜ªğ˜´ ğ˜´ğ˜µğ˜¢ğ˜µğ˜ªğ˜°ğ˜¯ ğ˜¸ğ˜ªğ˜­ğ˜­ ğ˜¤ğ˜°ğ˜¯ğ˜¥ğ˜¶ğ˜¤ğ˜µ ğ˜¢ ğ˜µğ˜¦ğ˜´ğ˜µ ğ˜°ğ˜§ ğ˜µğ˜©ğ˜¦ ğ˜Œğ˜®ğ˜¦ğ˜³ğ˜¨ğ˜¦ğ˜¯ğ˜¤ğ˜º ğ˜‰ğ˜³ğ˜°ğ˜¢ğ˜¥ğ˜¤ğ˜¢ğ˜´ğ˜µ ğ˜šğ˜ºğ˜´ğ˜µğ˜¦ğ˜®.",
            "created": "Sat, 24 Oct 2020 17:23:51 GMT",
            "type": "tweet",
            "tweetId": "1320053449246056455",
            "tweetUserName": "davewiner"
        },
        {
            "text": "Will we undo Trump?",
            "created": "Sat, 24 Oct 2020 15:16:34 GMT",
            "type": "outline",
            "description": "We were an occupied country for four years. ",
            "metaImage": "http://scripting.com/images/2020/10/24/statueOfLiberty.png",
            "subs": [
                {
                    "text": "I don't want to jinx things, but when Biden takes office I assume the FBI will fully investigate what really happened in the 2016 election, without any interference from political appointees. ",
                    "created": "Sat, 24 Oct 2020 15:16:49 GMT",
                    "image": "http://scripting.com/images/2020/03/08/uncleSam.png"
                },
                {
                    "text": "The new Attorney General will release the reports Barr wouldn't let us see. I assume that's going to happen too. ",
                    "created": "Sun, 25 Oct 2020 01:23:37 GMT"
                },
                {
                    "text": "What if we determine that the election was a crime. That the Trump campaign didn't just collude with Russia, it <i>was</i> Russia. Recent <a href=\"https://www.wbur.org/npr/903512647/senate-report-former-trump-aide-paul-manafort-shared-campaign-info-with-russia\">revelations</a> about Manafort say that pretty clearly. Everyone was looking for collusion, but it was actually much worse.",
                    "created": "Sat, 24 Oct 2020 15:17:48 GMT"
                },
                {
                    "text": "We were an occupied country for four years. Should we allow everything Trump did in those four years to stand? Or do we remove the three Supreme Court justices he nominated, tear up all his executive orders, remove all the regulations passed by his agencies. Undo anything that can be reasonably undone. ",
                    "created": "Sat, 24 Oct 2020 15:18:20 GMT"
                }
            ]
        }
    ]
}