{
    "text": "October 25",
    "created": "Sun, 25 Oct 2020 15:39:20 GMT",
    "name": "25",
    "subs": [
        {
            "text": "Today's song: <a href=\"https://www.youtube.com/watch?v=N7pZgQepXfA\">You can't always get what you want</a>. ",
            "created": "Sun, 25 Oct 2020 18:37:47 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1320433322154172416\">Poll</a>: Anyone who votes for Trump after they said they aren't going to control the virus is..",
            "created": "Sun, 25 Oct 2020 18:46:08 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://www.hbomax.com/\">HBO Max</a> is like <a href=\"https://en.wikipedia.org/wiki/New_Coke\">New Coke</a>. HBO was the <a href=\"http://www.tjwaldorf.com/brand-positioning-the-ladders-in-our-head/\">#1</a> brand. Needed to be a little more like Netflix, but really it was pretty good as it was. Now the <i>max</i> part has coincided with it being a lot harder to use, virtually impossible if you use the popular Roku platform. At least for me. Looks like an epic mistake. At a time when the market is overloaded with lots of big brands (Disney, Apple etc) trying to diversity into a market already dominated by HBO, it's a really curious time for them to knock out their own legs. ",
            "created": "Sun, 25 Oct 2020 17:13:18 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/04/17/roku2.png"
        },
        {
            "text": "<a href=\"https://en.wikipedia.org/wiki/New_Coke\">New Coke</a> was \"the unofficial name for the reformulation of Coca-Cola introduced in April 1985. It was renamed Coke II in 1992, and was discontinued in July 2002.\"",
            "created": "Sun, 25 Oct 2020 17:14:42 GMT",
            "type": "outline"
        },
        {
            "text": "Have you experienced 5G yet? Is it wonderful? Worth it?",
            "created": "Sun, 25 Oct 2020 17:13:30 GMT",
            "type": "outline"
        },
        {
            "text": "In a sane world \"We're not going to control the virus\" is what you <a href=\"https://www.cnn.com/2020/10/25/politics/mark-meadows-controlling-coronavirus-pandemic-cnntv/index.html\">say</a> as you resign. It <a href=\"https://www.google.com/search?q=define+resign\">literally</a> is a resignation.  ",
            "created": "Sun, 25 Oct 2020 15:39:21 GMT",
            "type": "outline"
        },
        {
            "text": "One thing that's so disappointing about the people I've met in tech is that they are mostly motivated by what they can take from others, rather than what they can build working with others. So often they could make so much more money by doing the latter. Stupid. (And of course money is far from the most motivating motive.)",
            "created": "Sun, 25 Oct 2020 16:22:00 GMT",
            "type": "outline"
        },
        {
            "text": "I've now made it through the first two episodes of <a href=\"http://bingeworthy.io/tv/?id=https%3A%2F%2Fwww.metacritic.com%2Ftv%2Fthe-queens-gambit\">The Queen's Gambit</a>, and it is really good. If the quality in the first two episodes carries through, this is going to be one of <a href=\"http://my.bingeworthy.io/davewiner/\">my favorite binges</a>. ",
            "created": "Sun, 25 Oct 2020 17:26:22 GMT",
            "type": "outline"
        },
        {
            "text": "Using structure in outlines",
            "created": "Sun, 25 Oct 2020 17:36:45 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "A friend is starting to use the outliner to <a href=\"http://scripting.com/stories/2009/08/09/narrateYourWork.html\">narrate his work</a>. He writes about an \"impenetrable wall of text.\" I wrote up some tips, and of course felt they should be public. ",
                    "created": "Sun, 25 Oct 2020 17:36:53 GMT",
                    "subs": [
                        {
                            "text": "Re the impenetrable wall of text -- try collapsing things, where the detail isn't of immediate concern, so you can see the structure. It would help me too as a reader, to see the old stuff collapsed, and be able to expand it as I need to. ",
                            "created": "Sun, 25 Oct 2020 17:37:14 GMT"
                        },
                        {
                            "text": "Also hoist and dehoist are there to help manage complexity. You can hoist a section, by placing the cursor on a head with subs, and click on the pushpin icon in the left margin. It'll be the one that's enabled. Then when you want to return, click the other one. It's like a stack (it actually is a stack, of course).",
                            "created": "Sun, 25 Oct 2020 17:38:05 GMT"
                        }
                    ]
                },
                {
                    "text": "Imagine a bookshelf of notebooks. You don't have every notebook open to all pages at the same time. It doesn't even make sense. You'd go crazy trying to find something. Same idea here. You've got tools to manage clutter, they take time to learn to use. ",
                    "created": "Sun, 25 Oct 2020 17:41:23 GMT"
                },
                {
                    "text": "Here's what my blog outline looks like as I'm writing today's notes. ",
                    "created": "Sun, 25 Oct 2020 17:44:52 GMT"
                },
                {
                    "text": "",
                    "created": "Sun, 25 Oct 2020 17:43:10 GMT",
                    "inlineImage": "http://scripting.com/images/2020/10/25/davesBlogOutline.png"
                }
            ]
        }
    ]
}