{
    "text": "October 27",
    "created": "Tue, 27 Oct 2020 15:28:21 GMT",
    "name": "27",
    "subs": [
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1321244681636859905\">Poll</a>: Who will be the first Repub to declare for president in 2024?",
            "created": "Wed, 28 Oct 2020 00:18:25 GMT",
            "type": "outline"
        },
        {
            "text": "I was driving up <a href=\"https://www.google.com/maps/place/Rock+City+Rd,+Woodstock,+NY+12498/@42.0451038,-74.1204888,17z/data=!3m1!4b1!4m5!3m4!1s0x89dd074a1c5d71cd:0x26f6555bfe042b4b!8m2!3d42.0451038!4d-74.1183001\">Rock City Road</a> earlier, and there were all these cars parked on the side of the road, and I had no idea what they were there for. I thought maybe someone famous had died, but no, they were all there to vote. The line was very long. Proud of Woodstock.",
            "created": "Tue, 27 Oct 2020 20:58:01 GMT",
            "type": "outline"
        },
        {
            "text": "There was one question on the local Woodstock town ballot, whether to fund a <a href=\"https://www.woodstock.org/planning/\">new library building</a>. I voted <a href=\"https://hudsonvalleyone.com/2020/10/23/letter-vote-yes-on-woodstock-library-bond-issue/\">yes</a>. This is a very hot local issue. I see signs all over town on the <a href=\"https://hudsonvalleyone.com/2020/10/23/letter-vote-no-on-woodstock-library-bond-issue/\">issue</a>. I read the posts in the local Facebook groups. And while I'm new here, I am a taxpayer, and I will have to pay more property taxes to support the new library.  Here's why I voted yes. If the librarians want a new library, give it to them. They know what the town needs. They are the most selfless, idealistic people, by profession. Librarians <a href=\"http://scripting.com/2018/07/23/125635.html#a125814\">helped me</a> a lot when I was a kid. I think this is what taxes are for. Funding libraries is directly related to the quality of life in a town. ",
            "created": "Tue, 27 Oct 2020 20:00:53 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/09/21/tree.png"
        },
        {
            "text": "If you love outliners, <a href=\"http://scripting.com/images/2020/10/27/infoworldThinkTankReviewP1.png\">here's</a> the <a href=\"http://scripting.com/images/2020/10/27/infoworldThinkTankReviewP2.png\">review</a> InfoWorld did of ThinkTank for the Apple II in July 1983. This review got us distribution, a deal with Apple to develop for the then-secret Macintosh, and angel investors and we were on our way. ",
            "created": "Tue, 27 Oct 2020 15:28:22 GMT",
            "type": "outline"
        },
        {
            "text": "Two theories of what happened to the <a href=\"http://scripting.com/2020/10/26.html#a202932\">rabbits</a>. <a href=\"https://www.jstor.org/stable/3799063?seq=1\">Coyotes</a> and a <a href=\"https://now.tufts.edu/articles/deadly-rabbit-virus-spreads-us\">virus</a>. ",
            "created": "Tue, 27 Oct 2020 15:33:59 GMT",
            "type": "outline"
        },
        {
            "text": "We must be worse than the Repubs",
            "created": "Tue, 27 Oct 2020 15:59:32 GMT",
            "type": "outline",
            "description": "We have to teach the Dems how to be hardass motherfuckers, and insist that they have a head-on collision with the Repubs so they respect them, and in doing so, respect us. ",
            "metaImage": "http://scripting.com/images/2020/10/27/theNewSupremeCourt.png",
            "subs": [
                {
                    "text": "First a story... ",
                    "created": "Tue, 27 Oct 2020 16:02:12 GMT",
                    "subs": [
                        {
                            "text": "I once lived on a narrow road, so narrow there was barely room for two cars. When approaching an oncoming car on this narrow lane, at first, when I was a newbie to the neighborhood, I’d do the neighborly thing and move to the right to make room. Always, the other car wouldn’t budge, so I’d have to pull off the road and slow to a stop. I found this frustrating of course, an example of selfish, Republican-like behavior.  ",
                            "created": "Tue, 27 Oct 2020 16:02:09 GMT"
                        },
                        {
                            "text": "Then I altered my procedure. When I saw a car approaching, I would still move off the to right, but if they didn't mirror my move, I'd veer directly into their path. This makes my car look bigger, and more of a threat to them. No need to honk my horn. The action is enough. Immediately, the other car <i>always</i> moves to the side, and I then move to my side, and we pass each other, both fully on the road, and going at normal speed. ",
                            "created": "Tue, 27 Oct 2020 16:03:27 GMT"
                        },
                        {
                            "text": "I assume these are otherwise good people who are selfish, like most people are, and will see your offer to get out of their way as weakness, and they'll just plow through you. Like Republicans. If you show you are selfish too, they'll negotiate for a win-win. ",
                            "created": "Tue, 27 Oct 2020 16:04:44 GMT"
                        }
                    ]
                },
                {
                    "text": "Soooo, this is where we are. The Repubs walk all over the Dems. But if you love America, you have to vote Democratic, because the Repubs are crazy fascists. We have to teach the Dems how to be hardass motherfuckers, and insist that they have a head-on collision with the Repubs so they respect them, and in doing so, respect us. ",
                    "created": "Tue, 27 Oct 2020 16:05:18 GMT"
                },
                {
                    "text": "We are right now poised to lose our system of government. Okay, we accept that. Let's go all the way. The Supreme Court is already tainted. Let's just go ahead and call them illegitimate. The line was crossed not with the new justice but with Kavanaugh. The moment he <a href=\"http://scripting.com/images/2018/10/02/kavanaughExcerpt.png\">spouted</a> Clinton conspiracy theories in his confirmation hearing was the moment I realized the enemy isn't just in the Oval Office, but in the Supreme Court too. We need to either get Kavanaugh and his ilk off the Court, to re-establish its legitimacy, or so dilute their vote as to make them irrelevant. ",
                    "created": "Tue, 27 Oct 2020 16:06:18 GMT"
                },
                {
                    "text": "People say oh if you pack the court, the Repubs will do the same when they take power again. Fine. So we'll stack the court for them too. Instead of just adding four or six new justices, let's add <i>1000</i>. All of them card-carrying members of the ACLU, Planned Parenthood and the Democratic Party. The Repubs will ignore their decisions when they're in power, and the Dems will ignore the current 6-3 court which, I would like to add, in no way represents the people of the United States. We don't like Citizens United, we want the Voting Rights Act back in force (obviously) and we want the three justices appointed by the criminal traitor Trump removed immediately, or else we'll add <i>100000</i> new justices, starting right now. ",
                    "created": "Tue, 27 Oct 2020 16:08:09 GMT",
                    "image": "http://scripting.com/images/2018/10/05/monstersFullSize.png"
                },
                {
                    "text": "If you don't like crazy, dear Republicans, then stop being crazy. And fuck off, we don't give a shit what you think. We love your tears. When you cry we are happy. Thank you very much.",
                    "created": "Tue, 27 Oct 2020 16:10:48 GMT"
                }
            ]
        }
    ]
}