{
    "text": "October 28",
    "created": "Wed, 28 Oct 2020 14:13:04 GMT",
    "name": "28",
    "subs": [
        {
            "text": "Podcast: <a href=\"http://scripting.com/2020/10/28/whyIdLikeToInvestInTheLincolnProject.m4a\">Why I'd like to invest in the Lincoln Project</a>. ",
            "created": "Wed, 28 Oct 2020 18:20:01 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2020/10/28/whyIdLikeToInvestInTheLincolnProject.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "5063253"
        },
        {
            "text": "<a href=\"https://www.theverge.com/platform/amp/2020/10/27/21536963/amazon-free-podcast-update-catalog\">This is awesome</a>. Audible wanted to create a proprietary “podcast” network (in quotes because of the contradiction), now instead will try an open one. The power of an open juggernaut.",
            "created": "Wed, 28 Oct 2020 17:28:40 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/05/30/elephant.png"
        },
        {
            "text": "I love that <a href=\"https://en.wikipedia.org/wiki/Marc_Andreessen\">Marc Andreessen’s</a> VC firm is <a href=\"https://mondaynote.com/inside-a16zs-media-operations-1f5235881f6d\">building</a> so much on <a href=\"https://a16z.com/podcasts/\">podcasting</a>. We all benefited from his work in booting the open web. Happy to have been able to reciprocate. That’s the ethos of open networks. ",
            "created": "Wed, 28 Oct 2020 15:10:19 GMT",
            "type": "outline"
        },
        {
            "text": "The <a href=\"https://www.youtube.com/watch?v=Pre0OFtCqis\">best ad</a> of the campaign, so far, is from the Lincoln Project, of course. This is going to grab the heart of anyone with a parent. ",
            "created": "Wed, 28 Oct 2020 14:40:43 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=Pre0OFtCqis"
        },
        {
            "text": "Yesterday I <a href=\"http://scripting.com/2020/10/27.html#a200053\">wrote</a> about the vote for the new library building in Woodstock. I voted yes. Michael Hunt, who also reads this blog, and emailed me about the vote a couple of days ago, posted a <a href=\"https://youtu.be/iwrDgwUSCco\">video summary</a> of the case for voting yes. It's a much better argument than I could make, so I thought it belonged here. ",
            "created": "Wed, 28 Oct 2020 14:33:23 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=iwrDgwUSCco"
        },
        {
            "text": "If Trump voters were getting real news, they'd know that Trump leaving his rally-goers <a href=\"https://www.nbcnews.com/politics/2020-election/hundreds-trump-supporters-stuck-freezing-cold-omaha-airfield-after-rally-n1245065\">stranded</a> in the cold is par for the course for Trump. Ask the people of <a href=\"https://www.tampabay.com/florida-politics/elections/2020/10/02/they-fled-hurricane-maria-now-theyre-fighting-to-defeat-trump/\">Puerto Rico</a>. Ask the governor of any state that was experiencing a surge of Covid cases in the spring. Trump isn't actually a business person or a president. He loves to give rallies, he's a comedian, a performer, but you don't matter to him. You aren't even a thing. If you want a real government, you have to vote for Biden. ",
            "created": "Wed, 28 Oct 2020 14:13:05 GMT",
            "type": "outline"
        },
        {
            "text": "\"Getting it\" vs respect",
            "created": "Wed, 28 Oct 2020 15:45:48 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "This <a href=\"https://twitter.com/thejeffreymarsh/status/1321175950483169284\">video</a> I saw on Twitter this morning really grabbed me. ",
                    "created": "Wed, 28 Oct 2020 15:45:54 GMT"
                },
                {
                    "text": "<a href=\"https://twitter.com/thejeffreymarsh\">They</a> are right, first comes respect, then comes getting it. Now I'm going to add my two cents.",
                    "created": "Wed, 28 Oct 2020 15:46:45 GMT"
                },
                {
                    "text": "Respect isn't something you earn, respect is the default. Respect is listening to who the person really is, versus the story you've projected on them. Listen to the words they say. And accept that it is their point of view. It isn't right or wrong, it isn't something that can be argued over. This is what the person you're listening to wants to say. That's all. ",
                    "created": "Wed, 28 Oct 2020 15:47:06 GMT"
                },
                {
                    "text": "I understand this idea really well myself because I've always been projected on. I was raised by parents who judged me by their impression of who I was. So I was always all twisted up thinking about how they would interpret something I did, and how I would avoid being punished. ",
                    "created": "Wed, 28 Oct 2020 15:48:32 GMT"
                },
                {
                    "text": "The world does it too, sometimes very openly. I spoke at a conference in 2019 where I was heckled as being a person of privilege. The people probably had never even read anything I'd written, even that doesn't tell you enough to judge me. Why was it so hard for them to listen? I don't know. But they were very insistent that I was not to be listened to.",
                    "created": "Wed, 28 Oct 2020 15:50:31 GMT"
                },
                {
                    "text": "So Jeffrey Marsh, in the video, speaks for me. amd very likely you. It isn't worse or better for anyone. Either people try to change who you are or they don't. The best friends are the ones who give you a chance to be different from their expectations of you. Jeffrey says something we all probably would like to say, and expresses it in a way that some people can actually hear. And that's a service to everyone who just wants to be heard. ",
                    "created": "Wed, 28 Oct 2020 15:51:53 GMT"
                }
            ]
        },
        {
            "text": "How I code in my outliner",
            "created": "Wed, 28 Oct 2020 16:17:35 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Ooops this was published accidentally. ",
                    "created": "Wed, 28 Oct 2020 16:17:40 GMT"
                },
                {
                    "text": "It's not ready for primetime yet.",
                    "created": "Wed, 28 Oct 2020 17:31:32 GMT"
                },
                {
                    "text": "\"curly\"",
                    "created": "Wed, 28 Oct 2020 17:31:10 GMT"
                },
                {
                    "text": "<i>Still diggin!</i>",
                    "created": "Wed, 28 Oct 2020 17:30:48 GMT"
                }
            ]
        }
    ]
}