{
    "text": "News on the web still sucks",
    "created": "Thu, 29 Aug 2024 15:33:50 GMT",
    "type": "outline",
    "description": "Why, after 30 years, is there still no distribution system for news on the web?",
    "metaImage": "http://scripting.com/images/2024/08/29/expass.png",
    "subs": [
        {
            "text": "I can't read most of the stories I want to read. I have the money and am willing to spend it. But there is no system that allows me to pay. ",
            "created": "Thu, 29 Aug 2024 15:28:06 GMT",
            "flInCalendar": true
        },
        {
            "text": "On the other hand the distribution of video entertainment is somewhat functional, I spend an ungodly amount of mostly wasted money to get access to that. ",
            "created": "Thu, 29 Aug 2024 15:34:05 GMT",
            "flInCalendar": true
        },
        {
            "text": "I am not cheap. The news system realllly doesn't work. It could be fixed, but for the usual problem -- they would have to work with each other. ",
            "created": "Thu, 29 Aug 2024 15:41:29 GMT",
            "flInCalendar": true
        },
        {
            "text": "If you think the NYT is a huge success, compare its size to the size of Microsoft, Netflix, Amazon or Apple, all of whom have made great businesses out of distributing other people's products. ",
            "created": "Thu, 29 Aug 2024 15:34:19 GMT",
            "flInCalendar": true
        },
        {
            "text": "Market caps for Amazon, Apple, Microsoft, Netflix and NYT.",
            "created": "Thu, 29 Aug 2024 15:37:14 GMT",
            "inlineImage": "https://imgs.scripting.com/2024/08/29/marketcaps.png",
            "flInCalendar": true
        },
        {
            "text": "We were getting somewhere with <a href=\"http://scripting.com/2019/09/03/132640.html?title=nytAndRss\">RSS</a>, btw -- but the journalism industry lost its minds over Twitter, and let the tech industry own the distribution system, and now it's a total mess, a good time for a re-think, I think. ",
            "created": "Thu, 29 Aug 2024 15:45:22 GMT",
            "flInCalendar": true
        },
        {
            "text": "I generated graph in <a href=\"https://chatgpt.com/share/8bbe7d22-89d4-4fc3-b3c3-d56993da3e00\">ChatGPT</a> by just asking for it. It has great chart software built-in. Quietly they are rearranging all the pieces of software we use. They will end up owning everything, and meanwhile people are asking if this is a bubble. Not really. More like an invasion. ",
            "created": "Thu, 29 Aug 2024 15:43:25 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}