{
    "created": "2025-09-08T04:00:00.000Z",
    "flInCalendar": true,
    "name": "08",
    "path": "2025/09/08",
    "text": "September 08",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Podcast: <a href=\"https://shownotes.scripting.com/scripting/2025/09/08/whyBloggingLostToTwitterAndOtherFolkSongs.html\">Why blogging lost to Twitter and other folk songs</a>. ",
            "created": "Mon, 08 Sep 2025 21:24:20 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I've been calling the next release <a href=\"https://daveverse.org/2025/09/08/radio-wordland-coming-along-nicely/\">Radio WordLand</a>. If you know the <a href=\"https://daytona.scripting.com/search?q=%22Radio%20UserLand%22\">history</a> you'll understand why. I'll start posting screen shots soon. ",
            "created": "Mon, 08 Sep 2025 16:37:31 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://imgs.scripting.com/2025/09/08/evanPostMasto.png\">Screen shot</a> of a <a href=\"https://mastodon.social/@evan@cosocial.ca/115164400820285035\">post</a> by Evan Prodromou on Masto yesterday. \"You publish where you want to publish, Dave. We'll find a way to connect to you. That's the whole point.\" Indeed that <i>is</i> the whole point. I say it <a href=\"https://this.how/standards/#1497798753000\">like this</a>. \"Interop is all that matters.\" If our products interop that's pure love. The rest of it is baloney. Maybe I'm not a nice guy. Not my job. We've being fucked over by \"social media\" for 19 years now, and the new ones who say they're open, and on the web, and decentralized, are not. The only way out of this mess is what Evan said. BTW, I <a href=\"https://mastodon.social/@davew/115164714595757607\">sent</a> Evan a <a href=\"https://feedland.social/opml?screenname=davewiner&catname=daveverse\">pointer</a> to the subscription list which is my outflow. I use OPML for the list and RSS for the feeds. That's where you will find my writing. ",
            "created": "Mon, 08 Sep 2025 15:06:06 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2024/09/10/kittyStamp.png",
            "flInCalendar": true
        },
        {
            "text": "I watched the movie <a href=\"https://en.wikipedia.org/wiki/Seven_(1995_film)\">Seven</a> last night, and I can't stop thinking about it. It got a shitty <a href=\"https://www.nytimes.com/1995/09/22/movies/film-review-a-sickening-catalogue-of-sins-every-one-of-them-deadly.html\">review</a> in the NYT, which usually means I won't bother with something, but this time I decided to give it a try. The reviewer, Janet Maislin, didn't like the acting of Brad Pitt. I thought Pitt was an unlikeable jerk, but I also thought that was the role, but maybe I was wrong. I didn't care. I also couldn't figure out what city it was. It wasn't NY, but Maislin says it was. Usually in a movie set in NY, I recognize many of the locations. There are only a few places movies are shot in the city. But again, I didn't care. What keeps me thinking about it is the story. I'm not going to spoil it. Don't read any reviews before watching it, they pretty much all get in the way of the storytelling. ",
            "created": "Mon, 08 Sep 2025 15:17:45 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2025/09/08/se7en.png",
            "flInCalendar": true
        },
        {
            "text": "How to be part of the <a href=\"https://this.how/blogosphere/\">rebooted blogosphere</a>. ",
            "created": "Mon, 08 Sep 2025 14:11:55 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}