{
    "created": "2025-09-14T04:00:00.000Z",
    "flInCalendar": true,
    "name": "14",
    "path": "2025/09/14",
    "text": "September 14",
    "type": "calendarDay",
    "subs": [
        {
            "text": "The Bloggers <a href=\"https://mastodon.social/@scripting@daveverse.org/115205341809959164\">of Mastodon</a>.",
            "created": "Mon, 15 Sep 2025 01:33:24 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "A very smart application of AI. Google could add it to the debugger. When my program crashes deep in jQuery code, with no stack crawl, it could suggest what the problem might be without me have to try to describe it for ChatGPT. The Google AI debugger would be able to look everywhere any anywhere in the virtual machine. Much faster than I can. As a programmer I hope they're working on this. Or maybe it's already out in testing form?",
            "created": "Sun, 14 Sep 2025 22:55:36 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "A couple of days ago I saw a <a href=\"https://mastodon.social/@evan@cosocial.ca/115180872933751939\">post</a> from Evan Prodromou asking if I had seen a product announcement, and was wondering what I thought of the name. The name of the product was Really Simple Something. I said it was the first I heard of it. I did a little digging using ChatGPT and found they can do this, it’s not illegal or unethical. But it’s also true that you could invent a new format and call it HTML even if it isn’t what we think of as HTML today . The W3C would have no recourse. If you wanted to make a new CSS to compete with the existing CSS, no one can stop you, and you can call it CSS. Not a good way to run the internet imho. But that appears that's how it works. So as much as I didn't like what they did, esp the fact that the first I heard of it was a public announcement, and had no time to prepare or maybe even help them do something better, I guess we have to accept it. RSS has been through this before and came out okay. I just wish it would stop at some point. It's a useful thing, deserves <a href=\"http://scripting.com/2025/09/11/123936.html#a124132\">love</a> and support, not just from me, but from everyone, esp people who run companies that depend on it. You benefit as much as I do. End of sermon.",
            "created": "Sun, 14 Sep 2025 16:36:16 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2025/09/14/cheezWhiz.png",
            "flInCalendar": true
        },
        {
            "text": "Last night's email didn't go out. I found and fixed the bug, and the mails went out about 10.5 hours late. ",
            "created": "Sun, 14 Sep 2025 14:12:56 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}