{
    "created": "2025-09-16T04:00:00.000Z",
    "flInCalendar": true,
    "name": "16",
    "path": "2025/09/16",
    "text": "September 16",
    "type": "calendarDay",
    "subs": [
        {
            "text": "It's <a href=\"https://really.reallysimple.org/\">really</a> simpler than really simple.",
            "created": "Tue, 16 Sep 2025 20:18:51 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Here's an idea. Why doesn't Apple make a laptop with a light shining out to highlight the user's face so they look better when they're on a Zoom call. I bet someone makes a device like this to clip on a laptop. Right?? ",
            "created": "Tue, 16 Sep 2025 17:18:55 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Until we start working together it’s going to keep getting worse.",
            "created": "Tue, 16 Sep 2025 16:45:07 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I've started calling ChatGPT boss as in <i>OK boss.</i>",
            "created": "Tue, 16 Sep 2025 15:30:34 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "ChatGPT is great at <a href=\"https://en.wikipedia.org/wiki/SVG\">SVG</a>. Describe the icon you want and in a few iterations you have it, even if it's not in <a href=\"https://fontawesome.com/\">Font Awesome</a>. I would have killed to have this a few years ago, before FA came out. This is the best of both -- use FA if they have the right icon, design your own if they don't. It also makes me think that now perhaps SVG-based user interfaces are within the realm of possibility. CSS is no way to design UIs. I have a podcast in the pipe about this. If you want to know what I mean, look at the <a href=\"http://scripting.com/publicfolder/scripting/misc/quickdrawApiSummary.pdf\">docs</a> for <a href=\"http://scripting.com/2025/06/19/152802.html\">QuickDraw</a>.",
            "created": "Tue, 16 Sep 2025 14:54:48 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Now would be a good time for everyone to watch <a href=\"https://www.metacritic.com/movie/the-lives-of-others/\">this movie</a>. This is where we are now. It's not in the future. Getting this info will help. Spread the word. Download a copy too. It's a great movie.  ",
            "created": "Tue, 16 Sep 2025 14:43:44 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "To people who read my blog. If you have a quick thought about something you read here, it's ok if you send me an email. It should be short and not personal, if it adds some info or perspective that might be interesting, or if you just agree feverishly (not so much if you disagree, please) drop me a line. My return address on the nightly emails is my real email address. And you can find the address on the <a href=\"http://scripting.com/?tab=about\">About page</a> on my blog. Also sometime soon I think there will be a way to read my blog inside WordLand, so you can post a response to something I wrote, on your own blog, and I can get a link to it. I think this is the best of both worlds. You maintain the integrity of your blog, all your comments are in the same place, and if I think my readers would benefit, I can link it into my blog. I don't think we need comments, in other words. I think our blogs are powerful enough with some new code.  ",
            "created": "Tue, 16 Sep 2025 14:21:12 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}