{
    "created": "2025-09-17T04:00:00.000Z",
    "flInCalendar": true,
    "name": "17",
    "path": "2025/09/17",
    "text": "September 17",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I had a great talk/podcast interview yesterday with <a href=\"https://pfefferle.dev/\">Matthias Pfefferle</a> about everything I'm interested in re WordPress and networking, and our interests overlap a lot. I was explaining how I wanted to see a whole market of editors. You could see them as \"For WordPress\" but there's another way to look at them. They're plug-in replacements for the dreaded \"tiny little textboxes\" we see in twitter-like systems. Those awful little things. We know so many ways to make better editors. Now imagine that we store your Mastodon posts in WordPress documents (we do). And you see how the pieces start to fit together. Think of WordPress as the command line of the social web. And it really will be the web, not a promise of someday maybe being the web. It's like a Wordle puzzle. You have to move the parts around until you see a picture develop. Another fun thing, WordPress has a great simple REST api that's been around since 2017, and it covers most of the product functionality and is debugged, scaled and stable. It probably is the simplest API for ActivityPub. Now does that blow your mind? This is how you know this is the web, because your mind keeps exploding once you realize the things you could do just by connecting two things together and it works because they interop. Matthias has been working on this stuff since 2008. Our paths didn't cross until earlier this year. ",
            "created": "Wed, 17 Sep 2025 21:11:33 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2025/09/17/reallySimpleCola.png",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://www.nytimes.com/2025/09/17/realestate/real-estate-guide-amenia-new-york.html?unlocked_article_code=1.mk8.pyS5.EYIaVe05LN5h&smid=url-share\">This town</a>, at the end of the <a href=\"https://www.mta.info/agency/metro-north-railroad\">Metro North</a> line, looks like an ideal place to park yourself for easy access to the city, yet a fairly country experience. ",
            "created": "Wed, 17 Sep 2025 21:02:41 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "There have been reports of people having trouble using \"WordLand\". I was just able to do a <a href=\"https://techfightclub.wpcomstaging.com/2025/09/17/one-of-a-million-test-posts/\">test post</a>, and I can see from the logs that other people are successfully posting. It would be helpful if people with accounts could do a short test post. And if you have something to report, here's a <a href=\"https://github.com/scripting/wordlandSupport/issues/107\">good place</a> to do it.  ",
            "created": "Wed, 17 Sep 2025 19:19:12 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "In a piece I wrote yesterday <a href=\"https://daveverse.org/2025/09/16/can-we-finally-put-the-past-behind-us/\">on my WordPress blog</a>, I offered to do a virtual handshake with the people who worked at Netscape when it disappeared just as RSS 0.9.1 was being adopted by the blogosphere in 1999. I never considered their point of view, but in fairness, they never would talk to us except to dictate and dominate. In the <a href=\"https://daveverse.org/2025/09/16/can-we-finally-put-the-past-behind-us/\">piece</a> I try to explain how it all looked from my point of view, that of a developer who had adopted RSS 0.91 in favor of my own earlier format. Most of the stories miss the real innovator, and when you find out <a href=\"http://scripting.com/stories/2011/11/07/martinLeavesTheTimes.html\">who</a> it is you will be surprised. (It's not me, most of my job re RSS has been fairly thankless and not creative, and definitely not profitable, but still worth doing because the web is the only place independent developers can work without the interference of big tech companies.)",
            "created": "Wed, 17 Sep 2025 13:12:51 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2025/09/17/reallySimpleKetchup.png",
            "imageLink": "https://ketchup.reallysimple.org/",
            "flInCalendar": true
        },
        {
            "text": "A bunch of new people are trying out FeedLand news products. I haven't looked at them in a long time. I'm glad they're looking, but most of my demo news products were broken. Oy. It was hard to untangle. It should be a lot easier, and next time I can dig in and do it over I think it will be. Anyway as I convert my demos, I'll list them here: <a href=\"https://mlbriver.com/\">mblriver.com</a>, <a href=\"https://politics.newsriver.org/\">politics.newsriver.org</a>, <a href=\"https://bloggers.scripting.com/\">bloggers.scripting.com</a>, <a href=\"https://dave.podcatch.com/\">dave.podcatch.com</a>.",
            "created": "Wed, 17 Sep 2025 16:48:00 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}