{
    "created": "2025-09-19T04:00:00.000Z",
    "flInCalendar": true,
    "name": "19",
    "path": "2025/09/19",
    "text": "September 19",
    "type": "calendarDay",
    "subs": [
        {
            "text": "The challenge we face in the social web is enticing people off the silos with fun toys to play with that from the start don't rely on a bigco to run it. The back-end is a server you could run for $20 a month on Digital Ocean for example. But the logical network isn't tied to the physical server. We use URLs or DNS to find other nodes. They can be hosted anywhere. The reason to run lots of servers is to demonstrate that it's only as centralized as the web itself, from day 1. You can browse other people's subscription lists as you can in twitter-like networks. But it's made of feeds. The really simple ones. ",
            "created": "Fri, 19 Sep 2025 15:06:03 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2022/08/08/bootstrappingByEngelbart.png",
            "flInCalendar": true
        },
        {
            "text": "I'm going to call it \"social web\" not <a href=\"https://daytona.scripting.com/search?q=%22open%20social%20web%22\">open social web</a>. You don't need the \"open\" part. The web is open. It's like saying \"wet water.\"",
            "created": "Fri, 19 Sep 2025 21:01:03 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "There should be a ChatGPT \"personality\" for the chatbot. I'd like to start with a black lab. When I say \"good work\" that reinforces that what it did should be a priority. If I say that and give it a treat (by typing \"treat\") that should get double emphasis. I might like it better if I could train it. I don't mind a little enthusiasm, but I want it to respond to me with respect. ",
            "created": "Fri, 19 Sep 2025 20:55:51 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Highly recommend today's <a href=\"https://www.theringer.com/podcasts/the-bill-simmons-podcast/2025/09/18/the-kimmel-situation-plus-can-the-chiefs-really-go-0-3-and-more-week-3-gambling-questions-with-joe-house\">Bill Simmons podcast</a> where he talks about the Jimmy Kimmel situation. His perspective is very good, he says Kimmel doesn't need ABC. And I believe him.  ",
            "created": "Fri, 19 Sep 2025 21:04:59 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The penalty for ABC and Disney should be we stop watching their stuff.",
            "created": "Fri, 19 Sep 2025 13:07:18 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Can we finally put the past behind us?",
            "created": "Fri, 19 Sep 2025 20:17:05 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "<i>Cross-posted from my <a href=\"https://daveverse.org/2025/09/16/can-we-finally-put-the-past-behind-us/\">daveverse site</a>. </i>",
                    "created": "Fri, 19 Sep 2025 20:19:19 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I hadn’t considered the point of view of people who worked at Netscape when it disappeared just as RSS 0.9.1 was being adopted by the blogosphere in 1999. We tried to get in touch, even when they didn’t work there, but no one responded. So we kept going. ",
                    "created": "Fri, 19 Sep 2025 20:19:44 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Then we were surprised when a group of people we didn’t know announced, publicly, that they were the new authority on RSS and at the same time introduced a version 1.0 that was incompatible with the format Netscape left behind. Most developers didn’t switch, very few used their format. ",
                    "created": "Fri, 19 Sep 2025 20:21:54 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "There were discussions and arguments and lots of hurt feelings on the mail list, but the status quo remained for a couple of years. There was RSS 0.91 and RSS 1.0. Most sites used 0.91. ",
                    "flInCalendar": true
                },
                {
                    "text": "After a couple of years, we got lucky and found the people at the NYT who could license their proprietary feeds to us to use in our Radio UserLand product. We did a deal with them, and we were allowed to bundle their feeds with Radio. At first we stayed with their proprietary format, wanting to avoid dragging them into the arguments. But then we heard from other pubs that wanted to follow the NYT, and they wanted to know what they should do. We had a new version in the works, 0.92, that had a few new features, but as this was in development, we realized were doing all the work, and 1.0 was just sitting there as an obstacle, it would always appear as what we were doing was less than what they did, when the two really had nothing to do with each other. Since they never consulted us about superceeding the format we were using, we changed 0.92 to 2.0, waited for the flames, but they never came. People were tired of the arguing and there was too much potential in a publishing surface that was shared by bloggers and professional news. So guess what -- RSS 2.0 became the standard. ",
                    "created": "Fri, 19 Sep 2025 20:23:19 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The ex-Netscapers never talked with us, even though their big company no longer existed. We might have worked out something if they had talked with us as equals. But I guess we weren't good enough for them? Hard to say.",
                    "flInCalendar": true
                },
                {
                    "text": "I don’t care if they claim they created RSS, I've never claimed to be the inventor, and I don't there's much value in that -- and frankly I think The NY Times had more to do with its success than any of us. If they hadn’t decided to jump in simply because they liked my little company, RSS would be nothing but a bunch of geeks arguing about who did what about something no one cared about. We might be reminiscing about what might have happened if we could only work with each other and considered each others’ perspective. ",
                    "flInCalendar": true
                },
                {
                    "text": "To this day, decades later, they still won't talk to us. But I guess from their point of view we had no right to use the supposedly open format their defunct company had left behind.",
                    "flInCalendar": true
                },
                {
                    "text": "I have a different view of the web. It is not made of companies, it’s made of people. Companies can use the web, but they can’t own it. And I suggest that the people here no matter where they work now or in the past understand that there are other points of view. No matter how big your company is or was, you are still just people. ",
                    "flInCalendar": true
                },
                {
                    "text": "I have worked for big prestigious companies and organizations too. So what. ",
                    "flInCalendar": true
                },
                {
                    "text": "Okay so you all sent me a message by taking something I created and was proud of and called it your own without saying where you got it. You can do that, and hopefully this is the end of the vendetta. You can feel you got the win you are entitled to. You caused the pain you were hoping to. So now can we finally put the past behind us? Imho we have much bigger problems to solve and that can only happen if people work together. ",
                    "created": "Fri, 19 Sep 2025 20:25:37 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Maybe we can agree that RSS has done a lot of good for a lot of people. It isn't perfect. But it deserves a little peace and quiet, that I actually thought it had achieved. From here-on, let's try to make it better, not take things out of it for our own benefit.",
                    "created": "Fri, 19 Sep 2025 20:48:49 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "How about a virtual handshake and finally put the past behind us?",
                    "created": "Fri, 19 Sep 2025 20:48:44 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Really Simple beer",
            "created": "Fri, 19 Sep 2025 20:46:36 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Most beers are too complicated.",
                    "created": "Fri, 19 Sep 2025 20:47:01 GMT",
                    "inlineImage": "https://imgs.scripting.com/2025/09/19/bigBeerPackage.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}