{
    "text": "What is OPML?",
    "created": "Sat, 11 Dec 2021 14:50:32 GMT",
    "type": "outline",
    "description": "OPML is just a file format, like HTML or RSS. So it can be used for whatever you want, large files, small files.",
    "subs": [
        {
            "text": "A thread on Twitter led to this <a href=\"https://twitter.com/blogisch/status/1469579178890743808\">question</a> from Joël de Bruijn: \"Is an OPML file meant to encompass a whole library (with a notebook, subnotebook, note structure) or is it more like \"one note = one OPML file\" structure? Or something in between, what a user prefers?\" ",
            "created": "Sat, 11 Dec 2021 14:50:40 GMT",
            "flInCalendar": true
        },
        {
            "text": "\"OPML\" is just a file format, like HTML or RSS. So it can be used for whatever you want, large files, small files, libraries, bullet charts, tree charts, graphs, calendars, directories, projects, things we haven't invented yet. ",
            "created": "Sat, 11 Dec 2021 14:53:23 GMT",
            "flInCalendar": true
        },
        {
            "text": "It was <a href=\"http://scripting.com/manila/opml/spec.html\">originally</a> designed as the interchange format for the outliner in \"Frontier\", a scripting environment I created at UserLand Software in the late 80s and 90s. In Frontier, an outline could be a script, a menu, an object database, a blog, a blog post, or just an outline. We needed a way to exchange outlines with our product and other outliners, so this is what we came up with. OPML wasn't the first interchange format for outlines, there was a format called <a href=\"http://scripting.com/fatpages/misc/dotHeadFormat.html\">.HEAD</a> (pronounced dot-head) that we used for outliners in the 80s, but OPML was better because not only did it handle structures of text, they could also have attributes. Anywhere you could put an outline node, you could add attributes. They aren't visible when you're editing, but they're accessible through a dialog, or software can automatically attach attributes, such as the creation date of a node, so that they are indentifiable and can be pointed to from outside the outline. ",
            "created": "Sat, 11 Dec 2021 14:53:52 GMT",
            "flInCalendar": true
        },
        {
            "text": "Then came a very special attribute, the <i>type</i> attribute -- which says basically that this node in an outline is a document, so the outline containing the node behaves like a file system. That's how I edit my blog. Each post is a document contained within a day, which is part of a month. I find it convenient to start a new outline every month, and archive the previous month in a GitHub repository. You can study what real-world OPML looks like <a href=\"https://github.com/scripting/Scripting-News/tree/master/blog/opml\">there</a>, I have 4.5 years of archives there. I recently created a <a href=\"http://daytona.scripting.com/\">search utility</a> for those, which is kind of like the tagging systems you see in Tools For Thought products, but I don't have to tag anything, I can just search for the words. It's already a lot better than Google or other search engines that don't understand outline structure. ",
            "created": "Sat, 11 Dec 2021 14:57:03 GMT",
            "flInCalendar": true
        },
        {
            "text": "Anyway that's a longish answer to a question that can be answered simply by saying that an OPML file can be whatever size makes sense for the application. It's just a file format. Its signficance, I hope, is that it can provide a way for all kinds of outliners, and applications that accept outlines as input, to share the same data, making it possible for lots of outline-based tools to co-exist, and for users to be able the use the right tool for whatever job they want to do right now, without having to convert any data. It's totally possible, and I'm happy to help any way I can.",
            "created": "Sat, 11 Dec 2021 15:00:04 GMT",
            "flInCalendar": true
        },
        {
            "text": "And btw, a plug for my product \"Drummer\", whose native file format is OPML. :smile:",
            "created": "Sat, 11 Dec 2021 15:02:54 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}