{
    "text": "I've been Scobleized",
    "created": "Tue, 11 Jul 2017 13:26:01 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Scoble wrote something about my blog on Facebook, but sorry I can't point to it. It's <a href=\"http://scripting.com/2017/05/31.html#a110526\">against the rules</a> of this blog. But I will send Scoble a pointer to this post on Facebook. ",
            "created": "Tue, 11 Jul 2017 13:26:10 GMT",
            "image": "http://scripting.com/2016/10/19/fatcat.png",
            "permalink": "http://scripting.com/2017/07/11.html#a092610"
        },
        {
            "text": "He said he likes the way \"Scripting News\" works now (I'd say <a href=\"http://scripting.com/2017/05/05/iWantMyOldBlogBack.html\">again</a>) and it's given him pause to think if maybe he should blog outside of Facebook too.",
            "created": "Tue, 11 Jul 2017 13:26:41 GMT",
            "permalink": "http://scripting.com/2017/07/11.html#a092641"
        },
        {
            "text": "So here's what I want to say to Scoble. Why can't we have both? Why can't Facebook support the <a href=\"http://scripting.com/2016/04/30/1229.html\">basic features</a> of the web so we can post the same content to Facebook as we do on our blog. Make Facebook an excellent blogging surface. Really, a minor upgrade. That's the win-win. ",
            "created": "Tue, 11 Jul 2017 13:27:09 GMT",
            "permalink": "http://scripting.com/2017/07/11.html#a092709"
        },
        {
            "text": "For a couple of years that's what I thought Facebook was doing and why I was excited about the future that would unlock for the web. But either they punted or misled. Either way Facebook is a bad web citizen. Sucking energy from the web and not feeding it back. It's as if you had a one-way peering arrangement. You have to take our packets but we won't carry yours. That's not net-neutral (and why I don't support them in their fight against Verizon and Comcast).",
            "created": "Tue, 11 Jul 2017 13:28:19 GMT",
            "permalink": "http://scripting.com/2017/07/11.html#a092819"
        },
        {
            "text": "It's the analog of constructing private apartment buildings in Central Park. Not only isn't it fair or moral, it's also stupid. When you're done, no one will want to live there. To this day Facebook feeds off the web. When the web is exhausted, maybe then Facebook will support linking in their discussion posts. ",
            "created": "Tue, 11 Jul 2017 13:34:34 GMT",
            "permalink": "http://scripting.com/2017/07/11.html#a093434"
        },
        {
            "text": "I've tried over and over to get people <a href=\"http://www.goodreads.com/quotes/21810-it-is-difficult-to-get-a-man-to-understand-something\">inside</a> and outside of Facebook to understand why we need Facebook to relent, but I don't think they get it. This is one of those things you won't know you'll miss until it's too late. ",
            "created": "Tue, 11 Jul 2017 13:30:16 GMT",
            "permalink": "http://scripting.com/2017/07/11.html#a093016"
        },
        {
            "text": "PS: Just four <a href=\"http://scripting.com/2016/04/30/1229.html\">features</a>: 1. Links. 2. Simple styling. 3. Enclosures for podcasting. 4. Titles. They already have the code written, they just have to deploy it for <a href=\"http://www.urbandictionary.com/define.php?term=peon\">regular users</a> like you, Scoble and me.",
            "created": "Tue, 11 Jul 2017 13:49:22 GMT",
            "permalink": "http://scripting.com/2017/07/11.html#a094922"
        }
    ],
    "permalink": "http://scripting.com/2017/07/11.html#a092601"
}