{
    "created": "2025-11-02T04:00:00.000Z",
    "flInCalendar": true,
    "name": "02",
    "path": "2025/11/02",
    "text": "November 02",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Current <a href=\"https://imgs.scripting.com/2025/11/02/wordlandScreenShot.png\">screen shot</a> of WordLand.",
            "created": "Sun, 02 Nov 2025 22:26:07 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "It's the first day of \"no more baseball\" for the next ten months or so. I admit I don't really get involved until August. But this year was great, even though the Mets didn't make the playoffs. Congrats to my friends who are Mariners fans, they made a really good run. I was pulling for the Blue Jays, dreading a Los Angeles win, but as they say you can't always get what you want. And I don't mind that there's a victory for LA, a city that's taking the brunt of what's surely coming for NYC. Obviously they're waiting for the election to be over before they occupy the city.",
            "created": "Sun, 02 Nov 2025 22:38:16 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2023/12/24/slugger.png",
            "flInCalendar": true
        },
        {
            "text": "Since the next version of \"NetNewsWire\" supports \"source:markdown\" I wanted to <a href=\"https://github.com/Ranchero-Software/NetNewsWire/issues/4825\">show</a> how to find the feeds generated by WordLand that are compatible. ",
            "created": "Sun, 02 Nov 2025 14:23:41 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I wanted to show <a href=\"https://www.crunchbase.com/person/jake-savin\">Jake Savin</a>, a UserLand dev and friend, how I edit my JavaScript code projects in my outliner. This is the <a href=\"https://github.com/scripting/feedland/blob/main/database/source.opml\">source.opml</a> file for the <a href=\"https://www.npmjs.com/package/feedlanddatabase\">feedlanddatabase</a> package, <a href=\"https://drummer.land/?url=https://raw.githubusercontent.com/scripting/feedland/refs/heads/main/database/source.opml\">which you can edit</a> in Drummer.",
            "created": "Sun, 02 Nov 2025 13:25:57 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "In August 2002 I asked why RSS 1.0 is named RSS. I gathered up <a href=\"http://essaysfromexodus.scripting.com/whyRss10NamedRss\">opinions</a> and published it as a single document. I didn't edit or respond, just let people speak. I think this is a legit document type. And when implemented in 2026, it should all work with pointers. They should be only one copy of the text, where the author wrote it. Technically this is totally doable. Just a few independent developers to work with to start a bootstrap. We know how to do this. ",
            "created": "Sun, 02 Nov 2025 10:50:56 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}