{
    "text": "Advice for Stallman",
    "created": "Thu, 19 Sep 2019 13:28:58 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Yesterday I got an email from <a href=\"https://en.wikipedia.org/wiki/Richard_Stallman\">Richard Stallman's</a> PR person, <a href=\"https://www.sylviapaull.com/\">Sylvia Paull</a>, who I've known for many years. She was updating me on how he had <a href=\"https://en.wikipedia.org/wiki/Richard_Stallman#Controversy_and_resignation_from_MIT_and_Free_Software_Foundation\">lost</a> his position at <a href=\"http://web.mit.edu/\">MIT</a> and at the <a href=\"https://www.fsf.org/\">FSF</a> in recent days. Of course I had been following the story. ",
            "created": "Thu, 19 Sep 2019 13:29:05 GMT"
        },
        {
            "text": "I offered advice, in an email, which I am including below. ",
            "created": "Thu, 19 Sep 2019 13:39:41 GMT",
            "subs": [
                {
                    "text": "I feel for Stallman. On the other hand he had a long run and was <a href=\"https://en.wikipedia.org/wiki/Richard_Stallman#Honors_and_awards\">celebrated</a> in so many ways, given an office at MIT, had a foundation. Some of us would have loved that kind of support. ;-)",
                    "created": "Thu, 19 Sep 2019 13:33:03 GMT"
                },
                {
                    "text": "As his PR person I think you can help by first learning from others' mistakes in these situations. There have now been lots of them. A mistake a lot of people make is trying to fight back or argue with the judgement. I don't think that works. If he has the money, taking some time off, writing software perhaps, fixing bugs in other people's stuff. Not being such a big guy for a while. Live a <a href=\"http://scripting.com/2016/05/31/1296.html\">human-size life</a>. Imagine what he could come up with if he wasn't always out traveling and evangelizing? I've done it. I even write software just for myself these days, no intention to publish ever. ",
                    "created": "Thu, 19 Sep 2019 13:33:24 GMT"
                },
                {
                    "text": "Best advice is to slow down, set your expectations on a longer horizon, and do some self-improvement. ",
                    "created": "Thu, 19 Sep 2019 13:33:36 GMT"
                }
            ]
        }
    ]
}