{
    "text": "Elon Musk's politics are disturbing, for sure -- but he has done one thing to seriously improve Twitter and that was getting rid of the character limit. You have to pay $8 a month to get this <a href=\"https://twitter.com/premium/status/1623411400545632256\">feature</a>, but it's worth it. Yesterday I was able to post a message thanking the folks at Automattic for restoring the Harvard blogs, and was able to say all that I needed to say because the character limit had been removed. If I had posted a link because of a character limit, it would have gone nowhere. Of course I'm a big fan of <a href=\"https://www.google.com/search?q=site%3Ascripting.com+linking\">linking</a> on the web, but the way Twitter and Facebook do linking is not really linking. Also if people actually clicked on links that would be one thing, but they don't and for good reason. We've been trained that clicking links on these sites is painful. For many of the links all you get is an ad telling you to subscribe, which is depressing not only because you wasted the time, but also because it's so freaking sad that the economics imposed on the news world by the news world itself is so stupid and dysfunctional. A reminder that if only they would just implement an EZ-Pass-like system, then maybe I could in the moment say sure, I'll pay for this because I want to know what they are saying and I trust this publication not to be totally full of shit (a long shot). Anyway, Axios ran an <a href=\"https://www.axios.com/2023/10/03/musk-x-links-long-form\">article</a> whose headline makes you groan at the stupidity of Musk, except the headline is a bit misleading. Musk just observes what anyone who has published links on Twitter has <a href=\"http://scripting.com/2015/09/08/peopleDontClickLinks.html\">learned</a>: PEOPLE. DON'T. CLICK. LINKS. ON. TWITTER. They just don't do it. So if you want people to hear you, the only way there's a chance is if the story is right there in Twitter in full. Thus if you're serious about communicating on Twitter, pay the $8 and go ahead and communicate. ",
    "created": "Wed, 04 Oct 2023 13:29:44 GMT",
    "type": "outline",
    "image": "https://imgs.scripting.com/2023/10/04/debbieDowner.png",
    "flInCalendar": true
}