{
    "text": "Twitter never did links anyway",
    "created": "Wed, 04 Oct 2023 16:44:37 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Today's debate is whether Elon Musk is out to strangle journalism by algorithmically downplaying links somehow. But that isn't what he said. What he actually <a href=\"https://www.axios.com/2023/10/03/musk-x-links-long-form\">said</a> is that in Twitter people don't click on links. This is observable. I've known this for years as I tried to arrange it so people could read my blog posts where ever they wanted, and finally in 2017 <a href=\"http://scripting.com/2017/05/05/iWantMyOldBlogBack.html\">gave up</a> because it was impossible. Even if Twitter had completely dropped the character limit then, it still wouldn't have been possible.",
            "created": "Wed, 04 Oct 2023 16:44:45 GMT",
            "image": "https://imgs.scripting.com/2023/10/04/debbieDowner.png",
            "flInCalendar": true
        },
        {
            "text": "Why don't people click on links? Probably because the user experience is a nightmare. First you have to turn off your add blocker to even see the article, and then you have to subscribe to the pub to read this one article. So you hit the back button and if you're like me you remember never again to click on links in Twitter. That happened long before Musk arrived. ",
            "created": "Wed, 04 Oct 2023 16:44:45 GMT",
            "flInCalendar": true
        },
        {
            "text": "Also what Twitter does is not linking because: ",
            "created": "Wed, 04 Oct 2023 16:48:36 GMT",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "I can't hot-up some text.",
                    "created": "Wed, 04 Oct 2023 16:48:49 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I can only link to one thing.",
                    "created": "Wed, 04 Oct 2023 16:48:57 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "It's a very limited form of <a href=\"https://chat.openai.com/share/4818e375-949d-4b7e-9686-4961f148ee32\">linking</a>, I guess. But not like I do linking in a story like the one you're reading now. ",
            "created": "Wed, 04 Oct 2023 21:37:49 GMT",
            "flInCalendar": true
        },
        {
            "text": "The best thing one of these services could do to distinguish itself is to support Markdown, allow enclosures for podcasting, have outbound RSS feeds to start, and inbound feeds soon after, and optional titles. That's about it. Basic features of blogging software circa 1999 or so. But they don't want to do it. ",
            "created": "Wed, 04 Oct 2023 16:49:34 GMT",
            "flInCalendar": true
        },
        {
            "text": "The first one that did so would be loved by writers, and if writers love it, it can't be long before readers love it too. ",
            "created": "Wed, 04 Oct 2023 17:01:29 GMT",
            "flInCalendar": true
        },
        {
            "text": "But the feature that Twitter added in February, while it isn't the panacea that would allow Twitter to let me post my writing there, it is a big step forward. 4000 characters is a pretty useful possible length. And they did exactly what I said they should a decade or so ago with what I called <a href=\"http://scripting.com/2015/10/02/whatWouldAFatTweetLookLike.html\">Fat Tweets</a>. If you don't want to read the rest, after 280, don't click the freaking button. But when you do, you'll know:",
            "created": "Wed, 04 Oct 2023 16:51:10 GMT",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "No delay, the text is already there.",
                    "created": "Wed, 04 Oct 2023 16:52:43 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "No request to turn off ad blockers.",
                    "created": "Wed, 04 Oct 2023 16:52:49 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "No paywall.",
                    "created": "Wed, 04 Oct 2023 16:52:59 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Sounds a little <a href=\"http://textcasting.org/\">like podcasting</a>, you know Adam's <a href=\"https://podnews.net/article/the-last-yard-adam-curry\">Last Yard</a> idea. ",
            "created": "Wed, 04 Oct 2023 17:02:47 GMT",
            "flInCalendar": true
        },
        {
            "text": "In other words you will be able to read what's there. ",
            "created": "Wed, 04 Oct 2023 16:53:05 GMT",
            "flInCalendar": true
        },
        {
            "text": "It's a start. It's better than what was there before. An improvement.",
            "created": "Wed, 04 Oct 2023 16:53:18 GMT",
            "flInCalendar": true
        },
        {
            "text": "For me it totally justifies the $8 a month fee. ",
            "created": "Wed, 04 Oct 2023 16:53:30 GMT",
            "flInCalendar": true
        },
        {
            "text": "More features like that please.",
            "created": "Wed, 04 Oct 2023 16:53:47 GMT",
            "flInCalendar": true
        },
        {
            "text": "PS: And yes Musk's politics are horrible, as are the politics of people who run a lot of companies whose products you use. But Musk's horribleness is in our faces. At some point Tesla and Starlink are going to suffer for it, as Twitter is now. ",
            "created": "Wed, 04 Oct 2023 16:53:54 GMT",
            "flInCalendar": true
        },
        {
            "text": "PPS: This is the <a href=\"http://scripting.com/2017/05/05/iWantMyOldBlogBack.html\">piece</a> I wrote in May 2017 when I decided finally to give up on trying to peer with social networks.  ",
            "created": "Wed, 04 Oct 2023 17:12:04 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}