{
    "text": "What's normal is what's real",
    "created": "Thu, 24 May 2018 13:39:46 GMT",
    "type": "outline",
    "description": "There are proper ways to respond to a totalitarian state, but saying it's not normal is not a good response.  ",
    "subs": [
        {
            "text": "Josh Marshall wrote a <a href=\"https://talkingpointsmemo.com/edblog/stop-talking-about-norms\">piece</a> yesterday saying it's time for journalism to stop talking about norms. Of course I agree. I've been writing <a href=\"http://scripting.com/2018/05/23.html\">about</a> <a href=\"http://scripting.com/2018/05/21.html\">that</a> a lot lately.  ",
            "created": "Thu, 24 May 2018 13:41:06 GMT",
            "image": "http://scripting.com/images/2018/02/08/trumpHead.png"
        },
        {
            "text": "Here's an analogy. Suppose you have a horrible accident and one of your legs is amputated. So you're trying to learn how to live with a single leg. All the while you're screaming at anyone who will listen: This is not normal. This is not normal. ",
            "created": "Thu, 24 May 2018 13:41:08 GMT"
        },
        {
            "text": "But it <i>is</i> normal. It just isn't what was normal in the past. ",
            "created": "Thu, 24 May 2018 16:00:24 GMT"
        },
        {
            "text": "There's a word for reporters who behave as if The Trump Totalitarian State, the one that's still emerging, isn't normal. Deluded. Not coping with reality. There are proper ways to respond to a totalitarian state, but saying <i>it's not normal</i> is not a good response.",
            "created": "Thu, 24 May 2018 13:42:06 GMT"
        },
        {
            "text": "We're in a weird period where (following the analogy) the leg hasn't been fully amputated yet. For example we still have a court system that's willing to <a href=\"https://arstechnica.com/tech-policy/2018/05/judge-orders-donald-trump-to-stop-blocking-people-on-twitter/\">order</a> the president to stop blocking people on Twitter. ",
            "created": "Thu, 24 May 2018 13:43:29 GMT",
            "collapse": "true",
            "subs": [
                {
                    "text": "An aside, how will that be implemented? Will Twitter disable the block command on his account? Will they unblock all the people he's previously blocked? Surely they're not depending on El Presidentè to personally obey the order? ",
                    "created": "Thu, 24 May 2018 13:44:03 GMT"
                }
            ]
        },
        {
            "text": "We still appear to have free speech. The right to assemble. Our votes still seem to work, even though some our votes are suppressed. But there's no question the doctor intends to amputate. So maybe we should be talking about things other than the incorrect idea that this is not normal. It most definitely is. ",
            "created": "Thu, 24 May 2018 13:51:55 GMT"
        }
    ]
}