{
    "text": "Humans aren't really toxic",
    "created": "Wed, 17 Oct 2018 13:56:52 GMT",
    "type": "outline",
    "description": "The smile on her face tells the story. Whatever this is, it's mine. That's the geek ethos imho. ",
    "subs": [
        {
            "text": "I've been wanting to discuss the idea of <a href=\"https://duckduckgo.com/?q=toxic+masculinity&t=h_&ia=web\">male toxicity</a>. What does it mean? And why only male toxicity? Why aren't women given the same awful label? I likened it to the use of the word <i>dead</i> to apply to things that were never alive. Seems like a misuse of the term, an impossibility. I saw one person <a href=\"https://twitter.com/rickhood/status/1052521774653558784\">say</a> that Lindsey Graham, a Republican senator from South Carolina was a toxic male, without explaining how or why or what it means. We're just supposed to know? I <a href=\"https://twitter.com/davewiner/status/1052524370302779392\">don't</a>.",
            "created": "Wed, 17 Oct 2018 13:59:06 GMT",
            "image": "http://scripting.com/images/2018/10/17/legoAdSmall.png"
        },
        {
            "text": "I engaged on Twitter with <a href=\"https://github.com/foosel\">Gina Häußge</a> who used the term in a <a href=\"https://twitter.com/foosel/status/1052477246634696705\">tweet</a> about a series of lovely old LEGO ads, one which <a href=\"http://scripting.com/images/2018/10/17/legoad.png\">showed</a> a girl and her LEGO creation. As a tech creative person myself, I am so proud of that little girl for following her path to geekosity. The smile on her face tells the story. Whatever this is, it's mine. That's the geek ethos imho. :boom:",
            "created": "Wed, 17 Oct 2018 13:59:27 GMT"
        },
        {
            "text": "I think we should stop applying a word like toxic to people. It's not far from calling people <a href=\"https://www.buzzfeednews.com/article/maryanngeorgantopoulos/trump-immigrants-vermin-infest\">vermin</a>. It's dehumanizing. A prerequisite for violence. Find another way to say what you're trying to say or refine it so it's closer to the truth.",
            "created": "Wed, 17 Oct 2018 14:01:07 GMT"
        },
        {
            "text": "Also, I don't think there's any way to measure the quantity of abuse one gender does to the other. It's all a soup -- we create each other. I inherited toxicity from both of my parents, and they from theirs, male and female, all the way back. We create each other.",
            "created": "Wed, 17 Oct 2018 14:11:44 GMT"
        },
        {
            "text": "We may not achieve some ideal we have for each other. A lot of our grievances come from that. I watch people online who are so good at finding fault in others, but never see the obvious opportunities <i>they</i> have to solve the problems themselves. If you regret other people aren't working together, the best approach is to start working with other people yourself. Take the advice you so want to give to others to your own heart, and then act on it. ",
            "created": "Wed, 17 Oct 2018 14:12:06 GMT"
        },
        {
            "text": "This isn't new wisdom. Humans spend their whole lives figuring this out. It's why functional families are so nurturing, if we could only find one! Accept what we have and do your part to make the present and future better. That's about as good as it gets imho. ",
            "created": "Wed, 17 Oct 2018 14:13:30 GMT"
        }
    ]
}