{
    "text": "The NRA ad and the Milwaukee police chief",
    "created": "Thu, 29 Jun 2017 19:36:55 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "The new <a href=\"https://www.youtube.com/watch?v=WxV23Ilsu2U\">NRA ad</a> is <a href=\"http://www.businessinsider.com/national-rifle-association-ad-call-to-violence-2017-6?op=1\">terrifying</a>. I know the reality. I live in the middle of NYC. I see a few protests here and there. The police observe, respectfully, no one gets hurt. This is America. If people don't like something they protest. It's a good thing about our country. Free speech. It's in the Constitution. I recall people who didn't like President Obama availed themselves of their First Amendment rights. ",
            "created": "Thu, 29 Jun 2017 19:37:23 GMT",
            "image": "http://scripting.com/images/2017/06/29/thinkUsa.png",
            "permalink": "http://scripting.com/2017/06/29.html#a030623"
        },
        {
            "text": "The NRA ad attacks the First Amendment and threatens violence. The only line it doesn't cross is racial. I'm sure they're getting ready for that too. ",
            "created": "Thu, 29 Jun 2017 20:11:00 GMT",
            "permalink": "http://scripting.com/2017/06/29.html#a040600"
        },
        {
            "text": "However, if you think the police are huge fans of the NRA, think again. Watch this <a href=\"https://twitter.com/nowthisnews/status/880464645806374912\">video</a> of the Milwaukee police chief, <a href=\"https://en.wikipedia.org/wiki/Edward_A._Flynn\">Edward Flynn</a>. Wisconsin's NRA-written gun law makes Milwaukee a lot more dangerous, and their jobs.",
            "created": "Thu, 29 Jun 2017 19:37:42 GMT",
            "permalink": "http://scripting.com/2017/06/29.html#a030642"
        },
        {
            "text": "The two stories make a fantastic contrast. I think perhaps the NRA is worried that the police are onto them. And they're speaking out. And the gun people want to try to nullify it? I don't know, but I don't see this ad persuading too many people in New York. ",
            "created": "Thu, 29 Jun 2017 19:38:06 GMT",
            "permalink": "http://scripting.com/2017/06/29.html#a030606"
        },
        {
            "text": "My friend Mike Rodriquez who lives in Kansas wants to know what to do. I thought about it. Maybe it's time to leave Kansas Mike. Most of the people in the country don't live in places like that. Small states like Kansas have oversized power due to the way the Senate is designed. But they're talking about extra-legal acts (i.e. illegal). If the people of Kansas are going to start shooting law-abiding Americans, I would guess they're going to spend a lot of time in jail. And if you don't want to be a victim, then just get the fuck out of there.",
            "created": "Thu, 29 Jun 2017 19:38:48 GMT",
            "permalink": "http://scripting.com/2017/06/29.html#a030648"
        }
    ],
    "permalink": "http://scripting.com/2017/06/29.html#a030655"
}