{
    "text": "Big Tech Co's don't understand innovation, part #200,217",
    "created": "Thu, 29 Jun 2017 13:00:58 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Interesting to see Microsoft <a href=\"https://twitter.com/fxshaw/status/880222183066263557\">promoting</a> their new series of podcasts.",
            "created": "Thu, 29 Jun 2017 13:01:12 GMT",
            "permalink": "http://scripting.com/2017/06/29.html#a090612"
        },
        {
            "text": "Reminds me, when I was living in Seattle in the summer of 2004, I was visiting various parts of Microsoft to see if there was business we could do.",
            "created": "Thu, 29 Jun 2017 13:01:32 GMT",
            "permalink": "http://scripting.com/2017/06/29.html#a090632"
        },
        {
            "text": "That summer was the moment podcasting clicked. I was doing Morning Coffee Notes. Adam had started Daily Source Code. Dawn and Drew. Dave Slusher. Trade Secrets. And more and then even more. What had been an idea was now blossoming into a medium. You could see it happening. Every day was a revelation. So I sought out a meeting with the people at Microsoft who were developing what would become <a href=\"https://en.wikipedia.org/wiki/Zune\">Zune</a>, which was doomed, you could see it, the iPod was too much of a juggernaut. There was no room for a <a href=\"http://anildash.com/2006/11/brown-zune.html\">brown</a> music player <a href=\"https://www.amazon.com/Zune-Digital-Media-Player-Brown/dp/B000H0QDCC\">device</a> that did what Apple already did. ",
            "created": "Thu, 29 Jun 2017 13:02:01 GMT",
            "permalink": "http://scripting.com/2017/06/29.html#a090601"
        },
        {
            "text": "But, this new thing, podcasting, needed a player device. The iPod was a terrible player. It was designed for music. You buy music. You store a song on your desktop and mobile device. You listen to a song many times over months or years. ",
            "created": "Thu, 29 Jun 2017 13:09:19 GMT",
            "permalink": "http://scripting.com/2017/06/29.html#a090619"
        },
        {
            "text": "Podcasting was different. You download a podcast as part of a series. It's a subscription. You pay nothing. You listen once and throw it away. Music is permanent, podcasts are ephemeral. A device for listening to podcasts would make it easy to listen to more podcasts. ",
            "created": "Thu, 29 Jun 2017 13:04:56 GMT",
            "permalink": "http://scripting.com/2017/06/29.html#a090656"
        },
        {
            "text": "There was an opening at the time for a device that was insanely great at podcasting. And it would give Microsoft something innovative to promote. A reason for the Zune to exist, at a time when it had none.",
            "created": "Thu, 29 Jun 2017 13:10:07 GMT",
            "permalink": "http://scripting.com/2017/06/29.html#a090607"
        },
        {
            "text": "Unfortunately I learned there, and with all the other interactions with Microsoft, that while they felt they were innovative, they had no appreciation for how innovation happens. It isn't something you put in a budget or a five-year plan. It's something that happens. One day a killer idea shows up out of nowhere, and you have to be prepared to hear it. They were not, clearly, prepared. ",
            "created": "Thu, 29 Jun 2017 13:06:05 GMT",
            "permalink": "http://scripting.com/2017/06/29.html#a090605"
        },
        {
            "text": "A year ago I tried again with Microsoft. I had an idea I thought they needed. They were very nice. They were told I was an industry founder, I guess. But they had no context to understand what I was talking about. You make software you say? Very nice. See you later. ",
            "created": "Thu, 29 Jun 2017 13:07:25 GMT",
            "permalink": "http://scripting.com/2017/06/29.html#a090625"
        }
    ],
    "permalink": "http://scripting.com/2017/06/29.html#a090658"
}