{
    "text": "News has been unbundled",
    "created": "Tue, 16 Jun 2020 13:36:27 GMT",
    "type": "outline",
    "description": "News is an unbundled, à la carte reading experience.",
    "subs": [
        {
            "text": "When I was a grad student, I'd grab a copy of the <a href=\"https://www.chicagotribune.com/\">Chicago Tribune</a>, <a href=\"https://madison.com/ct/\">Capitol Times</a> or <a href=\"https://madison.com/wsj/\">Wisconsin State-Journal</a> and hang out at the <a href=\"https://union.wisc.edu/visit/terrace-at-the-memorial-union/\">Memorial Union</a> and catch up on the news, do the crossword or read the cartoons. The good old days in the 1970s. ",
            "created": "Tue, 16 Jun 2020 13:36:32 GMT"
        },
        {
            "text": "Today, I'd still want to hang out at the Union but I'd get out my laptop or iPad and read the news via Twitter and my <a href=\"http://scripting.com/river/\">RSS river</a>. Key difference: Today  no single publication delivers the full news experience. ",
            "created": "Tue, 16 Jun 2020 14:09:13 GMT"
        },
        {
            "text": "The Union <a href=\"https://www.tripadvisor.com/Attraction_Review-g60859-d4480969-Reviews-Memorial_Union_Terrace-Madison_Wisconsin.html\">terrace</a> is where people meet in Madison. ",
            "created": "Tue, 16 Jun 2020 19:55:25 GMT",
            "inlineImage": "http://scripting.com/images/2020/06/16/terrace.png"
        },
        {
            "text": "Looking back, they could have seen this happening, and done more to bind themselves to Twitter or RSS, or even produced their own hybrid and add their expertise as users of news. And if they had let it evolve it might have been, by now, a fantastic news reading and interacting experience, far better than what we use today. They didn't so this is where it's at now, an unbundled, à la carte reading experience. ",
            "created": "Tue, 16 Jun 2020 13:39:20 GMT"
        },
        {
            "text": "But today the news industry is still set up as a business as if I'm going to get my news the way I did in the 70s. And how are they going to convince me to do this? A paywall. The price for reading the article that's caught my eye is to give them my credit card and the right to charge me $10 per month for perpetuity. No. The answer is no. Always no. ",
            "created": "Tue, 16 Jun 2020 13:40:19 GMT"
        },
        {
            "text": "I wonder how many subscriptions the CEO of the Atlantic and Mother Jones have bought this way? ",
            "created": "Tue, 16 Jun 2020 14:14:02 GMT"
        },
        {
            "text": "I'd like to see a bar graph with online subscription revenue for the top 15 pubs. I imagine it looks something like this. ",
            "created": "Tue, 16 Jun 2020 13:54:38 GMT"
        },
        {
            "text": "Imaginary subscription revenue for top 15 pubs. ",
            "created": "Tue, 16 Jun 2020 14:07:59 GMT",
            "inlineImage": "http://scripting.com/images/2020/06/16/bargraph.png"
        },
        {
            "text": "If you're a person who thinks about business models of news, ask yourself, how many subscriptions can one reader afford? Feel good about? Feel like they aren't being ripped off by? For me the answers to the three questions are: 3, 0 and 0. ",
            "created": "Tue, 16 Jun 2020 13:41:17 GMT"
        },
        {
            "text": "I'm paying about $30 per month for this, and am not happy about it. In contrast I pay <i>$200</i> per month for TV. And I'm ready to spend more. But, get this, I spend a lot more time every day reading on the net. And I know the news orgs don't think very much of us readers, but I'm not reading crap, I'm learning, getting information about a lot of local stuff (despite the belief there is no local news, there is). And I can afford to pay much more than I am, I'm just waiting for some part of the news industry to wake up and realize it's not the 1970s anymore. ",
            "created": "Tue, 16 Jun 2020 14:23:30 GMT"
        },
        {
            "text": "Another thing I spend a lot more money on that might be closer to news is political campaigns. As Election Day approaches, I'm giving out $100 gifts to candidates to help save the world, the same way I would like to throw money at news orgs who help to \"save my life\". ",
            "created": "Tue, 16 Jun 2020 13:56:55 GMT"
        },
        {
            "text": "Subscriptions? I don't think so. I don't commit to vote for the governor or mayor beyond the next election. It sounds stupid to even put it that way. I'm sure the politicians would like that. And there are good arguments for it. But we get to choose again and again. And that's how I like it. It keeps them interested in communicating with me, maybe even slightly, to listen. ",
            "created": "Tue, 16 Jun 2020 14:25:02 GMT"
        },
        {
            "text": "I've read so many stories about how news orgs feel about their role, maybe it's time for the news orgs to try to find out how their readers see their roles? Basic business. Know the people who pay your bills and do things that delight them. Not much of that going on with news. Too much talking to be heard by other news people. I visualize it as two barbers passing the time cutting each others hair. ",
            "created": "Tue, 16 Jun 2020 13:58:39 GMT"
        },
        {
            "text": "BTW, I <a href=\"http://scripting.com/2020/05/29.html#a135626\">wrote</a> about the news experience I want back in May.  ",
            "created": "Tue, 16 Jun 2020 13:45:09 GMT"
        },
        {
            "text": "Thanks for listening. ",
            "created": "Tue, 16 Jun 2020 13:47:20 GMT"
        }
    ]
}