{
    "text": "Rebooting America",
    "created": "Fri, 26 Apr 2019 15:19:50 GMT",
    "type": "outline",
    "description": "All my life I've been waiting for a candidate to realize that although they're probably not going to win, there are things they can do to make things better right now, as a person with a powerful microphone, as a potential president. ",
    "subs": [
        {
            "text": "A while back I said <a href=\"http://scripting.com/2019/03/17/135334.html\">Biden should not</a> run. But he's running. It is what it is and it's even worse than it appears. I look at Joe's eyes and I see they are the eyes of a very old man. Black dots. This happened to the eyes of my grandparents as they got close to the end. Joe seems to be in good health, but the eyes. ",
            "created": "Fri, 26 Apr 2019 15:19:54 GMT",
            "image": "http://scripting.com/images/2019/04/26/uncleSameNewYorkerCover.png"
        },
        {
            "text": "There are tradeoffs with Joe. He's old. That means there's a lot to criticize, but it also means he has a time-tested idea of what America is. I know young people think they have experienced things we will never understand, and that's true, but it's also true a person of Biden's age has experienced things they will never know, except in history books, and they always tell the story of the winner, not the struggle and the choices that led to the outcome. ",
            "created": "Fri, 26 Apr 2019 15:21:01 GMT"
        },
        {
            "text": "It seems you'd want someone like Biden around during the campaign with a voice people listen to. I think every one of the Democrats who will not be the nominee must view it that way. A billion dollars will be raised during the primary. Think about the good you can do with that, in communicating important ideas, and achieving positive results for the Americans you hope to represent. All my life I've been waiting for a candidate to realize that although they're probably not going to win, there are things they can do to make things better right now, as a person with a powerful microphone, as a potential president. Maybe Biden is the one who gets that.",
            "created": "Fri, 26 Apr 2019 15:22:47 GMT"
        },
        {
            "text": "He's already said something that needs to be said and has put Trump on the defensive, re-stating his <a href=\"https://talkingpointsmemo.com/edblog/trump-doubles-down-on-very-fine-people\">Nazi-friendly</a> ideas. I think that's a good way to start. Call the Nazi a Nazi. And Trump certainly is that. But we got tired of HRC advertising only how awful Trump was -- we got it. How about some uplifty poetry to go with the negative bits. We want to feel we're part of a cause when we go into the voting booth.",
            "created": "Fri, 26 Apr 2019 15:24:45 GMT"
        },
        {
            "text": "I hope Biden remembers how he launched his campaign, and others follow suit. We're all trying to reboot America. Let's keep focused on that. ",
            "created": "Fri, 26 Apr 2019 15:26:10 GMT"
        }
    ]
}