{
    "text": "On this day in 2001",
    "created": "Wed, 11 Sep 2019 15:35:54 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I was up and blogging early <a href=\"http://scripting.com/2001/09/11.html\">on this day in 2001</a>. If you visit the site you'll find that many of the links are broken, so you might want to try the archive.org <a href=\"https://web.archive.org/web/20070118082215/http://scripting.com/2001/09/11.html\">version</a>. It's in reverse-chronologic order, so read from the bottom and scroll up. ",
            "created": "Wed, 11 Sep 2019 14:55:43 GMT"
        },
        {
            "text": "What the day was like for me. It started as a normal blogging and programming day. A link to an article on Wired. A plug for David Banks' book new book on Microsoft. And then the day started for real. ",
            "created": "Wed, 11 Sep 2019 15:01:57 GMT"
        },
        {
            "text": "At 6:15AM I got an email from Bill Seitz with a link to a webcam in the Empire State Building pointing south. The World Trade Center was in the middle of the picture, smoke was coming out of the side of one of the buildings. He said a plane had hit the building. I had no TV. Emails came from people in New York, some with pictures. People sent me links to stories via email (remember this was before RSS was supported by most news orgs). Digital cameras were just starting to catch on, readers in Brooklyn and in lower Manhattan, with clear views of the scene, sent pictures. ",
            "created": "Wed, 11 Sep 2019 15:07:37 GMT",
            "image": "http://scripting.com/images/2019/09/11/nineEleven.png",
            "collapse": "true",
            "subs": [
                {
                    "text": "I had no TV because I turned it off. I had become obsessed with cable news after the 2000 election. Didn't like it. I turned it back on later in 2001, when we started the war in Afghanistan.",
                    "created": "Wed, 11 Sep 2019 15:36:51 GMT"
                }
            ]
        },
        {
            "text": "News orgs in New York had been knocked out, I was safe in California, but I grew up in New York, so I knew the geography. And later we'd learn that my father, a professor at Pace University hadn't been heard from. My mother, a school psychologist was on a rooftop in Brooklyn. ",
            "created": "Wed, 11 Sep 2019 16:10:32 GMT"
        },
        {
            "text": "That day my blog served the function that <a href=\"https://twitter.com/davewiner/status/1171807703372587008\">Twitter</a> and Facebook play today. The biggest story in the world, before or since. Only as much as one person could absorb, only the questions that occurred to that person. ",
            "created": "Wed, 11 Sep 2019 15:06:22 GMT"
        }
    ]
}