{
    "text": "Leftovers finale",
    "created": "Mon, 05 Jun 2017 03:32:49 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Spoiler alert. I discuss the final episode of <a href=\"https://en.wikipedia.org/wiki/The_Leftovers_(TV_series)\">The Leftovers</a> which aired tonight on HBO, and also briefly mention the final episode of Mad Men.",
            "created": "Mon, 05 Jun 2017 03:32:55 GMT",
            "image": "http://scripting.com/images/2017/06/04/sweetPeaPackage.png",
            "permalink": "http://scripting.com/2017/06/04.html#a110655"
        },
        {
            "text": "Finales of HBO series are a Thing. Debated for years. And The Leftovers was such an unusual show, a big enigma, with a lot of sleight of hand it turns out, you had to wonder how they were going to wrap things up, with the plot of the whole three-season show so uncertain.",
            "created": "Mon, 05 Jun 2017 03:33:14 GMT",
            "permalink": "http://scripting.com/2017/06/04.html#a110614"
        },
        {
            "text": "It turns out that 1/2 of the plot was revealed in Episode One of Season One, and the other half wasn't revealed until the final minutes of the last episode. Inbetween? Haha. But they did it. It really does make sense in a science fiction way. If you accept the premise that 2 percent of the population could disappear in an instant, and if you watched the show all the way to the end you had to accept it, then you can certainly accept the resolution, the explanation of how it balances, the symmetry of it. They even showed you the symmetry, with Nora's story, the one character for whom it made sense to make a round trip.",
            "created": "Mon, 05 Jun 2017 03:40:58 GMT",
            "permalink": "http://scripting.com/2017/06/04.html#a110658"
        },
        {
            "text": "I love it. I love it because when the show was originally pitched, the symmetry must have been the whole pitch. Just like the <a href=\"https://en.wikipedia.org/wiki/Person_to_Person_(Mad_Men)\">punchline</a> of Mad Men was also for sure the pitch for the show. Yet I didn't see it coming in The Leftovers. In hindsight it seems so obvious. And I spent some time thinking about it. At least the 30 or so hours I've spent watching episodes. ",
            "created": "Mon, 05 Jun 2017 03:35:50 GMT",
            "permalink": "http://scripting.com/2017/06/04.html#a110650"
        },
        {
            "text": "The best punchline is the one you didn't see coming which then seems totally obvious. The Leftovers, for me at least, delivered.",
            "created": "Mon, 05 Jun 2017 03:51:49 GMT",
            "permalink": "http://scripting.com/2017/06/04.html#a110649"
        },
        {
            "text": "I also like that they began the last episode with the Season 2 theme song, <a href=\"https://www.youtube.com/watch?v=nlaoR5m4L80\">Let The Mystery Be</a> by Iris DeMent. What a great song, great performer. ",
            "created": "Mon, 05 Jun 2017 03:37:02 GMT",
            "permalink": "http://scripting.com/2017/06/04.html#a110602"
        }
    ],
    "permalink": "http://scripting.com/2017/06/04.html#a110649"
}