{
    "text": "About the Baseline theme",
    "created": "Wed, 14 May 2025 11:52:52 GMT",
    "type": "outline",
    "metaImage": "http://scripting.com/images/2025/05/14/bodega.png",
    "subs": [
        {
            "text": "Scott Hanson has been working on the <a href=\"https://wordland.shanson.de/2025/05/13/how-to-install-baseline/\">Baseline theme</a> and it's ready for people to try out. ",
            "created": "Tue, 13 May 2025 20:50:38 GMT",
            "flInCalendar": true
        },
        {
            "text": "An important caveat. This theme was designed to be the beginning theme for WordLand-authored WordPress sites. ",
            "created": "Tue, 13 May 2025 20:51:17 GMT",
            "flInCalendar": true
        },
        {
            "text": "The goal is to get the minimal features for a nice blog-oriented site running in WordPress. ",
            "created": "Tue, 13 May 2025 20:51:49 GMT",
            "flInCalendar": true
        },
        {
            "text": "It's open source, so you can start with Baseline and add all the features you want.",
            "created": "Tue, 13 May 2025 20:52:11 GMT",
            "flInCalendar": true
        },
        {
            "text": "And Scott has said he'd be happy to work with others to make it so that it would be great for presenting non-WordLand-authored writing. ",
            "created": "Tue, 13 May 2025 20:52:24 GMT",
            "flInCalendar": true
        },
        {
            "text": "As the developer of <a href=\"https://wordland.social/\">WordLand</a>, I wanted to go back to the beginning and take fresh a approach to the way blogs implement various features in 2025. It's been a long time since we took a fresh look, and lots has happened since. The market has grown by orders of magnitude, and new user interfaces have become widely used, especially with social media apps. WordLand itself has been heavily influenced by Facebook and Twitter, for example, even though blogging predates both. So of course the <i>presentation</i> of the blog has opportunities to evolve as well.",
            "created": "Tue, 13 May 2025 20:52:57 GMT",
            "flInCalendar": true
        },
        {
            "text": "The bottom-line -- if you already have a WordPress theme you're happy with, then stick with it, no need to use Baseline. But if you're starting a fresh site, using WordLand as your editor, and you value simplicity, then I recommend trying it, and if you like it, keep using it.",
            "created": "Tue, 13 May 2025 20:54:32 GMT",
            "flInCalendar": true
        },
        {
            "text": "BTW, I have it installed on <a href=\"https://daveverse.org/\">daveverse.org</a>, and I'm a happy camper. So we have one endorsement. It's a good start. :smile:",
            "created": "Tue, 13 May 2025 20:55:36 GMT",
            "flInCalendar": true
        },
        {
            "text": "PS: If you have comments or questions, here's a <a href=\"https://github.com/scripting/wordlandSupport/issues/88\">good place</a> to post them. ",
            "created": "Wed, 14 May 2025 12:10:45 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}