{
    "text": "Our podcaster reads the news",
    "created": "Fri, 12 Jul 2024 12:37:54 GMT",
    "type": "outline",
    "enclosure": "https://cyber.harvard.edu/blogs/gems/crimson1/coffeeNotesJuly12.mp3",
    "enclosureType": "audio/mpeg",
    "enclosureLength": "3310201",
    "link": "http://scripting.com/2004/07/12.html#When:9:29:59AM",
    "subs": [
        {
            "text": "My notes as I listen to the July 12, 2004 <a href=\"https://cyber.harvard.edu/blogs/gems/crimson1/coffeeNotesJuly12.mp3\">podcast</a> 20 years later.",
            "created": "Fri, 12 Jul 2024 12:51:07 GMT",
            "flInCalendar": true
        },
        {
            "text": "Oddpost bought by Yahoo. I talk about \"dynamic html apps\" which today we'd call web apps, I guess. Oddpost was kind of a miracle, done by the team that did <a href=\"https://chatgpt.com/share/f7a56fa8-7015-49ec-beda-f8b228cd6470\">HalfBrain</a>, a browser-based spreadsheet. Apparently Oddpost came out before GMail, which if I recall correctly came out around that time, maybe May 2004? I remember I was in St Augustine when it came out. I still use that GMail account all the time for basically everything. ",
            "created": "Fri, 12 Jul 2024 12:38:05 GMT",
            "flInCalendar": true
        },
        {
            "text": "RSS 2.0 namespaces aren't evolving as I hoped they would, but Movable Type did a great job in helping the format coalesce, thanking them for that. ",
            "created": "Fri, 12 Jul 2024 12:41:26 GMT",
            "flInCalendar": true
        },
        {
            "text": "Daniel Berlinger wants to know why he should vote for Kerry. I never get around to saying why he should vote for Kerry. I didn't handle this well. I think we had the same animosity that doesn't serve us, not even talking to people who support the other candidate. ",
            "created": "Fri, 12 Jul 2024 12:42:22 GMT",
            "flInCalendar": true
        },
        {
            "text": "As in the previous podcast, I'm not sure I like what I'm saying here. But I agree with 2004 Dave's decision this time not to vote for Bush and be an enthusiastic supporter of the Democrat. I wonder if my podcasts of 2024 sound any different.",
            "created": "Fri, 12 Jul 2024 12:45:36 GMT",
            "flInCalendar": true
        },
        {
            "text": "Iraq was the big issue in 2004. We started an unprovoked war. Kind of like what Russia is doing in Ukraine, today, btw. ",
            "created": "Fri, 12 Jul 2024 12:46:19 GMT",
            "flInCalendar": true
        },
        {
            "text": "Again, it's interesting to listen to myself speaking in words that sound like me, saying things today's me thinks are naive. And in fact almost by definition they are. The world we live in today didn't exist in 2004. ",
            "created": "Fri, 12 Jul 2024 12:47:03 GMT",
            "flInCalendar": true
        },
        {
            "text": "I wish I knew where I was on this day, I can hear cars driving by. But I'm sure I'm not driving. Is it NY? No clue. ",
            "created": "Fri, 12 Jul 2024 12:48:47 GMT",
            "flInCalendar": true
        },
        {
            "text": "The <a href=\"http://scripting.com/2004/07/12.html\">Scripting News archive</a> for the day. ",
            "created": "Fri, 12 Jul 2024 12:48:02 GMT",
            "flInCalendar": true
        },
        {
            "text": "PS: It is in NYC! Right at the end of the podcast. It was 9:02AM. Pretty close to the current time today 20 years later. ",
            "created": "Fri, 12 Jul 2024 12:50:56 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}