{
    "text": "Home exercise in winter",
    "created": "Thu, 12 Nov 2020 21:37:08 GMT",
    "type": "outline",
    "description": "I'd like to start riding daily asap.",
    "subs": [
        {
            "text": "I have plenty of ways to get exercise in the summer, but winter has been a challenge. I don't like riding a stationary bike, I tried mounting my street bike on a Zwift device, and yuk, I didn't like the simulated racing, I don't ride competitively. And the street scenes were primitive. Unlike my regular real-world rides I always was impatient for the exercise to be over. When I'm riding outdoors, I feel very differently.",
            "created": "Thu, 12 Nov 2020 21:37:15 GMT",
            "image": "http://scripting.com/images/2020/11/12/bowflex.png",
            "flInCalendar": true
        },
        {
            "text": "A friend suggested getting a rowing machine, and somehow that seemed better. But when I looked into the devices I started feeling it might be the same. ",
            "created": "Thu, 12 Nov 2020 21:39:03 GMT",
            "flInCalendar": true
        },
        {
            "text": "We just had five unusual warm November days, I rode all of them, outdoors, and was thinking that the difference may be the feel of the ride. Real bike rides you almost never are straight up and down. You lean one way then another, and shift your weight to different sides. Maybe that's the diff. Then I saw an ad for <a href=\"https://www.bowflex.com/bikes/velocore.html/\">this Bowflex bike</a> that leans! It looks in the <a href=\"https://www.youtube.com/watch?v=9DseC78ShNc\">video</a> like it may be more fun to ride. ",
            "created": "Thu, 12 Nov 2020 21:39:29 GMT",
            "flInCalendar": true
        },
        {
            "text": "I posted a bit about this <a href=\"https://twitter.com/davewiner/status/1326968117579436037\">on Twitter</a>. Megan McCarthy sent a <a href=\"https://twitter.com/Megan/status/1326968332717789196\">pointer</a> to a review of the <a href=\"https://www.reviewed.com/health/best-right-now/best-stationary-exercise-bikes\">category</a> and a <a href=\"https://www.reviewed.com/health/features/echelon-review-cheaper-spin-bike-good-peloton\">specific bike</a> I asked about. I might get a Peloton, but it seems I might not have it until January. I'd like to start riding daily asap. But I'm concerned I'm going to spend a lot more money and still not have something I want to use. ",
            "created": "Thu, 12 Nov 2020 21:40:48 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}