{
    "created": "2024-11-01T04:00:00.000Z",
    "flInCalendar": true,
    "name": "01",
    "path": "2024/11/01",
    "text": "November 01",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Unfortunately the only place you can read this <a href=\"https://www.facebook.com/dan.conover.714/posts/pfbid0VqEwJyLQQ7Qyhu9Zoz6ivz35APRfvLMKp7wBZvR2pDRTVdLwf1QR8Xh646faRJ1Zl\">Dan Conover piece</a> is on Facebook about the failure of the NY Times and Washington Post to adequately defend democracy. He says something I had not seen elsewhere. \"We're not talking about HuffPo or Salon here. We're talking about the last two 'unique nationals' standing in American print journalism. Institutions with long and storied histories. Both took the same test at the same time, and both failed it.\" I'd add that all other journalism usually follows their lead, but that may be finally changing. ",
            "created": "Fri, 01 Nov 2024 13:43:58 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Meanwhile, it's amazing that both CNN and MSNBC have gotten serious about covering the reality of Trump 2.0 after being very unserious for the last year. It's as if after rejecting Joe Biden, months later they realized they rejected the wrong guy.",
            "created": "Fri, 01 Nov 2024 13:46:07 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "We now understand that the Republicans derive their power through division, setting groups against each other. We think the Democrats are the opposite, they are inclusive, everyone is welcome there. But that's not true. This <a href=\"https://www.npr.org/2024/11/01/nx-s1-5154873/what-explains-the-big-gender-gap-between-supporters-of-trump-and-harris\">NPR piece</a> touches on it, gingerly, because it's the third rail in non-Republican politics. Because it's one of the divisions that's maintained by people who are mostly Democrats. If you want to know if you're part of the problem, measure your own feelings when you find out what it's about. And then listen, carefully to the words. It might be hard to hear because I think most people who do this don't think they do, or they're justified in doing it. They don't want to look here. But the pragmatic reason to focus on this is that in future elections, assuming we have them, if we can make an effort to not do this, we could get enough Republican votes to switch to make real change possible. They might even become our most vocal supporters. Winning in politics is done by focusing on common interests over division. ",
            "created": "Fri, 01 Nov 2024 13:22:02 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2023/04/17/asGoodAsItGets.png",
            "flInCalendar": true
        },
        {
            "text": "The monthly archive <a href=\"https://github.com/scripting/Scripting-News/blob/master/blog/opml/2024/10.opml\">for October</a> has been saved. By the end of this month we'll know a lot more than we know now.",
            "created": "Fri, 01 Nov 2024 13:18:36 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}