{
    "created": "2024-11-14T05:00:00.000Z",
    "flInCalendar": true,
    "name": "14",
    "path": "2024/11/14",
    "text": "November 14",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Today's song: <a href=\"https://www.youtube.com/watch?v=dKMCz1b2RxE\">Who's this kinky so and so</a>. ",
            "created": "Thu, 14 Nov 2024 14:57:54 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "A few days ago I saw <a href=\"https://en.wikipedia.org/wiki/Donald_Fagen\">Donald Fagen</a> at a local supermarket. I had heard he lives in the area. I didn't bother him, I imagine a star like that enjoys moments as an ordinary person, but he's anything but. I'm listening to <a href=\"https://www.youtube.com/watch?v=dKMCz1b2RxE\">Haitian Divorce</a> this morning, grinning from ear to ear as I sing along. ",
            "created": "Thu, 14 Nov 2024 14:58:34 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2022/10/31/camel.png",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"http://scripting.com/2023/11/14.html#a144157\">Last year on this day</a>: We have too many modes of writing. I just wrote a blog post that's also a tweet. Why didn't it go to my followers on all the social nets I'm on? Why do I have to use a different editor to post to each of the services? That's the point of Textcasting, btw.",
            "created": "Thu, 14 Nov 2024 14:48:14 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "We're going to open testing for \"WordLand\" shortly. At first I only want developers who write great bug reports. My goal is to speed up development and reduce wear and tear on me. Once we're confident it really works as advertised, we'll open up the testing further. There will be a form you can fill out to get in the queue. The choice of the first testers will be highly subjective. ",
            "created": "Thu, 14 Nov 2024 14:49:12 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "BTW, start thinking of WordPress as a highly networked, deployed, debugged, widely supported <b>network operating system</b>. It meets all the criteria. It also has storage. And can publish. And unlike other social web systems, it is textcasting-ready since it comes from the world of blogging where we competed to give writers the features they needed. We can build lots of apps on this foundation.",
            "created": "Thu, 14 Nov 2024 15:12:03 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I've been having a one-sided discussion with Bluesky asking they make their product less vulnerable to takeover by tech bros, and I can't tell if they're doing anything about it. They must be conflicted, on the one hand, they clearly could sell there service now for a lot of money, but when they do that they must know they're selling us out.",
            "created": "Thu, 14 Nov 2024 16:36:40 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}