{
    "created": "2024-11-24T05:00:00.000Z",
    "flInCalendar": true,
    "name": "24",
    "path": "2024/11/24",
    "text": "November 24",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Imagine if the Democratic Party ran a Bluesky clone where being able to post means you're a dues-paying member of the party. We can vote on referendums, support or not support Democratic initiatives. Site would never shut down, and would support campaigns when they're running. It would cost money to belong to the site. This would keep trolling under control, and would fund projects the community would sponsor, and also pay for operating the service. No advertising, no billionaires sponsoring. They can be members like everyone else.",
            "created": "Sun, 24 Nov 2024 14:36:46 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2024/07/03/smallerPatrioticKitty.png",
            "flInCalendar": true
        },
        {
            "text": "If such a network existed, we would be nominating our own Cabinet members, the shadow Cabinet. Let the journalists compare the qualifications of our candidates vs the incumbent party's. Create news. That's what the Dems absolutely suck at. They very quietly pass legislation that the other party (which votes against) takes credit for. One party is on the air, the other is not. We need to change that. We make news. And we listen to each other, not just the stuffed shirts who run the party now. ",
            "created": "Sun, 24 Nov 2024 14:41:28 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "If there was going to be a <a href=\"https://bsky.app/profile/did:plc:oety7qbfx7x6exn2ytrwikmr/post/3lbparflnes2e\">User's Charter for Bluesky</a>, item one would be: You can give me the benefit of the doubt. Let's not argue, esp not about details. We assume the other person is smart. That's one way we get stuff done.  ",
            "created": "Sun, 24 Nov 2024 14:44:38 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Rule #2. You have permission. If you want someone else to do something, and they haven't done it, or you don't want to wait, you have permission to do it yourself. You can invoke this rule when someone says \"who do they think they are.\" You had permission, according to rule #2.",
            "created": "Sun, 24 Nov 2024 14:52:50 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "One of the best things about ChatGPT is that you can ask it to put together exactly the report you want, that the news orgs aren't writing, or you can't find, or get to through paywalls. In <a href=\"https://chatgpt.com/share/67435186-f804-8012-a29c-4d5ecce996f9\">this query</a>, I learned about how Republicans deal with intersex people and bathrooms, they apparently don't. Not surprising, to tell the truth.",
            "created": "Sun, 24 Nov 2024 16:18:57 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}