{
    "text": "The Bose speaker review",
    "created": "Wed, 18 May 2022 13:04:08 GMT",
    "type": "outline",
    "description": "A buggy product that doesn't work for its intended purpose, and it's way too expensive.",
    "subs": [
        {
            "text": "I've been buying smart battery-powered Bluetooth speakers almost since they first came out, starting with the <a href=\"https://www.amazon.com/gp/product/B00G3SNCGM/ref=ppx_yo_dt_b_search_asin_title?ie=UTF8&psc=1\">Beats Pill</a>, which I had mounted on the handlebars of the bike I rode in Manhattan. Lots of people asked what it was, and where could they get one. Since then I've bought speakers from <a href=\"https://www.amazon.com/gp/product/B01MSYQWNY/ref=ppx_yo_dt_b_search_asin_title?ie=UTF8&th=1\">JBL</a>, <a href=\"https://www.amazon.com/gp/product/B07VSPPQXC/ref=ppx_yo_dt_b_search_asin_title?ie=UTF8&th=1\">Tribit</a>, <a href=\"https://www.amazon.com/gp/product/B01FFV59PY/ref=ppx_yo_dt_b_search_asin_title?ie=UTF8&th=1\">Ultimate Ears</a>, and others. None of them cost more than $100. My favorite so far is the Tribit, it's tiny, has a huge sound, and it's got a great feel in the hand.",
            "created": "Wed, 18 May 2022 13:11:18 GMT",
            "image": "http://scripting.com/images/2022/05/18/boseSpeaker.png",
            "imageLink": "https://www.amazon.com/Bose-Speaker-Amazon-Alexa-Built/dp/B07Q337VV3?th=1",
            "flInCalendar": true
        },
        {
            "text": "Then the other day I figured out what I wanted for summer outdoor lounging -- a battery-powered speaker that had Alexa built in. So I did a little shopping, found there aren't many, and they're all really expensive. I asked for advice <a href=\"https://twitter.com/davewiner/status/1524533392901083136\">on Twitter</a>, and decided to blow some money, ordering a $400 <a href=\"https://www.amazon.com/gp/product/B07VFKBQ3K/ref=ppx_yo_dt_b_search_asin_title?ie=UTF8&th=1\">Bose speaker</a>. The reviews were stunning. I had a hard time imagining how the sound could be that great, compared to how great the much cheaper models were, but I had to find out. They offered free returns. So all I was risking was a little time. ",
            "created": "Wed, 18 May 2022 13:23:23 GMT",
            "flInCalendar": true
        },
        {
            "text": "Here's the top line. It was a huge disappointment in every way. ",
            "created": "Wed, 18 May 2022 13:11:32 GMT",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "I had to download their app just to turn it on, and then I had to create an account on their service. I also had to check off their agreement, which of course I didn't read. So right off the bat, before it even says anything to me, I hate it.",
                    "created": "Wed, 18 May 2022 13:11:47 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Then it takes ten minutes to download the updated system software. ",
                    "created": "Wed, 18 May 2022 13:12:35 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "To use Alexa, I had to go through another signon process which required me to remember the password I used for their system, which very luckily I did (I didn't try, I never plan on using that service again). ",
                    "created": "Wed, 18 May 2022 13:12:45 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Okay now finally, I say \"Alexa WNYC,\" our local NPR station. Nothing happens. Then the speaker upstairs starts playing WNYC. I yell ALEXA STOP upstairs. No good. So I go upstairs and tell it again to stop, and again it doesn't. So I pull the plug. Then I hear the Alexa in the bedroom is doing the same thing. I go in there and pull the plug. Go back downstairs. The Bose speaker is doing nothing. Okay I take a deep breath and try it again. \"Alexa WNYC.\" Exactly the same thing happens. So I go upstairs again, pull the plugs on the speakers, this time, leave them unplugged, go back downstairs and try again. \"Alexa WNYC.\" Nothing. I figure I'll try it again later.",
                    "created": "Wed, 18 May 2022 13:13:37 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I'm not done with the flaws of the product, but I want to pause here for a moment. I'm accustomed to setting up Alexas by plugging them in, waiting a few seconds while it boots up, then it looks around and somehow finds one of the other Alexas and asks if it's okay if it uses the data on it to configure this one. I always smile at this point, man that's good design, and I say YES of course, and in a few seconds I'm listening to NPR. The process involves no work beyond plugging it in and giving my consent. I imagine it needs to download updated system software, but wisely waits until late at night to do it. Why make the human wait while the robot does its housekeeping?",
                    "created": "Wed, 18 May 2022 13:16:19 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Okay the next day I figure enough with Alexa, let's see how this is as a speaker. So I press the Bluetooth button on top of the speaker, and I connect my iPhone in the normal way for Bluetooth. Then I play an old McCartney song. It sounds like any of the other speakers I have. I hit pause and start playing another song, and it never plays. I hit pause and play again, and it plays for a few seconds then freezes. I repeat the pause-play thing again and again, that's it -- it never plays another bit of music. ",
                    "created": "Wed, 18 May 2022 13:18:24 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Conclusion: This is a piece of shit product. Maybe the Alexa problems are really Amazon problems, but if so, I can't believe they shipped the thing in this condition. But Bluetooth is mature technology. I've never had a problem with Bluetooth on any of the other speakers. ",
            "created": "Wed, 18 May 2022 13:20:43 GMT",
            "flInCalendar": true
        },
        {
            "text": "And there's no way this product is worth $400. Even if it worked it wouldn't be worth any more than $100, and probably a lot less because the idea is this is supposed to be a portable product and it's much less portable than the $43 <a href=\"https://www.amazon.com/gp/product/B07VSPPQXC/ref=ppx_yo_dt_b_search_asin_title?ie=UTF8&th=1\">Tribit</a>, and honestly -- if it sounds better, I couldn't tell the difference. ",
            "created": "Wed, 18 May 2022 13:21:32 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}