{
    "text": "What I've learned about WordPress",
    "created": "Wed, 22 Nov 2023 13:57:55 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Thinking about <a href=\"https://wordpress.com/\">WordPress</a> this morning, APIs and feeds.",
            "created": "Wed, 22 Nov 2023 13:58:01 GMT",
            "flInCalendar": true
        },
        {
            "text": "This last year I’ve caught up with WordPress, have been asking questions, and one of the best thing about <a href=\"http://scripting.com/2023/11/12.html#a142810\">my work with Automattic</a> is that the doors have been open. I have great teachers who are encouraging me, and of course are experts in and proud of WordPress, and as a result I think \"FeedLand\" and <a href=\"https://wordpress.com/\">WordPress</a> are going to work together in some very nice ways. Getting pretty close on some of it.",
            "created": "Wed, 22 Nov 2023 13:58:08 GMT",
            "image": "https://imgs.scripting.com/2023/04/24/cheshireCat.png",
            "flInCalendar": true
        },
        {
            "text": "A year ago I didn’t even know that WordPress still had APIs. At some point the code I had that worked with WordPress via the <a href=\"http://xmlrpc.com/metaweblog\">MetaWeblog API</a> broke, and I assumed that it was the end of the line, and took the feature out of my linkblogging tool. But I was wrong. And not only that there was <a href=\"https://developer.wordpress.com/calypso/\">Calypso</a>, a modern REST interface, that works in the same model I use for FeedLand and \"Drummer\". It’s all there. I love it. All kinds of integrations will be possible. ",
            "created": "Wed, 22 Nov 2023 13:58:42 GMT",
            "flInCalendar": true
        },
        {
            "text": "Getting FeedLand to work in the new environment has been a step by step process. It was built to run on a <a href=\"https://www.digitalocean.com/\">Digital Ocean</a> server, with a file system. I’ve converted now all the pieces we needed, and it seems finally to run smoothly.",
            "created": "Wed, 22 Nov 2023 14:04:50 GMT",
            "flInCalendar": true
        },
        {
            "text": "Onward! ",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}