{
    "text": "My pitch to Josh",
    "created": "Mon, 19 Jun 2017 16:06:29 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I became a prime member of TPM, to support <a href=\"https://en.wikipedia.org/wiki/Josh_Marshall\">Josh Marshall</a> who has been kicking ass the last couple of years, and maybe longer. I just started paying close attention as Trump was coming to power. Anyway, now I have a problem. If I read an article that's only available to Prime members that I feel everyone should read wtf am I going to do. I have the same problem with the NYT, where I pay for my subscription. I'll probably complain!  :smile_cat: ",
            "created": "Mon, 19 Jun 2017 16:03:25 GMT",
            "type": "outline",
            "image": "http://static.scripting.com/larryKing/images/2013/10/28/pitcher.gif",
            "permalink": "http://scripting.com/2017/06/19.html#a120625"
        },
        {
            "text": "Anyway, to Josh, you have a connection with readers, that's great, but imho you can and should imho go further. <i>I think there's a middle-ground between the social nets and pubs like TPM.</i> Your business can grow into theirs. Quality is what matters. Which of your readers you give a mike to should be the result of your knowing them. It may increase the pressure on yourself, but it's a good pressure, imho.",
            "created": "Mon, 19 Jun 2017 16:06:42 GMT",
            "permalink": "http://scripting.com/2017/06/19.html#a120642"
        },
        {
            "text": "I did something similar just before we first met, when I went east after booting up the blogosphere in the Bay Area. I wanted to recruit more intellectual writing. So I went where the intellectuals live. I didn't get them, at first, but I got something better -- political bloggers, like Josh Marshall and of course many others.",
            "created": "Mon, 19 Jun 2017 16:07:49 GMT",
            "permalink": "http://scripting.com/2017/06/19.html#a120649"
        },
        {
            "text": "We need to grow again. We've let the social nets usurp the good that bloggers were doing. Someone has to find the new voices with fresh perspectives. It isn't so much stopping fake news as <a href=\"http://www.wordnik.com/words/eclipse\">eclipsing</a> it with excellent thinking, insight, humor, connections.",
            "created": "Mon, 19 Jun 2017 16:08:46 GMT",
            "permalink": "http://scripting.com/2017/06/19.html#a120646"
        },
        {
            "text": "It happened in tech in the early 90s. Supposedly it was all over. Nothing but domination by the BigCo's from here. Until something surprising developed that completely flipped around the partnership between big media and big tech. We're still feeling the <a href=\"https://www.whitehouse.gov/administration/president-trump\">aftershocks</a> of that upheaval.",
            "created": "Mon, 19 Jun 2017 16:12:08 GMT",
            "permalink": "http://scripting.com/2017/06/19.html#a120608"
        }
    ],
    "permalink": "http://scripting.com/2017/06/19.html#a120629"
}