{
    "text": "The best condolence note",
    "created": "Sat, 24 Mar 2018 14:42:46 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Since my mother's recent <a href=\"http://scripting.com/2018/02/11/152545.html\">death</a>, I've received many notes of condolence. All very very much appreciated. We all have to send messages of sympathy from time to time. I often find it awkward. Do I say I know what they're going through? In some sense I think I do, but I'm sure I don't, and would it be comforting? I don't think so.",
            "created": "Sat, 24 Mar 2018 14:43:57 GMT"
        },
        {
            "text": "When people say \"It's tough,\" or talk about what you're \"going through\" that makes me want to object. I don't think it's tough, that's not the word I'd use. There are silver linings. New freedom. And expressing sadness is just sad, it's not tough. It's the easiest thing in the world. And is \"going through\" the right term? That assumes there's an end. There isn't always an end. And at the outset it doesn't at all feel like there is. ",
            "created": "Sat, 24 Mar 2018 14:45:46 GMT"
        },
        {
            "text": "An example, from an anonymous sender (not wanting to embarrass them).",
            "created": "Sat, 24 Mar 2018 14:42:58 GMT",
            "subs": [
                {
                    "text": "Just caught up with the news and wanted to express my condolences.",
                    "created": "Sat, 24 Mar 2018 14:43:33 GMT"
                },
                {
                    "text": "She sounds like a great lady."
                },
                {
                    "text": "And good to know that she wasn’t too intimidated by her very smart son."
                },
                {
                    "text": "May she rest in peace.",
                    "created": "Sat, 24 Mar 2018 14:43:48 GMT"
                },
                {
                    "text": "And may you continue to provide optimism, criticism and horse sense in your customary generous quantities."
                }
            ]
        },
        {
            "text": "What' so great about about the example?",
            "created": "Sat, 24 Mar 2018 14:47:08 GMT",
            "subs": [
                {
                    "text": "How to express condolences? Just that way. \"I want to express my condolences.\" ",
                    "created": "Sat, 24 Mar 2018 14:47:22 GMT"
                },
                {
                    "text": "Say something positive about the departed. ",
                    "created": "Sat, 24 Mar 2018 14:47:43 GMT"
                },
                {
                    "text": "Say something kind about the relationship between the departed and the person you're writing to, even if you didn't know the departed.",
                    "created": "Sat, 24 Mar 2018 14:47:57 GMT"
                },
                {
                    "text": "Offer a little closure, and then talk about the bright future, in terms of the qualities of the person you're writing to. ",
                    "created": "Sat, 24 Mar 2018 14:48:25 GMT"
                }
            ]
        },
        {
            "text": "I just wanted to write this up, as a writer, who appreciates effective writing, and as a son who isn't going through something that is bittersweet and full of meaning, and is anything but tough.",
            "created": "Sat, 24 Mar 2018 14:48:55 GMT"
        }
    ]
}