{
    "text": "Interesting <a href=\"https://prodromou.pub/@evan/110045336289311841\">thread</a> by <a href=\"https://en.wikipedia.org/wiki/Evan_Prodromou\">Evan Prodromou</a>, one of the originators of <a href=\"https://en.wikipedia.org/wiki/ActivityPub\">ActivityPub</a>. He says basically everyone should get behind it and stop inventing new formats and protocols for federated social web apps. Without any judgment, it seems to me that ActivityPub should have started with RSS 2.0, building whatever new features they needed on top of it. But they didn't. I don't know why. We were going down that path, but then one day I saw that all the people I was collaborating with were meeting with Google and out of that came a completely incompatible protocol, which I believe became ActivityPub. Not sure, because they seemed more interested in reinventing what already worked than trying to build as much <a href=\"http://scripting.com/2021/12/16/153331.html?title=myProductIsInterop\">interop</a> as possible. I really mean \"no judgment\" -- because this seems to happen in tech all the time. It's the knee-jerk reaction. Young people wanting to make a name for themselves, don't have a new idea, so they pretend that what already exists doesn't. Let the <a href=\"http://scripting.com/2023/07/19.html\">journalists</a> figure it out. Anyway, I think it's inevitable that there will be more protocols. There already are. So what will be needed is the <a href=\"http://scripting.com/2023/05/04/142200.html\">analog of the internet</a>, which bridged the differences between incompatible networks. I think at this point that's the best we can hope for. And in that spirit I offer the <a href=\"http://xmlrpc.com/metaweblog\">MetaWeblog API</a> which did that for blogs. Maybe for once we won't have to start over from scratch. I doubt it, but hope is still possible. ",
    "created": "Thu, 20 Jul 2023 11:06:08 GMT",
    "type": "outline",
    "image": "https://imgs.scripting.com/2022/03/02/roomFreshener.png",
    "flInCalendar": true
}