{
    "text": "A tale of many lives",
    "created": "Mon, 24 Jan 2022 15:15:21 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "The Anderson family of the Pacific Northwest, friends who I met through the late <a href=\"http://daytona.scripting.com/?q=craig%20cline&collection=scriptingnews\">Craig Cline</a>, one of the <a href=\"http://scripting.com/2006/09/06.html#myCraigClineStory\">finest</a> people I ever knew in tech, runs a conference called <a href=\"https://www.futureinreview.com/\">Future In Review</a>. It's a catchy title, because it's about the future, as you can tell, but from the point of view of the past? What! Hello. My brain explodes. Anyway what made me think of it is how nice it is to have younger friends, personal friends, who tell me about what's going on in their lives, so I can review their future from the point of view of my own past. ",
            "created": "Mon, 24 Jan 2022 15:10:15 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/07/21/giannis.png",
            "flInCalendar": true
        },
        {
            "text": "Of course not everything I've learned in my 66 years applies to the life of a 28 year-old of the opposite gender, but it's actually amazing how much does. Especially if that young person has been studying herself and listening and trying to figure out what's going on through the haze of what the various voices inside her are telling her. ",
            "created": "Mon, 24 Jan 2022 15:25:15 GMT",
            "flInCalendar": true
        },
        {
            "text": "I told my 28-year-old friend, who also happens to be a relative, that I'm still learning from relationships I had when I was roughly her age. For example, being a programmer, my various girlfriends who loved me, no doubt, had generally negative feelings about the time I spent \"staring at the computer\" (how it must have looked to them). We had the same problem at <a href=\"http://daytona.scripting.com/?q=Living%20Videotext&collection=scriptingnews\">Living Videotext</a>, a software company, whose existence depended on the production of those programmers. The sales people didn't understand that interrupting a programmer in the middle of their day to join to a meeting could destroy their work for the day. But it could. Often did. So much that I eventually opened another <a href=\"https://www.google.com/maps/@37.3905039,-122.0809571,3a,75y,282.14h,107.96t/data=!3m7!1e1!3m5!1saRFB17_pQ4PhvzoHfadE8A!2e0!6shttps:%2F%2Fstreetviewpixels-pa.googleapis.com%2Fv1%2Fthumbnail%3Fpanoid%3DaRFB17_pQ4PhvzoHfadE8A%26cb_client%3Dmaps_sv.tactile.gps%26w%3D203%26h%3D100%26yaw%3D97.63002%26pitch%3D0%26thumbfov%3D100!7i16384!8i8192\">office</a>, just for programmers, so they could finish a days' work without interruption from people who had jobs that could endure random interruptions. ",
            "created": "Mon, 24 Jan 2022 15:15:42 GMT",
            "flInCalendar": true
        },
        {
            "text": "I wonder if it's any better today, roughly 40 years since I was 28. Try to imagine being a writer whose partner didn't like to read, or didn't enjoy their partner's writing. Why torture yourself. Why not hook up with someone who loved reading what you wrote? Similarly, if you're a programmer, why not hook up with someone who loves using your software and thinks it's a miracle that their own wants are reflected in your \"staring at the computer\" efforts?  ",
            "created": "Mon, 24 Jan 2022 15:20:18 GMT",
            "flInCalendar": true
        },
        {
            "text": "I'm reminded of one of the greatest lines in any movie ever. At the end of <a href=\"http://daytona.scripting.com/?q=As%20Good%20As%20It%20Gets&collection=scriptingnews\">As Good As It Gets</a>, Helen Hunt's mother, after Hunt exclaims \"Why can't I just have a normal boyfriend. Why? Just a regular boyfriend who doesn't go nuts on me!\" says in a soft voice from off-stage, \"Everybody wants that dear. It doesn't exist.\" One of the most liberating and at the same time saddest <a href=\"https://clip.cafe/as-good-it-gets-1997/why-cant-i-have-a-normal-boyfriend/\">movie lines</a> ever. A great <a href=\"https://www.metacritic.com/movie/as-good-as-it-gets\">movie</a>, btw. I think only a certain kind of person loves it. I am one of them. Maybe you should marry someone who thinks the same movies are great? I wish I knew.",
            "created": "Mon, 24 Jan 2022 15:22:14 GMT",
            "flInCalendar": true
        },
        {
            "text": "\"curly\"",
            "created": "Mon, 24 Jan 2022 15:48:48 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}