{
    "text": "One reason I miss Frontier",
    "created": "Mon, 09 Oct 2023 13:59:22 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Quick note -- I'm working on a deep database feature in \"FeedLand\", adding support for <a href=\"https://www.google.com/search?q=site%3Ascripting.com+%22reading+lists%22\">reading lists</a>. Deep in the sense that it's under several layers of user interface. It's like digging up the foundation of a house and figuring out how to add a new room on the third floor. It's something of a high wire act, but I honestly think I figured it out. ",
            "created": "Mon, 09 Oct 2023 13:59:26 GMT",
            "image": "https://imgs.scripting.com/2019/12/26/frontier.png",
            "flInCalendar": true
        },
        {
            "text": "It's far from the first time I've implemented reading lists, I've done it before with simpler apps in JavaScript, and richer apps many years ago, in \"Frontier\".",
            "created": "Mon, 09 Oct 2023 13:59:49 GMT",
            "flInCalendar": true
        },
        {
            "text": "This time it's in JavaScript and MySQL, and thus is, in one way, fairly compariable to UserTalk and Frontier's object database. But we didn't have the SQL querying capability in Frontier, so it's not comparable in that way. What we're doing now in FeedLand would not have been possible in Frontier.",
            "created": "Mon, 09 Oct 2023 14:00:08 GMT",
            "flInCalendar": true
        },
        {
            "text": "To implement this feature in MySQL I needed two tables to the database, one for reading lists, and the other for reading list subscriptions. This part is very easy. Not necessary in Frontier's object database because the structure is ad hoc, like JavaScript objects are ad hoc. You could store relational database tables in a JS object, but there would be nothing to prevent you from breaking the rules in some or all of the \"records.\"",
            "created": "Mon, 09 Oct 2023 14:01:18 GMT",
            "flInCalendar": true
        },
        {
            "text": "Where it gets complicated is the code to access the database, and use the reading lists while everything is running. The Frontier code to implement the structures would also be simple, and easy to debug. It's just straight line code, with if's and else's. The runtime takes care of suspending your thread when you need to wait for a result, it does not show up in the syntax of the language. The Frontier programming language also has an intimate relationship with its database, whereas in JavaScript and MySQL there are layers of levels between the JS stack and the database. There really don't need to be any layers at all, that's what Frontier proves. ",
            "created": "Mon, 09 Oct 2023 14:03:12 GMT",
            "flInCalendar": true
        },
        {
            "text": "It took me years to dig out from under all the layers and gruntwork that's here that wasn't in Frontier to figure out what exactly the difference was.",
            "created": "Mon, 09 Oct 2023 14:05:16 GMT",
            "flInCalendar": true
        },
        {
            "text": "And since I designed Frontier, this is self-praise, for which I apologize, but let me share with you the secret that makes Frontier so much better. For years in development I factored and refactored every time I came up with a simpler way to do something. I had been programming for a decade when I started Frontier, and had used some great highly factored tools before -- specifically Unix and THINK C, and I understood the process, having done it with commercial Mac, IBM and Apple II end-user products. I treated every aspect of development as you would treat the user experience of end-user software. And since you are an intimately involved user, there's a huge advantage here. I just had the time, and took the time to do the factoring that so far no one else has taken. At least to my knowledge and that's a big caveat because we don't generally use each others' platforms in tech, unlike other arts and sciences, we tend to live in and create our own caves. But Frontier was a product at one point, with several thousand people working in it, and most of them understand what I'm talking about here .",
            "created": "Mon, 09 Oct 2023 14:05:46 GMT",
            "flInCalendar": true
        },
        {
            "text": "PS: I asked ChatGPT for <a href=\"https://chat.openai.com/share/105ed538-237d-4e52-862e-a876ffb2575e\">five distinguishing features</a> of Frontier.",
            "created": "Mon, 09 Oct 2023 17:18:07 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}