{
    "text": "Facebook isn't the answer for news on the web",
    "created": "Thu, 12 Apr 2018 15:58:38 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Journalists say it's time for Facebook to endow journalism. I think that's a really bad idea.",
            "created": "Thu, 12 Apr 2018 16:08:45 GMT",
            "flNumberedSubs": "true",
            "subs": [
                {
                    "text": "Journalism has to compete with tech, not be supported by tech. The best of both. It's way too early to surrender. That's what asking for a handout is. ",
                    "created": "Thu, 12 Apr 2018 15:58:51 GMT"
                },
                {
                    "text": "The best product in journalism and tech has yet to be created. It won't be if journalism is married to Facebook. How can Facebook's competitors emerge in this environment? They can't.",
                    "created": "Thu, 12 Apr 2018 15:59:16 GMT"
                },
                {
                    "text": "I want journalism to listen much better. For example, the story of Facebook and Cambridge Analytica could have been reported <i>eight years ago.</i> Any number of independent technologists could have helped journalists develop this story. But they don't answer the calls. What incentive will journalism have to change if the bills are being paid by Facebook? They're already too impressed with huge tech companies.",
                    "created": "Thu, 12 Apr 2018 16:00:26 GMT"
                },
                {
                    "text": "I want to compete with Facebook. All people with ideas in news and software should be able to. Senator Lindsey Graham <a href=\"https://www.youtube.com/watch?v=VbjC4uKXbvE\">asked</a> Zuck the right question on Tuesday. Who are your competitors? The answer is they have none, though Zuck wouldn't say that. That is the big problem. Solve it and all the others go away. It requires Facebook to do a much better job of linking out from the main user experience. Meaningful change could happen immediately. Over a period of a few years, Facebook could open up to peering with competitive social networks. This would enable all kinds of new technology and news flows to develop. ",
                    "created": "Thu, 12 Apr 2018 16:01:55 GMT",
                    "urlvideo": "https://www.youtube.com/watch?v=VbjC4uKXbvE"
                },
                {
                    "text": "I want to build a beautiful online world just for news, not to tack it on to a discussion board. Start from zero. Given the current wealth of resources on the net, what would you create for news? I know what I want to make, and it would not be Facebook. It would start at a different place.",
                    "created": "Thu, 12 Apr 2018 16:03:27 GMT"
                },
                {
                    "text": "It's too early to lock it down, either tech or journalism. Still too much change that needs to happen. Honestly I think it's the change that the incumbents in journalism are trying to avoid. The change could have started over 20 years ago. It's time to give up on the old way and create the new way. The ideas of Facebook definitely apply. But not Facebook itself. ",
                    "created": "Thu, 12 Apr 2018 16:04:38 GMT"
                },
                {
                    "text": "PS: For background see <a href=\"http://scripting.com/2018/04/11/140429.html\">yesterday's piece</a> on where we're at with Facebook.",
                    "created": "Thu, 12 Apr 2018 16:25:47 GMT"
                }
            ]
        }
    ]
}