{
    "text": "My product is interop",
    "created": "Thu, 16 Dec 2021 15:33:31 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "If someone was a passionate user of one of the other <a href=\"http://daytona.scripting.com/?q=tools%20for%20thought&collection=scriptingnews\">Tools For Thought</a> projects, and they asked me to sell them on using \"Drummer\", I would probably say why don't you stick with the product you like, and work with us to get it interoperating with Drummer. That way when you want to try Drummer, you won't have to switch, you can just use it, and use the other one too, whenever you like. ",
            "created": "Thu, 16 Dec 2021 15:33:46 GMT",
            "image": "http://scripting.com/images/2021/03/30/grannySmithApple.png",
            "flInCalendar": true
        },
        {
            "text": "This is something I struggle to explain to people. I'm 66 years old, and have spent decades making software, so I think about it differently than I did when I was say 22 and wanting to take on the world. My <a href=\"http://daytona.scripting.com/?q=runway&collection=scriptingnews\">horizon</a> is obviously 44 years shorter now than it was then. And my goals are adjusted as well. ",
            "created": "Thu, 16 Dec 2021 15:34:18 GMT",
            "flInCalendar": true
        },
        {
            "text": "As I said the <a href=\"http://scripting.com/2021/12/14.html#a144920\">other day</a>, I've been lucky because of when I was born and my interest in technology, to be part of several \"bare metal bootstraps,\" where we got down to a basic set of functionality, a complete machine that everyone agreed on, and we as developers built up from there. Some amazing things can be accomplished if the baseline is powerful. ",
            "created": "Thu, 16 Dec 2021 15:34:39 GMT",
            "flInCalendar": true
        },
        {
            "text": "I think of my \"product\" today not being Drummer or Daytona or whatever's next, rather it's wanting to have my passion, outlining, experience the same kind of birth as a platform as the Apple II did, or CP/M, MS-DOS, Windows, the web, RSS, podcasting. Look at that string! Wow. But today's users and developers haven't even really experienced <i>one</i> exploding platform. That's my product now. I want outlining to be the basis for growth the same way those others were. ",
            "created": "Thu, 16 Dec 2021 15:35:32 GMT",
            "flInCalendar": true
        },
        {
            "text": "So you don't have to use Drummer but do insist on the highest level of interop with it from the people who make your software. Don't accept no for an answer. I'm not. Hopefully that makes sense? ",
            "created": "Thu, 16 Dec 2021 15:36:37 GMT",
            "flInCalendar": true
        },
        {
            "text": "Drummer is more than a piece of software -- it's an interop <a href=\"http://mindbomb.org/\">bomb</a>. It's going to sit there and grow, inviting others to interop with it, and every feature and service I add will make the proposition more enticing. Think of Drummer less as a product and more as a seduction. :bomb:",
            "created": "Thu, 16 Dec 2021 15:37:14 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}