{
    "text": "May 1",
    "created": "Tue, 01 May 2018 18:16:35 GMT",
    "name": "01",
    "subs": [
        {
            "text": "When Trump gives a speech we should arrange for Michelle Wolf to give one too. I'd fly across the country to be in the audience.",
            "created": "Tue, 01 May 2018 22:57:41 GMT",
            "type": "outline"
        },
        {
            "text": "Michelle Wolf is to Trump what the Parkland high school students are to the NRA.",
            "created": "Tue, 01 May 2018 23:25:32 GMT",
            "type": "outline"
        },
        {
            "text": "Here’s what was really positive about <a href=\"https://www.youtube.com/watch?time_continue=1&v=DDbx1uArVOM\">Michelle Wolf</a> at the dinner on Saturday, she knocked Trump off the air. Anything less and we’d be talking about the outrageous shit <i>he</i> said, but who cares? His jokes aren’t as funny as hers, and she said the truth and he lies.",
            "created": "Tue, 01 May 2018 20:45:46 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=DDbx1uArVOM"
        },
        {
            "text": "Dependent developers",
            "created": "Tue, 01 May 2018 18:16:36 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Reading Brent's <a href=\"http://inessential.com/2018/05/01/godot_framework\">piece</a> about Mac development made me think about the ideal, what I really want from being a developer for as long as I've been a developer. The thing that got me started was the independence of it. I could have taken a job at Bell Labs or some big mainframe or minicomputer company, and had a nice career being pushed around by bosses at big companies. But I went for PC development because it was something I controlled. I could do what I wanted. Make my own art. The things I wanted to do were things no company would approve of, they had no way of understanding it. And at first it was lovely. Then the corporate bosses at the PC companies started pushing us around and it turned to shit.",
                    "created": "Tue, 01 May 2018 18:18:44 GMT",
                    "image": "http://scripting.com/images/2018/04/27/deathStar.png"
                },
                {
                    "text": "I think of <a href=\"https://en.wikipedia.org/wiki/Alan_Cooper\">Alan Cooper</a>, a developer himself who now is a crafts person, building things out of his farm in Marin County, California. Things that are made of wood, glass and metal, not software. I've been reading his stories on <a href=\"https://twitter.com/MrAlanCooper\">Twitter</a>. It's a very different kind of story from the ones Brent and others tell. There are no big companies pushing him around, as far as I know. The tools he uses have existed for decades, if not more, and they aren't going to change in a way that forces him to do anything. That's the ideal.",
                    "created": "Tue, 01 May 2018 18:18:48 GMT"
                },
                {
                    "text": "On Twitter, <a href=\"https://twitter.com/om/status/991369341294624768\">Om</a> is wondering if we should trust Zuck? Why is that even a question? Of course we <a href=\"https://twitter.com/davewiner/status/991373169398235136\">shouldn't</a> trust him. Any more than Zuck would trust me (although there are more reasons for him to trust me than vice versa). Where did we get this idea that 30-something young folk should push us all around just because they're <a href=\"https://twitter.com/MrAlanCooper/status/991388800633847808\">rich</a>? What a crazy fucked up world. Repeat after me: Don't. Trust. Zuck.",
                    "created": "Tue, 01 May 2018 18:20:27 GMT"
                },
                {
                    "text": "And Google. Just read this TechCrunch <a href=\"https://techcrunch.com/2018/05/01/google-is-launching-app-domains-the-first-tlds-secured-with-built-in-https-on-may-7/\">article</a>. Some people thought I'd be angry at Google. I have no problem with them offering HTTPS support in their TLD. I've often thought Amazon could do a lot more for people, like myself, who use S3, to support HTTPS. After all they know as much about me as any naming authority could. They have my credit card number. They know where I live. They know, if they look at my buying history, a lot of very personal things about me! No what pisses me off is the way TechCrunch perpetuates <a href=\"http://this.how/googleAndHttp/#1519489336000\">Google's lies</a> about HTTP. One after the other. It's a rewritten press release. Something an AI could do. This is what most journalism is like. Rewritten press releases from companies taking things that don't belong to them. Like Google.",
                    "created": "Tue, 01 May 2018 18:21:40 GMT"
                },
                {
                    "text": "No conclusion other than we lie to ourselves and each other when we say independent developers are independent. ",
                    "created": "Tue, 01 May 2018 18:24:12 GMT"
                }
            ]
        }
    ]
}