{
    "text": "May 2",
    "created": "Wed, 02 May 2018 17:57:11 GMT",
    "name": "02",
    "subs": [
        {
            "text": "I had an idea for a Twitter coop. A group of say 100 people with roughly the same number of followers get together and pool their logins. Every user gets the right to push one message to all our collective followers once a month. So you have to be careful about what you use it for. But that way when you have really great idea that needs to get out there you have a way to do it, without begging. Of course there has to be a way to check against abuse. Perhaps it requires the approval of five of the 100 people in order to actually be sent? It's a variant of an idea that <a href=\"https://twitter.com/kyleshank?lang=en\">Kyle Shank</a> implemented a few years ago which allowed people to donate use of their accounts for a political cause. This would be more democratic, and wouldn't be limited to politics. BTW this is <a href=\"https://twitter.com/davewiner/status/991450186785304576\">the tweet</a> I'd push this month. If you feel inclined, please RT. We might just save the country with this idea. ",
            "created": "Wed, 02 May 2018 17:59:17 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/09/02/mrFrog.png"
        },
        {
            "text": "Also, you'd get a bonus push on your birthday. :boom:",
            "created": "Wed, 02 May 2018 18:03:32 GMT",
            "type": "outline"
        },
        {
            "text": "A variant on the <a href=\"http://scripting.com/2018/05/02.html#a175917\">above idea</a>: You can will your Twitter account to another coop. The end-of-runway coop. So your online presence can be powerful in your afterlife. ",
            "created": "Wed, 02 May 2018 18:16:35 GMT",
            "type": "outline"
        },
        {
            "text": "I've been in Seattle the last couple of days. One thing is different from last year when I visited, there are green and yellow bikes all over the place. I just signed up for <a href=\"https://www.limebike.com/\">LimeBike</a> (the green ones) and am going to try a ride on one this afternoon.",
            "created": "Wed, 02 May 2018 17:57:12 GMT",
            "type": "outline"
        }
    ]
}