{
    "text": "May 9",
    "created": "Wed, 09 May 2018 15:33:59 GMT",
    "name": "09",
    "subs": [
        {
            "text": "Journalism has to consider, at some point soon, the possibility that assuming Trump is not compromised is making their reporting wildly inaccurate.",
            "created": "Wed, 09 May 2018 20:29:11 GMT",
            "type": "outline"
        },
        {
            "text": "I listened to <a href=\"http://podcatch.com/archive/2018/05/09/206968.html\">today's Daily</a> podcast on Trump pulling out of the Iran deal. I guess because they can't prove that Trump is owned by Russia they can't consider that his actions have to be viewed in those terms. If they could, then the explanation is clear. Trump is trying to dismantle American influence in the Middle East and create a vacuum for Russia to move into. This is the Occam's Razor answer.",
            "created": "Wed, 09 May 2018 20:13:03 GMT",
            "type": "outline"
        },
        {
            "text": "If you were going to make a product that helped people write Twitter threads, how would you like it to work? I'm thinking of taking a stab at this.",
            "created": "Wed, 09 May 2018 19:14:24 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/994294449600679941"
        },
        {
            "text": "Elsewhere the NYT <a href=\"https://www.nytimes.com/2018/05/09/business/ev-williams-twitter-medium.html?partner=rss&emc=rss\">says</a> Evan Williams plans to save the Internet. ",
            "created": "Wed, 09 May 2018 15:45:57 GMT",
            "type": "outline"
        },
        {
            "text": "With tech billionaires so visible in the news these days we can all see the conundrum clearly. There really is nothing good you can do with the billions. You still are a person, you still are the person you were before you had the billions. There's no escaping yourself, I know I've tried, it doesn't work. There is no <i>better</i> when it comes to people. We're all slightly different variants of the same theme. ",
            "created": "Wed, 09 May 2018 16:06:12 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/05/09/shrug.png"
        },
        {
            "text": "The NYT Daily podcast is spawning a <a href=\"https://www.nytimes.com/2018/05/09/business/media/new-york-times-daily-podcast-tv.html?partner=rss&emc=rss\">weekly show</a> on FX. It will not be hosted by <a href=\"https://twitter.com/mikiebarb\">Michael Barbaro.</a> I think this is a mistake. The thing that makes the Daily good is not that they're NYT reporters, though that is of course important, it's that Barbaro is an inquisitive and empathetic interviewer. There are lots of NYT reporters, but I've never seen an interviewer so capable of bringing out an unusual point of view as Barbaro. ",
            "created": "Wed, 09 May 2018 15:37:59 GMT",
            "type": "outline"
        },
        {
            "text": "We could divide the world <a href=\"https://twitter.com/davewiner/status/994238741207310337\">in two</a>, those who think H stands for Humble and those who think it's Honest. Because they are two distinct viewpoints. The former says \"I could be wrong\" and the latter doesn't admit that. I am solidly in the first camp.",
            "created": "Wed, 09 May 2018 15:34:00 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/994238741207310337"
        }
    ]
}