{
    "text": "May 17",
    "created": "Thu, 17 May 2018 13:42:47 GMT",
    "name": "17",
    "subs": [
        {
            "text": "This <a href=\"https://www.nytimes.com/2018/05/16/podcasts/the-daily/facebook-sri-lanka-violence.html\">podcast</a> tells how a fake story on Facebook started a religious war in Sri Lanka. When I listened to it I realized this is the way the net will end. Sooner than I thought. You should listen to this.",
            "created": "Fri, 18 May 2018 01:30:11 GMT",
            "type": "outline"
        },
        {
            "text": "Google didn’t prepare for the <a href=\"https://www.vanityfair.com/news/2018/05/uh-did-google-fake-its-big-ai-demo\">obvious</a> <a href=\"https://www.axios.com/google-ai-demo-questions-9a57afad-9854-41da-b6e2-5e55b619283e.html\">questions</a> because the tech press never asks any. The kinds of questions they get are like “How great are you?” Keep going. There are lots of unreported stories. Big ones.",
            "created": "Thu, 17 May 2018 20:51:42 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/997198555096977408"
        },
        {
            "text": "When they <a href=\"https://en.wikipedia.org/wiki/The_Mother_of_All_Demos\">write</a> about <a href=\"https://en.wikipedia.org/wiki/Douglas_Engelbart\">Engelbart’s</a> accomplishments they leave out the one he thought was most significant — outlines. Computers are great for augmenting human intellect. Of all the things I've developed, the one with the greatest value is outline software. Idea processors. Incredibly useful tools. The intersection of machine and brain architecture. Engelbart, a brilliant explorer of technology, found his way to this place. I did too, independently, a few years later. We were introduced by <a href=\"https://en.wikipedia.org/wiki/Ted_Nelson\">Ted Nelson</a>. When they write the history of this period of tech development, I'm pretty sure it'll be the <a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+outline&t=hb&ia=web\">outliners</a> they will be writing about. ",
            "created": "Thu, 17 May 2018 15:36:53 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/05/17/mrNatural.png"
        },
        {
            "text": "Five minute <a href=\"http://scripting.com/2018/05/17/laurelYanny.m4a\">podcast</a> about Laurel and Yanny, obsessing about the <a href=\"https://www.nytimes.com/interactive/2018/05/16/upshot/audio-clip-yanny-laurel-debate.html\">NYT page</a> that lets you tweek it endlessly back and forth between the two. What does it all mean? Something. Nothing. Drives me crazy. 😜",
            "created": "Thu, 17 May 2018 14:58:16 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2018/05/17/laurelYanny.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "2254173",
            "urltweet": "https://twitter.com/davewiner/status/997126571201908736"
        },
        {
            "text": "When people are enjoying a BBQ in the park, and the cops are <a href=\"https://www.snopes.com/news/2018/05/11/oakland-woman-calls-police-black-people-grilling-illegally-public-park/\">called</a> because of their skin color, let's flood the park with BBQ-loving people of all colors. Stand with our fellow Americans.",
            "created": "Thu, 17 May 2018 14:21:08 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://github.com/scripting/Scripting-News/issues/78#issuecomment-389729751\">Darius Kazemi</a>, re changes to Twitter API: \"The real losers here are apps that need to real-time monitor a feed of Tweets, mostly 3rd-party Twitter clients.\"",
            "created": "Thu, 17 May 2018 13:55:35 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://en.wikipedia.org/wiki/Multi-factor_authentication\">Two-factor authentication</a> is based on the assumption that you control your phone. But phones are easy to <a href=\"https://www.nbcnews.com/business/consumer/how-hackers-are-hijacking-your-cell-phone-account-n859986\">hijack</a>.  ",
            "created": "Thu, 17 May 2018 13:42:48 GMT",
            "type": "outline"
        },
        {
            "text": "About the angry lawyer",
            "created": "Thu, 17 May 2018 18:21:36 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "<i>This is a lightly edited version of a <a href=\"https://twitter.com/davewiner/status/997152468084641792\">Twitter thread</a> I posted earlier.</i>",
                    "created": "Thu, 17 May 2018 18:21:52 GMT"
                },
                {
                    "text": "My grandparents, all citizens of the US, and taxpayers, spoke English and their native languages. My paternal grandparents spoke Russian. On my mother's side, they spoke German, Polish, Yiddish, probably some Russian too. To get by they had to speak lots of languages.",
                    "created": "Thu, 17 May 2018 18:22:30 GMT"
                },
                {
                    "text": "The <a href=\"https://forward.com/fast-forward/401320/pro-trump-jewish-lawyer-caught-ranting-spanish-new-york-deli/\">lawyer</a> who got so angry has a Jewish last name, and if he's like a lot of second or third generation Jews in the US, has recent ancestors, that he may have known, who spoke English with an accent and it wasn't their only language.",
                    "created": "Thu, 17 May 2018 18:22:51 GMT"
                },
                {
                    "text": "And I bet he was embarrassed by his grandparents. I know I was. And now, as an adult, I regret this. They had hard lives. They got swept up in the Holocaust. That fucked up our family in many ways. And I bet the lawyer got some of that too.",
                    "created": "Thu, 17 May 2018 18:23:00 GMT"
                },
                {
                    "text": "So even though we got screwed, we lived. That's huge. I wouldn't exist if it weren't for their perseverance and courage. Determination. That's why the immigrants who actually make it here are such intelligent and capable people. They had to be, or they wouldn't have made it.",
                    "created": "Thu, 17 May 2018 18:23:06 GMT"
                },
                {
                    "text": "As always people focus on the number of people killed. Six million. But many more people survived, but were damaged by the experience. We live with them. We are them. And that's just us. What about African-Americans. They rose from slavery! Can you imagine.",
                    "created": "Thu, 17 May 2018 18:23:11 GMT"
                }
            ]
        }
    ]
}