{
    "text": "May 3",
    "created": "Sun, 03 May 2020 14:04:20 GMT",
    "name": "03",
    "subs": [
        {
            "text": "People seem to feel it's over, but that's just a form of mass hysteria, they see the weather changing, winter is finally over, summer is here,  we must have survived, time to go out and play. That's evolution for you. Of course the virus is still out there hunting us. ",
            "created": "Sun, 03 May 2020 18:38:25 GMT",
            "type": "outline"
        },
        {
            "text": "Such a beautiful day , almost summer weather, everything is in bloom now. Winter is finally over. I rode my bike both yesterday and today. Lovely. ",
            "created": "Sun, 03 May 2020 18:42:20 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://twitter.com/TheBushCenter/status/1256607729151619073\">A video from President Bush</a>. It's not hard to say the right words. ",
            "created": "Sun, 03 May 2020 15:42:43 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/TheBushCenter/status/1256607729151619073"
        },
        {
            "text": "It's great to get John Naughton's <a href=\"https://johnnaughton.substack.com/\">nightly email</a>. He writes frequently about <a href=\"http://scripting.com/2020/04/21/191743.html?title=theEbbAndFlowOfLockdown\">contact tracing</a>, as he did <a href=\"https://johnnaughton.substack.com/p/saturday-2-may-2020\">last night</a>. I believe that our phones can help with contact tracing, and we should be willing to give up some privacy. This is an emergency. I don't agree with Schneier who dismisses the help mobile devices could offer, but some of the comments on <a href=\"https://www.schneier.com/blog/archives/2020/05/me_on_covad-19_.html\">his post</a> were right on, imho. More later for sure.",
            "created": "Sun, 03 May 2020 16:28:21 GMT",
            "type": "outline"
        },
        {
            "text": "Maybe journalism can stop tiptoeing around the plan, and just say what it is. 1. Reduce new infections to zero. 2. Contact tracing. 3. Low-cost, fast testing. That's how we get out of this.",
            "type": "outline",
            "created": "Sun May 03 15:47:26 +0000 2020"
        },
        {
            "text": "Bill Gates fights for science",
            "created": "Sun, 03 May 2020 14:22:49 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/2015/08/29/bliigFull.png",
            "description": "He is standing up for science at a time when that can save a lot of lives, maybe even save our civilization. ",
            "subs": [
                {
                    "text": "We often wait to say the good things about people until they're gone and can't hear it. I just wanted to say about Bill Gates, he's doing good now. Standing up for <a href=\"https://www.washingtonpost.com/technology/2020/05/02/bill-gates-coronavirus-science/\">science</a> at a time when that can save a lot of lives, maybe even save our civilization. ",
                    "created": "Sun, 03 May 2020 14:24:05 GMT"
                },
                {
                    "text": "He doesn't have to take a risk now, he could, like other rich people, isolate himself perfectly and ride out the storm. Instead he's put himself out there, standing for what's right, and you know what, <i>that's good, </i>and thanks to him for doing that. ",
                    "created": "Sun, 03 May 2020 18:58:52 GMT"
                }
            ]
        }
    ]
}