{
    "text": "May 5",
    "created": "Tue, 05 May 2020 14:54:21 GMT",
    "name": "05",
    "subs": [
        {
            "text": "Good journalism should save your life.",
            "created": "Tue, 05 May 2020 19:22:17 GMT",
            "type": "outline"
        },
        {
            "text": "I build code forts. Forts of code. Only a few ways in and out, heavily defended, lots of valuable powerful stuff inside. ",
            "created": "Tue, 05 May 2020 17:33:22 GMT",
            "type": "outline"
        },
        {
            "text": "Now that the <a href=\"http://scripting.com/2020/04/30.html#a142426\">Apple is happy</a> with the <a href=\"http://this.how/cuomo/\">Cuomo podcast</a>, it's really nice the way it updates so quickly in the Podcasts app on my iPhone. A few seconds after a new episode is available, the podcast moves to the <a href=\"http://scripting.com/images/2020/05/05/applePodcastsAppScreenShot.png\">top of the list</a> and it starts downloading the new episode. I wonder how they do it. Is my iPhone polling the feed constantly? Is an Apple  server doing the polling and relaying a notice to all subscribed clients? Or perhaps they hook into the <a href=\"http://scripting.com/2015/06/02/rsscloudDomains.html\">rssCloud</a> functionality that the <a href=\"http://xmlviewer.scripting.com/?url=http://scripting.com/cuomo/rss.xml\">feed</a> <a href=\"http://scripting.com/images/2020/05/05/cloudElement.png\">supports</a> (part of RSS 2.0). That would be the best answer. ",
            "created": "Tue, 05 May 2020 17:08:49 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/04/30/voila.png"
        },
        {
            "text": "<a href=\"https://pressthink.org/2020/05/the-plan-is-to-have-no-plan/\">Jay Rosen outlines</a> all the probably news from the White House through the election. It's depraved, awful, and totally predictable. Not much point sending reporters to cover Trump, instead devote limited news resources to finding information <a href=\"http://scripting.com/2020/04/29.html#a154224\">that</a> could <a href=\"http://scripting.com/images/2020/05/05/saveMyLife.png\">save my life</a>. ",
            "created": "Tue, 05 May 2020 15:12:39 GMT",
            "type": "outline"
        },
        {
            "text": "On my bike ride the other day I saw a group of 10 or so people off on the side of the road, talking. Like they were catching up. All wearing masks. Except they all had them down so they could see each other's full faces, I imagine, which defeats the purpose of wearing a mask, of course. ",
            "created": "Tue, 05 May 2020 17:27:07 GMT",
            "type": "outline"
        },
        {
            "text": "In the future it will be as rude to talk with someone publicly with your mask off as it would be with your pants down. Future porn will be people talking without masks in public places.",
            "created": "Tue, 05 May 2020 14:54:22 GMT",
            "type": "outline"
        },
        {
            "text": "I am a lip-reader. I guess over the years my hearing has become less accurate, and I compensate for it by getting more information from lip movement. I noticed this in a new way, waiting in line at the supermarket last week. If you depend on lip-reading, listening to people talk through masks is harder.",
            "created": "Tue, 05 May 2020 14:59:47 GMT",
            "type": "outline"
        }
    ]
}