{
    "text": "May 9",
    "created": "Sat, 09 May 2020 13:19:13 GMT",
    "name": "09",
    "subs": [
        {
            "text": "<a href=\"https://github.com/scripting/Scripting-News/issues/170\">Braintrust query</a>: Writing my own synchronous functions in Node. The conclusion -- anything you can do from the command line in the OS can be synchronous, because they're easy to <a href=\"https://nodejs.org/api/child_process.html#child_process_child_process_execsync_command_options\">invoke</a> from a Node app. A wide gaping loophole in the design of Node, and I love it. ",
            "created": "Sat, 09 May 2020 14:11:54 GMT",
            "type": "outline"
        },
        {
            "text": "I love this <a href=\"https://hudsonvalleyone.com/2020/05/09/were-all-catching-up\">story</a> about Cuomo and the people of the Catskills. I think he's right. I went to the supermarket today too -- the new routines are starting to feel routine.",
            "created": "Sat, 09 May 2020 22:43:08 GMT",
            "type": "outline"
        },
        {
            "text": "I did a long <a href=\"http://scripting.com/2020/05/09/Robustness.m4a\">podcast</a> today about robustness in software, but even I got bored with it after a few minutes. I'm putting it here for the record, why I made a decision about how to run code in \"PagePark\" the way I did. I don't imagine many people will be interested. :boom:",
            "created": "Sat, 09 May 2020 21:31:39 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2020/05/09/Robustness.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "14467206"
        },
        {
            "text": "As voters we gave up our power when we chose to vote for leaders who we'd like to have a beer with instead of people who represented us. They were never going to have beer with you, btw.  ",
            "created": "Sat, 09 May 2020 15:21:31 GMT",
            "type": "outline"
        },
        {
            "text": "Something to think about. The buildings of our government could be as toxic as a nursing home, prison or meat plant. What then?",
            "created": "Sat, 09 May 2020 15:18:12 GMT",
            "type": "outline"
        },
        {
            "text": "I’m glad I live in New York where we have a <a href=\"http://this.how/cuomo/\">governor</a> who believes in science and keeping us alive. Amazing this is America, the country that went to the moon.",
            "type": "outline",
            "created": "Sat May 09 11:42:12 +0000 2020",
            "tweetId": "1259086261890973696",
            "tweetUserName": "davewiner"
        },
        {
            "text": "Virus testing can work like polling. You don't have to talk to everyone to get a sense of who's leading in a poll. And you don't have to test everyone to find out how we're doing with the pandemic.",
            "type": "outline",
            "created": "Sat May 09 13:15:59 +0000 2020",
            "tweetId": "1259109863499628544",
            "tweetUserName": "davewiner"
        },
        {
            "text": "A <a href=\"https://www.youtube.com/watch?v=P8tTwXv4glY\">song</a> you should enjoy.",
            "created": "Sat, 09 May 2020 23:14:44 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=P8tTwXv4glY"
        },
        {
            "text": "Soon it will be my turn, and yours",
            "created": "Sat, 09 May 2020 16:42:10 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2020/05/09/jacksonHeights.png",
            "description": "It is already too late for 80K Americans. But soon it'll be your turn and my turn.",
            "subs": [
                {
                    "text": "After I moved to the mountains in March 2019, I've only been to NYC once, to have dinner with a friend from Calif who was visiting. Long before Covid. I don't really identify with the city much anymore. It feels far away. But it isn't far away. ",
                    "created": "Sat, 09 May 2020 16:42:16 GMT"
                },
                {
                    "text": "I was raised in Queens -- in Jackson Heights and northeast Flushing. I'm guessing people in Flushing are doing ok relative Covid, but Jackson Heights is burning. Lots of people I rode the subways with are sick, very sick, dying or dead. Like the victims of a tsunami in SE Asia or a hurricane in Puerto Rico. In some ways it feels far away, but it isn't. ",
                    "created": "Sat, 09 May 2020 16:42:48 GMT"
                },
                {
                    "text": "It just hit me in a visceral way when I thought of what happens when I will have to wait in soup lines after the collapse of the food supply in two or three months (or weeks as things are going). By then the infection will be even more out of control than it is now. My next thought -- I live in farm country, it's incredibly rich and fertile and productive place, so I'll be ok, but then I realize that food will be going to feed NYC which is just two hours to the south. Or it'll be feeding the people in the Hamptons, Martha's Vineyard or the Trumps and their buddies. It'll disappear just like the PPE did, down the Mafia hole. Going to Russia and Kentucky.",
                    "created": "Sat, 09 May 2020 16:43:28 GMT",
                    "image": "http://scripting.com/images/2020/05/01/pigeon.png"
                },
                {
                    "text": "The press meanwhile is covering <i>past</i> failures of Trump, how they blew it in January. But they're blowing it in May, and that's going to spread poverty and death to new parts of America outside NYC. Soon. ",
                    "created": "Sat, 09 May 2020 16:44:43 GMT"
                },
                {
                    "text": "The virus is in the White House. I bet it's in Congress too and maybe the Supreme Court. It's in DOD and DOJ and Homeland Security. Government houses people densely just like meat packing plants, prisons, nursing homes. Lots of vulnerable people taking big risks. They aren't any more immune than you and I are. ",
                    "created": "Sat, 09 May 2020 16:48:44 GMT"
                },
                {
                    "text": "That's why I say journalism's business model is \"Save my life.\" We need to get back on track, I don't care how we do it, now is already too late for 80K Americans. But soon it'll be your turn and my turn. <i>Soon. </i>",
                    "created": "Sat, 09 May 2020 16:45:24 GMT"
                }
            ]
        }
    ]
}