{
    "text": "May 10",
    "created": "Sun, 10 May 2020 12:26:22 GMT",
    "name": "10",
    "subs": [
        {
            "text": "Happy Mother's Day to my friends who are mothers.",
            "created": "Sun, 10 May 2020 12:45:21 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"http://scripting.com/2020/05/10/scienceRulesFromNowOn.m4a\">Podcast</a> about where we're at with the virus. It's been a while since I checked in on this. ",
            "created": "Sun, 10 May 2020 15:43:35 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2020/05/10/scienceRulesFromNowOn.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "8994618"
        },
        {
            "text": "<a href=\"https://twitter.com/nick__puckett/status/1259541624389955584\">Video</a>: A Colorado restaurant <a href=\"https://www.denverpost.com/2020/05/10/castle-rock-cc-coffee-reopens-coronavirus/amp/\">opens for Mother's Day</a> and it's packed with future Covid-19 victims. ",
            "created": "Sun, 10 May 2020 22:55:56 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/nick__puckett/status/1259541624389955584"
        },
        {
            "text": "I've been looking for this <a href=\"https://www.facebook.com/watch/?t=2&v=293304638236514\">video of Bill Barr</a> doing the polka dressed in a chicken suit. I would love to get the video in a form that doesn't depend on Facebook. Don't want to lose it again. (Be sure to turn the audio on.)",
            "created": "Sun, 10 May 2020 23:07:21 GMT",
            "type": "outline"
        },
        {
            "text": "I'd bet money that the things that are \"opening\" now are going to be closed quickly at great cost to: 1. the economy, 2. human bodies and 3. morale. ",
            "created": "Sun, 10 May 2020 14:44:06 GMT",
            "type": "outline"
        },
        {
            "text": "Who would have guessed that drive-in movie theaters would become the new essential art and business form factor. ",
            "created": "Sun, 10 May 2020 14:17:29 GMT",
            "type": "outline"
        },
        {
            "text": "Why isn’t there a Covid-19 game where you win by having your town not die before a treatment or vaccine is developed. When one of your citizens is infected you can isolate them for a bit and also do contact tracing. A mafia don in an orange jumpsuit shows up at random times and steals all your PPE! It’d be fun cause kids who master the game can explain it to their clueless Fox-watching parents and grandparents. They  could even be part of the game! ",
            "created": "Sun, 10 May 2020 12:51:02 GMT",
            "type": "outline"
        },
        {
            "text": "Trump wants to <a href=\"https://www.axios.com/trump-tweets-russia-investigation-flynn-e5f680a8-5ff3-4d45-aae8-4049bcc904ad.html\">change the subject</a> to the Russian probe. I find this somewhat amazing. He got away with all the Russian michegas. But he wants to go back to it. Because as they say Covid-19 doesn't respond to his bullshit. We could learn from the virus. Don't take the <a href=\"http://this.how/trolls/\">troll</a> bait.",
            "created": "Sun, 10 May 2020 12:26:23 GMT",
            "type": "outline"
        },
        {
            "text": "Just heard a report on NPR that began with a quote from Trump, a <a href=\"https://en.wikipedia.org/wiki/Big_lie\">big bold lie</a>, and they just went on as if he had made a good point. This has to stop. It's not saving my life, quite the contrary, it's killing people, to let Trump get away with lying about the role of testing. He says we have the highest numbers because we do the most testing. Yeah. Not true. And they went on to say that governors don't know why they need so much testing. What? Hello. Yes, everyone who cares knows. We need to know where the freaking virus is and isn't. That's why we test. It's the same reason we launch weather satellites, so we know where and when it's going to snow. I keep repeating this, hopefully the idea will spread. News should be in the business of saving my life and yours. It's never been more possible and more vital. And it's a good business model. If they're not just relaxing entertainment, if they <a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+%22save+my+life%22&t=h_&ia=web\">save my life</a>, we'll make sure they get the money they need. The news doesn't understand its own role. ",
            "created": "Sun, 10 May 2020 12:27:29 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/12/24/drummer.png"
        },
        {
            "text": "United flight crammed",
            "created": "Sun, 10 May 2020 15:55:23 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2020/05/10/fullFlight.png",
            "description": "United wrote them 10 days ago to say the middle seats would all be empty. Clearly they are not empty.",
            "subs": [
                {
                    "text": "In a <a href=\"https://twitter.com/ethanjweiss/status/1259165939037331456\">thread</a> on Twitter, Ethan Weiss was with a group of 25 nurses and doctors working in NYC hospitals for the past 2-4 weeks. They are going home. He says United flew them to NYC for free, got lots of great PR, and took <a href=\"https://twitter.com/ethanjweiss/status/1254197942732324867\">great care</a> of them going out. ",
                    "created": "Sun, 10 May 2020 15:55:36 GMT"
                },
                {
                    "text": "United wrote them <a href=\"https://twitter.com/ethanjweiss/status/1259171771191824385\">10 days ago</a> to say the middle seats would all be empty. Clearly they are not empty.",
                    "created": "Sun, 10 May 2020 16:00:36 GMT"
                },
                {
                    "text": "This is the <a href=\"https://twitter.com/ethanjweiss/status/1259310067066630144/photo/1\">departure board</a> for United at Newark yesterday. ",
                    "created": "Sun, 10 May 2020 15:57:59 GMT"
                },
                {
                    "text": "I think this is what everyone fears about flying. ",
                    "created": "Sun, 10 May 2020 16:02:22 GMT"
                },
                {
                    "text": "The United Airlines flight yesterday.  ",
                    "created": "Sun, 10 May 2020 15:53:40 GMT",
                    "inlineImage": "http://scripting.com/images/2020/05/10/unitedFlightFull.png"
                }
            ]
        },
        {
            "text": "Mother's Day 2020",
            "created": "Sun, 10 May 2020 13:05:18 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "My mother was a regular reader of this blog. Maybe she still reads it, where ever she is, whatever form she is in. I have women friends who read the blog, I think in a similar way to the way she read it. ",
                    "created": "Sun, 10 May 2020 12:56:26 GMT"
                },
                {
                    "text": "She was a very smart person, lots of brain power, but also very wounded, and the wounds, which we shared in a way, made it hard for us to be close. Maybe toward the end of her life she opened up a bit, but she had a fear of men, given to her by her parents, and she passed that on to her children, in the weird way that parents give their agony to their children. But she read the blog. That was something. ",
                    "created": "Sun, 10 May 2020 13:06:22 GMT"
                },
                {
                    "text": "The author and his mother with the author's newborn brother.",
                    "created": "Sun, 10 May 2020 13:09:02 GMT",
                    "inlineImage": "http://static.scripting.com/larryKing/images/2014/05/22/daveEveBoo.jpg"
                },
                {
                    "text": "I dream about her every night. They are not happy dreams, they are dreams of unresolved anger, disloyalty. But I also feel for her in ways I didn't when she was alive. I wish I had protected her, which is ridiculous because she was the mother and I was the child. But it's there nonetheless. ",
                    "created": "Sun, 10 May 2020 13:06:49 GMT"
                },
                {
                    "text": "I wish we could talk, but then I remember, we never accomplished anything with talk. Yet, she is the one who fed me, taught me, read to me, gave me her values, and ultimately was proud of me. ",
                    "created": "Sun, 10 May 2020 13:07:14 GMT"
                },
                {
                    "text": "She was my mother and all that came with it. I hope she can read this and I hope she's happy. ",
                    "created": "Sun, 10 May 2020 13:07:39 GMT"
                }
            ]
        },
        {
            "text": "My mother's judgement",
            "created": "Sun, 10 May 2020 14:25:56 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Now that my parents have been gone for some considerable time, our differences come into focus.",
                    "created": "Sun, 10 May 2020 14:26:10 GMT"
                },
                {
                    "text": "I felt that my life was dispensable, temporary, so I was ready to take risks that they didn't want me to take."
                },
                {
                    "text": "If you took them at face value, they were sure I was going to fail and be dependent on them. That I would fail at what I was trying to do, and then be a failure at life. That could have been the outcome. I was certainly close a few times! ;-)"
                },
                {
                    "text": "Why I was willing to take such risks is something I don't know. I have theories about it but I'm too close to have a good idea. I am what I am, it never was in question that I would do risky things. I wanted to do big things from a very young age. "
                },
                {
                    "text": "My parents on the other hand valued security above all else. They had steady jobs, savings accounts, were very careful with their money. "
                },
                {
                    "text": "Funny thing was that both my grandfathers were pretty sure I was doing the right thing."
                },
                {
                    "text": "Even though I overcame their objections, I don't think either of my parents ever forgot the judgement they formed years earlier, that I was a failure. On a personal level I still took big risks even if I had established myself from a productivity standpoint. (This was my mother's biggest value, that we be productive.)",
                    "created": "Sun, 10 May 2020 14:26:55 GMT"
                },
                {
                    "text": "They were depression era refugees in World War II. ",
                    "created": "Sun, 10 May 2020 14:27:14 GMT"
                },
                {
                    "text": "I am a Boomer. ",
                    "created": "Sun, 10 May 2020 14:27:23 GMT"
                },
                {
                    "text": "I think that explains a bunch of it, btw. ",
                    "created": "Sun, 10 May 2020 14:34:58 GMT"
                },
                {
                    "text": "I think they would be surprised to know that I actually did pick up most of their values re money. While I have been willing to roll the dice on new ideas I either thought had potential or I believed in for other reasons, otherwise I am quite conservative in the way I live, though it took me a while to arrive at that. Acquiring too much is a burden, living as lightly as you can is a good value. That was my mother's thing. I never have been very organized in record-keeping. In that I am original, both my parents were very good at that. Maybe that's my act of rebellion. ;-)",
                    "created": "Sun, 10 May 2020 14:34:59 GMT"
                },
                {
                    "text": "Also people who think the story of Boomers is written, consider Covid-19. We're still here, it's part of our story too. For all the hardship my parents' generation survived, they never had to deal with a pandemic. I'd love to send them an email about that. My grandparents on the other hand were around for the 1918 pandemic.",
                    "created": "Sun, 10 May 2020 14:38:47 GMT"
                }
            ]
        }
    ]
}