{
    "text": "May 11",
    "created": "Mon, 11 May 2020 13:10:40 GMT",
    "name": "11",
    "subs": [
        {
            "text": "The <a href=\"https://www.youtube.com/watch?v=n5SRHdcPLAI\">William Barr chicken polka</a>. Enjoy!",
            "created": "Mon, 11 May 2020 18:18:47 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=n5SRHdcPLAI"
        },
        {
            "text": "We're not just dying for Trump, we're also dying for CNN.",
            "created": "Mon, 11 May 2020 16:28:40 GMT",
            "type": "outline"
        },
        {
            "text": "I <a href=\"https://twitter.com/davewiner/status/1259869502042451968\">hope</a> that behind the scenes the Dems in the House are testing the waters for a bipartisan impeachment. ",
            "created": "Mon, 11 May 2020 15:34:05 GMT",
            "type": "outline"
        },
        {
            "text": "I wonder if any of the news orgs with a paywall have thought about doing what Netflix and Google TV (and perhaps others) do. They let you share your membership with \"family members,\" which really means anyone you want. It might be good marketing. ",
            "created": "Mon, 11 May 2020 16:16:10 GMT",
            "type": "outline"
        },
        {
            "text": "Another idea: A special deal for bloggers. People can read the stories if they come from my blog. The NYT used to do this. I felt like we had risen above crass commercialism, and were focused on informing people. Here come the lectures on how I don't understand news!",
            "created": "Mon, 11 May 2020 16:16:23 GMT",
            "type": "outline"
        },
        {
            "text": "How about a twist on that. Any paying user gets to forward stories from the site a certain number of times? Not sure about that. It's always so irritating when a friend RTs a story from the WSJ. It just doesn't make sense for me to subscribe. I did at one time, so I know what they do. I just am not that active in business these days. But sometimes the get a great story. Maybe what need are peering arrangements of some kind. You get 50 free articles from the WSJ with a NYT subscription, and vice versa. Maybe those two pubs don't do it. But maybe say Mother Jones and National Review. Kind of like William F. Buckley <a href=\"https://www.vox.com/2016/10/3/13081784/best-of-enemies-gore-vidal-william-buckley-pbs\">debating</a> Gore Vidal?",
            "created": "Mon, 11 May 2020 16:18:00 GMT",
            "type": "outline"
        },
        {
            "text": "The NYT (still) needs fresh air",
            "created": "Mon, 11 May 2020 13:10:41 GMT",
            "type": "outline",
            "description": "The Times has become too powerful and too unopposed. And now they want to cement this victory by drawing money from the tech companies, or to be paid money from taxes.",
            "metaImage": "http://scripting.com/images/2020/05/11/butHerEmails.png",
            "subs": [
                {
                    "text": "I had <a href=\"http://scripting.com/2020/01/28.html#a215257\">high hopes</a> when <a href=\"https://en.wikipedia.org/wiki/Ben_Smith_(journalist)\">Ben Smith</a>, former editor-in-chief of Buzzfeed News, was hired as the NYT's media columnist. I first became familiar with his work when Buzzfeed got a copy of the <a href=\"https://en.wikipedia.org/wiki/Steele_dossier\">Steele dossier</a>, and quickly <a href=\"https://www.buzzfeednews.com/article/kenbensinger/these-reports-allege-trump-has-deep-ties-to-russia\">shared</a> it with the public, causing an uproar in the press that it had not been vetted and should not have been published. I listened to a <a href=\"http://podcatch.com/pages/12818.html\">podcast</a> with him and New Yorker editor <a href=\"https://en.wikipedia.org/wiki/David_Remnick\">David Remnick</a>, and cheered in a post <a href=\"http://scripting.com/2017/01/28/errOnTheSideOfDisclosure.html\">here</a>. ",
                    "created": "Mon, 11 May 2020 13:10:44 GMT",
                    "image": "http://scripting.com/images/2019/12/24/rooster.png"
                },
                {
                    "text": "His position: The readers are smart. If we tell them it hasn't been vetted, they will add the same grain of salt a good reporter will. The contents of the dossier concerns them, they have every right to see it, since it was influencing politics and journalism. Outrageously, the press and Washington insiders had copies of the dossier for a long time, and had not released it. Meanwhile dumps of Clinton's emails were appearing, unvetted, almost daily. ",
                    "created": "Mon, 11 May 2020 13:27:16 GMT"
                },
                {
                    "text": "I <a href=\"http://scripting.com/2017/01/28/errOnTheSideOfDisclosure.html\">praised</a> Smith and Buzzfeed for siding with the people. I have found this trust of readers to be very rare in journalism. Most journalists hold readers in great contempt if they think of us at all. Smith's philosophy was in sync with the blogger's view. And I was glad to see it in a respected mainstream publication -- Buzzfeed.",
                    "created": "Mon, 11 May 2020 13:28:18 GMT"
                },
                {
                    "text": "So when Smith went to the Times, I looked forward to finally having some pushback on their editorial page, which never allows dissent from the orthodoxy of the most prestigious of news orgs. <i>We Know Best</i> could be their motto. <i>We'll Tell You What To Think, </i>might be the tagline. This has gotten us into huge trouble over the years, for example with the buildup to the Iraq War, where they carried Bush Administration lies, unopposed, never retracted or apologized-for. Then in the 2016 election the fabricated story of <a href=\"https://en.wikipedia.org/wiki/Hillary_Clinton_email_controversy\">Hillary's Emails</a> was born in the pages of the NYT, constantly repeated and amplified. You could legitimately blame the horrors of the Trump Admninistration, which are still reaching new heights, on the Times. Again, no mea culpa, and more importantly, no pushback from the op-ed pages. ",
                    "created": "Mon, 11 May 2020 13:14:00 GMT"
                },
                {
                    "text": "Another subject where piety has had no dissent on the editorial page is the idea that the tech industry stole their business and therefore owes them money. This is often repeated, never rebutted and is completely corrupt. As Bob Bierman said so well in a <a href=\"https://twitter.com/bobbierman/status/1259809847698227201\">tweet</a> this morning, in rebuttal to Smith's <a href=\"https://www.memeorandum.com/200510/p72#a200510p72\">latest</a> <a href=\"https://www.nytimes.com/2020/05/10/business/media/big-tech-has-crushed-the-news-business-thats-about-to-change.html\">column</a>: ",
                    "created": "Mon, 11 May 2020 13:16:42 GMT",
                    "subs": [
                        {
                            "text": "<i>Respectfully, nothing was stopping a newspaper from starting a simple classifieds site, a micro-blogging site or a community where people could talk to each other.</i>",
                            "created": "Mon, 11 May 2020 20:45:07 GMT"
                        }
                    ]
                },
                {
                    "text": "That is such a key point. I've been banging this drum since the inception of the web. Compete! Open the pages of your news product to the people. I called this <a href=\"http://scripting.com/2015/10/12/itsStillSourcesGoDirect.html\">Sources Go Direct</a>. I had a specific proposal for the Times in 2002, let the contributors be vetted by NYT reporters. Put their blogs on a separate domain with a big disclaimer. But when sources post there, you have quotes for future NYT articles. And stars will rise, and more important, your inbred ideas will be challenged under your masthead, something the Times needs, and more important, something the world needs. Had the Times done this there might not have been a Facebook, or they might not have played such an important role in the distribution of news.",
                    "created": "Mon, 11 May 2020 13:18:54 GMT"
                },
                {
                    "text": "The Times has become too powerful and too unopposed. And now they want to cement this victory by drawing money from the tech companies, or to be paid money from taxes. The answer has to be no. First try to compete, and then try again and again until you get it right. Tech still doesn't do news well. There's a new world still to be explored, try to create a great news product out of the net, jump in and stop pretending news works as it did before it went electronic. And get some fresh blood on the op-ed pages. Let's get some real criticism of the Times there, at least. We don't need royalty in the White House and we certainly don't need it in journalism. ",
                    "created": "Mon, 11 May 2020 13:20:32 GMT"
                }
            ]
        }
    ]
}