{
    "text": "May 12",
    "created": "Tue, 12 May 2020 12:01:22 GMT",
    "name": "12",
    "subs": [
        {
            "text": "When an idea is right it snaps into your mind like it always was there.",
            "created": "Tue, 12 May 2020 12:26:36 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/06/14/bowling.png"
        },
        {
            "text": "In the Supreme Court I love how they talk about the president's massive todo list. This president just eats, farts, watches tv, and throws his poop at the wall.",
            "created": "Tue, 12 May 2020 18:20:16 GMT",
            "type": "outline"
        },
        {
            "text": "There was a <a href=\"https://inessential.com/2020/05/10/heads_up_to_rss_reader_authors\">kerfuffle</a> in the \"RSS\" world yesterday when it appeared that Apple wanted aggregator developers to get written permission from sites whose feeds they include as defaults. It appears this was an error, or Apple changed their mind. Also, I love the word <a href=\"http://thesaurus.land/?word=kerfuffle\">kerfuffle</a>. Surprisingly, it's <a href=\"https://www.google.com/search?q=site%3Ascripting.com+kerfuffle\">not the first time</a> I've used it, according to Google. I'm surprised. But it appears to be the first time <i>in 13 years. </i>",
            "created": "Tue, 12 May 2020 12:06:26 GMT",
            "type": "outline"
        },
        {
            "text": "As you <a href=\"https://www.pbs.org/newshour/politics/watch-live-fauci-cdc-director-testify-in-senate-hearing-on-how-to-safely-return-to-work-and-school\">watch</a> Fauci today imagine if he were on every day.  Maybe it's because I'm a former entrepreneur that I see <i>tons</i> of ways to do this.   Biden, for example, could give Fauci a pulpit. I've tried this idea out of people inside the Democratic Party, they say this just isn't done. And that's a reason not to do something? Bill Gates could do it. He's entrepreneurial. It doesn't have to be Fauci himself, any affable avuncular scientist who tells the truth. As Trump fades into oblivion we should fill the airwaves with facts. That's a good way to \"save my life\". 😇",
            "created": "Tue, 12 May 2020 12:01:23 GMT",
            "type": "outline"
        },
        {
            "text": "<i>ALEXA!</i>",
            "created": "Wed, 13 May 2020 00:03:10 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I use my kitchen Alexa only to listen to WNYC. ",
                    "created": "Wed, 13 May 2020 00:03:21 GMT"
                },
                {
                    "text": "Usually I say <i>Alexa WNYC</i> and it works.",
                    "created": "Wed, 13 May 2020 00:03:26 GMT"
                },
                {
                    "text": "Now I have to say it slowly and loudly, being sure there’s no other sound. It takes 3 or more tries.",
                    "created": "Wed, 13 May 2020 00:03:33 GMT"
                },
                {
                    "text": "It's getting worse.",
                    "created": "Wed, 13 May 2020 00:03:44 GMT"
                },
                {
                    "text": "But when I say <i>Alexa stop</i> it works every time.",
                    "created": "Wed, 13 May 2020 00:03:47 GMT"
                },
                {
                    "text": "What's wrong?",
                    "created": "Wed, 13 May 2020 00:04:00 GMT"
                }
            ]
        }
    ]
}