{
    "text": "May 14",
    "created": "Thu, 14 May 2020 12:55:04 GMT",
    "name": "14",
    "subs": [
        {
            "text": "New motto: \"Nothing focuses the mind like imminent doom.\"",
            "created": "Thu, 14 May 2020 14:36:08 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://context-cdn.washingtonpost.com/notes/prod/default/documents/7868701d-d3f8-471a-82f2-dcf38551caa9/note/7f460e89-9adf-48fa-9953-5e202356f855.#page=1\">Poll</a> shows <a href=\"http://scripting.com/images/2020/05/14/polltable.png\">80% support wearing masks</a>.  Catastrophes unify us.",
            "created": "Thu, 14 May 2020 13:51:50 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://www.nytimes.com/2020/05/14/opinion/coronavirus-young-people.html\">She has Covid-19</a>, is still very sick, writes passionately about America, our disaster of a health care system, how little help is available to most patients. One of the most powerful pieces I've ever read. ",
            "created": "Thu, 14 May 2020 22:04:40 GMT",
            "type": "outline"
        },
        {
            "text": "It seems fair if a news org can keep us from reading their articles, that we should be able to tell Twitter orX Facebook not to show us their links. Like a \"no-thanks-wall\" to their paywall.",
            "created": "Thu, 14 May 2020 14:56:23 GMT",
            "type": "outline"
        },
        {
            "text": "Maybe only \"essential\" workers should have jobs, everyone else could get a government grant monthly and hang out and read books and learn to play the guitar. Maybe all this work we do is not necessary? Maybe if we didn't do so much work, then we'd live more green.",
            "type": "outline",
            "created": "Thu May 14 21:40:53 +0000 2020"
        },
        {
            "text": "Someone should be working on a virtual political rally where people in the audience can make noise, clap, laugh, chant etc. I think the net is up to it. Also would be helpful for sports and comedy. ",
            "created": "Thu, 14 May 2020 12:57:30 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://www.metacritic.com/movie/contagion\">Contagion</a> is on HBO. The first half is a pretty good dramatization of Covid, then it goes off the rails. I do not like the blogger, btw, or Elliot Gould who says bloggers aren't writers. It's probably not his fault, someone wrote that line for him. A writer, of course.  ",
            "created": "Thu, 14 May 2020 12:58:00 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://www.dailyfreeman.com/news/local-news/kingston-barber-tests-positive-for-covid-19-after-cutting-hair-in-violation-of-ny-order/article_932aa858-9565-11ea-b86d-bf0d85310eb1.html\">Kingston barber</a> tests positive for COVID-19 after cutting hair in violation of NY order. For some reason when I linked to this piece <a href=\"https://twitter.com/davewiner/status/1260726497532354563\">on Twitter</a>, it got a relatively large number of RTs and Likes. For some reason people found this interesting. I'm trying to link to more local Ulster County news, as more people in the area are tuning into my blog. Something I've been trying to encourage. ",
            "created": "Thu, 14 May 2020 12:55:05 GMT",
            "type": "outline"
        },
        {
            "text": "Contrary to what may seem obvious, the <a href=\"https://www.nytimes.com/2020/05/13/climate/coronavirus-coal-electricity-renewables.html\">stupid virus</a> might be saving humanity.  ",
            "created": "Thu, 14 May 2020 12:58:49 GMT",
            "type": "outline"
        },
        {
            "text": "Unmasked on the Rail Trail",
            "created": "Thu, 14 May 2020 13:02:29 GMT",
            "type": "outline",
            "description": "It's the kind of amenity you'd expect in Boulder not the Catskills. Let the record show that as our civilization crumbled we were just beginning to do nice things for ourselves. ",
            "metaImage": "http://scripting.com/images/2020/05/14/kindlyWearAMask.png",
            "subs": [
                {
                    "text": "I went for a ride yesterday along the <a href=\"https://ashokanrailtrail.com/\">Ashokan Rail Trail</a>, a very nice bike and walking trail, alongside the <a href=\"https://en.wikipedia.org/wiki/Ashokan_Reservoir\">Ashokan Reservoir</a>, which, believe it or not, is part of NYC. 1/6 of the water for the <a href=\"https://en.wikipedia.org/wiki/New_York_City_water_supply_system\">city</a> comes from this <a href=\"https://www.dec.ny.gov/outdoor/101552.html\">body</a> of water. Pretty sure the rail trail is also NYC property.",
                    "created": "Thu, 14 May 2020 13:02:41 GMT"
                },
                {
                    "text": "Most people were not wearing masks and of those that were, many had them around their neck. I was wearing a mask, I actually like the warmth and moisture. I also like the civics of it. But it pisses me off when people don't reciprocate. It means their viruses are spewing all over everyone else, including me, and possibly into my body, and might possibly cause me to get sick or worse.  ",
                    "created": "Thu, 14 May 2020 13:03:17 GMT",
                    "image": "http://scripting.com/images/2020/05/14/mask.png"
                },
                {
                    "text": "One <s>asshole</s> cyclist passed me on his bike on the way back, no mask, and he slowed down in front of me, so I was getting all of his virus in the <a href=\"https://en.wikipedia.org/wiki/Wake\">wake</a>. ",
                    "created": "Thu, 14 May 2020 13:04:39 GMT"
                },
                {
                    "text": "I <a href=\"https://www.vanityfair.com/news/2020/05/masks-covid-19-infections-would-plummet-new-study-says\">read</a> yesterday that if everyone in America wore a mask it would stop the virus cold. Who needs a vaccine. We just need people to stop being such intellectual dorks. ",
                    "created": "Fri, 15 May 2020 00:40:27 GMT"
                },
                {
                    "text": "If you are not wearing a mask when you go out, you can get off my porch right now!   ",
                    "created": "Fri, 15 May 2020 00:41:23 GMT"
                },
                {
                    "text": "Anyway, the <a href=\"https://hudsonvalleyone.com/2019/12/08/what-its-like-to-walk-the-new-ashokan-rail-trail/\">ART</a> is the kind of amenity you'd expect in Boulder not the Catskills. Let the record show that as our civilization crumbled we were just beginning to do nice things for ourselves. ",
                    "created": "Thu, 14 May 2020 13:05:20 GMT"
                },
                {
                    "text": "This trail is just 15 minutes from where I live. I have a nice bike rack on my car, so it's easy for me to get there. That said, I think the riding where I live is better. I live in paradise even compared to another nearby paradise. And most of the people around here wear masks and they keep them on their faces!",
                    "created": "Thu, 14 May 2020 13:05:41 GMT"
                },
                {
                    "text": "Sign on the Ashokan Rail Trail.",
                    "created": "Thu, 14 May 2020 14:13:25 GMT",
                    "inlineImage": "http://scripting.com/images/2020/05/14/wearAMask.png"
                },
                {
                    "text": "<a href=\"https://www.youtube.com/watch?v=OdEHzFiKrSw\">Video</a> of the <a href=\"https://www.google.com/maps/place/Ashokan+Reservoir/@41.9664626,-74.3219922,11z/data=!3m1!4b1!4m5!3m4!1s0x89dd024fe33ca6dd:0x8b66e1238c3c2a81!8m2!3d41.9784966!4d-74.1650991\">reservoir</a> taken from the rail trail yesterday.",
                    "created": "Thu, 14 May 2020 13:27:38 GMT",
                    "urlvideo": "https://www.youtube.com/watch?v=OdEHzFiKrSw"
                }
            ]
        }
    ]
}