{
    "text": "May 15",
    "created": "Fri, 15 May 2020 13:07:38 GMT",
    "name": "15",
    "subs": [
        {
            "text": "A 20-minute <a href=\"http://scripting.com/2020/05/15/letMeGiveYouMoney.m4a\">rambling podcast</a> with two simple ideas for journalism: 1. The customer is always right. 2. Let me show you how to make it easy for me to give you money.",
            "created": "Fri, 15 May 2020 15:19:19 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2020/05/15/letMeGiveYouMoney.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "10298475",
            "image": "http://scripting.com/images/2019/10/05/creamyRussianDressing.png"
        },
        {
            "text": "In news everything is a race between two political parties. The reds and the blues. There are other perspectives, for example I have the perspective of a citizen: voter, taxpayer, juror, soldier (according to the president), and now -- possibly infected, transmitting, part of a death toll. Yesterday's <a href=\"https://www.cnn.com/2020/05/14/politics/coronavirus-whistleblower-testimony/index.html\">testimony</a> by <a href=\"https://en.wikipedia.org/wiki/Rick_Bright\">Rick Bright</a> wasn't just a scandal, as much of journalism characterized it, it was also a clear statement that the US government isn't doing anything to \"save my life\". That should have been the headline. We are being rolled over by a killer. <i>No one is driving the bus. </i>",
            "created": "Fri, 15 May 2020 13:26:10 GMT",
            "type": "outline"
        },
        {
            "text": "Perspective is everything. I'd love to see just one publication adopt the perspective of the people even if just for a little while. Do something shocking. Report from the perspective of the voter, taxpayer, governed. Always say what the news means to us.",
            "created": "Fri, 15 May 2020 21:29:28 GMT",
            "type": "outline"
        },
        {
            "text": "Ref the <a href=\"https://www.cnbc.com/2020/05/11/coronavirus-trump-ends-press-conference-after-reporters-challenge-him-on-testing.html\">famous question</a> from CBS reporter Weijia Jiang asking Trump why make the amount of testing a competition, well -- please ask the same question of journalism. It's only a horse race if you choose to view it that way. Sometimes there are other more important perspectives (see above).  ",
            "created": "Fri, 15 May 2020 13:29:24 GMT",
            "type": "outline"
        },
        {
            "text": "Trump's promise about the vaccine recalls promises about his tax returns. The end of the year is also after the election. At that point, either way, he'll have no need to follow-through on this, as with the tax returns. He'll say he never thought there was going to be a vaccine.",
            "created": "Sat, 16 May 2020 00:51:46 GMT",
            "type": "outline"
        },
        {
            "text": "It's funny what kinds of businesses do well in the current environment. Restaurants -- not so good, it seems. But bike stores? Doing a great business. Everyone wants a new bike.",
            "created": "Sat, 16 May 2020 00:57:07 GMT",
            "type": "outline"
        },
        {
            "text": "I wish <a href=\"https://www.metacritic.com/\">Metacritic</a> reviews were available directly from program listings on Netflix and Amazon. ",
            "created": "Fri, 15 May 2020 13:07:39 GMT",
            "type": "outline"
        },
        {
            "text": "New header <a href=\"http://scripting.com/images/2020/05/15/olanaHudsonView.png\">image</a> on my blog home page, a snapshot from the <a href=\"https://www.olana.org/olanaeye/\">Olana webcam</a>, overlooking the Hudson River. ",
            "created": "Fri, 15 May 2020 14:37:39 GMT",
            "type": "outline"
        },
        {
            "text": "Better ventilation?",
            "created": "Fri, 15 May 2020 18:30:48 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Thinking out loud. ",
                    "created": "Fri, 15 May 2020 18:32:52 GMT"
                },
                {
                    "text": "What if instead of <a href=\"http://scripting.com/images/2020/05/15/poker.png\">plastic</a> separating people in casinos, modify how air circulates. Air enters in the ceiling and exits through the floor. Strong enough so any bits of virus going horizontal are swept up in the down-current. ",
                    "created": "Fri, 15 May 2020 18:31:02 GMT"
                },
                {
                    "text": "Poker in the age of Covid-19?",
                    "created": "Fri, 15 May 2020 18:31:36 GMT",
                    "inlineImage": "http://scripting.com/images/2020/05/15/poker.png"
                }
            ]
        }
    ]
}