{
    "text": "May 22",
    "created": "Fri, 22 May 2020 12:55:27 GMT",
    "name": "22",
    "subs": [
        {
            "text": "New version of <a href=\"https://github.com/scripting/publicfolder#readme\">publicFolder</a>, a Node app that runs on your desktop and keeps an Amazon S3 location in sync with a folder on a local disk. It's available as an NPM package and an Electron app. I use it to publish this.how, and am starting to use it in place of Dropbox. Much lighter weight, and I have all the source (and so do you). ",
            "created": "Fri, 22 May 2020 15:23:13 GMT",
            "type": "outline"
        },
        {
            "text": "I have a <a href=\"https://en.wikipedia.org/wiki/Subaru_Forester\">Subaru Forester</a>. Nice car. But every so often the rear door refuses to open. Three beeps. So I <a href=\"https://www.google.com/search?q=subaru+forester+open+rear+gate&rlz=1C5CHFA_enUS743US747&oq=subaru+forester+open+rear+gate&aqs=chrome..69i57j0l6j69i61.12667j0j4&sourceid=chrome&ie=UTF-8\">search</a>, have trouble finding an answer. So confusing, they talk about buttons my car doesn't seem to have. Anyway it turns out if you hold the touch point for six seconds it'll open the rear door. Software glitch of some kind. From then on it works as normal. Wonder what the logic is. If it has the means to reset itself why doesn't it just reset itself without me having to jump through hoops?",
            "created": "Fri, 22 May 2020 17:06:35 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/05/15/broccoli.png"
        },
        {
            "text": "On Maddow last night an interesting observation as to why meat packing plants are even worse than we thought. Recall that enclosed spaces with lots of humans present for long periods of time are bad. The virus has plenty of time to become dense, which it needs to be infectious. But meat packing plants are also loud, lots of machinery, so people have to yell to be heard. And when an infected person yells they emit more virus, contributing to greater density, therefore more transmission. ",
            "created": "Fri, 22 May 2020 13:01:01 GMT",
            "type": "outline"
        },
        {
            "text": "Virus in summertime?",
            "created": "Fri, 22 May 2020 12:55:28 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2020/05/22/brazilBeach.png",
            "description": "Maybe the virus doesn't care about the heat, but humans behave differently when it's warm. ",
            "subs": [
                {
                    "text": "My longtime friend <a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+matt+ocko&t=hk&ia=web\">Matt Ocko</a> <a href=\"https://twitter.com/mattocko/status/1263795877103071233\">says</a> it's hot in Brazil and they have a lot of virus there, so the virus must do okay in heat, so therefore no reprieve during the summer in the US. ",
                    "created": "Fri, 22 May 2020 12:55:32 GMT",
                    "image": "http://scripting.com/images/2020/05/22/masksAreForPussies.png"
                },
                {
                    "text": "I don't know whether the virus does better or worse in summer months, but saying it's doing fine in Brazil doesn't add much data about how it will do in the US in the summer. ",
                    "created": "Fri, 22 May 2020 12:55:51 GMT"
                },
                {
                    "text": "Maybe the virus doesn't care about the heat, but humans behave differently when it's warm. We spend more time outdoors, and the virus isn't as infectious outdoors, because it's the virus <a href=\"https://twitter.com/davewiner/status/1263787622859771904\">load</a> that determines how infectious it is. At least that's what we currently think.",
                    "created": "Fri, 22 May 2020 12:56:18 GMT"
                },
                {
                    "text": "Human bodies are generally in better shape in the summer. That might make us better able to fight the virus. ",
                    "created": "Fri, 22 May 2020 12:56:29 GMT"
                },
                {
                    "text": "Brazil is a different place from the US and is responding socially to the virus differently, so it's hard to conclude anything about what happens in the US based on what happens in Brazil. ",
                    "created": "Fri, 22 May 2020 12:56:38 GMT"
                },
                {
                    "text": "And of course the US is a very varied country, so what happens in NYC is different from what happens in Calif, is different from other parts of New York State for that matter. "
                }
            ]
        }
    ]
}