{
    "text": "May 23",
    "created": "Sat, 23 May 2020 13:32:20 GMT",
    "name": "23",
    "subs": [
        {
            "text": "<a href=\"https://en.wikipedia.org/wiki/Horse_race_journalism\">Horserace journalism</a> has never seemed less relevant.",
            "created": "Sat, 23 May 2020 14:20:38 GMT",
            "type": "outline"
        },
        {
            "text": "Anybody thinking how we can lobby the Senate to support local governments so we continue to have police, fire, sanitation, health care, teachers, etc. ",
            "created": "Sat, 23 May 2020 20:50:06 GMT",
            "type": "outline"
        },
        {
            "text": "Opening churches could flush out the last of Trump's  supporters who'd be ok if he shot someone on Fifth Avenue. The key assumption was that he was shooting someone else, not them. Maybe George Soros or Al Sharpton. I don't think they stick with him if shoots their neighbor from church.",
            "created": "Sat, 23 May 2020 14:28:27 GMT",
            "type": "outline"
        },
        {
            "text": "Read this <a href=\"https://politicalwire.com/2020/05/23/quote-of-the-day-2571/\">quote</a> from the Republican governor of North Dakota about masks. A silver lining to the pandemic is the only way out of it is to cut the level of insanity to zero and start acting according to science. There is no other way out of it, assuming you don't want to bet exclusively on a miracle. Either we stay collectively insane, we'll all get the virus, sooner than later, and a shitload of us will die, and the survivors will have a new Dark Ages. If we could only apply the objective brainpower to this problem that we do to a sports game like football or basketball. There is a winning strategy but it requires teamwork. ",
            "created": "Sat, 23 May 2020 14:04:55 GMT",
            "type": "outline"
        },
        {
            "text": "When you hear someone you love and think is smart and literate say Oh it's no big deal if I catch the virus, say \"I love you and you're smart and literate, and please <a href=\"https://thesunmagazine.org/issues/534/just-this-breath\">read this story</a>, because you're wrong about it not being a big deal.\" Perfect example of \"save my life\" story-telling.",
            "created": "Sat, 23 May 2020 13:32:21 GMT",
            "type": "outline"
        },
        {
            "text": "I've heard reports of people having trouble unsubscribing from the <a href=\"https://scripting.com/email/\">nightly email</a>. If you've been having trouble, please let me know by respoinding to the email.",
            "created": "Sat, 23 May 2020 14:19:24 GMT",
            "type": "outline"
        },
        {
            "text": "Listening to the virus",
            "created": "Sat, 23 May 2020 20:58:16 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "The latest save my life <a href=\"https://thesunmagazine.org/issues/534/just-this-breath\">story</a> (must-read) makes me wonder how to listen to people we support. People who are suffering. What conclusions to draw from what they say? ",
                    "created": "Sat, 23 May 2020 20:58:27 GMT"
                },
                {
                    "text": "This is part of the \"we're going to have to learn to live with it\" approach, which is another part of \"save my life\". It's not only about medicine, math, politics, money and power -- it's also about individual people who need -- what? How can we help? How to listen? How can we help? What to say? And how can we help?",
                    "created": "Sat, 23 May 2020 21:07:03 GMT"
                },
                {
                    "text": "The author wasn't able to convey her condition to the first doctor over the phone. I wanted to know how the doctor could do better. Also how the doctor could have made a difference when there was no treatment, at the time -- not sure if there's treatment possible now, even.",
                    "created": "Sat, 23 May 2020 21:00:35 GMT"
                },
                {
                    "text": "It's about more than science. It's about us. ",
                    "created": "Sat, 23 May 2020 21:01:41 GMT"
                }
            ]
        },
        {
            "text": "Node deprecates request",
            "created": "Sat, 23 May 2020 16:56:37 GMT",
            "type": "outline",
            "description": "I wonder what the Node platform vendor thinks we should use in place of request?",
            "metaImage": "http://scripting.com/images/2020/05/23/tumbleweed.png",
            "subs": [
                {
                    "text": "This is a technical post. ",
                    "created": "Sat, 23 May 2020 16:56:46 GMT"
                },
                {
                    "text": "The three words in the title of the post are noun, verb and subject. ",
                    "created": "Sat, 23 May 2020 16:56:54 GMT"
                },
                {
                    "text": "Let's go through them one by one.",
                    "created": "Sat, 23 May 2020 16:57:21 GMT",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "<b><a href=\"https://nodejs.org/\">Node</a></b> is a popular developer platform with set of common libraries called packages. It's based on JavaScript which is a very popular language. And its power comes from the very deep set of freely usable code you can build on. That part is the reason why I switched to JavaScript in 2013. I wanted to tap into the work of all the other developers using Node. That it was JavaScript was incidental, and honestly the Node platform had nothing to do with it, because at the time I switched I had little idea what it was.",
                            "created": "Sat, 23 May 2020 16:57:28 GMT"
                        },
                        {
                            "text": "<b><a href=\"https://techterms.com/definition/deprecated\">deprecates</a></b> is a word that platform vendors use when they are going to break the implicit promise that the platform you're developing on is stable. The word <a href=\"http://scripting.com/davenet/1995/08/22/whatisaplatform.html\">platform</a> implies stability. The fact that platform vendors can do this is one main reason we like to work with open source software, because if we don't agree with what they're doing, we don't have to go with them, which hopefully means they'll be less willing to break us.",
                            "created": "Sat, 23 May 2020 16:58:41 GMT"
                        },
                        {
                            "text": "<b><a href=\"https://www.npmjs.com/package/request\">request</a></b> is possibly the most used package in Node. I'm not sure. But since Node is used to make servers and one thing servers do a lot of is call other servers to get information, and request is pretty much the only way to do that, you'd have to say even if it isn't the most popular package, it certainly is one of the most important. If you were to remove request almost all Node apps would break. And that is exactly what they're doing. It won't work. I'm sure of it. And they don't know it yet. But they'll find out. ",
                            "created": "Sat, 23 May 2020 17:00:39 GMT"
                        }
                    ]
                },
                {
                    "text": "A couple of stories to go with this.",
                    "created": "Sat, 23 May 2020 17:02:15 GMT",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "Back in the late 90s when we were working on a new version of \"Frontier\", we were generating a lot of new routines for developers to call. We had packages of routines called suites, and as we were generating them we didn't know which package an individual routine would go in when the new version was finalized. So we created a temporary package called <a href=\"https://www.google.com/search?q=site%3Ascripting.com+toys\">toys</a>, disclaimed it would be deprecated before we shipped. We gave it a silly name so people would remember it was doomed. I said to devs, don't depend on anything in toys being there after we ship. Well, as promised, when it came time to ship, we sorted all the routines in toys to their permanent homes and deleted toys. Everything broke. Everything. The outcry was so loud and angry that we put toys back. The lesson is this, when you ship something to developers you're stuck with it, so be sure you can live with it when you ship. You have to live with your mistakes too. Clearly the Node developers think <a href=\"https://www.npmjs.com/package/request\">request</a> is a mistake. Well tough shit, you have to live with it. Sorry I didn't make the rules. :smile:",
                            "created": "Sat, 23 May 2020 17:02:23 GMT"
                        },
                        {
                            "text": "Dave Gandy's company makes a product called <a href=\"https://fontawesome.com/\">Font Awesome</a>. It's great. When it came out I knew I was going to use it. I had even been asking someone to do what it does. Anyway, when they came out with a new version, they broke lots of stuff. The conventional wisdom was if the new version is a \"full point release,\" like you're going from version 4 to 5, you can break whatever you want. Well it was a huge setback for Font Awesome and it got users (like me) to fear upgrading to new versions. If they want to improve their product, Dave and his company learned, they would have to add functionality, they can never take functionality out. I <a href=\"http://scripting.com/2020/02/16.html#a180941\">wrote it up</a> in February of this year, which feels like a decade ago! :-)",
                            "created": "Sat, 23 May 2020 17:06:03 GMT"
                        }
                    ]
                },
                {
                    "text": "At UserLand we came up with the fundamental rule, so fundamental that we called it Rule 1. It was this: Don't break users. There's nothing more sacred in the relationship between platform vendors and the devs. ",
                    "created": "Sat, 23 May 2020 17:07:45 GMT"
                },
                {
                    "text": "So with all that background, I wonder what the Node platform vendor thinks we should use in place of request? To make it as smooth as possible it should just <i>be</i> request, of course. :boom:",
                    "created": "Sat, 23 May 2020 17:08:34 GMT"
                }
            ]
        },
        {
            "text": "Me, as a kid",
            "created": "Sat, 23 May 2020 20:21:57 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "My brother found this picture of me as a kid in my father's photos.",
                    "created": "Sat, 23 May 2020 20:20:49 GMT",
                    "inlineImage": "http://scripting.com/images/2020/05/23/daveAsAKid.png"
                }
            ]
        }
    ]
}