{
    "text": "May 24",
    "created": "Sun, 24 May 2020 18:06:50 GMT",
    "name": "24",
    "subs": [
        {
            "text": "Taking it easy today, not much writing or programming. The weather has turned gorgeous, real upstate NY summer weather. After a long winter and an even longer almost-spring, including snow on May 9, and a pandemic, it's pretty ecstatic weather, luxurious, great-to-be-alive type weather. It's the contrasts that make the eastern part of the US so much more livable than the west, say I, a native son of the east who spent many years in the west.",
            "created": "Sun, 24 May 2020 18:06:51 GMT",
            "type": "outline"
        },
        {
            "text": "I'm always looking for a good binge, and I found one. The <a href=\"https://en.wikipedia.org/wiki/Homecoming_(TV_series)\">second season</a> of <a href=\"https://www.vulture.com/2020/05/homecoming-season-2-review.html\">Homecoming</a> is out, on <a href=\"https://www.amazon.com/dp/B085SW2PFQ/?ref=dvm_us_dl_sl_go_ast_522HO|m_2aaNnzkwc_c436988553276&gclid=CjwKCAjwtqj2BRBYEiwAqfzur97nIZDGWdlC1jUutPGDdtug_T52f__inue8ztQOoGDGkQsFlYfKrBoCP3oQAvD_BwE\">Amazon</a>. I started it the other night instead of watching the news. I had forgotten most of the plot of the first season, I remember liking it, but it didn't leave much of an impression. The second season is nicely done, has a Mr Robotish feel, there's a constant stream of twists and surprises, it's fun and so far intellectually gratifying, and it reviews the plot of season 1 as it goes. We have an inkling of how it will end because the first episode is about how it ends, or so we are led to believe. I don't know otherwise because I still have a few episodes to go. But nothing in this show is a straight line, and as I said it's well done. I especially like the end of each episode. They end with a twist, but they stay wtih the scene as the credits roll. I had not seen this technique before. ",
            "created": "Sun, 24 May 2020 18:09:09 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/05/24/homecoming.png"
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1264631259923431425\">Thread</a>: A friend tells me that Node does breaking releases regularly. I've been working in Node for seven years so far and it hasn't affected me yet. So they must not be heavy earth-shaking things.",
            "created": "Sun, 24 May 2020 21:59:29 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1264631259923431425"
        },
        {
            "text": "I have been trained not to click on links to most news sites because the experience is so unpleasant.",
            "created": "Sun, 24 May 2020 21:54:47 GMT",
            "type": "outline"
        }
    ]
}