{
    "text": "May 27",
    "created": "Wed, 27 May 2020 12:46:21 GMT",
    "name": "27",
    "subs": [
        {
            "text": "Twitter's <a href=\"https://www.google.com/search?q=twtr+market+cap\">market cap</a> is approx $26 billion, so one could buy a controlling interest for $13 billion.",
            "created": "Wed, 27 May 2020 20:14:32 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://github.com/scripting/Scripting-News/issues/173\">Prior art search</a>: I'm writing a command line tool to talk with PagePark, a web server running on the same machine. The question is what should the URLs look like. ",
            "created": "Wed, 27 May 2020 14:58:06 GMT",
            "type": "outline"
        },
        {
            "text": "I get this <a href=\"http://scripting.com/images/2020/05/27/iTunesErrorDialog.png\">cryptic dialog</a> when I try to update my <a href=\"https://en.wikipedia.org/wiki/IPhone_XS\">iPhone XS/Max</a> using iTunes. I've tried all the things the recommend, to no avail. Do you know what it means? I <i>really</i> don't want to reformat the phone. ",
            "created": "Wed, 27 May 2020 18:33:47 GMT",
            "type": "outline"
        },
        {
            "text": "I picked a good time to leave the city for the country -- March 2019. Just enough time to get established. I don't think I would have done very well in a 1-bedroom apartment in the middle of Manhattan. ",
            "created": "Wed, 27 May 2020 14:02:46 GMT",
            "type": "outline"
        },
        {
            "text": "I think it's going to turn out the virus isn't as infectious in the summer than in the cold months because it doesn't transmit well outdoors, and people spend more time outdoors in summer than winter.",
            "created": "Wed, 27 May 2020 14:01:24 GMT",
            "type": "outline"
        },
        {
            "text": "Old TV shows had a <a href=\"https://en.wikipedia.org/wiki/Laugh_track\">laugh track</a> that simulated audience applause and laughter. This was before they started recorded sitcoms in front of a live audience. As a little kid, I thought they must have little microphones in the TVs, maybe only some of them (not mine of course) and they could pick up the sounds made by people at home. The laugh track and other audience sounds were real, little Dave imagined. So you gotta wonder why they don't do actually that for <a href=\"https://morningconsult.com/2020/05/27/sports-poll-fans-prefer-natural-sound-in-telecasts/\">live sports events</a> in the upcoming seasons for basketball, baseball, hockey, football, etc -- when there won't be any fans in the stadiums and arenas. You could even pipe the audience sounds into the venue so the players can experience them. The technology is totally up to it. Why not have some fun with it?",
            "created": "Wed, 27 May 2020 12:46:22 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/09/01/mrFrog.png",
            "imageLink": "https://en.wikipedia.org/wiki/List_of_fictional_frogs_and_toads"
        },
        {
            "text": "BTW, what do you think the odds are that one of the sports players contracts Covid-19 during these new experimental seasons. I figure it's a near-certainty. And what happens then? Do they keep playing? ",
            "created": "Wed, 27 May 2020 12:55:58 GMT",
            "type": "outline"
        },
        {
            "text": "Where did RSS come from?",
            "created": "Wed, 27 May 2020 13:08:06 GMT",
            "type": "outline",
            "description": "From Pointcast to Microsoft to Netscape to the NY Times, there were lots of inspirations behind RSS. ",
            "metaImage": "http://scripting.com/images/2020/05/27/nytimesbuilding.png",
            "subs": [
                {
                    "text": "On Twitter, <a href=\"https://twitter.com/ejoep/status/1265522849973927940\">Joe Pezillo says</a> he's pretty sure Dave Winer (me) got the idea for \"RSS\" from Newton. He's also pretty sure I won't admit it. He's wrong on the first count, and right on the second. :smile: ",
                    "created": "Wed, 27 May 2020 13:08:13 GMT"
                },
                {
                    "text": "I wrote a tweet that was too long to fit in 280 chars that lists the steps that led to what we think of as RSS today. It wasn't an <a href=\"http://scripting.com/stories/2010/11/11/didYouInventRss.html\">invention</a> as most people think of invention, it was more of a synthesis, one idea leading to another and then another. ",
                    "created": "Wed, 27 May 2020 13:09:07 GMT",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "It started with seeing <a href=\"http://scripting.com/davenet/1996/01/14/cnnonyourdesktop.html\">Pointcast</a>, being blown away by the idea. ",
                            "created": "Wed, 27 May 2020 13:09:43 GMT"
                        },
                        {
                            "text": "Then a <a href=\"http://scripting.com/davenet/1997/11/25/Thanksgiving1997.html#4\">guy</a> from Microsoft wanted me to do something with XML, so I turned my <a href=\"http://my.userland.com/stories/storyReader$11\">blog into a feed</a>.",
                            "created": "Wed, 27 May 2020 13:11:28 GMT"
                        },
                        {
                            "text": "Then Netscape reinvented what I did."
                        },
                        {
                            "text": "Then I said OK let's do it your way. "
                        },
                        {
                            "text": "Then someone leaked the XML feeds for the NYT to me.",
                            "created": "Wed, 27 May 2020 20:47:27 GMT"
                        },
                        {
                            "text": "Then I repurposed them and published them so people could use them from Radio UserLand. ",
                            "created": "Wed, 27 May 2020 13:10:09 GMT"
                        },
                        {
                            "text": "Then they shut me down (they were nice about it). ",
                            "created": "Wed, 27 May 2020 13:11:48 GMT"
                        },
                        {
                            "text": "Then they <a href=\"http://scripting.com/davenet/2002/04/10/newYorkTimesAndUserland.html\">let me have them</a> for free.",
                            "created": "Wed, 27 May 2020 20:48:38 GMT"
                        },
                        {
                            "text": "Then we turned them into \"RSS\" feeds. ",
                            "created": "Wed, 27 May 2020 20:48:54 GMT"
                        },
                        {
                            "text": "Then RSS took off like a bat out of hell! :boom:",
                            "created": "Wed, 27 May 2020 20:48:59 GMT"
                        }
                    ]
                },
                {
                    "text": "And thus was born what we now think of as RSS. ",
                    "created": "Wed, 27 May 2020 13:10:26 GMT"
                }
            ]
        },
        {
            "text": "My development platforms",
            "created": "Wed, 27 May 2020 18:37:44 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Main development platforms over time.",
                    "created": "Wed, 27 May 2020 18:37:52 GMT",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "1974: Fortran",
                            "created": "Wed, 27 May 2020 18:38:10 GMT"
                        },
                        {
                            "text": "1976: BASIC"
                        },
                        {
                            "text": "1977: Simula"
                        },
                        {
                            "text": "1978: C/Unix",
                            "created": "Wed, 27 May 2020 18:38:47 GMT"
                        },
                        {
                            "text": "1979: UCSD Pascal"
                        },
                        {
                            "text": "1981: Microsoft Pascal"
                        },
                        {
                            "text": "1987: Lightspeed C"
                        },
                        {
                            "text": "1989: UserTalk/Frontier"
                        },
                        {
                            "text": "2013: JavaScript"
                        }
                    ]
                }
            ]
        },
        {
            "text": "Forgive the Karen",
            "created": "Wed, 27 May 2020 13:54:56 GMT",
            "type": "outline",
            "description": "She did something awful, but it doesn't rise to the level that requires her life to be destroyed. ",
            "metaImage": "http://scripting.com/images/2020/05/27/ramble.png",
            "subs": [
                {
                    "text": "Anyone who lives in Manhattan and has made it through the last few months without going completely crazy deserves a prize.",
                    "created": "Wed, 27 May 2020 13:55:00 GMT"
                },
                {
                    "text": "The <a href=\"https://www.nytimes.com/2020/05/26/nyregion/amy-cooper-dog-central-park.html\">Karen story</a> with the off-leash dog in the <a href=\"https://en.wikipedia.org/wiki/The_Ramble_and_Lake\">Ramble</a>, an area I am familiar with, imho deserves a second chance. Wouldn't that be great if out of the virus we learned to forgive. Give her the dog and the job back and accept her apology. ",
                    "created": "Wed, 27 May 2020 13:55:28 GMT"
                },
                {
                    "text": "As someone who used Central Park when I lived in the city, the rules are broken a lot, my peeves were no smoking and no bike riding on the walking paths. Two rules I felt strongly about, as the man did about off-leash dogs interfering with birding in the Brambles. ",
                    "created": "Wed, 27 May 2020 13:56:47 GMT"
                },
                {
                    "text": "A lot of NYers, even when they aren't stressed by isolation, act in a way that might look insane to someone not from NY, when you say they've violated the rules governing use of space. ",
                    "created": "Wed, 27 May 2020 13:57:29 GMT"
                },
                {
                    "text": "And NYers are sensitive to those rules being broken because there is so little space. It's kind of a powder keg that way, even in normal times. "
                },
                {
                    "text": "She did something awful, but it doesn't rise to the level that requires her life to be destroyed. I think it would be good for all of us if we perhaps just this once practiced forgiveness.",
                    "created": "Wed, 27 May 2020 13:58:04 GMT"
                }
            ]
        }
    ]
}