{
    "text": "May 31",
    "created": "Sun, 31 May 2020 14:31:14 GMT",
    "name": "31",
    "subs": [
        {
            "text": "Ultimately imho the only form of protest that works is what Killer Mike <a href=\"https://www.youtube.com/watch?v=rapfJYfPU38\">said</a> in his speech. Kick their asses in the voting booth.",
            "created": "Sun, 31 May 2020 14:52:49 GMT",
            "type": "outline"
        },
        {
            "text": "We, and the world don't understand something really important. The United States is nothing like the country it was a few years ago. There's been so much change -- it's not reversible. There was still a little hope if nothing changed too much before the November election that we might possibly start to recover in January next year, but a couple of things happened that make that impossible now: 1. Barr. 2. Covid-19. We're way down <a href=\"https://en.wikipedia.org/wiki/First_they_came_...#Text\">Martin Niemöller's list</a>. It's not just people of color that are under attack. The other day the president tweeted that <a href=\"https://www.washingtonpost.com/politics/2020/05/28/trump-retweets-video-saying-only-good-democrat-is-dead-democrat/\">the only good Democrat is a dead Democrat</a>. Life is very cheap now. 100K people died of a preventable pandemic in the last few months and more that number will die before the election. People who are alive right now. Some who are perfectly healthy, privileged, white. When he talks about dead Democrats, listen. Yes, most of the dead are poor people and people of color. But also enough whites and people of priviledge for us all to feel it now. That's a very profound change, it must not be overlooked. But we cling to the same news system. We value the opinions of people who are heavily invested in the pre-Trump-Covid world. People who naturally tell the story of how we will return to what we were. I just got a heavy dose of that watching just a few minutes of the Sunday news on CNN and MSNBC. But we will not be going back to anything like what we were. We need to get in the moment, and get into \"save my life\" mode for all of us. The protests of the last few days are an impossible dream, you can see that in the police reaction. If we're going not be completely devastated, we need new thinking. I thought the two speeches I linked to yesterday were an excellent start. <a href=\"https://www.youtube.com/watch?v=rapfJYfPU38\">Killer Mike</a>, <a href=\"https://twitter.com/PabloPerezA/status/1266286333607071745\">Angela Merkel</a> and one more, Atlanta mayor <a href=\"https://www.youtube.com/watch?v=VO7z6m2os2g\">Keisha Lance Bottoms</a>. ",
            "created": "Sun, 31 May 2020 14:31:15 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2012/10/01/tenTons.gif"
        }
    ]
}