{
    "text": "I just realized that there's another kind of <a href=\"https://en.wikipedia.org/wiki/Enshittification\">enshitification</a> that we're experiencing now because the twitter-verse has split into so many forks. Bluesky is hot now, but this isn't over yet. Developers are deliberately locking their users in by creating new APIs that are not only incompatible with previously existing APIs, but also are difficult for developers who learned earlier APIs to adopt because now they have all kinds of replicated code for different systems. It adds another level of complexity to the developer's code. What each platform vendor wants is not only captive users, but also locked-in developers. Why do you think they all have new languages? Come on is Swift really better than Go or React or whatever. So you see groups of Mac developers. And groups of JavaScript developers. And there are many kinds of JS devs. When does it end. Ones who build on OpenAI and others that develop on the APIs of other vendors (I'm not even trying to go on that ride, too late in my career.) There's so much confusion, that leads to exhaustion. Now we're feeling it especially hard when there are such ill-conceived duplicate APIs that <i>all</i> could have been done with RSS 2.0 and OPML.  Every one of them. Cory Doctorow, who came up with the term enshitification, also wrote a <a href=\"https://pluralistic.net/2024/10/16/keep-it-really-simple-stupid/#read-receipts-are-you-kidding-me-seriously-fuck-that-noise\">passionate piece about RSS</a>. I want to say to my friend Cory, if a system isn't built on RSS at this point, they are certainly trying to lock users and developers in. I don't care if it's ActivityPub or ATProto or Facebook or Twitter (sorry I can't keep track of their names). I want to build on a system that's pure inbound and outbound RSS. Give me lists in OPML and the please just let me ignore the rest of your lockin strategy. They talk a good line about wanting interop, federation and standards, but their actions speak otherwise. ",
    "created": "Fri, 22 Nov 2024 16:03:06 GMT",
    "type": "outline",
    "image": "https://imgs.scripting.com/2019/05/12/chairmanMeow.png",
    "flInCalendar": true
}