{
    "text": "Users and AI",
    "created": "Thu, 23 May 2024 12:35:26 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "We hear about what the companies are doing, mostly very serious bullshit. However, as always the most interesting stuff is done by the users, especially at such an early stage in a technology. ",
            "created": "Thu, 23 May 2024 12:35:30 GMT",
            "image": "https://imgs.scripting.com/2024/05/23/humanScarJo.png",
            "flInCalendar": true
        },
        {
            "text": "In the past, when blogging was booting up, we had blogging itself to share information about what we were learning. ",
            "created": "Thu, 23 May 2024 13:07:39 GMT",
            "flInCalendar": true
        },
        {
            "text": "Podcasting grew even more quickly because we already had blogging to share info on what we were trying, what worked, and what didn't. ",
            "created": "Thu, 23 May 2024 13:07:46 GMT",
            "flInCalendar": true
        },
        {
            "text": "You can see all of it in the archive of Scripting News. I was liberal about what I pointed to, because sharing the ideas was more important than any one person's ideas, including my own. The downside is that it made it easy for people to claim credit for things they didn't contribute. ",
            "created": "Thu, 23 May 2024 13:08:11 GMT",
            "flInCalendar": true
        },
        {
            "text": "Anyway with AI, I'm just using the stuff, not developing with it, at least not yet. I wouldn't know where to begin. But I'm discovering all kinds of applications every day, and writing about them on my blog, but I know there are many others doing the same, and I want to read all of it and want them to read my stuff. There's no way to find each other right now.",
            "created": "Thu, 23 May 2024 12:37:20 GMT",
            "flInCalendar": true
        },
        {
            "text": "Sidebar: It would be interesting to have an AI server that was ingesting our RSS feeds all the time. Then a community of bloggers, if it should develop would have a totally unique kind of archive. Who knows what we'd learn? Would anyone need to write a book about this stuff, or would we always have a current book about what's been discovered here? If you find this fascinating as I do, then I want to know more about what you're doing. See how we can bootstrap something in itself, that's the best way to do it.",
            "created": "Thu, 23 May 2024 12:38:02 GMT",
            "flInCalendar": true
        },
        {
            "text": "In the meantime, when I discover a blogger who is writing about using AI, I'll add it to my blogroll, which is visible on the <a href=\"https://blogroll.social/\">blogroll.social</a> main page, and on <a href=\"http://scripting.com/\">my blog</a>. If you have such a blog, or know of a good one, send me a link, and I'll add it to the blogroll. Once there are enough, I'll start a public timeline for it in FeedLand, so everyone can benefit. ",
            "created": "Thu, 23 May 2024 12:40:16 GMT",
            "flInCalendar": true
        },
        {
            "text": "Let's use our technology to track the most exciting tech development in a long time. ",
            "created": "Thu, 23 May 2024 12:41:33 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}