{
    "text": "The iPhone 13 epilog",
    "created": "Wed, 16 Feb 2022 13:52:06 GMT",
    "type": "outline",
    "metaImage": "http://scripting.com/images/2022/02/16/upstruck.png",
    "subs": [
        {
            "text": "As I reported <a href=\"http://scripting.com/2022/02/15.html#a193031\">yesterday</a>, the <a href=\"http://daytona.scripting.com/?q=iPhone%2013&collection=scriptingnews\">iPhone 13</a> Pro arrived yesterday. So the embarrassing saga is over. Now I want to clean up, by finishing the story.",
            "created": "Wed, 16 Feb 2022 13:52:15 GMT",
            "imageLink": "https://en.wikipedia.org/wiki/Gaslight_(1944_film)",
            "image": "http://scripting.com/images/2022/02/16/gaslight.png",
            "flInCalendar": true
        },
        {
            "text": "Apple sent a total of three iPhones to me. After the first one was lost, the second one got jammed up in the system too, when Apple charged the wrong credit card $1 for an unspecified reason and they had changed my credit card number, so the charge was rejected. The email I got saying this happened had none of this information so I waited, hoping the problem would clear without me having to call them, but no such luck. Turns out that delay doomed the second iPhone because while it was in transit we had a huge ice storm that knocked out power in Ulster County for two days. The iPhone was left in the UPS warehouse, probably in Kingston, and probably was stolen while it was waiting for everything to come back online.",
            "created": "Wed, 16 Feb 2022 13:53:03 GMT",
            "flInCalendar": true
        },
        {
            "text": "After trying to get help from Apple Support on Twitter, I wrote an <a href=\"http://scripting.com/2022/02/16/142419.html?title=myEmailToTimCook\">email to Tim Cook</a>, the CEO of Apple. Within an hour of sending the email, I got a phone call from someone in \"Apple Retail Executive Relations\" who was empowered to blow through the problem. A third iPhone was sent, this time via Fedex, which is, in my experience, much more reliable in this area than UPS. But something funny happened before the third phone was delivered at 2PM Eastern yesterday. ",
            "created": "Wed, 16 Feb 2022 13:55:15 GMT",
            "flInCalendar": true
        },
        {
            "text": "At 12:45PM or so, I heard a UPS truck park outside my house. It stayed there for about ten minutes. I went out to see what was going on, and could hear the driver in the back sorting through packages. It usually doesn't take that long. I shouted out to him through the open door, but he didn't answer. So I went back in the house to take a <a href=\"http://scripting.com/images/2022/02/16/upstruck.png\">picture</a> with my Pixel 4a, in time to see him drive off without making a delivery. My guess is that the UPS computer had told him to come here to make a delivery, and when he got here, the package wasn't on the truck? I have the <a href=\"http://scripting.com/images/2022/02/16/upstruck.png\">picture</a> to prove this actually happened. ",
            "created": "Wed, 16 Feb 2022 13:57:07 GMT",
            "flInCalendar": true
        },
        {
            "text": "UPS truck before it left without making a delivery. ",
            "created": "Wed, 16 Feb 2022 13:59:27 GMT",
            "inlineImage": "http://scripting.com/images/2022/02/16/upstruck.png",
            "flInCalendar": true
        },
        {
            "text": "There's not much more to say that isn't spelled out in the <a href=\"http://scripting.com/2022/02/16/142419.html?title=myEmailToTimCook\">email to Tim Cook</a>, so I'll just leave it there, except to say at all levels Apple people knew what the right thing to do was, but their system wouldn't let them do it. That is, until we got to someone who was at most a couple of hops from the CEO, who <i>was</i> empowered to solve the problem. As a long time Apple user, I got my first Apple II in 1979, I'd hate to see Apple be in the toilet bowl of uncaring bigco American rust belt e-commerce, where people are peripheral devices to poorly designed computer systems created by lawyers and accountants and in some cases psychopaths. For evidence of that, <a href=\"http://scripting.com/images/2022/02/16/dmExcerpt.png\">see the DMs</a> that the Apple Support people sent. If <a href=\"https://en.wikipedia.org/wiki/George_Cukor\">George Cukor</a> or <a href=\"https://en.wikipedia.org/wiki/Alfred_Hitchcock\">Alfred Hitchcock</a> were still alive and making movies, they could be characters in one of <a href=\"https://en.wikipedia.org/wiki/Psycho_(1960_film)\">their</a> <a href=\"https://en.wikipedia.org/wiki/Gaslight_(1944_film)\">psycho dramas</a>. ",
            "created": "Wed, 16 Feb 2022 13:59:45 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}