{
    "text": "My email to Tim Cook",
    "created": "Wed, 16 Feb 2022 14:24:19 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "<i>On Monday February 14, after <a href=\"http://scripting.com/2022/02/16/135206.html?title=theIphone13Epilog\">waiting</a> 18 days for a new iPhone to be delivered, I sent an <a href=\"https://www.lifewire.com/how-can-i-email-apple-ceo-tim-cook-1171298\">email</a> to Apple CEO Tim Cook and as a result <a href=\"http://scripting.com/2022/02/16/135206.html?title=theIphone13Epilog\">two days later</a> I had the phone. Here's a copy of the email. </i>",
            "created": "Wed, 16 Feb 2022 14:24:50 GMT",
            "flInCalendar": true
        },
        {
            "text": "Dear Mr Cook: ",
            "created": "Wed, 16 Feb 2022 14:26:25 GMT",
            "flInCalendar": true
        },
        {
            "text": "I ordered an <a href=\"http://daytona.scripting.com/?q=iPhone%2013&collection=scriptingnews\">iPhone 13</a> Pro from the Apple online store on January 27. I paid $1300 plus tax. I also bought a leather case, which was delivered. ",
            "created": "Wed, 16 Feb 2022 14:35:13 GMT",
            "flInCalendar": true
        },
        {
            "text": "I've spent hours on the phone with Apple people, tried using the support address on Twitter, and have gotten conflicting advice from Apple people, and they've lost the case a couple of times. Also at one point I got an email from Apple saying I had to change something about my account, without saying what it was. It turned out Apple wanted to charge my account $1, and my credit card number had been changed on your system to something other than my credit card number. This may be the most alarming thing about this experience. How could that have happened?",
            "flInCalendar": true
        },
        {
            "text": "I bought my first Apple product, an Apple II, in 1979. I was an early Apple II developer, was one of the first Mac developers. I've created a lot of software for your platform and done a lot of business with Apple, and I'm also a longtime shareholder. I have never seen this company so incompetent, uncaring and unprofessional, apparently as a matter of corporate policy. The employees I've had to deal with are not proud of your company. ",
            "flInCalendar": true
        },
        {
            "text": "I paid Apple $1300, not UPS. If they screwed up, and it's likely they did, telling me to go to UPS is no answer. I didn't choose to use UPS, you did. And if they screwed up, fine, either give me my money back or get me the phone, now. I really want the product, but more than that I want to be treated as a customer, with the basic respect that requires.",
            "flInCalendar": true
        },
        {
            "text": "I've been writing about this on my blog since I made the purchase. Here's a <a href=\"http://daytona.scripting.com/?q=iPhone%2013&collection=scriptingnews\">search query</a> that will get you the full account. If you study this case, you'll see you need to do a lot of work on the customer experience, and empower your employees to solve problems, instead of pointing the finger at other companies and giving assignments to customers about dealing with your vendors. I've heard the story about how Apple people can't solve an obvious repeated failure on the part of your company. That's a system that is going to lose you your reputation for being tops in customer service. ",
            "created": "Wed, 16 Feb 2022 14:37:28 GMT",
            "flInCalendar": true
        },
        {
            "text": "I hope you can help. I either want an immediate refund or to have the product delivered soon. And in all this mess, no one has ever apologized. I think that would be the place to start. And not an indirect apology like the one I got from the Twitter support team, which began: \"We’re sorry to hear your delivery is stalled...\" I've enclosed the full message as an <a href=\"http://scripting.com/images/2022/02/16/dmExcerpt.png\">attachment</a>.",
            "created": "Wed, 16 Feb 2022 14:28:31 GMT",
            "flInCalendar": true
        },
        {
            "text": "Thanks in advance,",
            "flInCalendar": true
        },
        {
            "text": "Dave Winer",
            "created": "Wed, 16 Feb 2022 14:28:21 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}