{
    "text": "I want the web to be like Harvard",
    "created": "Fri, 08 Aug 2025 13:52:09 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Back in the beginning I wanted the web to be like Harvard.",
            "created": "Fri, 08 Aug 2025 13:52:11 GMT",
            "flInCalendar": true
        },
        {
            "text": "It's one of the reasons I went there as a research fellow in 2003. ",
            "created": "Fri, 08 Aug 2025 13:57:35 GMT",
            "flInCalendar": true
        },
        {
            "text": "I wasn't satisfied with the web, the density of minds wasn't up to my expectations, so I thought if I brought the web to the minds, that might work better. I wanted to work on communication systems for people trying to work together to solve big problems. ",
            "created": "Fri, 08 Aug 2025 13:57:46 GMT",
            "flInCalendar": true
        },
        {
            "text": "I chose Harvard over MIT, because the web was already strong at MIT, and they weren't friendly to my cause, they were busy trying to reinvent the web when it imho didn't need that. I hoped instead, Harvard, more a school of the liberal arts, would be more open to innovation in communication between people as opposed to between machines. I felt, in 2003, that was a solved problem on the web.",
            "created": "Fri, 08 Aug 2025 13:52:25 GMT",
            "flInCalendar": true
        },
        {
            "text": "It didn't happen there either, some great stuff did come out of that period, and some of it was lasting, but eventually the university wasn't on board with the web as a community for intellect. Instead what came out of Harvard in that period was Facebook, which is a great accomplishment. I am a FB user to this day and appreciate how well it works at keeping friends from long ago in contact. ",
            "created": "Fri, 08 Aug 2025 13:59:06 GMT",
            "flInCalendar": true
        },
        {
            "text": "I still want an intellectual community on the web. That's why I'm putting so much effort into rebuilding it as a writing environment. All this because the writing products of Silicon Valley are always will be silos. As heroic as Ghost has been in supporting ActivityPub that is not the web. The barriers are too high and the features too limited. The web is the web, it's well defined and well understood. And that's where we have to go, and I want the minds to be there or else it wasn't worth the effort.",
            "created": "Fri, 08 Aug 2025 13:52:22 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}