{
    "text": "Ideas for Twitter",
    "created": "Wed, 09 Nov 2022 20:45:40 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I started thinking and the ideas kept pouring out. Here goes.",
            "created": "Wed, 09 Nov 2022 20:45:50 GMT",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "Re the blue checkmarks, leave them alone. Make a very clear statement and stick to it. Blue checkmarks are Twitter Classic.",
                    "created": "Wed, 09 Nov 2022 20:46:01 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Let's come up with some more colors -- silver, gold and black (to correspond to different levels of credit cards perhaps).",
                    "created": "Wed, 09 Nov 2022 20:46:38 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Anyone can buy a silver checkmark. It means that other people, with a single click, or by hovering over their tag, can find out their real name and whatever other verifiable info the user wants to share publicly. The info comes from the credit card company.",
                    "created": "Wed, 09 Nov 2022 20:46:43 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "With gold, you get more services and they cost more. Twitter will make introductions to other members who might share interests with you. With this Twitter could get into the businesses of match.com or linkedin.",
                    "created": "Wed, 09 Nov 2022 20:46:44 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Black is reserved for Friends Of Elon, whatever that means. People who hang out and smoke weed or travel on Twitter Tours. The kind of perks credit card companies offer. Hey you could even partner with Amex or whatever. Good deals on a Model Y or Starlink. ",
                    "created": "Wed, 09 Nov 2022 20:46:46 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Hey here's another idea. There must be a pool of good names that have been abandoned years ago. Those might be worth money. I'd like to buy a few if they're for sale. Or buy a TLD, maybe .twtr and allow their twitter names to be portable in some sense as afforded by DNS's flexibility. Thinking out loud here.  ",
                    "created": "Wed, 09 Nov 2022 20:46:58 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "BTW, while I have your attention I used to have <a href=\"https://twitter.com/nyt\">NYT</a>, and the NYT didn't mind. It goes back to the beginning of Twitter and NYT support for RSS. I'd pump links to NYT articles through this Twitter account. Never got an explanation why it was suspended. If you like the ideas can you ask them to let me use that account again? It was fun. Free advertising for the paper of record. ",
                    "created": "Wed, 09 Nov 2022 20:51:03 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}