{
    "text": "Outline of my 34-minute podcast",
    "created": "Sat, 24 Aug 2024 14:41:19 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "About the podcast",
            "created": "Sat, 24 Aug 2024 14:46:00 GMT",
            "subs": [
                {
                    "text": "I just did a 34-minute podcast, not sure I'm going to publish it. ",
                    "created": "Sat, 24 Aug 2024 14:41:32 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I asked ChatGPT to do an outline of the talk, and that's what I've included below. ",
                    "created": "Sat, 24 Aug 2024 14:46:57 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Kamala Harris is much more than I thought.",
            "created": "Sat, 24 Aug 2024 14:50:15 GMT",
            "subs": [
                {
                    "text": "It’s not just me; millions of people are realizing her capacity.",
                    "flInCalendar": true
                },
                {
                    "text": "She’s more than a good vice president; she’s in the right place at the right time.",
                    "flInCalendar": true
                },
                {
                    "text": "I was skeptical at first, thinking her as president would be a disappointing outcome.",
                    "flInCalendar": true
                },
                {
                    "text": "Watching her acceptance speech blew away any doubts I had.",
                    "flInCalendar": true
                },
                {
                    "text": "I’m really looking forward to her inaugural speech—it’s going to be something.",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "I’ve realized that Trump is still basically the incumbent.",
            "subs": [
                {
                    "text": "It sounds strange, but his influence is still huge, almost like he never left office.",
                    "flInCalendar": true
                },
                {
                    "text": "January 6th wasn’t just a riot; it was an act of war against our government.",
                    "flInCalendar": true
                },
                {
                    "text": "It’s scary that Trump hasn’t been held accountable, and that’s dangerous.",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Harris offers a fresh perspective compared to Biden.",
            "subs": [
                {
                    "text": "Biden has been steady during crises like COVID-19, but he’s tied to old ways.",
                    "flInCalendar": true
                },
                {
                    "text": "The Dobbs decision overturning Roe v. Wade was a huge missed opportunity—they weren’t prepared.",
                    "flInCalendar": true
                },
                {
                    "text": "This decision wasn’t just legal; it fundamentally changed our society.",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Harris seems to understand the stakes better than Biden.",
            "subs": [
                {
                    "text": "She’s ready to take action, and that’s what we need now.",
                    "flInCalendar": true
                },
                {
                    "text": "Biden is like a tree that’s been in the same spot for decades—strong but inflexible.",
                    "flInCalendar": true
                },
                {
                    "text": "Harris isn’t weighed down by that history; she can move forward.",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "We’re heading into another election cycle with potential for violence and misinformation.",
            "subs": [
                {
                    "text": "Harris’s role is critical because Trump’s threat isn’t going away.",
                    "flInCalendar": true
                },
                {
                    "text": "How we deal with this will define the future of our democracy.",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Kamala Harris isn’t just a vice president; she’s the leader we need right now.",
            "subs": [
                {
                    "text": "She understands the challenges and is ready to guide us through them.",
                    "flInCalendar": true
                },
                {
                    "text": "This is a critical moment, and Harris is the one who can help us navigate it.",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}