{
    "text": "Inclusivity",
    "created": "Sun, 26 Aug 2018 16:15:33 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "What it means to be inclusive",
            "created": "Sun, 26 Aug 2018 16:16:07 GMT",
            "subs": [
                {
                    "text": "I don’t care how you got to the party. Whether you took the subway, walked, came by spaceship or were driven by your chauffeur. What’s important is you’re here.",
                    "created": "Sun, 26 Aug 2018 16:15:48 GMT"
                }
            ]
        },
        {
            "text": "Non-inclusive vs inclusive",
            "created": "Sun, 26 Aug 2018 16:15:52 GMT",
            "subs": [
                {
                    "text": "You can advocate for your cause by pushing away people who you don't identify with, or you can be inclusive, and take support where you get it. Most of the great causes we remember are the inclusive kind. The ones that demonize or ridicule \"others\" tend to result in war.",
                    "created": "Sun, 26 Aug 2018 16:16:56 GMT"
                }
            ]
        },
        {
            "text": "Two views of America",
            "created": "Sun, 26 Aug 2018 16:17:55 GMT",
            "subs": [
                {
                    "text": "The Constitution is inclusive. It started out with some huge holes. Over the generations we've been closing them. That's been the clear trend.",
                    "created": "Sun, 26 Aug 2018 16:17:59 GMT"
                },
                {
                    "text": "The Trump movement is non-inclusive. It says there are <i>real</i> Americans, white, rural, Christian, male-dominated. They say these are traditional American values. This isn't new, this thread has been a constant since the beginning. It's the regulator on change happening too fast.",
                    "created": "Sun, 26 Aug 2018 16:18:35 GMT"
                },
                {
                    "text": "One of the reasons the Trump style America is ascendant is that the inclusive America has been moving forward at a rapid pace in the last few generations, post-World War II. Recently, we had an African-American president, the ultimate in other-ness, and we have removed gender from the concept of marriage. That's a lot of change happening very quickly, <i>within ten years. </i>",
                    "created": "Sun, 26 Aug 2018 16:19:38 GMT"
                },
                {
                    "text": "To heal we have to come out the other side with our inclusive principles intact.",
                    "created": "Sun, 26 Aug 2018 16:21:31 GMT"
                }
            ]
        }
    ]
}