{
    "text": "Podcasts please get to the point",
    "created": "Sat, 02 Jan 2021 14:30:05 GMT",
    "type": "outline",
    "description": "Podcasting is not a joke and looks like it's going to be here for a while. So we should learn how to make better podcasts. ",
    "metaImage": "http://scripting.com/images/2021/01/02/chineseCulturalRevolution.png",
    "subs": [
        {
            "text": "Yesterday I wrote a <a href=\"http://scripting.com/2021/01/01.html#a190023\">short admonition</a> about podcasts that tell you about the experiences and feelings of experts who I don't know. ",
            "created": "Sat, 02 Jan 2021 14:30:22 GMT",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://twitter.com/aweissman/status/1345375764544421888\">Andy Weissman</a> suggests that it might be the unlimited length of podcasts that encourages people to go on and on. I'm sure that's part of it. I also think producers aren't listening to their own podcasts, so aren't aware of how poorly these indefinite ramblings about nothing go over.  ",
            "created": "Sat, 02 Jan 2021 14:30:57 GMT",
            "flInCalendar": true
        },
        {
            "text": "The other day I was on a walk in the country, bundled up with three layers covering everything including my head and the new <a href=\"https://www.amazon.com/Apple-MWP22AM-A-AirPods-Pro/dp/B07ZPC9QD4\">AirPods</a>. I was walking basically inside a podcast pillow. I choose the podcast I'll listen to before I get all bundled up. This walk, I wanted to learn all about the pandemic from a reporter who had been covering nothing else for a year. I had been reading his articles. But the interviewer wanted to know about about the author's personal feelings about the pandemic. I went with it for five minutes, they were still talking about the author's feelings, so I tried another podcast. Same thing! And another. The topics were all interesting to me. But they took forever to get going. ",
            "created": "Sat, 02 Jan 2021 14:32:31 GMT",
            "flInCalendar": true
        },
        {
            "text": "Finally I hit on a <a href=\"https://www.bbc.co.uk/programmes/m000q9b6\">BBC podcast</a> about the <a href=\"https://en.wikipedia.org/wiki/Cultural_Revolution\">Chinese Cultural Revolution</a> in the 60s and 70s, which I was fascinated by as a kid. I got what I wanted, I learned something, but I'm sure there was good stuff in the podcasts I skipped. ",
            "created": "Sat, 02 Jan 2021 14:33:21 GMT",
            "flInCalendar": true
        },
        {
            "text": "There are rules about this medium. It's not a joke -- it's for real and it looks like it's going to be here for a while. So we should be thinking about how to do the best possible podcast for people who are really interested in the depth the podcast medium offers that isn't available elsewhere.",
            "created": "Sat, 02 Jan 2021 14:31:37 GMT",
            "flInCalendar": true
        },
        {
            "text": "PS: [%search: Sanford Dickert%], a friend from the Kerry campaign and the first BloggerCon, does a daily thing on Facebook live video, riding a bike around London. I just kind of interviewed him, while he was riding, me on the keyboard, him on video and voice. I realized his is a podcast that's totally about how he's feeling, and of course it's interesting because <i>he's</i> interesting. So that's an obvious exception. ",
            "created": "Sat, 02 Jan 2021 14:57:34 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}