{
    "text": "Hearts of stone",
    "created": "Thu, 13 Jul 2023 11:50:50 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "When big tech companies say they love open formats and protocols, that means they're launching something new and they're just saying that so you relax about their intentions, which haven't actually changed at all.",
            "created": "Thu, 13 Jul 2023 11:51:03 GMT",
            "image": "https://imgs.scripting.com/2023/07/13/mrBurnsSimpsons.png",
            "flInCalendar": true
        },
        {
            "text": "That's why I say if they really want to prove their love for the open web, if they aren't just trying to lull us to sleep while they steal yet another market from the open web, they should do something that <a href=\"https://twitter.com/davewiner/status/1679125194764431360\">helps the web</a> more than it helps them. ",
            "created": "Thu, 13 Jul 2023 11:51:10 GMT",
            "flInCalendar": true
        },
        {
            "text": "I know how The Mind of Facebook works. There are people at the company who believe in the open web (or at least there were at one time) and some of them have the ability to launch projects to be part of the open web, but by the time the project has to get approval from one of the top execs, it dies -- because Zuck et al have hearts of stone, and think they can have anything that isn't nailed down, and think anyone who believes in being fair to users and competitors is a chump -- a Mother Teresa type, someone to laugh at not work with.",
            "created": "Thu, 13 Jul 2023 11:51:14 GMT",
            "flInCalendar": true
        },
        {
            "text": "There are very few people in the world as greedy and mean as Zuckerberg. Never underestimate how cold his heart is. And never believe he will do anything that benefits anyone but him.",
            "created": "Thu, 13 Jul 2023 11:51:18 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}