{
    "text": "Hello from the future",
    "created": "Thu, 29 Jun 2023 22:39:30 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "This post will appear on scripting.wordpress.com, a site I started a long time ago as an \"annex\" to my blog, providing support for trackback and comments. In August 2008, I stopped posting there, explained in <a href=\"http://scripting.com/stories/2008/08/09/disconnectingTheAnnex.html\">this post</a>, which also appeared on <a href=\"https://scripting.wordpress.com/2008/08/09/scripting-news-for-892008/\">the annex</a>.",
            "created": "Thu, 29 Jun 2023 22:40:53 GMT",
            "flInCalendar": true
        },
        {
            "text": "Now in 2023, I'm going to start cross-posting again, for different reasons. I want to show people how you can write for a powerful blogging platform like WordPress from an outliner running on the desktop. And for some writers this is going to be ideal, and for others maybe other approaches will be useful. The important point is that people should be able to decouple writing from hosting. The way the world works now it's like having to use a different word processor just because you bought a new printer! That would be terrible, but that's the world we've created on the web. I want to start creating more choices, by going first. ",
            "created": "Thu, 29 Jun 2023 22:42:57 GMT",
            "flInCalendar": true
        },
        {
            "text": "The great thing about Automattic is that they believe in user choice and open formats and protocols, it's in their DNA, and they've done an amazing job of keeping the APIs running all this time! I'm using the same API today that we used in 2000 to connect <a href=\"http://pikebeta.userland.com/whatIsThis\">Pike</a> to <a href=\"http://manila.userland.com/\">Manila</a>! Now that is some kind of interop. Whoa. Above and beyond.",
            "created": "Thu, 29 Jun 2023 22:44:56 GMT",
            "flInCalendar": true
        },
        {
            "text": "So over on the <a href=\"https://scripting.wordpress.com/2023/06/29/1475/\">WordPress site</a> it will feel like the microphone just came on again. Someone is speaking. That would be me. :smile:",
            "created": "Thu, 29 Jun 2023 22:46:06 GMT",
            "flInCalendar": true
        },
        {
            "text": "\"curly\"",
            "created": "Thu, 29 Jun 2023 22:46:35 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}