{
    "text": "We're cooked",
    "created": "Fri, 13 Aug 2021 19:42:44 GMT",
    "type": "outline",
    "metaImage": "http://scripting.com/images/2021/08/13/stoveOnFire.png",
    "description": "The planet is ruined for life as we know it. It's done. Nothing to worry about. It's over. ",
    "subs": [
        {
            "text": "I went for a walk in the noon heat and was wiped out.  ",
            "created": "Fri, 13 Aug 2021 19:42:59 GMT",
            "flInCalendar": true
        },
        {
            "text": "Listened to <a href=\"https://www.nytimes.com/2021/08/13/podcasts/the-daily/climate-change-IPCC.html\">today's lame Daily podcast</a>.",
            "created": "Fri, 13 Aug 2021 19:56:04 GMT",
            "flInCalendar": true
        },
        {
            "text": "The [[climate crisis]] is a lot worse than they were willing to say, obviously, based on facts they cited. ",
            "created": "Fri, 13 Aug 2021 19:56:29 GMT",
            "flInCalendar": true
        },
        {
            "text": "Then they got all weepy about how it's the fault of [[boomers]].",
            "created": "Fri, 13 Aug 2021 19:43:14 GMT",
            "flInCalendar": true
        },
        {
            "text": "Here's the story they should have reported.",
            "created": "Fri, 13 Aug 2021 19:44:02 GMT",
            "flNumberedSubs": "true",
            "subs": [
                {
                    "text": "We have not yet started to decrease carbon emissions, in fact it's still going up.",
                    "created": "Fri, 13 Aug 2021 19:44:26 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Even if we never emitted another ton of carbon, the next 30 years are going to be an escalating climate catastrophe. What we're seeing now is nothing compared to what we are certain to see in five years, ten years, all the way up to thirty years. ",
                    "created": "Fri, 13 Aug 2021 19:44:28 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Then in thirty years it will level off, assuming somehow in 2021 we stopped emitting any carbon. The climate will still be horrific but it won't get any worse. But (repeated, sorry) only if we turn our carbon emissions down to zero, now. ",
                    "created": "Fri, 13 Aug 2021 19:44:29 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "See <a href=\"http://scripting.com/2021/08/13/194244.html?title=wereCooked#a194426\">#1</a>.",
                    "created": "Fri, 13 Aug 2021 19:44:31 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "So the boomers are to blame, say the host and the guest. The guest is a boomer, the host is younger. This is where their version of the story ends. ",
                    "created": "Fri, 13 Aug 2021 19:44:32 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Here's the crazy part. They're doing exactly what the boomer supposedly did and feels so guilty about. Not owning the truth of now. Softening it. Shifting to blame instead of what to do. Now, even if we got our shit together, and we aren't and won't, we're <i>still</i> fucked. It's already too late.",
                    "created": "Fri, 13 Aug 2021 19:44:34 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "If the new generations are so cool, why are they doing the same thing? Why are they making it sound like we're not living in a wrecked ecosystem?",
                    "created": "Fri, 13 Aug 2021 19:44:35 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I know the answer. Here it is. It's a myth that anyone has any ability to turn the ship around, or even that all of us acting collectively could turn the ship around. ",
                    "created": "Fri, 13 Aug 2021 19:44:37 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The true story that I've yet to hear the NYT say, and today they had the perfect opportunity to say it, is that we're already over the cliff. The planet is ruined for life as it currently exists. It's done. Nothing to worry about. It's over. ",
                    "created": "Fri, 13 Aug 2021 19:44:39 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "PS: Here's the true true version of the story, an <a href=\"https://www.youtube.com/watch?v=XM0uZ9mfOUI\">excerpt</a> from The Newsroom, which was broadcast in 2014, seven years ago.",
            "created": "Fri, 13 Aug 2021 19:45:03 GMT",
            "urlvideo": "https://www.youtube.com/watch?v=XM0uZ9mfOUI",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}