{
    "text": "Jeff Jarvis and Dave in conversation",
    "created": "Mon, 01 Jul 2024 19:53:44 GMT",
    "type": "outline",
    "enclosure": "http://scripting.com/2024/07/01/jeffJarvisDiscusses.m4a",
    "enclosureType": "audio/x-m4a",
    "enclosureLength": "24718874",
    "subs": [
        {
            "text": "I just did an approx 40 minute <a href=\"http://scripting.com/2024/07/01/jeffJarvisDiscusses.m4a\">podcast</a> interview and discussion with <a href=\"https://en.wikipedia.org/wiki/Jeff_Jarvis\">Jeff Jarvis</a>. I know Jeff from the early days of blogging. He was one of the best discussion leaders at BloggerCon. And he's an accomplished author and educator. ",
            "created": "Mon, 01 Jul 2024 19:54:10 GMT",
            "flInCalendar": true
        },
        {
            "text": "We talk about how to organize news for people who are information starved by whatever it is that our news sources are doing, which is really hard to figure out, but in the end (I argue) who cares why, we have a problem to solve, so let's get on with it.",
            "created": "Mon, 01 Jul 2024 19:54:27 GMT",
            "flInCalendar": true
        },
        {
            "text": "I talk about the blogging at the Dean campaign in 2004, that's how they got around journalism. I'm sure that's where we have to go, put together what we think would be the Biden blog if the campaign was being run by Joe and Nicco, and I'd be on board, so would Jeff, and we'd help Heather Cox Richardson, and amplify anyone who is making sense and supports democracy. ",
            "created": "Mon, 01 Jul 2024 19:55:15 GMT",
            "flInCalendar": true
        },
        {
            "text": "It could be funded by the <a href=\"http://scripting.com/2016/07/01/1342.html\">People's PAC</a>, or something like it. It wouldn't take very much money, it's just a blog. But it would have powerful ideas that cut through the bullshit, and great videos, and we'd organize marches where people show up to help people.",
            "created": "Mon, 01 Jul 2024 19:56:58 GMT",
            "flInCalendar": true
        },
        {
            "text": "And the campaign would never stop, we'd always be organizing.",
            "created": "Mon, 01 Jul 2024 19:57:48 GMT",
            "flInCalendar": true
        },
        {
            "text": "This is the discussion I wanted to start. ",
            "created": "Mon, 01 Jul 2024 19:58:01 GMT",
            "flInCalendar": true
        },
        {
            "text": "Hope you enjoy! :-)",
            "created": "Mon, 01 Jul 2024 19:58:20 GMT",
            "flInCalendar": true
        },
        {
            "text": "PS: Jeff's mike is much better than mine. Gotta work on that. ",
            "created": "Mon, 01 Jul 2024 20:09:59 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}