{
    "text": "Morning Coffee Notes",
    "created": "Thu, 07 Jan 2021 15:27:45 GMT",
    "type": "outline",
    "isComment": "false",
    "subs": [
        {
            "text": "A few ideas early in the day...",
            "created": "Thu, 07 Jan 2021 15:27:38 GMT",
            "type": "outline",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "We really need to get Trump out of the White House. Yesterday, as the riot was developing, I posted on Twitter that this coup could be successful. They will try again. And remember there are 50 state capitals in the US. Any of them could be next. I hope they're preparing for it. Esp the swing states. ",
                    "created": "Thu, 07 Jan 2021 15:22:27 GMT",
                    "image": "http://scripting.com/images/2021/01/07/batman.png",
                    "flInCalendar": true
                },
                {
                    "text": "Impeachment? How fast could it happen? The Dems certainly have enough votes to impeach. Could they must 51 votes in the Senate to have a real trial? Could they somehow get 66 votes to convict? It may end up being symbolic, but censorship is not enough. Trump being the first president to be removed from office through impeachment would be the warning we needed at the beginning of 2020. It could give the Republican senators another chance to do the right thing. ",
                    "created": "Thu, 07 Jan 2021 15:23:50 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Communication. We need much better communication among all the American people. It's no longer acceptable that there be several versions of the truth. Radio Free America. It has to be less wish-washy and repetitive than Wolf Blitzer or as one-sided as Maddow. The NYT isn't it. ",
                    "created": "Thu, 07 Jan 2021 15:25:34 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Law enforcement. We have a big problem with the police, a lot of them are fascists, and support Trump. ",
                    "created": "Thu, 07 Jan 2021 15:27:00 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}