{
    "text": "Dave Winer, Human",
    "created": "Sat, 05 Aug 2023 12:16:28 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "When I started at Harvard in 2003, one of the first things I did was get my official ID card. When I got it, there was my picture. Underneath that was my name, and underneath that my status: Officer. It was a bit breathtaking. A few minutes before I was a schmuck. Now I was an officer at Harvard.",
            "created": "Sat, 05 Aug 2023 12:18:51 GMT",
            "flInCalendar": true
        },
        {
            "text": "I just had that kind of experience again. I went to my profile page on DALL-E, which I've been playing with lately, and there it said I was:",
            "created": "Sat, 05 Aug 2023 12:54:11 GMT",
            "flInCalendar": true
        },
        {
            "text": "<img src=\"https://imgs.scripting.com/2023/08/05/daveWinerHuman.png\" style=\"border: 1px solid silver; margin-left: 35px; padding: 10px;\">",
            "created": "Sat, 05 Aug 2023 12:19:12 GMT",
            "flInCalendar": true
        },
        {
            "text": "What an unusual perspective. Here's a place where saying someone is human is saying something. A familiar tweak I haven't felt in a while -- I am once again living in the future. 2023 has been like that for me, a lot of living in the past, and bringing it forward into the future, and then living in that future. I hope to do a lot more of that. Shoveling ideas from 20+ years ago that never got a chance into the future. ",
            "created": "Sat, 05 Aug 2023 12:19:13 GMT",
            "flInCalendar": true
        },
        {
            "text": "You know what we say about that..",
            "created": "Sat, 05 Aug 2023 12:21:32 GMT",
            "flInCalendar": true
        },
        {
            "text": "<i>Still diggin! </i>",
            "created": "Sat, 05 Aug 2023 12:21:37 GMT",
            "flInCalendar": true
        },
        {
            "text": "PS: I get this feeling sometimes when I start using a new keyboard, as I did this morning. It's a nice one, the same model as it replaces, which I just plain wore out. It will go to one of my other computers where it won't have so much work to do. Its profile would say: Dave's Keyboard, Keyboard. ",
            "created": "Sat, 05 Aug 2023 12:21:45 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}