{
    "text": "How journalism views Facebook",
    "created": "Wed, 25 Jul 2018 15:57:14 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "<a href=\"https://twitter.com/chrislhayes/status/1022118404411588610\">Chris Hayes</a>: \"Facebook is the equivalent of a massively profitable factory that just dumps all of its waste into the river and never has to pay for the cost to clean it up.\"",
            "created": "Wed, 25 Jul 2018 15:57:39 GMT",
            "urltweet": "https://twitter.com/chrislhayes/status/1022118404411588610"
        },
        {
            "text": "<a href=\"https://twitter.com/nxthompson/status/1022120139146321923\">Nicholas Thompson</a>: \"I think it's more like a massively profitable company that builds a giant river that everyone both drinks from and pees into. And it doesn't know how to clean it up.\"",
            "created": "Wed, 25 Jul 2018 15:58:13 GMT",
            "urltweet": "https://twitter.com/nxthompson/status/1022120139146321923"
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1022134114848309249\">Me</a>: \"That's not my experience as a FB user. I'd love to see a journalism outfit break out of the pack and take a contrary position, considering that FB has a tough problem and they're smart, and aren't doing a bad job of iterating to an answer.\"",
            "created": "Wed, 25 Jul 2018 15:59:13 GMT",
            "urltweet": "https://twitter.com/davewiner/status/1022134114848309249"
        },
        {
            "text": "There's a lot I don't like about Facebook, and I've been very <a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+facebook&t=h_&ia=web\">public</a> <a href=\"http://scripting.com/stories/2007/10/13/whyFacebookSucks.html\">about</a> it. But the criticism they're getting from the journalism world now is uniformly negative and not insightful and doesn't stimulate a useful discussion. It's mostly a woe-is-me look at how dumb they are (or corrupt or a horror show). ",
            "created": "Wed, 25 Jul 2018 15:59:51 GMT"
        },
        {
            "text": "I'd love to see journalism take a dispassionate and informed look at this, teach us something,  based on an understanding of the problem they're trying to solve. A perspective that a theater critic would have, or an art, movie, food or music critic. Some idea of how we got here. Think a few steps out into the future, add a sense of what's at stake, and what would happen if FB did what they believe they should obviously do (which would be imho about as successful as Trump's trade war). ",
            "created": "Wed, 25 Jul 2018 16:06:33 GMT"
        },
        {
            "text": "People who use Facebook seem to like it. The advertisers pay money to be there. If it were as bad as these guys say why would they do that? There's a lot of <a href=\"https://en.wikipedia.org/wiki/The_Fox_and_the_Grapes\">sour grapes</a> here, or the appearance of sour grapes. They have to watch out for that. And it begs the question if Facebook is so wrong, why have none of you ever tried to compete with them? ",
            "created": "Wed, 25 Jul 2018 16:05:47 GMT"
        }
    ]
}