{
    "text": "Where have you gone Walter Cronkite?",
    "created": "Sun, 24 Mar 2019 18:37:22 GMT",
    "type": "outline",
    "description": "People are covering climate change and Trump as if the normal rules of journalism can deal with these two crises. Clearly they cannot. We need a different approach.",
    "subs": [
        {
            "text": "Before <a href=\"https://www.youtube.com/watch?v=Dn2RjahTi3M\">Walter Cronkite</a> did an hour special <a href=\"https://www.npr.org/templates/story/story.php?storyId=106775685\">saying</a> the <a href=\"https://en.wikipedia.org/wiki/Walter_Cronkite#Vietnam_War\">Vietnam War</a> was unwinnable, press coverage was pretty much re-written press releases from the Pentagon. Cronkite's observation, that the war was unwinnable, turned press coverage in a different direction. The question of whether or not we should be in Vietnam was now something they could ask, and did.  ",
            "created": "Sun, 24 Mar 2019 18:37:37 GMT",
            "image": "http://scripting.com/images/2019/03/24/walterCronkite.png"
        },
        {
            "text": "We're in a similar situation now. People are covering climate change and Trump as if the normal rules of journalism can deal with these two crises. Clearly they cannot. We need a different approach.",
            "created": "Sun, 24 Mar 2019 18:38:58 GMT",
            "flNumberedSubs": "true"
        },
        {
            "text": "Postscript #1: Jon Stewart was definitely on track to be the current day Walter Cronkite before he left The Daily Show. I know he disclaimed that he was just a comedian, but he was much more than that. ",
            "created": "Sun, 24 Mar 2019 18:44:09 GMT"
        },
        {
            "text": "Postscript #2: Three observations that address the shortcomings of news in covering the current situation. If Cronkite were alive and observing the rise of Trump and our failure to address climate change, I'd like to think he'd do a corner-turn today like the one he did in 1968 around these ideas.",
            "created": "Sun, 24 Mar 2019 18:48:49 GMT",
            "flNumberedSubs": "true",
            "subs": [
                {
                    "text": "Occam's Razor. If it's obvious, report it as obvious.",
                    "created": "Sun, 24 Mar 2019 18:40:32 GMT"
                },
                {
                    "text": "Common sense. Life teaches us how people are. Use that info.",
                    "created": "Sun, 24 Mar 2019 18:40:50 GMT"
                },
                {
                    "text": "This is a dire situation. (Trump, climate change.)",
                    "created": "Sun, 24 Mar 2019 18:40:58 GMT"
                }
            ]
        },
        {
            "text": "Postscript #3: The title of this piece is derived from the song <a href=\"https://www.youtube.com/watch?v=9C1BCAgu2I8\">Mrs Robinson</a> by Simon and Garfunkel. ",
            "created": "Sun, 24 Mar 2019 18:51:15 GMT"
        }
    ]
}