{
    "text": "Copy/paste-to-publish",
    "created": "Tue, 06 Apr 2021 15:05:54 GMT",
    "type": "outline",
    "description": "it should be possible to hook your writing tool directly to both WordPress and Substack.",
    "subs": [
        {
            "text": "I started writing this email to <a href=\"https://twitter.com/jjn1\">John Naughton</a> re his recent <a href=\"https://johnnaughton.substack.com/\">Memex</a> daily posts, but I thought both of us being public writers, I should just post it here and send a pointer. So here goes. ",
            "created": "Tue, 06 Apr 2021 15:06:06 GMT",
            "subs": [
                {
                    "text": "John, I've been following the <a href=\"https://johnnaughton.substack.com/p/monday-5-april-2021\">story of the strange URLs</a> from your Substack newsletter. I also appreciated your telling how you produce your newsletter by <a href=\"http://scripting.com/images/2021/04/06/naughtonWorkflow.png\">copy/pasting</a> from WordPress into Substack. I bet 90 percent of Substack's text comes in this way. And that's what this letter is about. ",
                    "created": "Tue, 06 Apr 2021 15:06:44 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I've been asking them to automate that part for you via an API or RSS, or whatever they specify, to remove the copy/paste step from your publication workflow. I am deliberately being a squeaky wheel, hoping that writers who use Substack will join in.",
                    "created": "Tue, 06 Apr 2021 15:08:03 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Basically, it should be possible to hook your writing tool directly to both WordPress and Substack.",
                    "created": "Tue, 06 Apr 2021 15:20:35 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I would have used Substack myself if it weren't for this limit. As a writer, I want to eliminate steps, to make my writing more effortless. Publishing an idea takes too many steps, as a result, a lot of ideas don't get out. ",
                    "created": "Tue, 06 Apr 2021 15:08:32 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I want to have a better flow on the web as a writer, and I think if other writers knew what was possible they'd want it too, and hopefully they would write about it. You wrote about it yesterday! ;-)",
                    "created": "Tue, 06 Apr 2021 15:21:36 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "JN, writers have a lot more power imho than they think. Esp in the early days of a service like Substack. They are listening to you. They know they depend on you. If enough writers wanted a feature, they would implement it. That's how development works. ",
                    "created": "Tue, 06 Apr 2021 15:22:07 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Please consider writing something yourself about eliminating copy/paste-to-publish step. There's a lot of power trapped in that limit. ",
                    "created": "Tue, 06 Apr 2021 15:09:03 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Dave",
                    "created": "Tue, 06 Apr 2021 15:59:00 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PS: A <a href=\"https://twitter.com/davewiner/status/1379453137963122688\">feature request</a> for <a href=\"https://en.wikipedia.org/wiki/Permalink\">permalinks</a> in Substack.",
                    "created": "Tue, 06 Apr 2021 15:59:01 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}