{
    "text": "Introducing myself to Woodstock",
    "created": "Mon, 07 Oct 2019 16:11:06 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "<i>I just posted this to the private Woodstockers Say Anything group on Facebook. I've been living here since March, but mostly have been posting pictures and questions about what's going on here. This is the first time I've talked about what I do. I thought this was a good day to do it.</i>",
            "created": "Mon, 07 Oct 2019 16:11:14 GMT"
        },
        {
            "text": "I haven't really introduced myself to the Woodstock group, today is a good day to do that.",
            "created": "Mon, 07 Oct 2019 16:12:17 GMT"
        },
        {
            "text": "I am a software developer and one of the very first bloggers, starting back in 1994, on October 7."
        },
        {
            "text": "25 years ago today."
        },
        {
            "text": "These days I'm writing at my house in Woodstock.",
            "created": "Mon, 07 Oct 2019 16:13:14 GMT"
        },
        {
            "text": "I am lucky that the work I do can be done anywhere there's a net connection. So I've moved around quite a bit in the last 25 years. I started writing on the web in <a href=\"https://en.wikipedia.org/wiki/Woodside,_California\">Silicon Valley</a> in 1994. In 2003 I moved to Cambridge, MA, then tried Seattle and the beach in northeast Florida (I had family there). I spent a few years in Berkeley, and then when my father died in <a href=\"http://scripting.com/stories/2009/10/03/fathersDay.html\">2009</a>, I moved back to NYC (where I was born and raised) to be near my rapidly shrinking family. When my mom passed away in <a href=\"http://scripting.com/2018/02/11/152545.html\">2018</a>, I started looking for the next place, and this is where I landed.",
            "created": "Mon, 07 Oct 2019 16:14:44 GMT"
        },
        {
            "text": "I've always felt that my software development was an artistic endeavor. My materials are unusual, they're almost all virtual. But I've built quite a castle out of all that imagination. :-)"
        },
        {
            "text": "The next software product I ship will come from Woodstock. And I'm celebrating 25 years of blogging right here in the woods, with the sound of rain and the smell of nature all around me.",
            "created": "Mon, 07 Oct 2019 16:13:29 GMT"
        },
        {
            "text": "One of my mottos of blogging is this --"
        },
        {
            "text": "Still diggin! ;-)"
        },
        {
            "text": "PS: My blog is at http://scripting.com/."
        }
    ]
}