{
    "text": "Dear Jack, installment 2",
    "created": "Mon, 07 Oct 2019 16:56:41 GMT",
    "type": "outline",
    "description": "Twitter is a new kind of TV news looking for the right user interface. I don't think Moments is the answer. I think Checkbox News is.",
    "subs": [
        {
            "text": "<a href=\"https://en.wikipedia.org/wiki/Jack_Dorsey\">Jack Dorsey</a> subscribes to the email version of this blog, so I've started writing <a href=\"http://scripting.com/2019/09/30/132753.html\">directly to him</a> in an open format. I'd do the same for the CEOs of any other tech firm whose products I use. Free consulting. :-)",
            "created": "Mon, 07 Oct 2019 16:56:45 GMT",
            "image": "http://scripting.com/images/2017/10/10/maude.png"
        },
        {
            "text": "Anyway, I find myself hooking into <a href=\"https://twitter.com/PitchingNinja/status/1181268716056657925\">videos</a> on Twitter more and more. Like this ridiculous annoying exasperating <a href=\"https://twitter.com/MSNBC/status/1181249348824379393\">interview</a> with a Bush-era Republican, shilling for Trump while trying to sound reasonable. ",
            "created": "Mon, 07 Oct 2019 16:57:34 GMT",
            "urltweet": "https://twitter.com/MSNBC/status/1181249348824379393"
        },
        {
            "text": "More and more, news orgs are posting short bits of video to Twitter. It's growing, and that's imho good.  Further, Twitter has a good API and it's relatively stable and liberal. I've thought for a long time that their API is their big advantage. As a developer I'd like to see them do more with it.",
            "created": "Mon, 07 Oct 2019 16:58:17 GMT"
        },
        {
            "text": "Twitter is a new kind of TV news looking for the right user interface. I don't think Moments is the answer. I think Checkbox News is. ",
            "created": "Mon, 07 Oct 2019 16:59:08 GMT"
        },
        {
            "text": "Here's the idea of <a href=\"http://scripting.com/stories/2007/04/24/checkboxNews.html\">Checkbox News</a> in an <a href=\"http://scripting.com/images/2019/10/07/checkboxNewsFullSize.png\">image</a>. ",
            "created": "Mon, 07 Oct 2019 17:00:08 GMT"
        },
        {
            "text": "I did this around the time Boris Yeltsin died and the Virginia Tech massacre. I want to watch the news while I work, or tweet while I watch the news, basically <i>news isn't the only thing I'm doing. </i>I want a bit of control over what flows through the video window. I got it, Yeltsin died. All the reports are starting to sound the same, so I uncheck it. No more news of Yeltsin. ",
            "created": "Mon, 07 Oct 2019 17:06:27 GMT"
        },
        {
            "text": "As media has progressed, we've learned that sometimes it's best to turn things on, and in other contexts that's too much work, I want others to do it for me, and then I need the ability to turn things off. TV news is most definitely in the latter category.",
            "created": "Mon, 07 Oct 2019 17:02:12 GMT"
        },
        {
            "text": "With the flow that Twitter already has, if trusted news sources (a super important concept that should also be developed, not by Twitter) would add keywords to their video uploads, we could have Checkbox News running pretty quickly, maybe as early as next year. ",
            "created": "Mon, 07 Oct 2019 17:03:12 GMT"
        }
    ]
}