{
    "created": "2022-07-01T04:00:00.000Z",
    "flInCalendar": true,
    "name": "01",
    "path": "2022/07/01",
    "text": "July 01",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Thanks to <a href=\"https://johnnaughton.substack.com/p/friday-1-july-2022\">John Naughton</a> for the <a href=\"http://scripting.com/images/2022/07/01/naughtonBit.png\">praise</a>, esp of my recent 25-minute <a href=\"http://scripting.com/2022/06/25/dontWasteAGoodCrisis.m4a\">podcast</a>. We're at those one of those moments when things change radically and those are the best times to check in with some ideas of what needs changing, because <i>you</i> can change things too when the world is falling apart if you keep your head from exploding. I tell you why and I even tell you what to change! 1. Shut down the Supreme Court. 2. Do away with the fillibuster, the Electoral College and the Senate. 3. Then reinstate the court with more justices and term limits of say 10 years. At that point we will actually have representative government and fewer stale old hacks on the court nursing their grievances and taking it out on us.  ",
            "created": "Fri, 01 Jul 2022 14:03:57 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2022/06/28/wimpy.png",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1542798905661956097\">Will we</a> come to despise Christianity in the US? I ask this question because up to this last week I felt that Christianity was other people’s problem, not mine. But they’ve captured the Supreme Court, and they’re using it to force their religion on the rest of us. So it’s no longer something that I can be neutral about. It seems that eventually, maybe very soon, we will come to hate Christianity.",
            "created": "Fri, 01 Jul 2022 13:33:21 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1543031777291378690\">Have you</a> ever saved another person’s life?",
            "created": "Sat, 02 Jul 2022 01:56:14 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"http://scripting.com/images/2022/07/01/pearlHarbor.png\">New header image</a>. Pearl Harbor in 1941. ",
            "created": "Sat, 02 Jul 2022 01:54:27 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The montly ritual is done. Here's <a href=\"https://raw.githubusercontent.com/scripting/Scripting-News/master/blog/opml/2022/06.opml\">the OPML</a> for June 2022. Let's get started on July! :boom:",
            "created": "Fri, 01 Jul 2022 13:43:07 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Joe Biden's failure",
            "created": "Fri, 01 Jul 2022 17:40:50 GMT",
            "type": "outline",
            "description": "They had 58 days to stop the attack.",
            "metaImage": "http://scripting.com/images/2022/07/01/pearlHarbor.png",
            "subs": [
                {
                    "text": "Here's what <a href=\"https://twitter.com/JoeBiden/status/1521551422931845123\">Joe Biden said</a> in a tweet on May 3, the day after the Dobbs decision leaked in advance of it's release this week.",
                    "created": "Fri, 01 Jul 2022 17:41:01 GMT",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "<i>We will be ready when any ruling is issued.</i>",
                            "created": "Fri, 01 Jul 2022 17:41:51 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "They had 58 days to stop the attack. To have a powow with the court, and ask if they really planned to issue such a decision and when they said yes, shut it down before they had the chance to make it official. ",
                    "created": "Fri, 01 Jul 2022 17:42:11 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "You don't react to an attack on Pearl Harbor. If you know it's coming, you stop it.",
                    "created": "Fri, 01 Jul 2022 17:49:04 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Look what happened instead. They got to announce that ruling and a half-dozen others, all that are head shots to American democracy. Now Biden, as president, is occupying an office with no power.",
                    "created": "Fri, 01 Jul 2022 17:42:50 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The Democrats, <a href=\"https://twitter.com/davewiner/status/1543051727569657861\">Obama</a>, Clinton and now Biden have stood by and watched while the Repubs went deeper and deeper, cutting every artery of our system, and they still act as if this all is business as usual. Could they be that stupid or cowardly or are they just actors. My guess is that we're the ones who have been duped, and after all they are just actors and know exactly what they're doing.",
                    "created": "Fri, 01 Jul 2022 17:44:02 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}