{
    "created": "2022-07-07T04:00:00.000Z",
    "flInCalendar": true,
    "name": "07",
    "path": "2022/07/07",
    "text": "July 07",
    "type": "calendarDay",
    "subs": [
        {
            "text": "This is an <a href=\"https://twitter.com/jakeludington/status/1545042178942021634\">example</a> of a Twitter Note. It <a href=\"http://scripting.com/images/2022/07/07/twitterNotePresents.png\">presents</a> as a link to an off-site story. When you click the link, it takes you to a <a href=\"https://twitter.com/i/notes/1544501177814880256\">page</a> on twitter.com, where you can read the story, which is limited to 2500 words (a lot). It can include images and embedded tweets and links to offsite pages. The author uses some bold and italic styling. A story has a title. All this is good. Are there limits on what you can link to? Impossible to say. The link to the note also includes a link to a <a href=\"https://help.twitter.com/en/using-twitter/notes\">howto page</a> for Twitter Write, which presumably is the tool you use to write a Twitter Note. You can edit a note after posting it, unlike a tweet. They say they are still developing it. I highly recommend a different user interface on the Twitter timeline, that they present a note analogously to how they present an image, video, audio chat, etc -- that is, inline. I did a <a href=\"http://scripting.com/2015/10/02/whatWouldAFatTweetLookLike.html\">mockup</a> of how this would work in 2015. The way they present it now, i think most users will see the links to notes as they see all other links, not worth the trouble. By putting it inline, they start reading, and when they want more, they just click the more link. There's great prior art for this -- Facebook. It works there, it would work great on Twitter. ",
            "created": "Thu, 07 Jul 2022 13:49:46 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/06/11/pizza.png",
            "flInCalendar": true
        },
        {
            "text": "BTW -- to <a href=\"https://twitter.com/TwitterDev\">TwitterDev</a> -- is there an API for Notes? This is a crucial question. If yes, then devs will be able to hook great editorial tools to Twitter in ways no one has been able to do before. It will open so many doors not just for Twitter, but for the entire net. ",
            "created": "Thu, 07 Jul 2022 14:16:44 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The other day I replied to a tweet by a famous  columnist and even though the trolls couldn't reply, a  number of them did QT it with the usual boring crap. Then I remembered I had turned Twitter's quality filter off. I turned it on and they went away. Poof. As if they never existed. ",
            "created": "Thu, 07 Jul 2022 14:36:32 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}