{
    "created": "2022-07-08T04:00:00.000Z",
    "flInCalendar": true,
    "name": "08",
    "path": "2022/07/08",
    "text": "July 08",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Twitter tanking would be far worse than Google pulling the plug on <a href=\"http://daytona.scripting.com/?q=google%20reader&collection=scriptingnews\">Google Reader</a> in 2013. The whole world is in a way built around Twitter, and it works pretty well. ",
            "created": "Fri, 08 Jul 2022 22:28:17 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Someone needs your lungs or they'll die. You're taken to a hospital where your bodies are connected. You are now breathing for two people. If you disconnect that's \"abortion\" and it's illegal. ",
            "created": "Fri, 08 Jul 2022 21:30:31 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "twitter thinks one of my domains is a \"malware url\" -- but it's not -- until now it wasn't being used for anything other than a parked home page. i'm not finding anything online about this error... obviously it's in some database somewhere somehow. but it makes the domain unusable. good thing it's a cheap one. but it was a very good domain for the product. oy.",
            "created": "Fri, 08 Jul 2022 17:24:04 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/06/11/strongman.png",
            "flInCalendar": true
        },
        {
            "text": "As if to prove that billionaires can be putzes too, <a href=\"https://www.cnbc.com/2018/05/02/jeff-bezos-this-is-what-you-are-going-to-regret-at-80.html\">Jeff Bezos says</a> the same old boring shit about what you'll regret when you're 80. I mean how could he know. If he asked 80-year-olds there's a pretty good chance they lie to him, I expect. I wouldn't trust them. Here's what I think, <a href=\"https://twitter.com/davewiner/status/1545431247417139200\">this</a> is what you'll regret at 80 -- that you aren't 20. Heh. And btw it's because sex is great at 20. So if you're 20 you should do a lot of that. At least it'll make you smile when you're 80 (I imagine).",
            "created": "Fri, 08 Jul 2022 15:50:59 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Every time I hear someone talk about podcasting in such a <a href=\"https://twitter.com/richardberryuk/status/1545385842956550145\">mainstream way</a> I feel a sense of accomplishment. Podcasting made a difference. It worked. The thing that really gives me pride is that it can serve as an example to young developers that their work can make a difference, and it isn't all about making huge piles of money, and you don't have to work for a big corporation, if you think creatively and seek out others with a similar perspective.",
            "created": "Fri, 08 Jul 2022 15:23:20 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}