{
    "created": "2022-07-12T04:00:00.000Z",
    "flInCalendar": true,
    "name": "12",
    "path": "2022/07/12",
    "text": "July 12",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I can't wait until we get the timeline of what Trump was doing while the battle of the Capitol was going on. What snacks did he order from the White House kitchen. How many Quarter Pounders? Who was he talking with on the phone? Was he sexually aroused?",
            "created": "Tue, 12 Jul 2022 23:21:52 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2022/07/12/quarterPounderWithCheese.png",
            "flInCalendar": true
        },
        {
            "text": "Imagine a person in a boat on the <a href=\"https://en.wikipedia.org/wiki/Niagara_River\">Niagara River</a> about to go over the <a href=\"https://en.wikipedia.org/wiki/Niagara_Falls\">falls</a>. A reporter wants to cover both sides. The problem that needs solving is pretty clear, there aren't sides. When it gets that simple (like now) there's nothing left to debate. ",
            "created": "Tue, 12 Jul 2022 16:49:00 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I look forward to forgetting the name \"Steve Bannon.\"",
            "created": "Tue, 12 Jul 2022 14:04:28 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The big <a href=\"https://webb.nasa.gov/content/webbLaunch/countdown.html\">NASA press conference</a> is at 10:30AM Eastern.",
            "created": "Tue, 12 Jul 2022 13:58:46 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Two-way RSS",
            "created": "Tue, 12 Jul 2022 17:09:55 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I'm thinking a lot about \"RSS\" this year.",
                    "created": "Tue, 12 Jul 2022 17:10:01 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "As a reader, I have no problem with a publishing site like <a href=\"https://substack.com/\">Substack</a> only doing outbound RSS. All my reading tools can hook into their authors' writing. It's good.",
                    "created": "Tue, 12 Jul 2022 17:11:02 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "But as a writer, I can't use a system that doesn't do inbound RSS. It's the inverse of the silo problem. ",
                    "flInCalendar": true
                },
                {
                    "text": "Such a site insists that I do all my writing on there. That's a deal-stopper because I already have my best writing tool and I do all my serious writing in that tool.  It's as if a radio station insisted that I use their guitar to play music. ",
                    "flInCalendar": true
                },
                {
                    "text": "Someday we'll look back on this practice and think how could we have missed something so obvious. ",
                    "flInCalendar": true
                },
                {
                    "text": "I've asked writers who use Substack how they feel about this, with mixed results. None of the writers are thinking about it very much, apparently. ",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Give us something to remember",
            "created": "Tue, 12 Jul 2022 13:18:39 GMT",
            "type": "outline",
            "description": "The first photo from the JWST was a nothingburger.",
            "metaImage": "http://scripting.com/images/2022/07/12/aRandomBitOfCosmos.png",
            "subs": [
                {
                    "text": "I was hoping for something spectacular from the <a href=\"https://www.nasa.gov/image-feature/goddard/2022/nasa-s-webb-delivers-deepest-infrared-image-of-universe-yet\">first photo</a> released from the <a href=\"https://en.wikipedia.org/wiki/James_Webb_Space_Telescope\">JWST</a> yesterday at 5PM, but when I saw it I had no idea what I was looking at. The explanations were technical, and while I am technical in some areas, the cosmos is not one of them. Also as someone who was raised in NYC -- I didn't grow up with a view of the cosmos as people who live in more rural areas do. So none of what we saw in that photo means much to me. ",
                    "created": "Tue, 12 Jul 2022 13:07:01 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "We were told by experts that this was really impressive, I'm sure they're right -- but I was hoping for something that would make me gasp, that would give us <i>all</i> something to remember. ",
                    "created": "Tue, 12 Jul 2022 13:19:22 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I am old enough to remember the first <a href=\"http://scripting.com/2014/07/20/#a1405894933\">moon landing</a> in 1969. I suppose there were some who said they shouldn't bother with a TV camera for live broadcasts, but they had it, and we saw Neil Armstrong climb down the ladder and say his famous first words. This moment is probably just like that. The first time we're seeing the cosmos as a peer, not from the point of view of someone on or near a planet, but from the perspective of a solar system. Maybe at some point we'll have a telescope outside of our solar system, but I won't be around for that.",
                    "created": "Tue, 12 Jul 2022 13:19:40 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "When I tuned in at 5PM for the great unveiling, I was greeted with nothing. There was nothing on the TV channels I tuned into. Nothing on Twitter. A few hours later on Twitter I saw a picture a bunch of blurry lights. I was told this was it. Come on folks, point the camera at something we know. <a href=\"https://solarsystem.nasa.gov/resources/2490/saturns-rings-shine-in-hubble-portrait/?category=planets_saturn\">Saturn</a> perhaps. Maybe Earth. It's not what the telescope is for, I get it, nor was the moon landing for sending a TV show back to Earth, but we're the audience for the moment. Give us something we can remember.",
                    "created": "Tue, 12 Jul 2022 13:19:58 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Anyway there's another moment coming up this morning, <a href=\"https://webb.nasa.gov/content/webbLaunch/countdown.html\">the official unveiling</a>. I hope to be emotionally overcome with pride and amazement and a bit more optimism for the future. Give us a show. Something we can write about and say \"I was there when..\"  ",
                    "created": "Tue, 12 Jul 2022 13:20:20 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PS: Here are some of the <a href=\"https://esahubble.org/images/archive/top100/\">best photos</a> taken from the <a href=\"https://en.wikipedia.org/wiki/James_Webb_Space_Telescope\">JWST's</a> predecessor, the <a href=\"https://en.wikipedia.org/wiki/Hubble_Space_Telescope\">Hubble</a>. ",
                    "created": "Tue, 12 Jul 2022 13:33:12 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PPS: Later in the day here are some of the most <a href=\"https://www.nytimes.com/2022/07/12/science/space/james-webb-telescope-photos.html?unlocked_article_code=AAAAAAAAAAAAAAAACEIPuomT1JKd6J17Vw1cRCfTTMQmqxCdw_PIxftm3iWka3DKDm8YiP8eAoWG8EqKfrJqbNZ03T2eScQEL7IlTrluw-tSJEdqUwTtupuDhJMeZSUprIb5FkUH46XwZ5Fquzn7cjv-b-5l2Ly0ux_BOWO7XabbhXc-JV00p49iJ1H7xSQIwP_aR7Mk09cq3PchBp15Vi5AMHfRx4TgCR14PNuGagiNqVVlHrEEBkyA2IKU-LkCcw5NCFzZTHgZ4mw06dlUO95_L7-oZld7O5K42eNNfzQueIS5BJQxRJzWnqFpsdPNqx-Oysm2wpYmBWTby2YoUn0J__qks_sG-yA&smid=url-share\">spectacular pictures</a> from the JWST as assembled by the NYT (no paywall). ",
                    "created": "Tue, 12 Jul 2022 23:01:33 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}