{
    "created": "2022-07-18T04:00:00.000Z",
    "flInCalendar": true,
    "name": "18",
    "path": "2022/07/18",
    "text": "July 18",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Today's song: <a href=\"https://www.youtube.com/watch?v=t1Jm5epJr10\">I am the Walrus</a>.",
            "created": "Mon, 18 Jul 2022 21:59:20 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Programming note: September 18 is the 20th anniversary of RSS 2.0. After 20 years, there's a <i>lot</i> of new stuff that wasn't there when RSS 2.0 was rolled out, that because RSS has been stagnating, hasn't been added to the mix. I never should have stopped working on it, but the environment then was crazy. Anyway, I decided, at the beginning of 2022, that I'd spend the whole year building a new RSS toolkit. A top to bottom review. Only constraint is everything must be compatible with what's out there. With lots of room for innovation and refinement. Anyway -- today is a big day in the process. A lot of stuff is working, very little of it is visible. But a bunch of stuff that will make your brain explode, a little, is now available. If you care about RSS, please set aside a little time to focus on what's here in the blog for today. It's not complicated, but it is new. :smile:",
            "created": "Tue, 19 Jul 2022 02:38:41 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2022/07/18/20.png",
            "flInCalendar": true
        },
        {
            "text": "Twitter + RSS + Markdown",
            "created": "Mon, 18 Jul 2022 16:36:58 GMT",
            "type": "outline",
            "description": "I've added Markdown to RSS, and hooked Twitter up to RSS. And of course because it's all open, any RSS reader can support this.",
            "subs": [
                {
                    "text": "Here's an <a href=\"http://xmlviewer.scripting.com/?url=http://feedland.org/twitterfeeds/cluelessnewbie/rss.xml\">RSS feed</a> for the tweets on my cluelessnewbie test account. This is new. Look at the items in that feed, you'll see each has a  <i>source:markdown</i> element. It's explained in the <a href=\"http://source.scripting.com/#1653758422000\">docs</a> for the Source namespace. ",
                    "created": "Mon, 18 Jul 2022 16:31:11 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I entered a <a href=\"https://twitter.com/cluelessnewbie/status/1549068783066791937\">thread</a> in Twitter, using Markdown to style lists, text, links and code. Also note that the first item in the Twitter thread begins with a single #, which my processor interprets as it being the title for the RSS item. Believe it or not that fixes a pretty big mismatch in the connection between Twitter and RSS, titles. If you remember reading Twitter feeds in Google Reader you'll know what I mean. :smile:",
                    "created": "Mon, 18 Jul 2022 16:47:44 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The text starts in Twitter, goes out through RSS, is processed by Markdown, and rendered predictably in my reader app. ",
                    "created": "Mon, 18 Jul 2022 16:40:44 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The Twitter <a href=\"https://twitter.com/cluelessnewbie/status/1549068783066791937\">thread</a>, <a href=\"http://scripting.com/images/2022/07/18/markdownInAFeedFromATweet.png\">as rendered</a> in my RSS reader.",
                    "created": "Mon, 18 Jul 2022 17:00:35 GMT",
                    "inlineImage": "http://scripting.com/images/2022/07/18/aBunchOfMarkdown.png",
                    "flInCalendar": true
                },
                {
                    "text": "Summary: We've added Markdown to RSS, and hooked Twitter up to RSS. And of course because it's all open, any RSS reader can support this.",
                    "created": "Mon, 18 Jul 2022 16:59:58 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "In the old days on \"Scripting News\" when something like this worked I'd end the post with..",
                    "created": "Mon, 18 Jul 2022 16:38:29 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "<i>Bing!</i>",
                    "created": "Mon, 18 Jul 2022 16:38:36 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PS: Support for this feature is already in the <a href=\"https://github.com/scripting/reallysimple/blob/main/worknotes.md\">reallySimple package</a>. ",
                    "created": "Mon, 18 Jul 2022 17:07:49 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PPS: Here's a <a href=\"https://github.com/scripting/reallysimple/discussions/6\">place</a> to ask questions. ",
                    "created": "Mon, 18 Jul 2022 17:13:58 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Debuggers",
            "created": "Mon, 18 Jul 2022 22:21:28 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I've heard of programmers who don't use a debugger. I couldn't work without one. After almost 10 years of working in JavaScript I've got the debugger working almost as well as the one in Frontier. I use the debugger to write code -- if I want to see the data my code has to work with, I don't have to figure it out, I can see it. A debugger isn't just for fixing mistakes, it's for exploring the inner workings of code you might not be familiar with. The first really great debugger I used was THINK C. It made it possible for me to do much more complex projects, for example \"Frontier\". ",
                    "created": "Mon, 18 Jul 2022 15:50:46 GMT",
                    "image": "http://scripting.com/images/2019/03/14/cowgirl.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Won't get fooled again",
            "created": "Mon, 18 Jul 2022 22:00:14 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "You can invent and evolve a new sport if you are all the elements, yourself. If you're can play all the roles, have a venue, journalists (cover it), and you have fans. If you want to change the rules, you don't need to get anyone's approval, you just need a vision. ",
                    "created": "Mon, 18 Jul 2022 15:40:57 GMT",
                    "type": "outline",
                    "flInCalendar": true
                },
                {
                    "text": "That's how I got blogging going. I had tools for writing, and reading, and I generated feeds myself because I am a writer. I don't have to wait to find a writer who will try out my latest ideas. Or get a feed reader to support the feature, or have editing tools so that other people can do it. It happened even faster with evolving podcasting because it was the second time around, and people were paying attention to the blogs we created in Step 1. ;-)",
                    "created": "Mon, 18 Jul 2022 22:01:58 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "With RSS 2.0, I was intimidated when big companies and VCs got in the way. In the future I'll keep cruising because I know I have a better sense of what's needed than they do because they just hire bored employees to work on my ideas. None of them had the guts, curiousity or frankly enough intelligence to work with the person who put it all together. Learned that lesson after twenty years of stagnation in <a href=\"http://rss.land/\">RSS-Land</a>. No more of that. ",
                    "created": "Mon, 18 Jul 2022 22:02:08 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PS: I turned this post into a <a href=\"https://twitter.com/cluelessnewbie/status/1549146834689556481\">thread</a> on Twitter. ",
                    "created": "Mon, 18 Jul 2022 21:39:47 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PPS: You can read the feed <a href=\"http://feeder.scripting.com/?template=mailbox&feedurl=http://feedland.org/twitterfeeds/cluelessnewbie/rss.xml\">here</a>. And, of course -- a <a href=\"http://scripting.com/images/2022/07/18/cluelessscreenshot.png\">screen shot</a>. ",
                    "created": "Mon, 18 Jul 2022 22:13:23 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PPPS: The title of this post comes from a <a href=\"https://www.youtube.com/watch?v=SHhrZgojY1Q\">great song</a> by The Who.",
                    "created": "Mon, 18 Jul 2022 22:03:37 GMT",
                    "urlvideo": "https://www.youtube.com/watch?v=SHhrZgojY1Q",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}