{
    "created": "2022-07-31T04:00:00.000Z",
    "flInCalendar": true,
    "name": "31",
    "path": "2022/07/31",
    "text": "July 31",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I heard yet another piece on NPR this morning wondering why Biden's approval rating is so low. First question, who has ever shown that this number means anything? Esp at the end of July, the middle of the summer two years before he's up for re-election. Second, the reason his approval rating is so low is that he's old and frail. On the other hand, I know he's in great shape. But when he's giving a prepared speech, the makeup is bad, or the lighting, but his eyes have the beady look of a very old person. And he is terrible at reading speeches. The intonation is all wrong. There's nothing human about it. I imagine they've hired coaches to try to improve this, but he hasn't gotten better. Funny thing is, when he's doing a press conference, which is very rare, he's great! His mind is sharp, he's an excellent communicator. You quickly forget how old he is. My guess is that his handlers think the <a href=\"https://www.theguardian.com/us-news/2019/apr/25/joe-biden-2020-public-gaffes-mistakes-history\">famous Biden gaffes</a> are too expensive, so they play it safe with the prepared remarks approach. I don't think it's working. It's the source of \"he's too old.\" And ultimately who cares what NPR thinks anyway. Stop worrying. Let Biden be Biden. ",
            "created": "Sun, 31 Jul 2022 14:08:34 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/01/25/chickenOnWhiteHouse.png",
            "flInCalendar": true
        },
        {
            "text": "As I work on my software, when I get something cool working I reward myself by playing <a href=\"https://www.youtube.com/watch?v=pW3PSKJ-Bik&t=1s\">Squeezebox</a> on my <a href=\"https://www.amazon.com/dp/B07G9Y3ZMC/\">Echo Studio</a>. ",
            "created": "Sun, 31 Jul 2022 16:03:11 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=pW3PSKJ-Bik&t=1s",
            "flInCalendar": true
        },
        {
            "text": "You know how Amazon was <a href=\"https://www.npr.org/2022/06/23/1107079194/amazon-alexa-dead-relatives-voice\">experimenting</a> with having Alexa assume the voices of dead relatives. Probably not a great idea, but I just thought of <a href=\"https://en.wikipedia.org/wiki/Wolfman_Jack\">someone</a> who I'd love have <a href=\"https://www.youtube.com/watch?v=KtNa9v9d5v4&t=97s\">announcing my musical</a> choices. ",
            "created": "Sun, 31 Jul 2022 16:03:33 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=KtNa9v9d5v4&t=97s",
            "flInCalendar": true
        },
        {
            "text": "No wonder \"rss.land\" is such a mess. No one has been caring for it, for 20 years. People try to own it, exploit it, and when they fail, dump it. In that way it's amazing how strong it is. Even though we haven't been caring for RSS, it keeps going. ",
            "created": "Sun, 31 Jul 2022 14:06:23 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Why isn't there a Reproductive Rights Pac like the NRA. One that rates candidates on their support for women. One that we can give money to that they in turn give to candidates that campaign on Reproductive Rights. It's not enough to be for it, you have to campaign for it. Of course people will say it's Planned Parenthood, but they do more than that. I'm talking about a PAC that's focused on making abortion rights a major issue in all elections until the Dobbs decision is reversed.",
            "created": "Sun, 31 Jul 2022 13:53:36 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "August is the best month. Everyone is nice and relaxed. Nothing to do. No major holidays. Swimming. BBQs. Book reading. Hanging around doing nothing. Everyone is somewhere else. Baseball. Warm. Shorts. Hikes. Bikes. Beach. Fresh fruit and veggies.",
            "rawText": "August is the best month. Everyone nice and relaxed. Nothing to do. No major holidays. Swimming. BBQs. Book reading. Hanging around doing nothing. Everyone is somewhere else. Baseball. Warm. Shorts. Hikes. Bikes. Beach.",
            "type": "tweet",
            "created": "Sun, 31 Jul 2022 10:03:32 GMT",
            "tweetId": "1553682765610160128",
            "urltweet": "https://twitter.com/davewiner/status/1553682765610160128",
            "tweetUserName": "davewiner",
            "flInCalendar": true
        }
    ]
}