{
    "text": "Ain't too proud to blog",
    "created": "Sun, 14 Nov 2021 14:19:02 GMT",
    "type": "outline",
    "description": "News orgs should run a 'river of sources' their reporters and editors consider authoritative.",
    "metaImage": "http://scripting.com/images/2021/11/13/algorithmicHumans.png",
    "subs": [
        {
            "text": "<a href=\"https://twitter.com/jeffjarvis/status/1459864763635314693\">Jeff Jarvis</a> generously gave me support for the idea of using rivers in news orgs. I want to clarify that:",
            "created": "Sun, 14 Nov 2021 14:19:09 GMT",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "I appreciate the support. :smile: ",
                    "created": "Sun, 14 Nov 2021 14:19:56 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I don't think I've ever \"begged\" though at times I imagine it might have seemed that way.",
                    "created": "Sun, 14 Nov 2021 14:20:01 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "And I haven't been promoting rivers to them for quite some time, because I think the problems are much bigger now. ",
                    "created": "Sun, 14 Nov 2021 14:20:22 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "I think the most important thing news orgs can do to improve their service is to include ideas and perspectives from outside the newsroom, esp those that are critical of their work. ",
            "created": "Sun, 14 Nov 2021 14:21:03 GMT",
            "flInCalendar": true
        },
        {
            "text": "I would encourage a news org to run a <i>river of sources</i> their reporters consider authoritative. Blogs, newsletters, and whatever new <a href=\"https://en.wikipedia.org/wiki/Underground_press\">forms</a> <a href=\"https://en.wikipedia.org/wiki/Pamphlet\">come</a> up in the future. This would initially be an internal resource, but the obvious next step is to share the resource with their readers, in the interest of increasing news flow, broadening perspectives, and also introducing transparency. And perhaps most important to introduce criticism of their work to their flow, something we need and they need. If I were going to beg for anything that would most likely be it. I wrote about how this would work in more detail in <a href=\"http://scripting.com/2015/05/13/howToHaveAFuture.html\">May 2015</a>. ",
            "created": "Sun, 14 Nov 2021 15:21:47 GMT",
            "flInCalendar": true
        },
        {
            "text": "When I read yet another NYT article or op-ed about how Facebook is letting us down, I keep wondering when they're going to look at how <i>they</i> contribute to this problem, how their coverage of Hillary's Emails, for example, gave Trump the White House, and set the country on the path to authoritarianism. I think they did far more damage than Facebook, and not surprisingly, that has not been examined to anywhere near the extent Facebook has. This is a serious problem, and it's not going to get better in the current news system. That's where rivers could make a huge difference, if they cared enough about the service they provide readers.",
            "created": "Sun, 14 Nov 2021 14:22:50 GMT",
            "flInCalendar": true
        },
        {
            "text": "PS: <a href=\"http://nytimesriver.com/\">This</a> is what a River of News looks like. ",
            "created": "Sun, 14 Nov 2021 14:32:50 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}