{
    "text": "My holiday binges",
    "created": "Fri, 20 Dec 2019 21:14:46 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "No <a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+njff&t=h_&ia=web\">NJFF</a> this year unless there's an epic BitTorrent dump of the new releases (it has happened in past years). I live too far out of <a href=\"https://en.wikipedia.org/wiki/New_York_City\">the city</a> to get to openings. So that means one thing -- binges! Here's what I have queued up.",
            "created": "Fri, 20 Dec 2019 21:14:53 GMT",
            "image": "http://scripting.com/images/2019/12/20/fsociety.png",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "Watchmen. Everyone says it's great, so I have to watch it. ",
                    "created": "Fri, 20 Dec 2019 21:16:01 GMT"
                },
                {
                    "text": "The Morning Show. I watched the first two episodes when it first came out and waited until the full series was out, and as of tonight, it is. It got terrible reviews, but I loved it. ",
                    "created": "Fri, 20 Dec 2019 21:16:23 GMT"
                },
                {
                    "text": "True Detective. I skipped the second season, but the third is good, they say. ",
                    "created": "Fri, 20 Dec 2019 21:20:26 GMT"
                },
                {
                    "text": "Mr Robot finale. On Sunday. The final episode of the final season. The last episode was the big reveal, as far as we know right now, Elliot and Darlene weren't really the stars of the show, White Rose was. But there's still another hour to go, and the writing and everything has been so superb, they got me. ",
                    "created": "Fri, 20 Dec 2019 21:17:11 GMT"
                },
                {
                    "text": "Handmaid's Tale. I tried watching the new season earlier, but I didn't remember enough from the previous season to make sense of it. I have it on my list to try again.",
                    "created": "Fri, 20 Dec 2019 21:28:11 GMT"
                },
                {
                    "text": "The Expanse? I know so many people who love it, but I watched the first season and it never got me. But it looks like it might be a Battlestar Galactica type show, which I loved. ",
                    "created": "Fri, 20 Dec 2019 21:29:39 GMT"
                },
                {
                    "text": "Impeachment. Oh I hope there are leaks. McConnell deserves it. If the witnesses won't testify maybe they can share some of what they know anyway. Wouldn't it serve him right if he tried to control the flow of info, and it just flowed around him. I'd love to see <a href=\"http://scripting.com/images/2019/12/20/moscowmitch.png\">his face</a> then!",
                    "created": "Fri, 20 Dec 2019 21:32:41 GMT"
                }
            ]
        },
        {
            "text": "That's it for now. I'll keep you posted. ",
            "created": "Fri, 20 Dec 2019 21:20:53 GMT"
        }
    ]
}