{
    "text": "December 4",
    "created": "Tue, 04 Dec 2018 17:31:41 GMT",
    "name": "04",
    "subs": [
        {
            "text": "I hear good things about <a href=\"https://www.srware.net/en/software_srware_iron.php\">SRWare Iron</a>.",
            "created": "Tue, 04 Dec 2018 18:06:01 GMT",
            "type": "outline"
        },
        {
            "text": "It's interesting to me, as an observer, to see Automattic go through the <a href=\"https://davisshaver.com/2018/12/04/why-last-nights-surprise-announcement-of-wordpress-5-0-was-a-concerning-decision-by-matt-mullenweg/\">kinds of pains</a> we went through years ago when releasing major versions of Frontier. It happened in 1998 when we released the first version that ran on Windows in addition to the Mac. And again when we shipped Radio UserLand with integrated blogging and RSS. These should have been times of celebration, and in earlier efforts before we did all our work on the net, they would have. I am impressed with the way the users express their concerns, because (I'm guessing) they have businesses with customers who are going  to be confused. And the angst is probably amplified because the leader of the WordPress community is so accessible. That was the conclusion I came to about the trouble we got for shipping. There's always a reaction among users and developers on new platform releases. Imagine if Steve Jobs had been as accessible as Matt Mullenweg when Apple shipped a version of Mac OS that breaks apps. But he wasn't. In general the leaders of these efforts are insulated through layers and layers. It takes guts for Matt to put himself out there. And at the same time, the <a href=\"https://twitter.com/jdevalk/status/1069930276829179904\">concerns</a> of his users are legit. ",
            "created": "Tue, 04 Dec 2018 17:52:02 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/09/26/colin.png"
        },
        {
            "text": "I'm spending the day in <a href=\"https://en.wikipedia.org/wiki/Woodstock,_New_York\">Woodstock, NY</a> today. I spent a lot of time in the area when I was young. It's cold, but lovely. ",
            "created": "Tue, 04 Dec 2018 17:31:42 GMT",
            "type": "outline"
        }
    ]
}