{
    "text": "December 10",
    "created": "Mon, 10 Dec 2018 14:58:55 GMT",
    "name": "10",
    "subs": [
        {
            "text": "I had a short podcast here earlier, but decided to take it down. I didn't like how it told <a href=\"http://scripting.com/2018/11/13/181952.html\">the story</a>. Not focused enough. Sorry. Will try again. :boom:",
            "created": "Mon, 10 Dec 2018 17:01:46 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/12/10/wwISoldire.png"
        },
        {
            "text": "Another academic journalist who I respect <a href=\"https://twitter.com/pilhofer/status/1071856693720571904\">endorsed</a> The Correspondent this morning, urging others to contribute money to the cause. I don't understand why. I can see studying them, learning from their mistakes, which they are sure to make, but an up front unconditional endorsement? Maybe they know a lot more than the rest of us? I <a href=\"https://twitter.com/davewiner/status/1072106500674465792\">asked</a> a bunch of questions of TheC. To their credit they are trying to answer them. Still I haven't seen any reporting on this effort that isn't a rewrite of their press release. There are serious questions to ask about this. Who else is asking them? ",
            "created": "Mon, 10 Dec 2018 14:58:56 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://duckduckgo.com/?q=Civil+blockchain+journalism&t=h_&ia=web\">Civil</a> was a recent <a href=\"https://www.nytimes.com/2018/11/01/style/blockchain-journalism-civil.html\">example</a> of an effort to launch a new model for journalism that received a lot of hype and unconditional endorsements. But the journalists who were supposed to be paid say they aren't being paid. And the investors who were hoping to support journalism and were motivated by greed (investor greed is perfectly appropriate) aren't happy either. Tech is never a panacea. If people are hyping a technology as one, they're selling <a href=\"http://scripting.com/davenet/1996/06/03/ofmiceandmenus.html\">snake oil</a>, and you should keep your hand on your wallet.",
            "created": "Mon, 10 Dec 2018 15:19:37 GMT",
            "type": "outline"
        },
        {
            "text": "As more journalism companies launch tech products, they're starting to behave more like tech companies, and that's not good. The transparency is gone. If you're creating a silo, you have an obligation to say so, esp if your product is primarily journalism. I'm not talking about The Correspondent here, it's too early to say how much lock-in there is in their product. But all of them have the same basic defect imho. The paid professionals are over here and the members of the community are over there. There's a clear line of separation. I understand why this is in the interest of the reporters, but I strongly believe it is against the interest of news. And if the mission of a news org isn't news, what is it?",
            "created": "Mon, 10 Dec 2018 15:03:21 GMT",
            "type": "outline"
        },
        {
            "text": "I see the danger we're in, politically and physically (climate change) are a result of the corruption of our news system. Really nothing short of corruption. They see fascism as a good business model. Trump is great click-bait. Some of them even have the honesty to say so directly. So if we're going to dig out of the mess, we're going to have to take control of the news. Not simply be bystanders. And any new journalism venture that isn't structured around that idea is not only not the answer, it's in the way of us formulating the answer. That's why I am not an enthusiastic supporter of The Correspondent. If their intentions are good, and I see no reason to assume they're not, they are not moving fast enough to embrace the change we need to happen merely to survive. Good ideas are not what's needed. Change is what's needed. Radical change. ",
            "created": "Mon, 10 Dec 2018 15:09:18 GMT",
            "type": "outline"
        }
    ]
}