{
    "text": "December 11",
    "created": "Tue, 11 Dec 2018 13:11:50 GMT",
    "name": "11",
    "subs": [
        {
            "text": "President Covfefe <a href=\"https://twitter.com/davewiner/status/1072622376356077568\">hits</a> the wall.",
            "created": "Tue, 11 Dec 2018 22:44:35 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1072622376356077568"
        },
        {
            "text": "Followup on The Correspondent",
            "created": "Tue, 11 Dec 2018 13:11:51 GMT",
            "type": "outline",
            "description": "Dissatisfied with the press coverage ot The Correspondent's rollout, I asked questions, got answers and organized them into a blog post. ",
            "subs": [
                {
                    "text": "I asked a bunch of <a href=\"https://twitter.com/davewiner/status/1072106500674465792\">questions</a> about The Correspondent yesterday and got answers from the anonymous account of the company, and from one of the founders, <a href=\"https://twitter.com/ejpfauth\">Ernst Pfauth</a>, on Twitter. He posted a link to a Medium <a href=\"https://medium.com/de-correspondent/reinventing-the-rolodex-why-were-asking-our-60-000-members-what-they-know-9be6a857c340\">piece</a> about how their rolodex feature works. Below are the questions and answers. ",
                    "created": "Tue, 11 Dec 2018 13:11:57 GMT",
                    "subs": [
                        {
                            "text": "Is the rolodex up and running yet?",
                            "created": "Tue, 11 Dec 2018 13:25:42 GMT",
                            "subs": [
                                {
                                    "text": "Yes.",
                                    "created": "Tue, 11 Dec 2018 13:25:52 GMT"
                                }
                            ]
                        },
                        {
                            "text": "Is it a benefit of membership?",
                            "created": "Tue, 11 Dec 2018 13:25:55 GMT",
                            "subs": [
                                {
                                    "text": "Yes",
                                    "created": "Tue, 11 Dec 2018 13:26:02 GMT"
                                }
                            ]
                        },
                        {
                            "text": "Do you have to pay to be in the rolodex?",
                            "created": "Tue, 11 Dec 2018 13:26:03 GMT",
                            "subs": [
                                {
                                    "text": "You have to be a member to be in there. But when we invite people to join a discussion, we give them a one month membership.",
                                    "created": "Tue, 11 Dec 2018 13:26:24 GMT"
                                }
                            ]
                        },
                        {
                            "text": "What if a \"reader\" gets an idea for a story?",
                            "created": "Tue, 11 Dec 2018 13:26:39 GMT",
                            "subs": [
                                {
                                    "text": "All our correspondent's email addresses are visible on the site.",
                                    "created": "Tue, 11 Dec 2018 13:26:48 GMT"
                                }
                            ]
                        },
                        {
                            "text": "Can readers enlist the expertise of other members?",
                            "created": "Tue, 11 Dec 2018 13:27:05 GMT",
                            "subs": [
                                {
                                    "text": "Not Yet. We really want to introduce this asap.",
                                    "created": "Tue, 11 Dec 2018 13:27:16 GMT"
                                }
                            ]
                        },
                        {
                            "text": "Is it a non-profit?",
                            "created": "Tue, 11 Dec 2018 13:12:22 GMT",
                            "subs": [
                                {
                                    "text": "No. But it is limited-profit. [What this means isn't clear. They have said it means that the partners will not draw out more than 5 percent of the revenue for themselves, putting all the remaining profit back into the company. At least one <a href=\"https://twitter.com/Trumpnado2016/status/1072248834057781248\">commenter</a> in the thread thinks this is not straight.]",
                                    "created": "Tue, 11 Dec 2018 13:13:26 GMT"
                                }
                            ]
                        },
                        {
                            "text": "Will you have a public editor? If so, will be it be a member of the public or a journalist?",
                            "created": "Tue, 11 Dec 2018 13:15:21 GMT",
                            "subs": [
                                {
                                    "text": "As far as I can see this one was not answered.",
                                    "created": "Tue, 11 Dec 2018 13:15:28 GMT"
                                }
                            ]
                        }
                    ]
                },
                {
                    "text": "Since being in the rolodex requires membership, I signed up, giving $25. The next page after signing up offered ways to give more money or help them promote membership. They really sell hard. There was a huge iconic <a href=\"http://scripting.com/images/2018/12/11/theCorrespondentDonationPage.png\">image</a> of Jay Rosen on the page. I found this very disturbing. I actually edited the DOM tree to make his image invisible. Then I gave them the money. ",
                    "created": "Tue, 11 Dec 2018 13:30:00 GMT"
                },
                {
                    "text": "I asked a bunch of other questions, trying to understand where their reporters will come from and how they will assure that these reporters care about members more than most American reporters. I got a vague answer about that, from which I concluded their reporters will be like every other reporter, and the idea that they will be engaged with readers is either hype or snake oil, or good intentions, but they don't have any magic that turns reporters into community-minded people. ",
                    "created": "Tue, 11 Dec 2018 13:30:59 GMT"
                },
                {
                    "text": "I am not part of their \"movement,\" even though they accuse me of that in all their communication. I don't like this company. I like them less than the typical journalistic venture that doesn't pretend to give a shit about readers, because they're using our good nature, and desire to believe in something to get money out of us. The limited role of members is, to me, unacceptable. We certainly don't get a chance to participate at the same level as the paid journalists. Consider the answer to the question as to whether members can start new investigations -- you can pitch an idea to a reporter via email. That is a <i>terrible</i> answer. ",
                    "created": "Tue, 11 Dec 2018 13:34:07 GMT"
                },
                {
                    "text": "The only movement I would be part of is one that doesn't distinguish between reporters and members, that has a level playing field. I think that's the only way journalism can scale to meet our needs and avoid the kinds of disasters journalism has led us to. ",
                    "created": "Tue, 11 Dec 2018 13:52:06 GMT"
                },
                {
                    "text": "Since the rolodex is online, I thought I should try to find it, and enter my information. I tried a <a href=\"https://duckduckgo.com/?q=%22the+correspondent%22+rolodex&t=h_&ia=web\">search</a>, but it led me to the home page, and a pitch to give money. I went to their <a href=\"https://thecorrespondent.com/faq\">FAQ</a> page and searched for the word \"rolodex\" -- there were no matches. I looked for a Members link on their website, if it was there I didn't see it. The rolodex may be online, but apparently it's not available to members yet.",
                    "created": "Tue, 11 Dec 2018 13:32:39 GMT",
                    "subs": [
                        {
                            "text": "Update: The rolodex <a href=\"https://twitter.com/ejpfauth/status/1072520167068983297\">exists</a> in Dutch but hasn't been localized yet. ",
                            "created": "Tue, 11 Dec 2018 16:00:24 GMT"
                        }
                    ]
                },
                {
                    "text": "Observation: The rolodex is a good idea, but why shouldn't there be a global index available to all reporters and sources, not just those who give money to Pfauf and company? Why would I want to limit my usefulness to just their reporters? ",
                    "created": "Tue, 11 Dec 2018 13:44:46 GMT"
                },
                {
                    "text": "Net-net: They're doing a great job of raising money. They promise to start a very different journalistic enterprise. When I asked Scripting News readers in the Netherlands what they thought of their Dutch effort there was a generally positive response. That's where we are now. ",
                    "created": "Tue, 11 Dec 2018 13:40:22 GMT"
                },
                {
                    "text": "PS: I forgot to ask if there will be RSS feeds. ",
                    "created": "Tue, 11 Dec 2018 13:39:55 GMT"
                },
                {
                    "text": "PPS: I also forgot to ask if there's a paywall. ",
                    "created": "Tue, 11 Dec 2018 13:39:55 GMT"
                }
            ]
        }
    ]
}