{
    "text": "December 13",
    "created": "Thu, 13 Dec 2018 12:58:58 GMT",
    "name": "13",
    "subs": [
        {
            "text": "iOS 12 problem. On a phone call, after a few minutes the volume drops until I can't hear the other party. When I call back the volume goes back to normal.  Happens with several numbers, so it's on my end not theirs. New iPhone XS. Any <a href=\"https://twitter.com/davewiner/status/1073238178910359555\">help</a> appreciated.",
            "created": "Thu, 13 Dec 2018 16:12:45 GMT",
            "type": "outline"
        },
        {
            "text": "Yesterday I <a href=\"http://scripting.com/2018/12/12.html#a151840\">asked</a> the braintrust of this blog to <a href=\"https://github.com/scripting/Scripting-News/issues/105\">help me understand Kubernetes</a>. Turns out I did not understand it. You all are the smartest most generous people I know. Thanks! :boom:",
            "created": "Thu, 13 Dec 2018 12:58:59 GMT",
            "type": "outline"
        },
        {
            "text": "Baratunde <a href=\"https://twitter.com/baratunde/status/1072932980123938818\">says</a> that a movement is a “group of people working together to advance their shared political, social, or artistic ideas.” That's a good definition. When I think of a movement I think of the <a href=\"https://en.wikipedia.org/wiki/Civil_rights_movement\">civil rights movement</a> of the 1960s, or the <a href=\"https://en.wikipedia.org/wiki/Anti-war_movement#Vietnam_War\">anti-war movement</a> that protested the Vietnam war. I do not think The Correspondent which is a for-profit business deserves to use that term. I certainly do not like them saying that I am a member of such a \"movement.\" As I said in my <a href=\"http://scripting.com/2018/12/11/131151.html\">writeup</a>, \"the only movement I would be part of is one that doesn't distinguish between reporters and members, that has a level playing field. I think that's the only way journalism can scale to meet our needs and avoid the kinds of disasters journalism has led us to.\" ",
            "created": "Thu, 13 Dec 2018 13:01:00 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/12/13/marchOnWashington1963.png"
        }
    ]
}