{
    "text": "December 16",
    "created": "Sun, 16 Dec 2018 16:04:58 GMT",
    "name": "16",
    "subs": [
        {
            "text": "Feeling courageous? Click the <i class=\"fa fa-retweet\"></i> symbol next to <a href=\"http://scripting.com/2018/12/16.html#a215317\">this post</a>. ",
            "created": "Sun, 16 Dec 2018 21:53:17 GMT",
            "type": "outline"
        },
        {
            "text": "Doing a bit more work on The Feature today. Also watching <a href=\"https://en.wikipedia.org/wiki/Sharp_Objects_(miniseries)\">Sharp Objects</a> on HBO. Very weird. But it got high ratings, and I generally like HBO stuff better than Netflix. More cerebral, intellectually challenging, surprising. Most of what's on Netflix is drek. ",
            "created": "Sun, 16 Dec 2018 16:04:59 GMT",
            "type": "outline"
        },
        {
            "text": "Lots of writing about the 50th anniversary of Engelbart's <a href=\"https://duckduckgo.com/?q=50th+anniversary+of+Engelbart%27s+Demo&t=h_&ia=web\">MOAD</a>. I wasn't there, but I knew Engelbart, at first through Ted Nelson's <a href=\"https://www.goodreads.com/book/show/722414.Computer_Lib_Dream_Machines\">writing</a>, and then in face to face. The reporters misunderstand what he meant by <a href=\"http://dougengelbart.org/content/view/138/000/\">augmentation</a>. It's the same thing we called idea processing with <a href=\"http://davewiner.userland.com/outlinersProgramming\">ThinkTank</a> and its <a href=\"https://duckduckgo.com/?q=%22living+videotext%22+outliners&t=h_&ia=web\">successors</a>. Computers, using outlining software, are incredible surfaces for recording your thoughts, seeing them visually, and then manipulate them in ways you couldn't on physical surfaces like paper and whiteboards. Index cards spread out all over the floor kind of approximates it. On a computer screen ideas are on rollerskates and rails. They move fast and precisely and then move again. There are so many more places to move them. This frees the mind up to try out new ideas without losing the train of thought. All the stories about Engelbart miss this. Yes the mouse was incredible. I was not aware he invented the web (did he?). But the thing he was most interested in, the biggest idea he had, apparently has been forgotten, but not by me. ",
            "created": "Sun, 16 Dec 2018 16:09:32 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/12/16/rollerSkate.png"
        },
        {
            "text": "Augmentation or idea processing sounds grandiose, but it's fairly mundane. Here's a <a href=\"http://scripting.com/images/2018/12/16/projectOutline.png\">snapshot</a> of my planning outline for the project I'm working on now. It changes as the project moves forward. The outline structure makes it easy for me to organize my work. My time is better used, I'm more confident that important things are not slipping through the cracks. ",
            "created": "Sun, 16 Dec 2018 16:52:01 GMT",
            "type": "outline"
        },
        {
            "text": "Minding my dream",
            "created": "Sun, 16 Dec 2018 16:25:36 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "My subconscious had me dream something really odd last night. Not something I’d mind sharing publicly, but there is no place. I suppose it’s the kind of thing everyone who has lost both parents goes through. Probably something that goes back to before we were even human. But we are not so evolved that there is a proper online place for it. If I wrote a memoir, I could put the story in there. Nothing I’m even remotely ashamed of.",
                    "created": "Sun, 16 Dec 2018 16:25:52 GMT",
                    "image": "http://scripting.com/images/2018/12/16/handbook.png"
                },
                {
                    "text": "So I'm going to tuck it away here in a corner of my blog. ",
                    "created": "Sun, 16 Dec 2018 16:26:17 GMT"
                },
                {
                    "text": "Here's the dream...",
                    "created": "Sun, 16 Dec 2018 16:30:26 GMT"
                },
                {
                    "text": "I'm lost and going back home. My glasses are broken. I'm trying to put them back together. (Note in the real world I don't need glasses any longer.) I'm walking along 32nd Ave a block away from my parents' house thinking about getting comfort from my father. Then I realize he's dead. No matter I'll have a nice talk with mom. Then boom, it hits me. She's dead too.",
                    "created": "Sun, 16 Dec 2018 16:26:30 GMT"
                },
                {
                    "text": "It's a terrible feeling. I get back to the house, but it's all different. There's a swimming pool out back, and a big guest house. It's dark. I can't see well. The glasses have seemingly repaired on their own, but it's a new design. My father's brother, my uncle Sam, is puttering about. He can't hear me. I can hear him but it's mumbling. I feel okay but lost. ",
                    "created": "Sun, 16 Dec 2018 16:27:42 GMT"
                },
                {
                    "text": "I wake up.",
                    "created": "Sun, 16 Dec 2018 16:28:40 GMT"
                },
                {
                    "text": "I seem to remember doing something like this before. Perhaps it takes a few tries before the knowledge permeates some deeper level? ",
                    "created": "Sun, 16 Dec 2018 16:28:44 GMT"
                }
            ]
        }
    ]
}