{
    "text": "December 19",
    "created": "Wed, 19 Dec 2018 05:01:50 GMT",
    "name": "19",
    "subs": [
        {
            "text": "Uncle Davey's remedy for all your end-of-year Facebook woes. New rule requires Facebook to peer with the open web so people who are not on Facebook can communicate with people who are. All or nothing is the real problem. Lots of precedent. AT&T had a monopoly over phones for a long time. If you wanted to make phone calls you had to use one of their devices. That rule changed and the rest is history. The technology is easy. There are plenty of people at Facebook who want to do it. ",
            "created": "Wed, 19 Dec 2018 19:32:24 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/11/27/xmasTree.png"
        },
        {
            "text": "<a href=\"https://twitter.com/jason_pontin/status/1075383209356091393\">Jason Pontin asks</a> how journalism is self-dealing and corrupt. Not all corruption is about money. Journalism exterts control and influence. Gatekeeping. They keep lots of ideas out of the news, esp ones they find uncomfortable. Show me an op-ed in the NYT about the future of journalism that says they should compete with Facebook. Or a public editor who is a member of the public? Also any industry that feels they should be above examination, and has been exempt for so long, must be <i>filled</i> with corruption. And of course if there's no corruption, there's no harm in looking, right? ",
            "created": "Wed, 19 Dec 2018 15:03:18 GMT",
            "type": "outline"
        },
        {
            "text": "I met <a href=\"https://twitter.com/dabeard\">David Beard</a> at a future-of-journalism <a href=\"https://www.newsgeist.org/exploring-future-news/\">conference</a> in Phoenix last year, and spent a couple of hours talking with him at the Phoenix airport waiting for planes home to Boston and NYC, respectively. Since then I've been watching what he does on Twitter with awe and interest. He posts links to stories with comments that are very widely circulated. Some of his tweets get thousands of RTs. You might think he has a million followers, but he doesn't, just 47K, though it seems to be increasing quickly. I always wonder what his secret is, and what his goal is. By asking the question on my blog, I hope to provoke a public response. :boom:",
            "created": "Wed, 19 Dec 2018 14:35:16 GMT",
            "type": "outline",
            "image": "http://scripting.com/2016/01/10/alice.png"
        },
        {
            "text": "My prediction for 2019: Everything you care about is dead. Everything I care about <i>rules.</i>",
            "created": "Wed, 19 Dec 2018 15:36:34 GMT",
            "type": "tweet",
            "tweetId": "1075432845219414021",
            "tweetUserName": "davewiner"
        },
        {
            "text": "Facebook offers ordinary people something they've never had before -- a place to publish their ideas for anyone to read. For all its flaws they have done something remarkable, something the news industry could have but did not do. ",
            "created": "Wed, 19 Dec 2018 05:01:51 GMT",
            "type": "outline"
        },
        {
            "text": "How I provision a new server",
            "created": "Wed, 19 Dec 2018 16:00:39 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Create a new server running Ubuntu. ",
                    "created": "Wed, 19 Dec 2018 16:00:51 GMT"
                },
                {
                    "text": "Log on via the Terminal app on the Mac.",
                    "created": "Wed, 19 Dec 2018 16:01:06 GMT"
                },
                {
                    "text": "Install Node, Git and Forever per the instructions on the 1999-project <a href=\"https://github.com/scripting/1999-project/blob/master/docs/setup.md\">setup page</a>. ",
                    "created": "Wed, 19 Dec 2018 16:01:15 GMT",
                    "subs": [
                        {
                            "text": "Update: The version of Node that's installed using the instructions on the setup page won't accept \"let\", \"const\" etc. I use those in some of my packages. The instructions on <a href=\"https://github.com/nodesource/distributions#debinstall\">this page</a> show you how to get the latest version. ",
                            "created": "Wed, 19 Dec 2018 16:37:14 GMT"
                        }
                    ]
                },
                {
                    "text": "Install Dropbox and the CLI app following these <a href=\"https://linoxide.com/linux-how-to/install-dropbox-ubuntu/\">instructions</a>. ",
                    "created": "Wed, 19 Dec 2018 16:02:05 GMT"
                },
                {
                    "text": "Create a folder in Dropbox for this server. Exclude all other folders:",
                    "created": "Wed, 19 Dec 2018 16:02:34 GMT",
                    "subs": [
                        {
                            "text": "dropbox exclude add folder1 folder2",
                            "created": "Wed, 19 Dec 2018 16:02:58 GMT"
                        }
                    ]
                },
                {
                    "text": "Add apps to the folder for this server and run them in Forever.",
                    "created": "Wed, 19 Dec 2018 16:03:12 GMT"
                }
            ]
        }
    ]
}