{
    "text": "December 26",
    "created": "Wed, 26 Dec 2018 16:02:36 GMT",
    "name": "26",
    "subs": [
        {
            "text": "I realized a few days ago I have not been thinking about <a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+boty&t=h_&ia=web\">BOTY</a> for 2018. This might be one of those years that I don't have one. Let's see what happens, go with the flow. ",
            "created": "Thu, 27 Dec 2018 00:34:33 GMT",
            "type": "outline"
        },
        {
            "text": "Speaking of flow, I was up in the Catskills over the break, and took a <a href=\"https://www.youtube.com/watch?v=2ycaLGbA44k\">movie of a creek</a> I came across. The video demonstrates the Doppler Effect. ",
            "created": "Thu, 27 Dec 2018 00:36:30 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=2ycaLGbA44k"
        },
        {
            "text": "Interesting post on <a href=\"http://www.niemanlab.org/2018/12/journalism-as-a-technology-service/\">journalism</a> as a technology service. ",
            "created": "Thu, 27 Dec 2018 00:31:15 GMT",
            "type": "outline"
        },
        {
            "text": "When everyone agrees on something, and users benefit from the agreement, then seriously consider maintaining the standard, even if your product would be, in some ways, nicer if you broke with the standard. Apple could have continued to have a <a href=\"https://techcrunch.com/2018/12/25/i-still-miss-the-headphone-port/\">headphone jack</a> on their phones, and all the other phone makers would have kept theirs. I'd still use my Bluetooth headphones (I was a wireless fan long before the headphone jack disappeared). It's the same reason we should all support <a href=\"http://this.how/googleAndHttp/\">HTTP</a> for as long as humanly possible (i.e. forever). This is a big philosophical question for all tech developers. I'm a continuity absolutist, to me the most awful word in tech is <a href=\"https://en.wikipedia.org/wiki/Deprecation\">deprecate</a>.  ",
            "created": "Thu, 27 Dec 2018 00:23:49 GMT",
            "type": "outline"
        },
        {
            "text": "I wish Netflix would link to <a href=\"https://www.metacritic.com/\">Metacritic</a> from each show. I wish they would all do this. And I wish <a href=\"http://hbogo.com\">HBO Go</a> let you download shows. I'd watch more HBO if they did. Anyway, next up is <a href=\"https://www.metacritic.com/tv/happy-valley\">Happy Valley</a>.",
            "created": "Wed, 26 Dec 2018 21:46:08 GMT",
            "type": "outline"
        },
        {
            "text": "I had no way of knowing how well the two shows I've been bingeing fit together. They are <a href=\"https://www.netflix.com/title/70260350\">River</a>, which is the story of a crazy grieving brilliant cop who learns to accept his insanity, and <a href=\"https://www.sho.com/kidding\">Kidding</a>, a crazy grieving Mr Rogers type TV actor. They're both struggling with pretty much the same issue. What were the chances. And both are quite good, if you're looking for a time-consuming holiday binge. ",
            "created": "Wed, 26 Dec 2018 21:38:02 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/12/26/kiddingPromo.png"
        },
        {
            "text": "Trump and his <a href=\"https://www.nytimes.com/2018/12/25/us/politics/trump-border-wall-shutdown.html\">wall</a> is beginning to sound like <a href=\"http://scripting.com/images/2018/12/26/queeg.png\">Captain Queeg</a> and his strawberries, or <a href=\"http://scripting.com/images/2018/12/26/gollum.png\">Gollum</a> and My Precious.",
            "created": "Wed, 26 Dec 2018 21:34:00 GMT",
            "type": "outline"
        }
    ]
}