{
    "text": "Techmeme's new podcast",
    "created": "Mon, 19 Mar 2018 13:28:48 GMT",
    "type": "outline",
    "description": "The Techmeme podcast takes a different approach, one more like radio news programs of the past, where the presenter, Brian McCullough, reads summaries of stories that are presumably the top items for the day on Techmeme. ",
    "subs": [
        {
            "text": "I've listened to a couple of episodes of the new <a href=\"https://techmeme.com/techmeme-ride-home-feed\">Techmeme podcast</a>. I was really <a href=\"http://scripting.com/2018/03/06.html\">excited</a> to hear about it. I imagined something like the <a href=\"https://www.nytimes.com/podcasts/the-daily\">Daily podcast</a> or <a href=\"https://www.npr.org/podcasts/381444908/fresh-air\">Fresh Air</a>, or any number of podcasts built around an interview with an interesting person, with the focus on tech. The Techmeme podcast takes a different approach, one more like radio news programs of the past, where the presenter, <a href=\"https://twitter.com/brianmcc\">Brian McCullough</a>, reads summaries of stories that are presumably the top items for the day on <a href=\"https://www.techmeme.com/\">Techmeme</a>.  ",
            "created": "Mon, 19 Mar 2018 13:25:45 GMT",
            "image": "http://scripting.com/images/2018/03/19/mrWhite.png"
        },
        {
            "text": "Called <i>Ride Home,</i> each episode begins with the headlines followed by what I assume is its positioning statement:  \"Here's what you missed today in the world of tech,\" followed by a synopsis of each story, read from a script. There are other podcasts that assume this voice -- notably the <a href=\"http://www.slate.com/articles/podcasts/whistlestop.html\">Whistlestop podcast</a> with CBS newsperson John Dickerson.  ",
            "created": "Mon, 19 Mar 2018 13:33:50 GMT"
        },
        {
            "text": "I want to like this podcast because I'm a longtime reader of Techmeme, and a fan of McCullough's <a href=\"http://www.internethistorypodcast.com/\">Internet History Podcast</a>. I was hoping it would be like a short version of that podcast every day, a candid interview with a tech newsmaker or a reporter at one of the pubs that Techmeme covers. I will keep listening because this is potentially an important podcast. ",
            "created": "Mon, 19 Mar 2018 13:37:18 GMT"
        },
        {
            "text": "On the other hand, I understand that this is the format they would arrive at by adapting Techmeme to a podcast. But sometimes a literal translation isn't the most useful approach. Techmeme is of course useful as a web page, refreshed many times during the day. Voice offers an opportunity to approach the mind through a different channel, to spread new ideas, more than \"what you missed.\" ",
            "created": "Mon, 19 Mar 2018 14:10:15 GMT"
        },
        {
            "text": "It is of course one of the podcasts available at \"podcatch.com\". ",
            "created": "Mon, 19 Mar 2018 13:40:19 GMT"
        }
    ]
}