{
    "text": "My cat Nurse",
    "created": "Sun, 01 Sep 2019 16:10:36 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "When I was a grad student in <a href=\"https://en.wikipedia.org/wiki/Madison,_Wisconsin\">Madison</a> I had a cat named Nurse. I got her when I lived in NYC, between college and grad school. ",
            "created": "Sun, 01 Sep 2019 16:10:39 GMT",
            "image": "http://scripting.com/images/2019/09/01/pumpItUp.png"
        },
        {
            "text": "I got her from an ad in the <a href=\"https://en.wikipedia.org/wiki/The_Village_Voice\">Village Voice</a>, from a woman who had dozens of cats in her Manhattan apartment. She pointed out this gray cat, see how she's taking care of the sick kitten? I took her home and named her Nurse.",
            "created": "Sun, 01 Sep 2019 17:34:25 GMT"
        },
        {
            "text": "Later I moved to Madison, in the middle of the winter. Nurse stayed with my parents in <a href=\"https://en.wikipedia.org/wiki/Flushing,_Queens\">Flushing</a> until I found a place to live, and they sent her out by airplane. She must've had a bad experience on the flight or waiting in a <a href=\"https://en.wikipedia.org/wiki/Hangar\">hangar</a>, because when she got to me, she was freaked out. ",
            "created": "Sun, 01 Sep 2019 16:12:13 GMT"
        },
        {
            "text": "She became a tough cat, but she still was a very special cat. She'd take walks with you like a dog. And in a few weeks she was pregnant, and in a couple of months delivered a litter of five really cute (of course) newborn kittens. ",
            "created": "Sun, 01 Sep 2019 17:34:59 GMT"
        },
        {
            "text": "I lived in a <a href=\"http://davetravel.scripting.com/2004/08/27#a36\">house</a> <a href=\"https://www.google.com/maps/@43.0683857,-89.3871709,3a,75y,160.71h,88t/data=!3m7!1e1!3m5!1sejrfHkjBYXO-p7iZodByHA!2e0!6s%2F%2Fgeo3.ggpht.com%2Fcbk%3Fpanoid%3DejrfHkjBYXO-p7iZodByHA%26output%3Dthumbnail%26cb_client%3Dmaps_sv.tactile.gps%26thumb%3D2%26w%3D203%26h%3D100%26yaw%3D154.0355%26pitch%3D0%26thumbfov%3D100!7i13312!8i6656\">with</a> nine roommates, the kittens were a huge hit. We all would watch them and poke at them and make cooing sounds until one day the kittens and Nurse were gone. Later I found them, she had camped out behind my dresser, but I didn't tell anyone where she was, I respected her wish to care for her children privately.",
            "created": "Sun, 01 Sep 2019 16:13:59 GMT"
        },
        {
            "text": "Then in a few days -- kittens everywhere! She had let them go out in the world to find their way, and it was great. They were so much fun. A few days later, we gave them away, and Nurse went off to get fixed, and when she came back, she came back to just being Nurse, her mom days were over. ",
            "created": "Sun, 01 Sep 2019 16:15:23 GMT"
        },
        {
            "text": "PS: I've written this story before, in <a href=\"http://scripting.com/2001/12/05.html#nurse\">2001</a>. It came out somewhat differently, but it's basically the same story. ",
            "created": "Sun, 01 Sep 2019 16:22:45 GMT"
        }
    ]
}