{
    "text": "There are no more gotchas",
    "created": "Thu, 21 Nov 2024 14:35:47 GMT",
    "type": "outline",
    "description": "The gotcha era of journalism ended with Access Hollywood.",
    "subs": [
        {
            "text": "When people said they didn't know Kamala well, they weren't kidding. She didn't start broadcasting until three months before the election. That's not even one season of <a href=\"https://en.wikipedia.org/wiki/Abbott_Elementary\">Abbott Elementary</a> or <a href=\"https://en.wikipedia.org/wiki/Wheel_of_Fortune_(American_game_show)\">Wheel of Fortune</a>. Of course they didn't know her. That's because the Dems go off the air <a href=\"https://x.com/KamalaHQ/status/1854036662952620232\">on Election Day</a> and don't show up again for three years. Meanwhile the other party is on the air 24 hours a day, every day of every year. ",
            "created": "Thu, 21 Nov 2024 14:30:27 GMT",
            "image": "https://imgs.scripting.com/2023/12/16/archieAndEdith.png",
            "flInCalendar": true
        },
        {
            "text": "Next time we nominate a candidate, the voters will already know them and like them. No more of the \"we don't know her well enough.\" That's what mattered. They want a sense that they know who you are. The same way kids of my generation knew who <a href=\"https://en.wikipedia.org/wiki/Archie_Bunker\">Archie Bunker</a> was, and <a href=\"https://en.wikipedia.org/wiki/Maude_(TV_series)\">Maude</a>, and <a href=\"https://en.wikipedia.org/wiki/Mary_Tyler_Moore\">Mary Tyler Moore</a>. That's where trust comes from. We may not have liked Archie Bunker's politics, but we knew who he was. ",
            "created": "Fri, 22 Nov 2024 02:03:42 GMT",
            "flInCalendar": true
        },
        {
            "text": "We should be marketing the hell out of this shit all the time so when we choose a candidate the people will already know and like them.  ",
            "created": "Fri, 22 Nov 2024 02:02:33 GMT",
            "flInCalendar": true
        },
        {
            "text": "I listened to a pathetic Daily Blast podcast <a href=\"https://podcasts.apple.com/us/podcast/big-setback-for-trump-as-gopers-privately-tell-him/id1728152109?i=1000677605316\">yesterday</a> where Greg Sargent and his <a href=\"https://www.thebulwark.com/p/trump-cabinet-team-of-outlaws-gaetz-hegseth-gabbard-rfk\">guest</a> kept saying \"we gotta figure this out.\" ",
            "created": "Thu, 21 Nov 2024 14:36:20 GMT",
            "flInCalendar": true
        },
        {
            "text": "The answer is staring you in the face. Dems are only on the air for a few months every four years. Of course the other side spins you like crazy. ",
            "created": "Thu, 21 Nov 2024 14:40:36 GMT",
            "image": "https://imgs.scripting.com/2023/03/27/successionPoster.png",
            "flInCalendar": true
        },
        {
            "text": "You all are clinging to the \"gotcha\" model of journalism. There are no more gotchas. We've known that since <a href=\"https://en.wikipedia.org/wiki/Donald_Trump_Access_Hollywood_tape\">Access Hollywood</a>. The leaders of the new Democratic Party will be comfortable in their own skin. They tell you what they think. Fetterman, AOC, Tammy Baldwin. There will be many of them. ",
            "created": "Thu, 21 Nov 2024 14:36:29 GMT",
            "flInCalendar": true
        },
        {
            "text": "Get on the air and relax and say what you really think. And when the Repubs lie, say it like that -- they're lying. When you say nothing people think you agree with them. ",
            "created": "Thu, 21 Nov 2024 14:36:38 GMT",
            "flInCalendar": true
        },
        {
            "text": "Let's get the Dems back on the air before the inauguration. I'll kick in $100 to get it started, and I'll tell everyone I know to fund it too. There's no time to waste.",
            "created": "Fri, 22 Nov 2024 02:07:27 GMT",
            "flInCalendar": true
        },
        {
            "text": "Woz and Jobs.",
            "created": "Fri, 22 Nov 2024 02:09:26 GMT",
            "inlineImage": "https://imgs.scripting.com/2024/11/21/wozAndJobs.png",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}