{
    "text": "Aspirational living",
    "created": "Sun, 22 Apr 2018 13:47:20 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I've always been obsessed with where would be the perfect place to live. I live in the middle of Manhattan, with all its variety and scale. This is where I dreamed of living when I was in Berkeley, and when I was growing up in the 60s and 70s in Queens. When I lived in Palo Alto I dreamed of living in Berkeley. When I lived in quiet places I dreamed of noisy ones. When I was poor in Silicon Valley, I dreamed of a hot tub and swimming pool and big oak trees and a creek and a place to throw great parties. When I grew tired of parties, I moved to Boston to live the academic life. I've lived in the midwest, the deep south, up and down both coasts. Yet still I dream of the perfect place. At this point I believe it doesn't exist.",
            "created": "Sun, 22 Apr 2018 13:47:35 GMT",
            "image": "http://scripting.com/images/2018/04/22/leaveitToBeaver.png"
        },
        {
            "text": "My mother had a dream like this, about our family. In her dream she was <a href=\"https://en.wikipedia.org/wiki/June_Cleaver\">June Cleaver</a>, her husband was <a href=\"https://en.wikipedia.org/wiki/Ward_Cleaver\">Ward</a>, her sons were <a href=\"https://en.wikipedia.org/wiki/Wally_Cleaver\">Wally</a> and <a href=\"https://en.wikipedia.org/wiki/Beaver_Cleaver\">Theodore</a>. She wouldn't have put it that way, but when you added up her expectations that's what it came to. But she was no June Cleaver, that's for sure (because JC was a character in a TV show, not an actual person). And none of us were who she dreamed we should be.",
            "created": "Sun, 22 Apr 2018 13:50:25 GMT"
        },
        {
            "text": "I'm still looking for the perfect place to live. I have a list of Zillow subscriptions. I have the economic means to live in any of them. And the personal freedom. Yet for some reason I don't move. It's never the day to go, or even the day to start to go. Maybe because by now I know that when I set up shop in any of these places it will be the same life as it was in NY, and in Berkeley before that, and Florida before that, etc etc. ",
            "created": "Sun, 22 Apr 2018 13:53:02 GMT"
        },
        {
            "text": "I thought of this story when I saw this <a href=\"https://twitter.com/meridithmcgraw/status/988039825864445953\">picture</a> of the living presidents and first ladies, with one conspicuous absence, the current president. He too has an aspirational story. He was always looked down on in NY society. He may have been educated, but he was crude. He was from Queens. His dream was to Show Them, to make a place for himself at the top of the pyramid. Then they'll see, I imagine the story-telling voices inside Donald's head say. But that's just what he <i>thinks</i> he wants. It's the equivalent of my mother's dream of being June Cleaver, or my hope to find the perfect place to live. He actually just <i>wants to want</i> to be included. Because this is his chance. Right between Michelle and Melania there's the spot for the Current Leader of the Free World. He could have shown up, been gracious and been photographed in the place he created for himself. But that isn't what he actually wants. ",
            "created": "Sun, 22 Apr 2018 13:54:56 GMT"
        }
    ]
}