{
    "text": "Is Spotify the next Facebook?",
    "created": "Mon, 07 Feb 2022 13:51:37 GMT",
    "type": "outline",
    "description": "Spotify is heading down the same path Facebook went down. It's not too late to get off that path, peer with podcasting instead of trying to dominate it.",
    "subs": [
        {
            "text": "I don't write much <a href=\"http://daytona.scripting.com/?q=Spotify&collection=scriptingnews\">about Spotify</a> because I don't use it, not like I use Facebook. ",
            "created": "Mon, 07 Feb 2022 13:53:02 GMT",
            "flInCalendar": true
        },
        {
            "text": "But now Spotify is unavoidable, because they've been buying podcast rights and locking them into their system. No feeds, if you want to listen the only way is on Spotify. And unfortunately for Spotify the company, that makes them responsible, if not legally, in public opinion (ie journalism) for what's said. They can claim otherwise, but that's the way it worked for Facebook and I don't see why it won't be like that for Spotify.",
            "created": "Mon, 07 Feb 2022 14:33:45 GMT",
            "flInCalendar": true
        },
        {
            "text": "Anyway it's kind of obvious Spotify wanted to own podcasting. Now, after <a href=\"http://daytona.scripting.com/?q=joe%20rogan&collection=scriptingnews\">Rogan</a>, I wonder if they still want to own it.",
            "created": "Mon, 07 Feb 2022 13:52:27 GMT",
            "flInCalendar": true
        },
        {
            "text": "It also seems obvious if they continue down this path, they're going to end up like Facebook, with a new name, and trying to be part of something vague that isn't Spotify.",
            "created": "Mon, 07 Feb 2022 13:52:34 GMT",
            "flInCalendar": true
        },
        {
            "text": "And they're obviously lying when they say they value Rogan's right to free speech. Instead they're  desperately trying to preserve their $100 million investment. Better idea -- they could cut their losses, stop trying to own podcasting, while Spotify is still a decent name.",
            "created": "Mon, 07 Feb 2022 13:52:40 GMT",
            "flInCalendar": true
        },
        {
            "text": "Facebook made the same mistake Spotify is making. They should have peered with the blogging world, and absolved itself of regulating speech. Instead they tried to dominate, and their brand became synonymous with all the abuse they imported from the web.",
            "created": "Mon, 07 Feb 2022 13:52:44 GMT",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://en.wikipedia.org/wiki/Daniel_Ek\">Ek</a> says he won't \"silence\" Rogan. But he doesn't have the power to silence anyone. If he were to stop carrying Rogan on his network, Rogan would still have the entire open web to speak on. But this is the real issue. If Ek continues on his path he will have the power to silence people. And that would be the end of podcasting as a medium. He's a very long way from that btw. ",
            "created": "Mon, 07 Feb 2022 13:52:48 GMT",
            "flInCalendar": true
        },
        {
            "text": "Ek is really saying is he doesn't want to lose his $100 million. If he told this truth, obviously no one but his shareholders would sympathize. I think if he chose to lose the  money it would be worth it. If he proceeds down this path he's going to lose a lot more.",
            "created": "Mon, 07 Feb 2022 13:52:52 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}