{
    "text": "While the net was down I watched the <a href=\"https://www.pbs.org/show/hemingway/\">Hemingway biography</a> from PBS. Thank goodness for BitTorrent, I had a backlog of things that I could watch when the net is down. <a href=\"http://daytona.scripting.com/?q=hemingway&collection=scriptingnews\">Hemingway</a>. He was like the <a href=\"http://daytona.scripting.com/?q=beatles&collection=scriptingnews\">Beatles</a>, but just one person. Much larger than life. Handsome and charismatic. He projected an avatar, but of course living up to the image he projected was impossible. As with the Beatles, how much better it would have been (imho or so it seems) if they could have been creative for decades and just been themselves. There's this great scene in Get Back where Paul and John are stressing out, and John lowers his glasses and says to Paul \"It's just me.\" What if every album didn't have to be the best one ever made. Relistening to the Beatles classics, the Beatles had a sound, and none of the ex-Beatles took it with them when they broke up. I've come to absolutely adore songs that just passed me by when I was young, and had no sense of art compared to now. I can't believe how good <a href=\"https://www.youtube.com/watch?v=t1Jm5epJr10\">I Am The Walrus</a> is. I laugh every time at all different parts because it is so Beatles and they create so much beauty. BTW much of John's sound came from George Martin, as he interpreted what John wanted (I got that from watching a long interview with Martin). The Beatles were a thing. It's unfortunate it had to consume the people of the Beatles, or they didn't understand what they had created. George Harrison desperately wanted to get out from under the Beatles, but imho, the Beatles made George Harrison. BTW creative life is exactly the same today was it was then. We don't nurture creative people, create safe environments for them to develop over full lives. And there's little that glues us together. Too much focus on being a hero, inflating the avatar, which ultimately kills the creativity. We could do much better.",
    "created": "Mon, 07 Feb 2022 16:03:31 GMT",
    "type": "outline",
    "image": "http://scripting.com/images/2022/02/07/hemingwayPBS.png",
    "flInCalendar": true
}