{
    "text": "Jon Stewart, yes you should STFU",
    "created": "Tue, 09 Jul 2024 13:17:13 GMT",
    "type": "outline",
    "enclosure": "http://scripting.com/2024/07/09/yesJonStewartPleaseSTFU.m4a",
    "enclosureType": "audio/mpeg",
    "enclosureLength": "8470459",
    "subs": [
        {
            "text": "<i>The problem is elites grabbing the wheel with no clue about what comes next.</i>",
            "created": "Tue, 09 Jul 2024 13:56:06 GMT",
            "flInCalendar": true
        },
        {
            "text": "Every Tuesday I look for Jon Stewart's opening for the Daily Show on YouTube. It's always funny, great comedy, whether or not you agree with what he says, and I usually do agree. But not when it comes to him pushing President Biden out, without any idea of what comes next, and how the people, even some people who love his show, feel about having no voice. ",
            "created": "Tue, 09 Jul 2024 13:17:20 GMT",
            "image": "https://imgs.scripting.com/2024/02/14/bidenActionFigure.png",
            "flInCalendar": true
        },
        {
            "text": "If the voters organize, using the tools we have now, and stay organized after the election, we could elect anyone to be president. There's never been a more clear opportunity to win a landslide. It depends on organization, and elites not grabbing the steering wheel with no clue about what comes next, and driving us off a cliff. ",
            "created": "Tue, 09 Jul 2024 13:27:00 GMT",
            "flInCalendar": true
        },
        {
            "text": "I've been close to elites at times, and I can tell you, they aren't any smarter than you, they just have more power. I think that's been the real problem. We have failed to stay a democracy as we've gotten the tools to really be a democracy in ways we never could have before. And now we're at the last moment before it's all flushed away and the NYT et al (including our hero Stewart) are making it more certain, not less. ",
            "created": "Tue, 09 Jul 2024 13:28:18 GMT",
            "flInCalendar": true
        },
        {
            "text": "Be warned I get really angry at the end and raise my voice. I don't think I've ever done that in a podcast, and I'm not sure I like it. But the rage is real. ",
            "created": "Tue, 09 Jul 2024 13:24:12 GMT",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"http://scripting.com/2024/07/09/yesJonStewartPleaseSTFU.m4a\">16 minute podcast</a>. ",
            "created": "Tue, 09 Jul 2024 13:22:07 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}