{
    "text": "Harris makes me proud",
    "created": "Wed, 14 Aug 2024 14:24:32 GMT",
    "type": "outline",
    "metaImage": "https://imgs.scripting.com/2024/08/14/harrisHeader.png",
    "description": "I'm proud that my country has nominated such an attractive group of talented people with such fierce competence and humility.",
    "subs": [
        {
            "text": "I am so impressed with how well the new Democratic Party is running this campaign. Latest innovation, they're going to do at least one public rally during the convention, so everyone can be part of the celebration, and I plan to watch every minute of it. What I don't want to witness is what the journalists try to provoke. I've been to two DNCs and later heard what they were talking about on CNN, and my god they invented crises that simply didn't exist. Who's going to have time to call them out because no one at the convention is watching TV. ",
            "created": "Wed, 14 Aug 2024 13:57:13 GMT",
            "flInCalendar": true
        },
        {
            "text": "I heard on a podcast yesterday that it's weird that Harris is polling as well as the <a href=\"https://www.advisorperspectives.com/commentaries/2021/11/23/the-generic-ballot-what-to-know-why-its-so-important\">generic</a> Democrat, which they felt was odd because she's not a white man, which made me think that in 2024, she is the face of the Democratic Party. Obama and Hillary Clinton knocked down those barriers, and now it would feel strange if the candidate at the top of the ticket were not interracial and female.",
            "created": "Wed, 14 Aug 2024 14:25:23 GMT",
            "flInCalendar": true
        },
        {
            "text": "I'm proud that my country has nominated such an attractive group of talented people with such fierce competence and humility. For these moments I wish I had a new graphic to put in the margin to symbolize the United States. We're strong, and we win, and when we don't we get back up and fight. Uncle Sam is a great symbol. But we've yet to create the interracial and female version that symbol. ",
            "created": "Wed, 14 Aug 2024 14:26:04 GMT",
            "flInCalendar": true
        },
        {
            "text": "One more thing, there are a lot of white male voters to be courted and welcomed back into the fold. Trump has had the advantage there, but it doesn't have to be that way. A hand reached out in brotherhood could turn this election into the kind of landslide we need to cleanse our political system its flirtation with fascism. ",
            "created": "Wed, 14 Aug 2024 14:26:42 GMT",
            "flInCalendar": true
        },
        {
            "text": "Statue of Liberty in the heartland. ",
            "created": "Wed, 14 Aug 2024 14:32:48 GMT",
            "inlineImage": "https://imgs.scripting.com/2024/08/14/ladyLibertyFullSizeIowa.png",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}