{
    "created": "2025-02-04T05:00:00.000Z",
    "flInCalendar": true,
    "name": "04",
    "path": "2025/02/04",
    "text": "February 04",
    "type": "calendarDay",
    "subs": [
        {
            "text": "<a href=\"https://bsky.app/profile/did:plc:oety7qbfx7x6exn2ytrwikmr/post/3lhepyeovhk2f\">The coup is over</a>. This time, unlike the <a href=\"https://en.wikipedia.org/wiki/January_6_United_States_Capitol_attack\">last time</a> it was tried, it worked. We're in the post-coup world now. He showed us exactly what he would do if he could and we somehow collectively acted as if he hadn't shown us. Sanewashing was just the tip of the iceberg, you can't blame it on the press, we didn't demand they get their shit together, we didn't try to change the subject so they'd have to tell the real story. We had a lot of tools available to us that we didn't use because we are lazy and selfish. BTW, if you want to follow the power, don't look at what governments do, look at what the other oligarchs do. Google, Apple, Amazon, Facebook, etc.",
            "created": "Tue, 04 Feb 2025 20:47:29 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://bsky.app/profile/devs.feediverse.org\">devs.feediverse.org</a> on Bluesky. An interesting experiment. ",
            "created": "Tue, 04 Feb 2025 17:19:01 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Freaky warning. As easily as Musk can turn off government websites, he can turn off our sites. He could turn off all .com or .org sites. He'll probably do it just that way. Only one domain will work in the future, x.com. Goodbye Google, Amazon, your drug store. Bubye. Not sure if moving your DNS to Europe or Asia will make a difference. He's taking advantage of centralization, and will try to make it more centralized. Totally centralized. A journalist couldn't report this, because what proof do I have? It's because there's a pattern here. And it's pretty obvious the tools he's using. ",
            "created": "Tue, 04 Feb 2025 17:20:50 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2024/08/17/dewey.png",
            "flInCalendar": true
        },
        {
            "text": "I was just setting up an account for another Feed Reader experiment on Bluesky and found that they have a <a href=\"https://www.google.com/search?q=site%3Ascripting.com+%22Suggested+User+List%22\">Suggested User List</a> that recommended the usual people who get in the way of telling the story that's really happening. I had a sinking feeling in my stomach, really felt it. We went through this with Twitter, it created influencers based on how loyal they were to the people who run Twitter, people who overlooked the obvious flaws in the system. We're living with their influence to this day, they have a million followers, completely manufactored by fealty to the owners. I swear to god these systems have to be publicly owned. The idea of turning to tech insiders to run them has run its course, don't you think. Over on Facebook this morning I saw an old friend with a cute meme that says people should paste swastika stickers on Teslas. That's nice. The reason you can get away with that is that you're attacking innocent people. More of the same. Of course <i>publicly owned</i> now means Musk Owned. See how things have changed, so quickly.",
            "created": "Tue, 04 Feb 2025 16:43:27 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://bsky.app/profile/stay.bsky.social/post/3lhcrxso5ik2e\">Jesse Stay</a> who I have known from early blogging days proposes to build the billionaire-proof social network using the AT Protocol. I'm going to help if I can. I'm developing apps that run on AT Proto, so at least I should be able to test my apps with his service. ",
            "created": "Tue, 04 Feb 2025 15:59:40 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I would love to manage individual DNS domains using GitHub. I already have great tools for updating stuff over there. And everything on my current DNS system is manual and laborious. ",
            "created": "Tue, 04 Feb 2025 16:26:34 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "It's as if we got cancer",
            "created": "Tue, 04 Feb 2025 15:30:45 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "What's happening in the US is like when a person who is a lifetime smoker gets cancer and stops smoking. You hope the cancer doesn't kill you, and swear to never smoke again if you're lucky enough to survive it.",
                    "created": "Tue, 04 Feb 2025 15:30:49 GMT",
                    "image": "https://imgs.scripting.com/2024/08/14/marlboroLights.png",
                    "flInCalendar": true
                },
                {
                    "text": "We didn't appreciate how good we had it with our representative form of government. We could have stopped the erosion of our power at any time, when our reps would have more or less had to listen. Now, when we start trying to get their attention, which hasn't happened yet, it's going to be a competition between the rule of law, which is undermined, and the forces that would keep our would-be rulers in line if only our reps felt we were behind them, which they justifiably, do not. ",
                    "created": "Tue, 04 Feb 2025 15:31:31 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The prognosis isn't good. But we should get our shit together asap because it's our only hope. ",
                    "created": "Tue, 04 Feb 2025 15:32:04 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PS: Blaming other people is easy and powerless. Accepting your own responsibility and doing something to change it is powerful.",
                    "created": "Tue, 04 Feb 2025 16:02:38 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}