{
    "created": "2025-02-06T05:00:00.000Z",
    "flInCalendar": true,
    "name": "06",
    "path": "2025/02/06",
    "text": "February 06",
    "type": "calendarDay",
    "subs": [
        {
            "text": "A great <a href=\"https://www.youtube.com/watch?v=P4nYgfV2oJA&t=130s\">scene in Goodfellas</a> where they explain what it's like to have Paulie the mob boss as a partner. In this scene Paulie is Musk. The restaurant owner is Trump. The United States is the restaurant.  \n",
            "created": "Thu, 06 Feb 2025 16:03:38 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "BTW, I found that video using ChatGPT. I had tried explaining it to Google and it didn't understand. ChatGPT found it in an instant. ",
            "created": "Thu, 06 Feb 2025 16:07:28 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "People might be curious to see the <a href=\"https://viewfeedlist.opml.org/?url=https%3A%2F%2Ffeedland.social%2Fopml%3Fscreenname%3Ddavewiner%26catname%3Dblogroll\">list of feeds</a> that make up the <a href=\"https://this.how/feediverse/bluesky/\">Little Feed Reader</a> account <a href=\"https://bsky.app/profile/feediverse.bsky.social\">on Bluesky</a>. It's dynamic, I can add or remove feeds through a very simple <a href=\"https://imgs.scripting.com/2025/02/06/feedlistEditor.png\">user interface</a> designed for managing systems like this. It's like the user inteface of a product like WordPress, for designers and developers, producing results that are for users. There are now apps for the <a href=\"https://bsky.app/profile/nba.feediverse.org\">NBA</a>, <a href=\"https://bsky.app/profile/devs.feediverse.org\">Devs</a> and all <a href=\"https://bsky.app/profile/dave.feediverse.org\">my feeds</a>.",
            "created": "Thu, 06 Feb 2025 14:30:38 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Big picture, the US is being turned into Russia.",
            "created": "Thu, 06 Feb 2025 14:08:40 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "California Senator Adam Schiff said, I think it was yesterday, that Trump and Musk are removing honest FBI investigators and DOJ attorneys so they can raid the treasury of the United States. It's obvious, but you don't hear it said very often. It's the money they want. All of it.",
            "created": "Thu, 06 Feb 2025 14:04:01 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "If you're feeling stressed",
            "created": "Thu, 06 Feb 2025 23:08:16 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "if you're feeling stressed, hum a few bars of alice's restaurant.",
                    "created": "Thu, 06 Feb 2025 23:08:24 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "i find it very calming and satisfying. ",
                    "flInCalendar": true
                },
                {
                    "text": "it's a nice place we can always go home to! ",
                    "flInCalendar": true
                },
                {
                    "text": "<a href=\"https://www.youtube.com/watch?v=m57gzA2JCcM\">https://www.youtube.com/watch?v=m57gzA2JCcM</a>",
                    "created": "Thu, 06 Feb 2025 23:09:06 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "just remember --",
                    "created": "Thu, 06 Feb 2025 23:08:41 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "you can get anything you want",
                    "flInCalendar": true
                },
                {
                    "text": "at alice's restaurant!",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Idea for news orgs",
            "created": "Thu, 06 Feb 2025 18:50:08 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Do 1000 profiles of federal workers being attacked by Musk.",
                    "created": "Thu, 06 Feb 2025 19:00:15 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Don't use real names. Have AI provide real-looking photos of fictitious people. Explain what they do. Don't focus on their lives. Make readers think of what life will be like without them.",
                    "created": "Thu, 06 Feb 2025 19:00:24 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "We should have done this a long time ago, when Reagan said, arrogantly, the government is the problem. ",
                    "created": "Thu, 06 Feb 2025 18:50:27 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "That should have been rebutted, strongly and regularly.",
                    "flInCalendar": true
                },
                {
                    "text": "We need to learn what they actually do, all of them, at least understand what we're going to live without.",
                    "created": "Thu, 06 Feb 2025 18:53:27 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I asked ChatGPT to try it out. \"I want to tell a story about a typical person who works for the US government. It shouldn't be a glamorous job, but an important one. It should improve people's lives, health, happiness, fulfillment. Pick the role at random, as well as gender, age, race, geography. Write a 100 word job description, and  provide a realistic looking profile picture. Nothing about their personal life, or actual name, but it's okay to talk about the required education and experience for the job.\"",
                    "created": "Thu, 06 Feb 2025 18:53:57 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Here's what it came back with: \"An Environmental Health Officer (EHO) plays a crucial role in safeguarding public health by identifying and mitigating environmental hazards. Employed by federal agencies such as the Centers for Disease Control and Prevention (CDC) or the Environmental Protection Agency (EPA), EHOs conduct inspections of facilities like restaurants, swimming pools, and nursing homes to ensure compliance with health regulations. They investigate complaints related to air and water quality, noise, and waste management, and implement measures to prevent disease outbreaks. A bachelor's degree in environmental health or a related field is typically required, with many positions preferring candidates with a master's degree. Professional certification, such as Registered Environmental Health Specialist (REHS), is often preferred. Strong analytical skills, attention to detail, and the ability to communicate effectively are essential for success in this role.\"",
                    "created": "Thu, 06 Feb 2025 18:54:54 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Our three Environment Health Officers (not actual people).",
                    "created": "Thu, 06 Feb 2025 18:57:59 GMT",
                    "inlineImage": "https://imgs.scripting.com/2025/02/06/theThreeEhos.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}