{
    "created": "2025-02-12T05:00:00.000Z",
    "flInCalendar": true,
    "name": "12",
    "path": "2025/02/12",
    "text": "February 12",
    "type": "calendarDay",
    "subs": [
        {
            "text": "The United States is not a Silicon Valley company",
            "created": "Wed, 12 Feb 2025 14:09:26 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2025/02/12/siliconValley.png",
            "description": "Ultimately the United States is going to chew up Musk and spit him out.",
            "subs": [
                {
                    "text": "I've had an experience few people have had, and it's relevant to the way all of us feel right now. The experience: Being part of a Silicon Valley company that was acquired by another Silicon Valley company. I was the CEO. ",
                    "created": "Wed, 12 Feb 2025 14:03:51 GMT",
                    "type": "outline",
                    "flInCalendar": true
                },
                {
                    "text": "I recognize the feeling, because Musk is acting as if he is the acquirer of a Silicon Valley company, and the company he has acquired in the USA. Or so he thinks. But the United States is not a Silicon Valley company where, you have departments and managers at every level, and each level must follow orders from the level above them. It doesn't work that way here. Deliberately. Very deliberately. ",
                    "created": "Wed, 12 Feb 2025 15:31:39 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "There never has been a Silicon Valley company that gives each employee the rights and responsibilities of an American citizen. We don't take orders except in very exceptional circumstances, and then with all the rights guaranteed by the Constitution. That's why Musk and Trump are having so much trouble coming to grips with how this place works, because even the employees of the USA are voters and taxpayers and have rights that must be respected. That <i>will</i> be respected or all hell will break loose. ",
                    "created": "Wed, 12 Feb 2025 14:11:19 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Anyway, back to Silicon Valley acquisitions. Up to the point when you, the former CEO, are now a VP, and must take orders from the CEO, you didn't have to take orders from anyone, not even your board of directors. The CEO of the tech company is a lot like a citizen of the US, until they aren't a CEO any longer and have to do the bidding of the actual CEO (which is who Musk thinks he is relative to the USA). This is why even MAGAs who love Trump (or really the idea of Trump) aren't going to put up with his bullshit. American citizens, rich or poor, old or young, LBGTQ or whatever -- we all are <a href=\"https://en.wikipedia.org/wiki/Sovereign_state\">sovereign</a>, ie we don't have to take orders from anyone, not even a supposed genius like Musk (sorry, but I am free to doubt his genius, something might take some getting used to by him). We don't take orders from him, or anyone else, except of course, as mentioned earlier under very special circumstances. ",
                    "created": "Wed, 12 Feb 2025 14:12:58 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Back to the disconnect in the Mind of Musk. Now you're supposed to sit here, quietly, while he rips apart the team you carefully built, the people you formed into a family with all its strengths and dysfunction. The new CEO (Musk) sweeps in with no idea what they're fucking with, and they don't want to hear about it. Finally you have to quit after a short time because you can't be part of the disaster they're creating. And always is a disaster, and sometimes they can dig out of it as he has done with Twitter, as we've seen many SV companies have. But again, for the 18th time, <i>the United States of America is not a Silicon Valley company.</i>",
                    "created": "Wed, 12 Feb 2025 14:10:27 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "What triggered it for me was the story about how Musk didn't know he had terminated all cancer research being done by the US. Surrounded by yes men, they never would have told him. And he didn't want to hear it from a founder (like a congressperson or the head of the NIH or the acting Treasury secretary). This is going to be repeated over and over until the acquirer writes off the investment or who knows. His experience comes from acquiring Tesla and Twitter, which while they were large organizations are nothing compared with the United States. ",
                    "created": "Wed, 12 Feb 2025 14:17:43 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "And ultimately the United States is going to chew up Musk and spit him out. We may be very damaged by the experience, but he will come out much worse than the country. Because we are not who he thinks we are. ",
                    "created": "Wed, 12 Feb 2025 14:29:39 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}