{
    "created": "2025-02-16T05:00:00.000Z",
    "flInCalendar": true,
    "name": "16",
    "path": "2025/02/16",
    "text": "February 16",
    "type": "calendarDay",
    "subs": [
        {
            "text": "We're diving head first into a world run by AI bots, before we've even begun to understand how to use them. Musk couldn't be more diabolical if he were cast as a comic book anti-hero. Trump is like the straight man police commissioner. I grew up reading those kinds of comic books. We all did I guess. Probably Elon Musk too. He needs a biographer, asap. Someone please get to work on this.  ",
            "created": "Sun, 16 Feb 2025 15:26:20 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The idea of a <a href=\"https://en.wikipedia.org/wiki/Self-coup\">coup</a> in the US is one we all presumably have a hard time thinking about. I sure do. It has never happened before. But it has happened now, and the group that is governing is doing it illegally, and is dismantling the country as quickly as they can, assuming someone will at some point try to stop them? Is that correct? What comes next? ",
            "created": "Sun, 16 Feb 2025 13:24:36 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2025/02/16/designatedSurvivor.png",
            "flInCalendar": true
        },
        {
            "text": "Great quote from a <a href=\"https://www.google.com/search?q=severance+s2e5\">favorite show</a>. \"He put the dick in contradiction.\" This is a show that doesn't often indulge in that kind of humor. I imagine they must've had a great time with it in the writer's room. Or was it ad-lib'd? And wtf does it mean?",
            "created": "Sun, 16 Feb 2025 13:24:55 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "BTW, no one thought much about the threading structure we use on Bluesky. As far as I can tell it was copied from Twitter. It's not a very good structure. It encourages spam and abuse. You gotta wonder if the threading structure had evolved, or if there were more competition, different approaches to see what would happen, we might have avoided our meltdown with a better design.",
            "created": "Sun, 16 Feb 2025 14:12:19 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}