{
    "created": "2025-02-18T05:00:00.000Z",
    "flInCalendar": true,
    "name": "18",
    "path": "2025/02/18",
    "text": "February 18",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Threads in Bluesky",
            "created": "Tue, 18 Feb 2025 23:32:56 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2025/02/18/charlieHustle.png",
            "subs": [
                {
                    "text": "I started out doing a week to strip blue.threadcenter down to its bones, for a fresh start, but then I started getting ideas, and decided to go for it. I have the time, and Bluesky is having moment after moment and these days I'm using it to the exclusion of pretty much everything else, though I do check Twitter, Threads and Mastodon a few times a day, but usually there's nothing for me in those places. Anyway I'll be pointing to this post <a href=\"https://bsky.app/profile/bighugga.bsky.social/post/3liihaddhsf2g\">from</a> some of my experiments, so maybe nothing more interesting than this will appear here. ",
                    "created": "Tue, 18 Feb 2025 23:33:05 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "An example of AI use",
            "created": "Tue, 18 Feb 2025 19:45:42 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I just thought of a good example of a question you could bring to ChatGPT. Here's the prompt.",
                    "created": "Tue, 18 Feb 2025 16:46:12 GMT",
                    "subs": [
                        {
                            "text": "<i>I'm thinking of driving from NYC to Jacksonville, FL. I want to do it in four days with stopovers in three places that have good places to ride a bike and a Citibike-style bike rental. Choose three places on the trip, I don't mind going out of my way.</i>",
                            "created": "Tue, 18 Feb 2025 16:46:36 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "It gave me three places to stop, Washington DC, Raleigh NC and Charleston SC. In each case it told me about the bike-sharing services and notable bike trails. ",
                    "created": "Tue, 18 Feb 2025 16:47:29 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "A logical next question would be to ask it to find hotels in each place that are reasonably priced and near an interesting place to ride.",
                    "created": "Tue, 18 Feb 2025 16:48:15 GMT",
                    "image": "https://s3.amazonaws.com/scripting.com/images/2024/02/13/commanderDataStarTrek.png",
                    "flInCalendar": true
                },
                {
                    "text": "It also offered information about weather considerations. It's not necessarily a great time of year for bike riding.",
                    "created": "Tue, 18 Feb 2025 16:48:51 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I'm not actually planning a trip south, I just used it as an example because I've done this trip a number of times and was curious how things had developed.",
                    "created": "Tue, 18 Feb 2025 16:49:35 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Another question I used to have when cross-country driving, where can I find a Starbucks not too far off the route I'm on. If you were plotting the progress of public information systems, AI is strictly on a continuum of services that have developed over the years that make information more accessible in the way you want it. It actually answers questions you have in the way you think of asking them. ",
                    "created": "Tue, 18 Feb 2025 16:50:10 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Here's a <a href=\"https://chatgpt.com/share/67b4bace-25e8-8012-99e4-ddec819960e8 \">link to the response</a>. I've heard that sometimes people have trouble accessing these files. ",
                    "created": "Tue, 18 Feb 2025 16:51:58 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}