{
    "created": "2025-02-19T05:00:00.000Z",
    "flInCalendar": true,
    "name": "19",
    "path": "2025/02/19",
    "text": "February 19",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I don't like <a href=\"https://bsky.app/profile/scripting.com/post/3likjorqzmk23\">social networks</a> as they're currently configured. The idea that it's some kind of conversation -- no it really doesn't resemble a conversation. I would like to try a social network that didn't have the concept of replying to a post. Give each other a little more distance. It still would be a graph, people following other people, but you wouldn't be able to insert something into someone else's flow, which is where all the indecency comes from imho. Or let replies be only visible to the person it's in reply to, so you don't end up getting speeches under your posts. And so that people with a lot of followers don't bother reading anything that's related to what they wrote, and thus no new ideas can enter the flow. We've been doing this, the way we do it, since the inception of Twitter in 2006. For some reason the design of that network is considered sacred. I was a math major who studied combinatorics, specifically graph theory -- and the Twitter way of organizing people and discourse is just one of many ways people could be arranged. Predictably, the weird structure of Twitter is turning into the structure of our society. If we want to change things the fastest way might be to do another look at what Twiiter does and see if we can't intentionally make something that works better for whatever we think we should be doing with it, other than staring at the evil people on the other side and saying how evil they are (or hopeless, or woke or whatever bullshit the influencers have made up). And with that I wish you a good evening and note that tomorrow is another day. :smile:",
            "created": "Thu, 20 Feb 2025 03:07:37 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2023/11/30/goodhumortruck.png",
            "flInCalendar": true
        },
        {
            "text": "One more thing. I like watching Maddow nowadays. She seems unstuck. And she's talking straight to the Repubs, and not with resignation, with the idea that maybe finally enough is enough, and they might work with us to save what we can of this great country. Also like that Bernie Sanders is on the road campaigning in swing districts that are held by Repubs, to see if he can squeeze out a few defectors from the ranks of House Republicans. Very important, because the Repub margin there is only 3. Just have to flip 2. America has to start moving now, or it's going to take a long long time to come back from this. The sooner we all get that, and that <i>we</i> are part of it, the better things will turn out, imho.",
            "created": "Thu, 20 Feb 2025 03:18:24 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}