{
    "created": "2025-02-21T05:00:00.000Z",
    "flInCalendar": true,
    "name": "21",
    "path": "2025/02/21",
    "text": "February 21",
    "type": "calendarDay",
    "subs": [
        {
            "text": "<a href=\"https://wordland.social/\">WordLand</a> is <a href=\"https://daveverse.wordpress.com/2025/02/21/quiet-launch/\">now open</a> for anyone to sign up. Here we go! :-) ",
            "created": "Fri, 21 Feb 2025 20:59:49 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Something you hear from Democratic politicians and MSNBC hosts. \"We know why Musk is cutting so much, it's to fund a huge tax cut for billionaires.\" They don't actually know that and I doubt it's true. Show me another example where Musk did anything to benefit anyone but himself? Why should he share the loot he's grabbing with other rich folk? What did they do to help? Nah I think it's all for him, with a taste going to the Trump and Putin families. He's going to use his new power to buy something else. The question is what? What else could he want? I imagine he wants <i>all the money</i> in the world not just the most. ",
            "created": "Fri, 21 Feb 2025 13:12:41 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2020/07/27/weHaveMetTheEnemy.png",
            "flInCalendar": true
        },
        {
            "text": "Templates for Bluesky?",
            "created": "Fri, 21 Feb 2025 15:20:20 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "A note to designers of Bluesky as a platform.",
                    "created": "Fri, 21 Feb 2025 15:20:41 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I've been playing with adding metadata to <a href=\"https://bsky.app/profile/bighugga.bsky.social/post/3liozqb2lkc2f\">posts</a> in a thread. ",
                    "created": "Fri, 21 Feb 2025 15:20:47 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "As you can see the metadata, in the screen shot below, overwhelms the content in the post.",
                    "created": "Fri, 21 Feb 2025 15:25:04 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Wouldn't it be nice to have a set of templates to choose from, post types? Let designers be part of the platform.",
                    "created": "Fri, 21 Feb 2025 15:21:56 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Playing with metadata in a <a href=\"https://bsky.app/profile/bighugga.bsky.social/post/3liozqb2lkc2f\">post</a> in a thread.",
                    "created": "Fri, 21 Feb 2025 15:21:56 GMT",
                    "inlineImage": "https://imgs.scripting.com/2025/02/21/examplePost.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Who is Elon Musk?",
            "created": "Fri, 21 Feb 2025 13:17:12 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Journalism is as usual writing news they could have written last year and should have if they weren't dreaming that somehow we'd escape End of Democracy 2.0. And we know how that turned out, about the same as <a href=\"https://daytona.scripting.com/search?q=%22Hillary%27s%20Emails%22\">Hillary's Emails</a>. ",
                    "created": "Fri, 21 Feb 2025 13:24:59 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Who is Elon Musk? Until I read his <a href=\"https://en.wikipedia.org/wiki/Elon_Musk\">Wikipedia profile</a> last week, I only had a vague idea. I wanted to know if he was actually raised in South Africa, when he left, and what influence it had on him. I'll let you read the article. We should be examining every nook and cranny of who this unelected guy who never was in a debate, or won a primary or an election, or had his background investigated, and remains untouched by any kind of examination. ",
                    "created": "Fri, 21 Feb 2025 13:30:00 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "His security detail was just <a href=\"https://www.cnn.com/2025/02/20/politics/elon-musk-private-security-deputized-marshals-service/index.html\">deputized</a> by the <a href=\"https://www.usmarshals.gov/\">US Marshals Service</a>. What next? Maybe they'll just give him control of the military and get on with it. You can see that's coming, maybe in March, or sooner. ",
                    "created": "Fri, 21 Feb 2025 13:26:30 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Do you think he'd have any <a href=\"https://dictionary.cambridge.org/us/dictionary/english/compunction\">compunction</a> against using the military against Americans? This isn't his country. So Americans probably mean nothing special to him. Since we played a role in the overthrow of their apartheid, probably the opposite. I wonder who or what he cares about. Has he ever answered a question without deflecting? Is there any reporter who could or would interview him? ",
                    "created": "Fri, 21 Feb 2025 13:28:08 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "If journalism were really doing their job seriously, they would report on this because this is what we're thinking. When will jouralism get that they are one of us, not above us? The sooner that light goes on, the better.  ",
                    "created": "Fri, 21 Feb 2025 13:36:23 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Here's a good story for one of fierce courageous reporters at the NY Times. Who should be more scared of what's coming? Blacks or Jews?",
                    "created": "Fri, 21 Feb 2025 13:36:02 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Musk's exclusive",
            "created": "Fri, 21 Feb 2025 13:11:37 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Can you imagine how livid developers of other AI platforms are that Musk gets exclusive access to all the private information stored in US government databases.",
                    "created": "Fri, 21 Feb 2025 13:12:08 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Imagine Bezos calling Trump.",
                    "created": "Fri, 21 Feb 2025 13:11:49 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "\"Hey I thought we were friends. I can send you another billion. 2 billion? 100 billion?\" ",
                    "flInCalendar": true
                },
                {
                    "text": "\"Call Elon, if he says it's OK I'll sign the order.\"",
                    "flInCalendar": true
                },
                {
                    "text": "Microsoft, Facebook, Apple, Oracle, OpenAI, etc etc.",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}