{
    "text": "I don't watch a lot of movies these days thanks to the pandemic I guess. But in the last two days I watched two, <a href=\"https://en.wikipedia.org/wiki/Nomadland_(film)\">NomadLand</a> and <a href=\"https://en.wikipedia.org/wiki/I_Care_a_Lot\">I Care a Lot</a>. It's hard to imagine two more different movies. NomadLand is a character study, played by a 63-year-old <a href=\"https://en.wikipedia.org/wiki/Frances_McDormand\">Frances McDormand</a>. Her age is important. I understand this somewhat because I'm 65, and it's like that great <a href=\"https://www.youtube.com/watch?v=_Z_7eu64y6c\">Al Pacino speech</a> in <a href=\"https://en.wikipedia.org/wiki/Any_Given_Sunday\">Any Given Sunday</a>, as you get older <a href=\"https://youtu.be/_Z_7eu64y6c?t=102\">things are taken</a> from you. Parents, friends, lovers, and then pieces of yourself start going, and you're left wondering what the fuck. That's NomadLand in a nutshell. The acting is beautiful, the scenery, the characters, the feelings (somewhat) -- but the story? It's like viewing a work of art in a museum. It's just there. It's for you to decide what it means and a lot of that will depend on how old you are, I imagine. I Care a Lot is very much the opposite, but interestingly it's also about things being taken away from an old person, in this case played by 72-year-old <a href=\"https://en.wikipedia.org/wiki/Dianne_Wiest\">Dianne Wieste</a>. So much happens in the first few minutes of the movie, and it's so anger-making, I turned it off at least three times to regain my composure to continue watching. But then it becomes a rollicking ultra-violent comedy, kind of like a Quentin Taratino movie, but funnier. If you want entertainment, I Care a Lot is for you. I will watch NomadLand again. Sometimes movies like this don't grab me on the first viewing, for example, <a href=\"https://en.wikipedia.org/wiki/There_Will_Be_Blood\">There Will Be Blood</a>, which i panned after a first viewing, then <i>loved</i> after a second. I'll let you know.  ",
    "created": "Sun, 21 Feb 2021 15:18:20 GMT",
    "type": "outline",
    "image": "http://scripting.com/images/2021/02/21/nomadland.png",
    "flInCalendar": true
}