{
    "text": "April 1",
    "created": "Wed, 01 Apr 2020 13:11:15 GMT",
    "name": "01",
    "subs": [
        {
            "text": "You know that scene in <a href=\"https://en.wikipedia.org/wiki/Goodfellas\">Goodfellas</a> where the <a href=\"https://en.wikipedia.org/wiki/Ray_Liotta\">Ray Liotta</a> character explains how they steal everything out of the bar they took over and then finally torch it to get the insurance money. That's America. Trump and friends are the <a href=\"https://en.wikipedia.org/wiki/Wiseguy_(book)\">wiseguys</a>. And we're being torched right now. And we aren't doing anything about it. The press keeps waiting for him to turn into FDR or even Nixon. ",
            "created": "Wed, 01 Apr 2020 14:04:15 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/04/01/wiseguy.png"
        },
        {
            "text": "<a href=\"http://scripting.com/2020/04/01/whatWillLifeBeLikeAfter.m4a\">Podcast</a>: What will it be like when the lights come back on? We've never turned off the world economy like this. We have had disasters where whole cities were decimated, but the world around them was able to absorb the flow of people, and send enough people and money in to rebuild. But what happens when there is no place to go, nor enough people to come in and help rebuild? ",
            "created": "Wed, 01 Apr 2020 17:04:01 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2020/04/01/whatWillLifeBeLikeAfter.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "14407270"
        },
        {
            "text": "Added a docs page for <a href=\"https://github.com/scripting/pagePark/blob/master/docs/plugins.md\">PagePark plugins</a>.",
            "created": "Wed, 01 Apr 2020 16:12:59 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://twitter.com/mathewi/status/1245400270533787648\">Mathew Ingram</a> shared a relaxing clip of the creek near his house. ",
            "created": "Wed, 01 Apr 2020 20:11:18 GMT",
            "type": "outline"
        },
        {
            "text": "I did the Census today. <a href=\"https://twitter.com/davewiner/status/1245399157512208384\">Noted</a> the only choices for gender were male and female. Also they didn't ask about my <a href=\"https://twitter.com/davewiner/status/1245421110310600705\">occupation</a>. I wonder if that's related to age.",
            "created": "Wed, 01 Apr 2020 20:08:45 GMT",
            "type": "outline"
        },
        {
            "text": "My friend told Facebook that his birthday is April 1 (it’s not) and all of the happy birthday wishes show up on his timeline as if on schedule. The best part is he doesn’t have to do a thing. Facebook does all the work.",
            "created": "Wed, 01 Apr 2020 13:11:16 GMT",
            "type": "outline"
        },
        {
            "text": "I'm going to turn 65 soon, so it's time to apply for Medicare. I finally got serious about it. I found the page where you apply for it, read the instructions, watched the video and thought this is going to be a breeze. I do this kind of stuff all the time. So I started to set up an account. They ask for your SSN, date of birth, address, phone, email address. I entered them all. It said no, you didn't do it right, go back and do it again. No indication which part they didn't like. So I tweaked my address. Still it doesn't like it. So I took out my middle initial, thinking my father, when he set up this account for me in 1957 or so might have left this out. They said no, and <a href=\"http://scripting.com/images/2020/04/01/errorMessage.png\">that's it</a> for 24 hours. You can't keep doing this the message said. I guess they figured I was trying to hijack my account? So I tried calling the number they gave for assistance. Oy. I got every piece of information they think I might be looking for. It's pretty grim stuff. I left a callback number. ",
            "created": "Wed, 01 Apr 2020 13:28:54 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/04/01/grandpa.png"
        }
    ]
}