{
    "text": "April 3",
    "created": "Fri, 03 Apr 2020 14:11:06 GMT",
    "name": "03",
    "subs": [
        {
            "text": "Stop what you're doing and watch retired general <a href=\"https://twitter.com/DavidBegnaud/status/1245907955469430796\">Russel L. Honoré</a> on the fiasco of the medical equipment supply chain. Clearly we're being looted by the Trumps.",
            "created": "Fri, 03 Apr 2020 14:11:07 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/DavidBegnaud/status/1245907955469430796",
            "image": "http://scripting.com/images/2017/12/23/sarahLynn.png"
        },
        {
            "text": "Don't forget, we have a <a href=\"http://scripting.com/cuomo/rss.xml\">podcast feed</a> for <a href=\"http://this.how/cuomo/\">Cuomo daily briefings</a>. Subscribe in your favorite podcast client. ",
            "created": "Fri, 03 Apr 2020 15:28:13 GMT",
            "type": "outline"
        },
        {
            "text": "This <a href=\"https://www.youtube.com/watch?v=5sQsVBolPNs&feature=youtu.be&t=137\">scene</a> from The West Wing about smallpox.",
            "created": "Fri, 03 Apr 2020 21:53:12 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=8nQNGYf3ZVY&feature=youtu.be\">Some of my many trees</a>. They laugh when I say they’re mine. Long after you’re gone, they say, we will still be here.",
            "created": "Fri, 03 Apr 2020 22:32:48 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=8nQNGYf3ZVY"
        },
        {
            "text": "Continuing to update <a href=\"http://woodstock.today/\">Woodstock Today</a> list.",
            "created": "Sat, 04 Apr 2020 02:08:43 GMT",
            "type": "outline"
        },
        {
            "text": "It sucks that there isn't a wiki-type food ordering app that takes no percentage of sales. I want the money to go to the deliverers and the restaurants. The restaurant would pay a flat monthly fee. At this late date there is no justification for the money the middlemen make.",
            "created": "Fri, 03 Apr 2020 15:44:29 GMT",
            "type": "outline"
        },
        {
            "text": "I think what <a href=\"https://www.businessinsider.com/bill-gates-factories-7-different-vaccines-to-fight-coronavirus-2020-4\">Bill Gates</a> is doing is terrific, but it's ironic that the thing that helped the Mac take over from Windows were viruses, and <a href=\"http://scripting.com/2013/03/04/whyWindowsLostToMac.html\">Microsoft's refusal</a> at first to do anything about them.",
            "created": "Fri, 03 Apr 2020 17:14:45 GMT",
            "type": "outline"
        },
        {
            "text": "As time goes by more of us will realize the danger we're in. Soon it will be universal. Everyone will feel it. This will have a benefit. Being right doesn't matter as much as we thought. We can be more accepting of ourselves and each other.",
            "created": "Fri, 03 Apr 2020 15:16:55 GMT",
            "type": "outline"
        },
        {
            "text": "Another thing that will happen, is already happening. More art will flow through the net. It's now the main form of human expression. I predicted this, going back to the beginning. People thought I was nuts. We were building a platform for human expression. Communication with a Big C.",
            "created": "Fri, 03 Apr 2020 15:14:59 GMT",
            "type": "outline"
        },
        {
            "text": "I predict that this week we will finally realize, the vast majority of Americans, that Trump is a distraction, an impediment, a sideshow. Finally the focus will be where it should have been since January, the virus.",
            "created": "Fri, 03 Apr 2020 15:24:49 GMT",
            "type": "outline"
        },
        {
            "text": "We will all be more patient in the future. What's a few minutes compared to all the waiting we're doing now. It's funny, I could keep developing, nothing in my way, but for the first time in a long time, I can't get the excitement or even the interest to actually do the work. Not that I don't get ideas. I'm much more interested in finding a good online version of Hearts, Sorry or Risk. Or if there were a way to play Wii games online. Now that would be interesting. But I don't want to write the software, thank you very much. :boom:",
            "created": "Fri, 03 Apr 2020 14:50:25 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/06/26/quimby.png"
        }
    ]
}