{
    "text": "April 6",
    "created": "Mon, 06 Apr 2020 13:30:45 GMT",
    "name": "06",
    "subs": [
        {
            "text": "At next press conference, please ask Trump if he has considered resigning. Repeat until he resigns. ",
            "created": "Mon, 06 Apr 2020 13:30:46 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/04/06/rooster2.png"
        },
        {
            "text": "In the past our idiocracy killed people in far-away places. Now as they say, the chickens have come home to roost. Now you can't look the other way.",
            "created": "Mon, 06 Apr 2020 18:04:34 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://twitter.com/joshtpm/status/1247216801886416902\">Kudlow</a>: \"I don't believe anybody could have predicted the exponential rise of this.\" OK that right there is why you get people who know math and biology to run the response to a pandemic. ",
            "created": "Mon, 06 Apr 2020 18:06:28 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/joshtpm/status/1247216801886416902"
        },
        {
            "text": "It really should be Cuomo v Trump in the November election, assuming Trump hasn't resigned by then.",
            "created": "Mon, 06 Apr 2020 16:24:49 GMT",
            "type": "outline"
        },
        {
            "text": "We ought to, instead of talking about how <s>deficient</s> defunct Trump is, talk about the job of POTUS, what his or her responsibilities are, for future reference, so there’s never again a doubt as to whether the incumbent is doing the job.",
            "type": "tweet",
            "created": "Mon Apr 06 11:41:31 +0000 2020"
        },
        {
            "text": "I suggest we use the word \"trump\" (lower case) to refer to what we used to call the Republican Party. Example of usage: \"That trump is really corrupt. Yeah they all are.\"",
            "created": "Mon, 06 Apr 2020 18:14:25 GMT",
            "type": "outline"
        },
        {
            "text": "Has Trump taken hydroxychloroquine himself? Why not? What has he got to lose?",
            "created": "Mon, 06 Apr 2020 13:51:55 GMT",
            "type": "outline"
        },
        {
            "text": "Was the Queen's speech timed to coincide with <a href=\"https://www.npr.org/sections/coronavirus-live-updates/2020/04/05/827754993/boris-johnson-hospitalized-for-testing-after-coronavirus-diagnosis\">Boris Johnson's hospitalization</a> or was it a chance event?",
            "created": "Mon, 06 Apr 2020 13:38:14 GMT",
            "type": "outline"
        },
        {
            "text": "Rudy Kiesler",
            "created": "Mon, 06 Apr 2020 15:20:04 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "My maternal grandfather, <a href=\"http://rudykiesler.com/\">Rudy Kiesler</a>, was a bundle of energy. Highly opinionated. Very loud. Didn't spend a lot of time thinking (or so it seemed to me as a child) he just burst into action. ",
                    "created": "Mon, 06 Apr 2020 15:20:07 GMT",
                    "image": "http://static.scripting.com/larryKing/images/2013/08/07/ohRudy.gif"
                },
                {
                    "text": "He was the 13th of 13 children, born in the land between Poland and Germany, sent off to fend for himself as a very young boy. ",
                    "created": "Mon, 06 Apr 2020 18:17:48 GMT"
                },
                {
                    "text": "Jewish, he was deported in the first rounds of the Nazi regime, leaving my grandmother and mother behind. Lucie, my grandmother, was Lutheran, blonde-haired, blue-eyed Aryan princess. Why they married is something I never understood. They didn't seem to have anything in common.",
                    "created": "Mon, 06 Apr 2020 15:21:16 GMT"
                },
                {
                    "text": "So the women were left in Germany or Czechoslavakia, I'm not clear on which, and <a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+rudy+kiesler&t=hy&ia=web\">Rudy K</a> was in Brooklyn or Queens, setting up a garment business, which he ran until he had a stroke in the 1970s. With no heir wanting to inherit the business, he sold the company, United Pioneer, to <a href=\"https://www.referenceforbusiness.com/history2/53/Salant-Corporation.html\">Salant & Salant</a>. But he was always a bundle of energy, until he drifted away in a nursing home and died in the early 90s.",
                    "created": "Mon, 06 Apr 2020 15:28:56 GMT"
                },
                {
                    "text": "He would not have liked this \"stay home stay safe\" thing. I can't imagine he would have done it. He was the kind of guy who couldn't stand to wait in a line at the <a href=\"https://en.wikipedia.org/wiki/1964_New_York_World%27s_Fair\">World's Fair</a>, so he'd cut in front of the person at the front of the line, and when they complained, he'd ignore them (this actually happened). ",
                    "created": "Mon, 06 Apr 2020 15:23:44 GMT"
                },
                {
                    "text": "Here's a <a href=\"http://scripting.com/images/2001/09/22/kieslers.gif\">picture</a> of his <a href=\"http://scripting.com/2001/09/22.html#l60a1aad9dbba17d33466766294610e29\">family</a> in Rockaway probably in 1961 or so. ",
                    "created": "Mon, 06 Apr 2020 15:24:53 GMT"
                },
                {
                    "text": "He was a legend. Still looms large in my mind. ",
                    "created": "Mon, 06 Apr 2020 15:30:03 GMT"
                }
            ]
        },
        {
            "text": "Tabs on scripting.com",
            "created": "Mon, 06 Apr 2020 15:11:48 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I changed the way tabs work on the \"Scripting News\" home page.",
                    "created": "Mon, 06 Apr 2020 15:11:53 GMT"
                },
                {
                    "text": "There are three tabs: Blog, Links and About.",
                    "created": "Mon, 06 Apr 2020 15:12:04 GMT"
                },
                {
                    "text": "When you click on a tab, you are redirected with a url of this form:",
                    "created": "Mon, 06 Apr 2020 15:12:19 GMT",
                    "subs": [
                        {
                            "text": "http://scripting.com/?tab=<i>name</i>",
                            "created": "Mon, 06 Apr 2020 15:12:42 GMT"
                        }
                    ]
                },
                {
                    "text": "Where <i>name</i> is the name of the tab you're going to.",
                    "created": "Mon, 06 Apr 2020 15:12:53 GMT"
                },
                {
                    "text": "That way you always have a link to the tab in the address bar.",
                    "created": "Mon, 06 Apr 2020 15:13:02 GMT"
                },
                {
                    "text": "And the browser's Back button works. ",
                    "created": "Mon, 06 Apr 2020 15:13:29 GMT"
                },
                {
                    "text": "It used to do it all with JavaScript without redirecting.",
                    "created": "Mon, 06 Apr 2020 15:13:12 GMT"
                },
                {
                    "text": "It also no longer remembers what tab you had frontmost last time you visited the site. This was always annoying. Not a good heuristic. When I come to scripting.com 99 times out of 100 I want to see the blog. It doesn't matter what I was looking at last time I visited. ",
                    "created": "Mon, 06 Apr 2020 15:14:05 GMT"
                },
                {
                    "text": "This was suggested a long time ago, has been on my todo list ever since, and I finally got around to doing it. It's even worse than it appears. :boom:",
                    "created": "Mon, 06 Apr 2020 15:15:00 GMT"
                }
            ]
        }
    ]
}