{
    "text": "April 7",
    "created": "Tue, 07 Apr 2020 12:16:57 GMT",
    "name": "07",
    "subs": [
        {
            "text": "I don't understand how <a href=\"https://www.youtube.com/watch?v=NWeh4A600E0\">this clip</a> from <a href=\"https://en.wikipedia.org/wiki/The_Dark_Knight_(film)\">The Dark Knight</a> hasn't become viral, it's such a premonition of Trump. Where's the plan you ask? There is no plan. He's the dog who caught the car. He has no idea what to do with it.",
            "created": "Tue, 07 Apr 2020 15:33:40 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=NWeh4A600E0"
        },
        {
            "text": "Is there a website you can go to, to find out if Trump's daily-court-holding is over?",
            "created": "Tue, 07 Apr 2020 22:04:23 GMT",
            "type": "outline"
        },
        {
            "text": "It's amazing how many podcasts suck for the simple reason that they put 15-20 minutes overhead up front. You keep waiting for them to start. My mainstays all have one thing in common, they start quickly.",
            "created": "Tue, 07 Apr 2020 14:29:14 GMT",
            "type": "outline"
        },
        {
            "text": "Manhattanites queue up for Zabar's. ",
            "created": "Tue, 07 Apr 2020 14:19:34 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/04/07/zabars.png"
        },
        {
            "text": "New slogan: <a href=\"https://github.com/scripting/utils/blob/master/daveutils.js#L748\">Wash your hands</a>.   ",
            "created": "Tue, 07 Apr 2020 13:07:59 GMT",
            "type": "outline"
        },
        {
            "text": "When I edited yesterday's piece about my grandfather <a href=\"http://scripting.com/2020/04/06/152004.html?title=rudyKiesler\">Rudy Kiesler</a>, I stumbled across a reference to him as a \"German Jewish communist,\" on a page about <a href=\"https://wikimili.com/en/Arno_Schmidt\">Arno Schmidt</a>, who was my grandmother's brother, Rudy's brother-in-law, my mother's uncle and my great uncle. I thought that was super interesting. Because if you met Rudy you'd have thought he was a Republican, at least today you would. But he wasn't at all. He was super liberal. Our whole family was. It never occurred to me that he was a communist, but he might have been, esp from the point of view of Uncle Arno (who I never actually met). ",
            "created": "Tue, 07 Apr 2020 12:16:58 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/04/07/arnoSchmidt.png"
        },
        {
            "text": "Also, <a href=\"http://rudykiesler.com/\">Rudy's</a> company, <a href=\"http://www.b340.com/\">United Pioneer</a>, still exists. Apparently Salant shut it down when they went bankrupt in the 80s, they must have sold the name to Bernie Braverman, who worked for Rudy. I remember him, since I worked in the office one summer (the summer of the Watergate hearings). United Pioneer, amazingly, still exists, but they wrote Rudy Kiesler out of the story. I've seen this happen many times, even with my own work. It must run in the family. Anyway the web is amazing, the trails are there for all of this, you just have to look, and now this is part of the story too. ",
            "created": "Tue, 07 Apr 2020 12:22:14 GMT",
            "type": "outline"
        }
    ]
}