{
    "text": "April 9",
    "created": "Thu, 09 Apr 2020 14:10:45 GMT",
    "name": "09",
    "subs": [
        {
            "text": "I've heard it said in the news that the virus is \"peaking\" in the US. Pretty sure that's not true. It <i>may</i> be peaking on its first go-around in NYC, but elsewhere it's just ramping up. ",
            "created": "Thu, 09 Apr 2020 21:27:27 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/04/09/santaCoke.png"
        },
        {
            "text": "I remember how hard it was to stop smoking in the years before I actually did. I would make a little progress, and feel okay I can have one now, I've been good, and then I go right back to two packs a day. Getting rid of the virus is going to be like that. Just when we feel like we have it licked is when you have to double-down on the commitment. It's so easy to let up, relax. And go back to the thing that was killing you. ",
            "created": "Fri, 10 Apr 2020 02:03:18 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"http://scripting.com/2002/08/22.html#When:5:05:41PM\">2002</a>: \"Tomorrow is Day 70 of No Smoking Dave. Ten weeks. A non-smoking story at the Bowie concert last week. As I'm walking out I see people lighting up everywhere. Smell of smoke all around. It smells good. I really want one. In my mind I outline the steps it would take to be smoking and the amount of time it would take. I would ask someone if they could spare a cigarette. If they said no I'd offer them $1. Oh hell, just offer $1 to begin with. Whoo, where would I get a match. I'd ask for a light. Take a drag. Estimated time, 15 seconds to one minute to first nicotine rush. My heart started beating faster. I felt scared like you feel on a NY subway platform as a train is entering the station and you're standing on the platform and in the instant before it passes you think how you could end your life by leaning forward.\"",
            "created": "Thu, 09 Apr 2020 21:33:15 GMT",
            "type": "outline"
        },
        {
            "text": "Yesterday <a href=\"https://twitter.com/amazon/status/1248094415752749059\">Jeff Bezos visited</a> an Amazon warehouse and a Whole Foods supermarket. The video would have been hard to anticipate just a few weeks ago. Why is he walking around like that, alone, not shaking anyone's hand. If that were a scene in a movie it would win an award. Foreboding. Ominous. Weird. ",
            "created": "Thu, 09 Apr 2020 20:38:08 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/amazon/status/1248094415752749059"
        },
        {
            "text": "A couple of months ago it <a href=\"http://scripting.com/2020/02/08.html#a184531\">started</a> to bug me that I didn't have a DVR for my TV, haven't had one since I gave up my TiVO when I left Massachusetts in 2004. Now my cable setup is Spectrum, because that's the only cable supplier where I live, and their TV package, including HBO, Showtime, and the rest of the stuff. I used it mainly for HBO, MSNBC, Law & Order and the occasional Knicks game. I set out on a quest for an alternative, and the best I came up with is <a href=\"https://tv.youtube.com/\">YouTube TV</a> which I am now subscribed to. The other choice was Hulu, which I have used and liked. Not sure which is better. Anyway, I got my <a href=\"https://en.wikipedia.org/wiki/Digital_video_recorder\">DVR</a>, so I can watch last night's Maddow when <i>The Trump Show</i> is on in the early evening. And I don't need <a href=\"https://www.insider.com/when-sports-return-from-coronavirus-hiatus-nba-mlb-nhl-2020-3\">sports</a>, because there aren't any. And I use the <a href=\"https://channelstore.roku.com/details/8378/hbo-go\">HBO app</a>, along with Netflix and Amazon. It's a good setup. ",
            "created": "Thu, 09 Apr 2020 14:10:46 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/04/09/tivo.png"
        },
        {
            "text": "The Fake Friends of Facebook are getting so freaking obvious and numerous. Every day I get ten or twenty friend requests from \"people\" who are obviously made-up. Here's a <a href=\"http://scripting.com/images/2020/04/09/fakeFriendRequestsOnFacebook.png\">screen shot</a> of some of them. I'm amazed Facebook's algorithm can't filter these.",
            "created": "Thu, 09 Apr 2020 15:06:36 GMT",
            "type": "outline"
        },
        {
            "text": "Biden can make a difference now",
            "created": "Thu, 09 Apr 2020 14:59:12 GMT",
            "type": "outline",
            "description": "Do what the CDC would be doing if Trump weren't president. ",
            "metaImage": "http://scripting.com/images/2020/04/09/cdc.png",
            "subs": [
                {
                    "text": "Biden can assemble a panel of scientists and medical doctors to keep the public informed. An hour a day, press conference style. What the CDC would be doing if Trump weren't president. ",
                    "created": "Thu, 09 Apr 2020 15:34:59 GMT"
                },
                {
                    "text": "And he (Biden) would step back, an example for what Trump should do. Let the doctors and the military manage it. Stop campaigning while thousands of Americans are dying. Biden wouldn't even have to say it. It would make Trump look immediately tone deaf which he most certainly is.  ",
                    "created": "Thu, 09 Apr 2020 16:21:14 GMT"
                },
                {
                    "text": "What makes this idea so appealing right now is that the governors are linking up and sharing resources. Someone should be providing the science for them. The government is failing. But there's plenty of unused talent out there, it just needs to be managed. ",
                    "created": "Thu, 09 Apr 2020 15:20:55 GMT"
                },
                {
                    "text": "Another reason -- it would mean that in order to compete, Trump would not only have to enable his scientists, he would also have to start using the US government money as it must be used, not for whatever bullshit he has planned. If he doesn't why should anyone listen to him? By giving him TV power the networks have made it unnecessary for him to use the government's economic and military power. ",
                    "created": "Thu, 09 Apr 2020 15:41:29 GMT"
                }
            ]
        }
    ]
}