{
    "text": "April 11",
    "created": "Sat, 11 Apr 2020 15:31:02 GMT",
    "name": "11",
    "subs": [
        {
            "text": "<a href=\"http://this.how/littleoutliner/versions.opml#1583613735000\">LittleOutliner v1.8.12</a>. Lots of fixes, tweaks. ",
            "created": "Sat, 11 Apr 2020 15:54:37 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://github.com/scripting/pagePark#v086-41120-by-dw\">PagePark v0.8.6</a>. Mirrors, and a new feature for plugins. ",
            "created": "Sat, 11 Apr 2020 15:31:03 GMT",
            "type": "outline"
        },
        {
            "text": "I am listening to <a href=\"https://www.youtube.com/watch?v=EdEQkRq_xrw\">this song</a> a lot these days. \"Burn down the mission If we're gonna stay alive. Watch the black smoke fly to heaven. See the red flame light the sky.\" A theme song for this era. We're going to have to burn it down. We've been putting it off for too long and now are living with the consequences. That's why this hurts so much, we created this moment as much as the Tea Party people did.",
            "created": "Sat, 11 Apr 2020 16:07:59 GMT",
            "type": "outline"
        },
        {
            "text": "It took about a half hour to realize the thermometer I got in the mail today was not the <a href=\"https://www.cvs.com/shop/kinsa-quickcare-smart-digital-thermometer-for-all-ages-prodid-2180122\">Kinsa thermometer</a> and that's why I couldn't configure the Kinsa app to talk to it. D'oh. God is goofing on me today. I ordered the <a href=\"https://www.amazon.com/gp/product/B085Y6H3CZ/ref=ppx_yo_dt_b_search_asin_title?ie=UTF8&psc=1\">thermometer</a> in March as a test to see if the world would still be here in May. Haha joke's on me, it is. PS: It got here a month early.",
            "created": "Sat, 11 Apr 2020 19:21:27 GMT",
            "type": "outline"
        },
        {
            "text": "I have mixed feelings about our demonstrations for health care workers. It could be interpreted not so much as appreciation as \"please save us.\"  The health care worker might resent this. I would. Why couldn't you heed the warning sooner? But it's good because it's a reminder to ourselves that there will be no simplistic solution to this problem. The applause is for us, for having the resolve and discipline to stick with it. And knowing no matter how painful it is for us, we have it easy.  ",
            "created": "Sat, 11 Apr 2020 16:18:26 GMT",
            "type": "outline"
        },
        {
            "text": "There's a myth that every dollar the government spends is from taxes, i.e. <i>taxpayer money. </i>Far from it, It's at least partially invented money or borrowed money, esp when it comes to bailouts and pointless wars. It's all good when the money is invested in a positive way, that creates growth, or value for the citizens of the country, now and especially future. Education is one great example, health care, and esp public health (as we're learning now). When we burn the money by blowing up far-away countries, or give the money to big companies for no reason, or the super-rich, it does nothing for us, or really for them. It's like scattering the money to the wind. ",
            "created": "Sat, 11 Apr 2020 15:59:18 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/08/17/doctorNick.png"
        }
    ]
}