{
    "text": "April 13",
    "created": "Mon, 13 Apr 2020 14:14:28 GMT",
    "name": "13",
    "subs": [
        {
            "text": "The pricing model of online pubs is as if each is publishing a whole magazine or newspaper, as they did before the web. I'm sure that's still their internal model, how their organizations work, but it's not the way we read them. We read an article here, another one there. Their pricing is utterly inflexible. It's a shame to <a href=\"https://www.brainyquote.com/quotes/rahm_emanuel_409199\">waste a crisis</a>. We need information like never before. And they need money because advertising is evaporating. Can't we arrive at a compromise? ",
            "created": "Mon, 13 Apr 2020 18:41:31 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/04/13/kimchiRamen.png"
        },
        {
            "text": "It would be smart imho for them to finally allow us to subscribe centrally so we didn't have to create accounts on each site. They have been unwilling to budge on this. I bet there's a ton of revenue out there they can have if each of them would stop trying to be world dominant.",
            "created": "Mon, 13 Apr 2020 18:52:10 GMT",
            "type": "outline"
        },
        {
            "text": "Milestone. Last night, my first dream that incorporated the logic of <a href=\"https://en.wikipedia.org/wiki/Social_distancing\">social distancing</a>. So apparently my subconscious has learned about this. ",
            "created": "Mon, 13 Apr 2020 14:14:29 GMT",
            "type": "outline"
        },
        {
            "text": "We need a fundamental attitude shift from journalism when there is a complete lack of leadership from the president. Stop covering him, and instead find expertise that knows what we should be doing to save lives, and tell us about that.",
            "type": "outline",
            "created": "Mon Apr 13 14:40:35 +0000 2020"
        },
        {
            "text": "I wonder if McConnell has any understanding of systems? He might not have a clue. All the judges in the world won't matter if the <s>country</s> world is reduced to rubble.",
            "created": "Mon, 13 Apr 2020 14:17:03 GMT",
            "type": "outline"
        },
        {
            "text": "How Trump is dealing with Covid-19.",
            "created": "Mon, 13 Apr 2020 18:39:28 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/04/13/howTrumpIsDealingWithCovid19.png"
        }
    ]
}