{
    "text": "April 14",
    "created": "Tue, 14 Apr 2020 14:47:34 GMT",
    "name": "14",
    "subs": [
        {
            "text": "New <a href=\"http://this.how/littleoutliner/versions.opml#1586885920000\">version</a> of \"LO2\" with a nice-to-have command that downloads all your outline and configuration files on my server onto your local computer. Now you can do a full backup whenever you like. Please use it regularly. If you have questions or comments, please post them <a href=\"https://github.com/scripting/Scripting-News/issues/166\">here</a>. ",
            "created": "Tue, 14 Apr 2020 17:47:01 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://youtu.be/OcZcb1zJamE\">Demo</a> of new Get My Files command in \"LO2\". ",
            "created": "Tue, 14 Apr 2020 18:16:28 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=OcZcb1zJamE"
        },
        {
            "text": "What Trump will do is not impotent or unobvious. He decrees (say) May 10 to be the date to re-open. States that don't re-open won't get any stimulus money. If you won't help yourselves, he'll say, why should the Federal government help you? That will \"make sense\" to his base as they rush off to their deaths. What happens after that, I don't imagine Trump has thought through.",
            "created": "Tue, 14 Apr 2020 15:16:04 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/07/21/trumpHead.png"
        },
        {
            "text": "Power user tip. If you're running Dropbox, esp on a server, if your disk space gets low, <a href=\"https://help.dropbox.com/installs-integrations/desktop/cache-folder\">empty the cache</a>. ",
            "created": "Tue, 14 Apr 2020 14:47:35 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=Ssd3U_zicAI\">What's so funny</a> about peace, love and understanding?",
            "created": "Tue, 14 Apr 2020 21:37:04 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=Ssd3U_zicAI"
        },
        {
            "text": "Lance Knobel on membership",
            "created": "Tue, 14 Apr 2020 14:55:39 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Lance Knobel, founder of <a href=\"https://www.berkeleyside.com/\">Berkeleyside</a>, via email:",
                    "created": "Tue, 14 Apr 2020 14:55:40 GMT",
                    "subs": [
                        {
                            "text": "There's a growing group of online news organizations that do better than your <a href=\"http://scripting.com/2020/04/13.html#a184131\">suggestion</a>. ",
                            "created": "Tue, 14 Apr 2020 14:55:41 GMT"
                        },
                        {
                            "text": "I'm thinking of the largely nonprofit news sites that, as a matter of principle, don't have paywalls. At Berkeleyside, the way we put it is that our news coverage is probably more important to someone who is housing insecure than to someone in a lovely house in the hills. "
                        },
                        {
                            "text": "So we're free to read, and always will be, but we encourage our readers to support us financially if they can. And they do: we're at over 3,600 members now. "
                        },
                        {
                            "text": "There are plenty of others who have the same core belief, from Texas Tribune to VT Digger to Bridge Magazine. "
                        },
                        {
                            "text": "We're still digging! "
                        }
                    ]
                }
            ]
        }
    ]
}