{
    "text": "When your parents die",
    "created": "Wed, 17 Mar 2021 15:50:04 GMT",
    "type": "outline",
    "description": "The things they give you, their love, the small incidental memories -- they end up mattering more.",
    "metaImage": "http://scripting.com/images/2019/03/26/eveAndPeterWalkingToSchoolIn1964.png",
    "subs": [
        {
            "text": "One thing you learn when your parents die, the people whose goals and dreams you studied for your formative years, is that our goals and dreams don't matter  much.  ",
            "created": "Wed, 17 Mar 2021 15:50:12 GMT",
            "flInCalendar": true
        },
        {
            "text": "The thing that matters is that my mother made a <a href=\"http://scripting.com/images/2021/03/17/evesQuilt.png\">quilt</a> for me because she wanted me to have it after she was gone. That she walked my brother to school one day 50 years ago and someone took a picture so I can put it on the wall of my living room today. She planted trees on her street, trees that wouldn't give shade until she was long-gone. ",
            "created": "Wed, 17 Mar 2021 15:56:52 GMT",
            "flInCalendar": true
        },
        {
            "text": "That my father wrote about what he learned about using a computer to organize his work, with software I had written. The time after I was home from the hospital and he took me to the toy store and said I could have whatever I wanted. I have no recollection of what I chose, but I remember that he did it. I imagine that day he was glad I was okay. ",
            "created": "Wed, 17 Mar 2021 15:50:19 GMT",
            "flInCalendar": true
        },
        {
            "text": "The things they give you, their love, the small incidental memories -- they end up mattering more than any of the battles they fought or the impossible dreams they never achieved. ",
            "created": "Wed, 17 Mar 2021 15:59:50 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}