{
    "text": "Why I use Twitter identity for the new email feature",
    "created": "Sun, 25 Aug 2019 15:06:13 GMT",
    "type": "outline",
    "description": "Sometimes a nightly email is more than it appears at first glance. ;-)",
    "subs": [
        {
            "text": "When I posted a note on Facebook for people to subscribe to the <a href=\"https://scripting.com/email\">new email service</a>, I got a bit of feedback saying it shouldn't require a Twitter login. So here's why it works that way.  ",
            "created": "Sun, 25 Aug 2019 15:06:21 GMT",
            "image": "http://scripting.com/images/2017/09/02/mrFrog.png"
        },
        {
            "text": "I am gradually adding features to my blog that involve people more in what's going on here. You can Like items. You can comment on them. And now you can receive a nightly email. All but the last require identity, and if you want any options on how you receive your email, even that feature requires identity. (No such features have been implemented yet.)",
            "created": "Sun, 25 Aug 2019 15:07:37 GMT"
        },
        {
            "text": "We've been down this road before, it's not new territory. Back in the 90s and early 00s, we had blog hosting here, each blog had its own identity namespace. So I know how much human work it is to maintain such a service. I've done it.",
            "created": "Sun, 25 Aug 2019 15:09:20 GMT"
        },
        {
            "text": "I want the identity features but I don't run the identity service. ",
            "created": "Sun, 25 Aug 2019 15:10:12 GMT"
        },
        {
            "text": "Remember it's just me here, and I'm doing this for free, before you judge me too harshly. If I can give Twitter a big job, that means I can do other work, or take time off, which I'm doing more these days. I'm not that ambitious anymore, I don't have anything to prove. And I think it's fair for readers and potential readers to understand that I'm nothing more than a human. Not trying to impress you with how much work I can do. ",
            "created": "Sun, 25 Aug 2019 15:22:37 GMT"
        },
        {
            "text": "I want to be able to easily add features to scripting.com. That's why I use Twitter as the identity system. ",
            "created": "Sun, 25 Aug 2019 15:12:16 GMT"
        },
        {
            "text": "There is one other reason. More and more my personal context is on Twitter. When they raised the character limit to 280 chars it became way more useful and it's a pretty good adjunct to this blog for short items. Very often I write something on Twitter first, and then copy it here. ",
            "created": "Sun, 25 Aug 2019 15:12:49 GMT"
        },
        {
            "text": "That's why I'm using it for comments too. Because their restrictions actually make a load of sense for comments on a blog. I really just want to hear unique ideas, or simple bug reports. If I want more I ask for it in a \"braintrust query\". Their limits are a practical implementation of my own <a href=\"http://guidelines.scripting.com/\">comment guidelines</a>. And being able to job-out a vital feature like comments to a reliable service, as Twitter has become, and as Disqus has become unusable, that's pretty welcome too.",
            "created": "Sun, 25 Aug 2019 15:13:39 GMT"
        },
        {
            "text": "It's hard to keep up with all the changes on the net. Sometimes a nightly email is more than it appears at first glance. ;-)",
            "created": "Sun, 25 Aug 2019 15:15:32 GMT"
        }
    ]
}