{
    "text": "Twitter's big competitive advantage",
    "created": "Thu, 22 Feb 2024 15:11:30 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "<i>I wrote this <a href=\"https://twitter.com/davewiner/status/1760681139407360255\">on Twitter</a> this morning. Re-posted here with minimal editing. The fact that I could write it on Twitter was the point.</i>",
            "created": "Thu, 22 Feb 2024 15:11:40 GMT",
            "flInCalendar": true
        },
        {
            "text": "Twitter has one advantage over all the other social webs. no character limit. ",
            "created": "Thu, 22 Feb 2024 15:14:11 GMT",
            "flInCalendar": true
        },
        {
            "text": "I started typing a post on Threads which has a large character limit compared to the others, but ran out of space and decided to write it over here in twitter instead. ",
            "flInCalendar": true
        },
        {
            "text": "yes they charge me $8 a month for it, but it's worth it. ",
            "flInCalendar": true
        },
        {
            "text": "we have to get used to the idea of paying for value, it's how we avoid the messes of the last 20 years. esp if we can make sure we retain copies of everything we write (guaranteed by using our own writing tools, btw) which is another requirement for the new blogosphere. ",
            "flInCalendar": true
        },
        {
            "text": "btw, i'm having a blast these days. it's like tinkerbell in peter pan. all the open web needed was people to believe it exists for it to come (back) into existence.",
            "flInCalendar": true
        },
        {
            "text": "still diggin. ",
            "flInCalendar": true
        },
        {
            "text": "ps: i also like they have simple styling, but where are the freaking links, twitter. do I have to pay another $8 to get those??",
            "flInCalendar": true
        },
        {
            "text": "pps: the worst character limit is bluesky, i can't write anything there. too bad, it's a really nice system otherwise.",
            "flInCalendar": true
        },
        {
            "text": "ppps: it would be nice to give something like this a title so you don't have to read pgf after pgf to try to figure out where i'm going and if you're interested. so i gave it a title, using markdown syntax. maybe they could just support markdown. hmmm.",
            "flInCalendar": true
        },
        {
            "text": "pppps: i asked chatgpt to draw an illustration. that light in the middle of the room is the open social web. it's a vision of self-reliance, empowerment and cooperation. I asked for the light to be <a href=\"https://en.wikipedia.org/wiki/Tinker_Bell\">tinkerbell</a>, but i guess they were concerned the image might belong to someone. creeping shitification. ",
            "created": "Thu, 22 Feb 2024 15:15:33 GMT",
            "flInCalendar": true
        },
        {
            "text": "This is not a picture of Tinkerbell.",
            "created": "Thu, 22 Feb 2024 15:15:35 GMT",
            "inlineImage": "https://imgs.scripting.com/2024/02/22/tinkerbellAndKids.png",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}