{
    "text": "Vote your chess move",
    "created": "Sun, 26 Oct 2025 14:02:48 GMT",
    "type": "outline",
    "metaImage": "https://imgs.scripting.com/2025/10/26/deBlasioPolice.png",
    "description": "The politics of NY are not in sync with the ambitions of dreamers.",
    "subs": [
        {
            "text": "<a href=\"https://www.thenation.com/article/archive/the-2000-election-unleashed-disaster-on-the-world-we-cant-let-that-happen-again-in-2016/\">Rebecca Solnit</a>: \"I think of voting as a chess move, not a valentine.\"",
            "created": "Sun, 26 Oct 2025 14:42:01 GMT",
            "flInCalendar": true
        },
        {
            "text": "I changed the <a href=\"https://imgs.scripting.com/2025/10/26/deBlasioPolice.png?nodialog\">header graphic</a> on Scripting News today to raise a question with NYC voters. ",
            "created": "Sun, 26 Oct 2025 14:05:05 GMT",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://en.wikipedia.org/wiki/Bill_de_Blasio\">Bill de Blasio</a> was mayor. A funeral for two murdered cops. The police stand at attention, their <a href=\"https://imgs.scripting.com/2025/10/26/deBlasioPolice.png?nodialog\">backs turned</a> on the mayor. This was a statement about him for sure, but even more about their disdain for the people who elected him, you and me, the people they're sworn to protect. I grew up in NY, and had plenty of experience with NY cops and this kind of disrespect is, from my point of view, who they are. I know they see themselves as martyrs, that's what the demonstration meant. But they also have a job to do and a chain of command.",
            "created": "Sun, 26 Oct 2025 14:50:34 GMT",
            "flInCalendar": true
        },
        {
            "text": "There's a lot of pent up resentment and you can't just wish it away. The mayor, for better or worse, owns it. I can't imagine they'd have much respect for the Democratic Party nominee. Like it or not, this is the city NYers live in. ",
            "created": "Sun, 26 Oct 2025 14:08:07 GMT",
            "flInCalendar": true
        },
        {
            "text": "I am old enough to remember when <a href=\"https://en.wikipedia.org/wiki/John_Lindsay\">John Lindsay</a>, a liberal Republican, back when there were such things, was the newly elected mayor in 1966 and was greeted by a transit strike, shutting down subways and buses. The unions walked all over him. ",
            "created": "Sun, 26 Oct 2025 14:56:41 GMT",
            "flInCalendar": true
        },
        {
            "text": "I think NYC and NYers will fare better with a <a href=\"https://en.wikipedia.org/wiki/Andrew_Cuomo\">Andrew Cuomo</a>. This isn't the first time I've stood up for him <a href=\"https://daytona.scripting.com/search?q=cuomo\">on this blog</a>. He resigned in disgrace, humiliated, but I never will forget his leadership during the darkest times of Covid. Cuomo, along with <a href=\"https://www.nytimes.com/by/donald-g-mcneil-jr\">Donald McNeil</a> at the NY Times and <a href=\"https://en.wikipedia.org/wiki/Anthony_Fauci\">Dr Anthony Fauci</a> were the bright beams of intelligence and compassion.",
            "created": "Sun, 26 Oct 2025 14:08:48 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}