{
    "text": "I'm not too depressed",
    "created": "Sun, 14 Feb 2021 13:57:44 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Net-net I'm not too depressed about the Senate acquittal because I remember how the impeachment happened. It was the only instant response possible. (Except as <a href=\"https://www.theatlantic.com/ideas/archive/2021/01/remove-trump-tonight/617576/\">David Frum</a> pointed out at the time, the Senate could have met and voted him out of office the same day, that would have been awesome. Wish they had the guts to do it.) ",
            "created": "Sun, 14 Feb 2021 13:53:15 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The inauguration was two weeks away. The concern was what would happen next. People say McConnell refused to have the trial before Trump left, but actually that was somewhat rational. They needed to clean up the Capitol, it was trashed, covered in blood and human excrement, and secure it. It sure looked like there would be more attacks at the time. Also don't forget that then-VP Pence refused to consider the 25th Amendment. He gets his share of the credit, if you want to blame McConnell.",
            "created": "Sun, 14 Feb 2021 14:04:26 GMT",
            "flInCalendar": true
        },
        {
            "text": "We know how it turned out now, but we did not know then. And of course a conviction wouldn't have had much practical value. I think it's better if Trump fades into obscurity. Let minor government officials harass him now. He'll protest. \"But but I'm the great Trump!\" No, you're now a defendant in criminal and civil trials. Then, no you are a bankrupt resident of a federal or state prison. ",
            "created": "Sun, 14 Feb 2021 13:59:03 GMT",
            "flInCalendar": true
        },
        {
            "text": "Let's give him something to really complain about. ",
            "created": "Sun, 14 Feb 2021 13:59:50 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}