{
    "text": "A few months ago I read a comment on Twitter, not directed to me but with my name tagged, that said that RSS will be able to move again once Dave Winer is dead. Isn't that <a href=\"https://www.youtube.com/watch?v=puwoUKhZQbg\">special</a>. I'm sure that's not true btw, but to be thought of as only contributing obstruction. I think it's like that in a lot of things I've worked on. People have tried to buy my products away from me, not realizing I still owned them. That was comedy. Other people, supposed friends, told me they were taking over, I should get out of their way or I'd get hurt. The first couple of times that happened, from someone who was very rich, I fell for it. It wasn't true. His products were flops because he had no idea what people valued in the products. I did because I had connections with the users and I listened, systematically. At LVT we got very good at listening, we knew in advance that new releases would be loved because were simply giving the users what they wanted. Once another rich guy offered me $1 million for my company or he was going to blow me out of the water (his words). Yeah I said, i've heard that before. Go right ahead. He never shipped anything even remotely competitive. BTW, our product was making more than $1 million <i>a month</i> at the time. He didn't even bother to get the numbers. All this says to me is that <i>we should fucking work together dammit. </i>Look at the Beatles and how individually they reached out to other musicians and recorded with them. Why don't we do that in software. If there's going to be more RSS, why shouldn't it benefit from what I've learned? You might be surprised to find that a new RSS can't happen <i>unless</i> I am involved, Mr Waiting For Me To Die. Why take the chance? I didn't save the tweet because I didn't want to ever close that loop. Imagine how that felt. The world is full of self-important assholes, and we've given every one of them tools to express their assholyness. You can quote me on that. ",
    "created": "Tue, 15 Mar 2022 16:28:09 GMT",
    "type": "outline",
    "flInCalendar": true
}