{
    "text": "Listening",
    "created": "Tue, 10 Jul 2018 13:34:58 GMT",
    "type": "outline",
    "description": "One of the things we learned in massage school, many years ago, was how to listen. There was an exercise I always try to remember when it's time to listen.",
    "subs": [
        {
            "text": "One of the things we learned in massage school, many years ago, was how to listen. There was an exercise I always try to remember when it's time to listen. ",
            "created": "Tue, 10 Jul 2018 13:39:58 GMT",
            "image": "http://scripting.com/images/2018/07/10/listening.png"
        },
        {
            "text": "The group separates into pairs. Seated on mats on the floor. Spines straight, head straight, not tilted in or out or to a side. One person speaks and the other listens. The speaker just talks, no rules there. Share whatever you want. Anything. The listener says nothing. Your body doesn't move in or out. No hugging, touching, no words. Your eyes stay neutral. No facial expressions. No empathy, no approval or disapproval, just hear what the other person is saying. Understand that they are this person's words. No response is allowed.  ",
            "created": "Tue, 10 Jul 2018 13:52:51 GMT"
        },
        {
            "text": "These days, when it's time to listen, I allow myself to put a hand across my mouth as a signal to my subconscious that it's time to listen. ",
            "created": "Tue, 10 Jul 2018 13:51:45 GMT"
        },
        {
            "text": "What made me think of this today? I listened to the latest <a href=\"https://www.thisamericanlife.org/\">This American Life</a> podcast, the <a href=\"https://www.thisamericanlife.org/617/fermis-paradox/act-two-2\">second segment</a> was a couple's therapy session. One was speaking, the other wasn't listening. If you're in a troubled relationship, I highly recommend the podcast. And if you can find someone who will pair with you on the listening exercise, above, I recommend that as well. You may be surprised how hard it is to stay centered, neutral, just listen, not go in or out.",
            "created": "Tue, 10 Jul 2018 13:40:18 GMT"
        },
        {
            "text": "<a href=\"http://scripting.com/2013/10/27/listeningIsHard\">Listening is hard</a>. If more people learned how to do it, we'd be better off. There would more love. People would understand that their friends and partners are real people, not just screens for projecting their movies on. ",
            "created": "Tue, 10 Jul 2018 13:46:30 GMT"
        }
    ]
}