{
    "text": "The importance of criticism",
    "created": "Mon, 02 Apr 2018 14:09:29 GMT",
    "type": "outline",
    "description": "I love it when people take the time to respond to what I write, or give me a good bug report on my software. As long as it's thoughtful and makes a point. I even appreciate the effort when they don't.",
    "subs": [
        {
            "text": "Usually when I criticize a professional journalist they ignore it. Not very often they respond. I don't mind if they disagree, and push back, but I most definitely do mind if they question the idea of my criticizing their work at all. Last week I had such an encounter, privately. ",
            "created": "Mon, 02 Apr 2018 14:09:38 GMT",
            "image": "http://scripting.com/images/2018/04/02/yosemiteSam.png"
        },
        {
            "text": "The criticism of a blogger, a user, someone who isn't trying to maintain access, or please advertisers, is imho more likely to locate a truth about your product, from their point of view, of course.. I never maintain that mine is the only valid point of view, just that it is mine. Take it for what it's worth.",
            "created": "Mon, 02 Apr 2018 14:12:13 GMT"
        },
        {
            "text": "I also have been wrong many times. Famously when <a href=\"https://en.wikipedia.org/wiki/Desktop_publishing\">desktop publishing</a> was the rage in the mid-80s, I said no one wanted to do it. Hah. It turned out that <i>everyone</i> did, at least at the time.  ",
            "created": "Mon, 02 Apr 2018 14:12:57 GMT"
        },
        {
            "text": "That <a href=\"http://scripting.com/davenet/2003/07/28/harvardHostsKeyWeblogSpec.html\">said</a>, <a href=\"http://scripting.com/davenet/1999/05/24/editThisPage.html\">I've</a> <a href=\"http://scripting.com/davenet/1998/02/27/rpcOverHttpViaXml.html\">also</a> <a href=\"http://scripting.com/davenet/2003/07/31/chrisLydonsWeblogForTheEar.html\">been</a> <a href=\"http://scripting.com/davenet/1995/02/18/billionsofwebsites.html\">right</a>. ",
            "created": "Mon, 02 Apr 2018 14:16:00 GMT"
        },
        {
            "text": "I love it when people take the time to respond to what I write, or give me a good bug report on my software. As long as it's thoughtful and makes a point. I even appreciate the effort when they don't. But to outright invalidate the criticism without response? Only <a href=\"http://thesaurus.land/?word=scoundrel\">scoundrels</a> do that. :boom:",
            "created": "Mon, 02 Apr 2018 14:13:08 GMT"
        }
    ]
}