{
    "created": "2023-04-03T04:00:00.000Z",
    "flInCalendar": true,
    "name": "03",
    "path": "2023/04/03",
    "text": "April 03",
    "type": "calendarDay",
    "subs": [
        {
            "text": "A feature Google should have had a long time ago. I want to tell Google where <a href=\"http://scripting.com/\">my blog</a> is. Have it be a preference setting. Then when I do searches it automatically gives priority to anything on my blog. Why would this be so incredibly powerful? I'd have a way to leave notes for myself on my research trips through Google's database. And if they let me do this in an outline and represented the structure in the query results, it would be explosively powerful. All without any AI, btw. Really cost effective.",
            "created": "Mon, 03 Apr 2023 17:09:11 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2022/02/09/allThingsMustPass.png",
            "flInCalendar": true
        },
        {
            "text": "What would it take for Google to do stuff like this? Invent a new department, the department of User Lovers, or Product Lovers (same thing of course). No tech company has ever had such a department. They mindlessly assume that love of the product is ingrained in all their people when the truth is the opposite, they have contempt for users. I've seen it grow in my own company, and in the blogging community. A sense that because I work for the company that made the product, I know everything all the users know and more. It's the same fallacy that applies to Silicon Valley billionaires. You have to step into a new perspective to love the product, one that has nothing to do with who you work for or how validated you are by reporters and the public. ",
            "created": "Mon, 03 Apr 2023 17:11:35 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I find this interesting, maybe you do too. But with my <a href=\"https://chatthing.ai/bots/b5c0ad69-55d4-4008-a97c-0b2884cca3f2/\">personal chatbot</a>, the next step is to have a Dave-emulator, right? Wouldn't be that big a stretch. I basically write like I talk. It's almost dialog. I do go back and edit and take out the parts where I'm thinking while talking, and in the end those parts aren't needed to make the point. I'm sure you could write an AI thing that did that. It probably already does it. I knew there would be a reason to put an effort into having a good archive. (I deliberately left this bit unedited.)",
            "created": "Mon, 03 Apr 2023 18:49:26 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://scripting.com/2015/04/03/offenseOnPrinciple.html\">1994</a>: \"I try not to get offended on principle.\"",
            "created": "Mon, 03 Apr 2023 21:47:52 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I just stumbled across this <a href=\"http://scripting.com/misc/scriptingImages.html\">list of images</a> from my blog. ",
            "created": "Mon, 03 Apr 2023 17:16:48 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "This is a link to my <a href=\"https://chatthing.ai/bots/b5c0ad69-55d4-4008-a97c-0b2884cca3f2/\">personal chatbot</a>.",
            "created": "Mon, 03 Apr 2023 16:05:09 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=f3VHK1NXIBw&t=173s\">President Bartlet</a>: You may be mistaking this for your monthly meeting of the Ignorant Tightass Club.",
            "created": "Mon, 03 Apr 2023 14:36:20 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "If I were going to write a <i>Rules for Love Makers</i> document, like the <a href=\"http://this.how/standards/\">one</a> I did for Standards Makers, I'd make the first rule: If you're going to be in a love relationship with this person, and you can't visualize them as your best-best friend, keep looking. It has to be someone you can go to with any problem, no matter how personal, involving them or someone or something else, and be totally confident they'll help. ",
            "created": "Mon, 03 Apr 2023 16:44:02 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2023/04/03/cupid.png",
            "flInCalendar": true
        }
    ]
}