{
    "created": "2023-04-05T04:00:00.000Z",
    "flInCalendar": true,
    "name": "05",
    "path": "2023/04/05",
    "text": "April 05",
    "type": "calendarDay",
    "subs": [
        {
            "text": "New feature: <a href=\"http://docs.feedland.org/yourFeed.opml#1680702347000\">FeedLand for linkblogging</a>. It's new today, so if you have any issues, please report them in the <a href=\"https://github.com/scripting/feedlandSupport/issues/188\">thread</a>.  ",
            "created": "Wed, 05 Apr 2023 16:42:06 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I asked ChatGPT to write a <a href=\"http://scripting.com/images/2023/04/05/lovestory.png\">story</a> in 35 words. Simple but beautiful.",
            "created": "Wed, 05 Apr 2023 15:00:27 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I don't often see links to articles on <a href=\"https://www.semafor.com/\">Semafor</a>, a new journalism platform started by Ben Smith formerly of Buzzfeed and the NYT. One of the reasons I rarely see links from them is that they still apparently don't have an <a href=\"https://www.google.com/search?q=semafor+rss+feed\">RSS feed</a> for their stories. If they had a feed, I'd be subscribed and I'd be much more likely to notice, and would probably occasionally <a href=\"https://mastodon.social/@dave@social.masto.land/110146691152214416\">pass a link</a> on to my followers. There is a distribution system that helps new pubs like Semafor boot up. My advice, do two things: 1. Put a linefeed at the end of each line in your <a href=\"http://scripting.com/images/2023/04/05/viewsource.png\">HTML source</a> so I can get some ideas where you might have put your RSS feed. 2. If you don't have a feed for your top stories at least, stop everything and do it. Every day you delay is more exposure you don't get. I asked them to do this when they started, so this is the second request. ",
            "created": "Wed, 05 Apr 2023 14:23:51 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2022/12/01/metrocard.png",
            "flInCalendar": true
        },
        {
            "text": "A reader named Bruno writes with a link to the <a href=\"https://feedland.org/?feedurl=https%3A%2F%2Fwww.semafor.com%2Frss.xml\">Semaphor RSS feed</a>. \"I never found it on the site. It was completely by accident, just typed the most obvious thing et voilà!\" I'm subscribed. ",
            "created": "Wed, 05 Apr 2023 20:00:34 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The journalism industry ought to form a news Twitter. It could be part of the fediverse, but it should also have its own easy UI. There are ease-of-use advantages to centralized systems. A lot of the people who use Twitter need the simplicity. A service can be both centralized and open at the same time. A lot of people got their first exposure to the web on AOL, for example. But news needs to have a single point of congregation. Twitter was providing a useful service there.",
            "created": "Wed, 05 Apr 2023 13:42:18 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Meanwhile Substack seems to be doing <a href=\"https://twitter.com/hamishmckenzie/status/1643629953026596867/photo/1\">exactly what</a> I was <a href=\"#a134218\">proposing</a> for the journalism industry to do, another end-run around the asleep-at-the-wheel journalism industry. They learned nothing from the Twitter experience. ",
            "created": "Thu, 06 Apr 2023 03:11:56 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}