{
    "created": "2023-04-12T04:00:00.000Z",
    "flInCalendar": true,
    "name": "12",
    "path": "2023/04/12",
    "text": "April 12",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I bet that a year from now there will be at least one huge <a href=\"https://en.wikipedia.org/wiki/Mastodon_(social_network)\">Mastodon</a> instance, with better features than the rest. Like there are lots of places to get coffee, there will be room for lots of big services that provide different experiences. And to create more headaches for everyone, the huge instances will develop differentiating features that are not supported by the others, without offering any interop. Early Mastodon fans will be as powerless to fix this as <a href=\"https://twitter.com/davewiner/status/1093562299758067712\">we are</a> when it comes to Spotify, Amazon, Google et al calling their audio programs podcasts, even though they don't provide the feeds that would give users choice. It's best to have your eyes open about this before it becomes a big issue, by then it will be too late. ",
            "created": "Wed, 12 Apr 2023 18:48:47 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/12/15/cannedTomatoes.png",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"http://scripting.com/publicfolder/chatgpt/2023/04/12/spacex-funding-in-2022.html\">According to ChatGPT</a> just one of Musk's companies, SpaceX, received almost $10 billion from the US government in 2020, the last year ChatGPT has data for. In contrast, NPR received no money directly from the US government, and a few million from the Corporation for Public Broadcasting, which is partially funded by the US government. In other words, if receiving money from the US government to subsidize your business is a sin, Musk is a far greater sinner than NPR. ",
            "created": "Thu, 13 Apr 2023 02:39:37 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://twitter.com/NPR/status/1646138100035272704\">NPR</a>, imho, is right to withdraw from Twitter after they classified them incorrectly. The question is, why aren't other journalism companies withdrawing in sympathy? Should they cede to Musk the power to decide which sources of journalism are allowed to publish via Twitter? ",
            "created": "Wed, 12 Apr 2023 18:47:02 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/NPR/status/1646138100035272704",
            "flInCalendar": true
        },
        {
            "text": "I finished <a href=\"https://www.vox.com/culture/2023/4/12/23680055/netflix-beef-review-ending-explained-season-2\">Beef</a> on Netflix. Definitely worth a watch. Haven't got comments yet, just beginning to digest it.  ",
            "created": "Wed, 12 Apr 2023 15:02:10 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}