{
    "created": "2023-04-19T04:00:00.000Z",
    "flInCalendar": true,
    "name": "19",
    "path": "2023/04/19",
    "text": "April 19",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Today's song: <a href=\"https://www.youtube.com/watch?v=zeaO5UZ5OcI\">Coyote</a>.",
            "created": "Thu, 20 Apr 2023 03:01:32 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=zeaO5UZ5OcI",
            "flInCalendar": true
        },
        {
            "text": "One more: <a href=\"https://www.youtube.com/watch?v=Zfr3L0drhS8\">Burning Down the House</a>. ",
            "created": "Thu, 20 Apr 2023 03:05:31 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=Zfr3L0drhS8",
            "flInCalendar": true
        },
        {
            "text": "Hey the <a href=\"http://scripting.com/2023/04/18/030519.html\">corner-turn</a> worked. Last night's emails went out with the linkblog items coming from the <a href=\"http://data.feedland.org/feeds/davewiner.xml\">new feed</a>, and if I hadn't said anything I bet most people wouldn't have noticed the markdown styling wasn't rendered on one of the items. Otherwise, no glitches to be seen. ",
            "created": "Wed, 19 Apr 2023 12:15:06 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I've converted the <a href=\"http://scripting.com/?tab=links\">Links page</a> on my blog to use the new linkblog feed. Also made the text a little smaller so more of it could fit on a line. ",
            "created": "Wed, 19 Apr 2023 15:04:09 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Fox <a href=\"https://www.memeorandum.com/230419/p6#a230419p6\">settled</a> a lawsuit for $787 million that makes it impossible for them to credibly call themselves a \"news organization.\" So now, as a Spectrum cable subscriber, I'd like to stop subsidizing this fake news org, not my theory but now an established fact. ",
            "created": "Wed, 19 Apr 2023 12:56:46 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Back to <a href=\"https://www.amazon.com/s?k=conscious+loving&hvadid=616931433496&hvdev=c&hvlocphy=1023511&hvnetw=g&hvqmt=e&hvrand=10917777834147687715&hvtargid=kwd-300600239008&hydadcr=24659_13611768&tag=googhydr-20&ref=pd_sl_70zn362wrb_e\">Conscious Loving</a>, a <a href=\"http://scripting.com/2023/04/16.html#a031659\">thread</a> which started a few days ago. After reading the book many years ago, I had a teacher named Jeru, whose tapes I have put on the <a href=\"http://jeru.scripting.com/\">web</a>, who said many wise things that made a huge difference in my understanding of myself. But he also said one thing that I think was too judgmental -- that most love relationships have the partners taking turns acting like children. We, the students, laughed, as if to say -- yes but we're smart enough to not do that. To which I, Dave, now 25 years older and hopefully a little wiser, say yeah okay, that's cool, but please -- that's bullshit. Because we're <i>always</i> acting like children, all of us, because that's what we are. 99 percent of our energy comes from the child, maybe 1 percent from the intellect, the adult. The fun of life comes from the child. At our core, where our joy lives, we're kids, human puppies. Our partner is our best friend, and we play together and make huge messes, but our parents (our intellects) are watching over us, and are ready to step up if there's danger. But as long as it's fun, let the kids play. Most relationships I've had have been love-starved. We're expected to live up to an impossible standard, something out of <a href=\"https://en.wikipedia.org/wiki/The_Adventures_of_Ozzie_and_Harriet\">Ozzie and Harriet</a> or <a href=\"https://en.wikipedia.org/wiki/Leave_It_to_Beaver\">Leave it to Beaver</a>. Ward and June, Wally and the Beaver. All I've ever wanted is someone to let me love them, who I could learn from, who would read my stuff and laugh at my jokes and tell me I'm a good boy. I really meant what I <a href=\"http://scripting.com/2023/03/04/014347.html\">said</a> about getting from my human partner the same kind of <a href=\"http://scripting.com/2023/03/04/014347.html\">love a dog gets</a>. Okay so I tore up the pillows and pissed on the carpet. But you still love me right? Here let me get you the stick, now please throw it so I can be a <i><a href=\"http://scripting.com/2023/02/23/161945.html\">good boy</a></i> again.",
            "created": "Wed, 19 Apr 2023 12:16:08 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/09/25/blackLab.png",
            "flInCalendar": true
        },
        {
            "text": "I love the Wikipedia description of <a href=\"https://en.wikipedia.org/wiki/Eddie_Haskell\">Eddie Haskell</a>: \"The archetype of the two-faced wise guy, a braggart among his peers and an obsequious yes man to the adults he mocks behind their backs.\"",
            "created": "Wed, 19 Apr 2023 12:29:46 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=jM-ETQifV3k&t=30s\">June Cleaver</a>: \"I just don't trust a 13-year-old boy that's that polite.\"",
            "created": "Wed, 19 Apr 2023 12:45:35 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=jM-ETQifV3k",
            "flInCalendar": true
        },
        {
            "text": "How to use the web",
            "created": "Wed, 19 Apr 2023 14:19:20 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "When you <a href=\"https://mastodon.social/@davew/110225906594359425\">use the web</a> to work with each other, you are using the web correctly. Almost no one does that. Instead people use the web to draw attention to themselves. The replies I get are mostly people trying to tag their names along with something someone else wrote to get more flow for them, more followers. It's a strategy. It's basically spam. It's not very social imho.",
                    "created": "Wed, 19 Apr 2023 14:19:28 GMT",
                    "urltoot": "https://mastodon.social/@davew/110225906594359425",
                    "flInCalendar": true
                },
                {
                    "text": "So the replies may <i>look</i> like they're addressed to you. Literally they are addressed to you. But they're not <i>for</i> you, they're for bots basically, or people behaving as bots. Mastodon is mostly like Twitter in this way. I have had some interactions that were legitimately about working together, but they're few and far between. ",
                    "created": "Wed, 19 Apr 2023 14:19:44 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}