{
    "created": "2023-04-30T04:00:00.000Z",
    "flInCalendar": true,
    "name": "30",
    "path": "2023/04/30",
    "text": "April 30",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Open the pod bay doors <a href=\"http://scripting.com/publicfolder/chatgpt/2023/04/30/open-pod-bay-doors.html\">ChatGPT</a>.",
            "created": "Sun, 30 Apr 2023 15:43:40 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "A free idea for any new social net. Allow the author of a post to classify any reply as spam. Most of the replies I get these days are ads. It took me a while to figure out this was going on. ",
            "created": "Sun, 30 Apr 2023 13:57:08 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Meta should use some of its programmers to add features to Facebook. Make it a first class blogging system. Would be easy to upgrade it. Stop trying to hit home runs, and just do nice things for your users. That's got to be good for business.",
            "created": "Sun, 30 Apr 2023 22:49:11 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "When I document my development work, I'm doing it more like ChatGPT. All the caricatures of AI from culture, like <a href=\"https://www.youtube.com/watch?v=Wy4EfdnMZ5g\">HAL from 2001</a>, seem to have gotten it wrong about how bots will write. They write like good human writers do. Let the ideas come to the front, remove extravagance. Aim to communicate directly with the human who is reading. But another funny thing, I am aware more that I'm writing for the bots, because I want them to \"understand\" what I'm saying. Human readers -- they don't pay a whole lot of attention. Finally I have a reader who is listening. The future is interesting, and it never is the way you thought it would be. ",
            "created": "Sun, 30 Apr 2023 15:38:09 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Back in the early days of the PC, we got a lot of putdowns from people from the mainframe and mini worlds. Our computers <i>were</i> less capable, but they made the mistake of thinking <i>we</i> were less capable too. We came from those worlds, and <a href=\"http://scripting.com/stories/2012/04/26/whyILovedTheAppleIi.html\">chose</a> PCs because we loved the idea of having our own computer that we could do anything we wanted to with. That was never true of the larger computers. The result is what you see now. Same will be true of AI. It is that big a deal. Apple then dismissed the web when it first came out, but eventually realized it wasn't going away, so they ended up embracing it. So did the big-iron computer makers with PCs but they were too late. And even IBM which did have the guts to be a first mover, once they came to dominate tried to retake control and were flushed from the system. Microsoft did it too, <a href=\"https://www.npr.org/2023/04/30/1172276538/world-wide-web-internet-anniversary\">when</a> the web came out, with the same result. When tech makes a leap, there's no going back. ",
            "created": "Sun, 30 Apr 2023 14:37:55 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2012/04/26/appleII.jpg",
            "flInCalendar": true
        },
        {
            "text": "Much-discussed on Masto is the idea that in Blue Sky a user's blocks are public. So they're not really blocks, more like declarations of war. ",
            "created": "Sun, 30 Apr 2023 14:11:20 GMT",
            "type": "tweet",
            "tweetId": "1652677188691410944",
            "tweetUserName": "davewiner",
            "flInCalendar": true
        },
        {
            "text": "This is a <a href=\"https://fruitsalad.lucky.wtf/\">test</a> to see if I can serve static sites with HTTPS. Mastodon requires you use HTTPS to link an account to a website. ",
            "created": "Sun, 30 Apr 2023 13:19:39 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Hallucinations",
            "created": "Sun, 30 Apr 2023 13:41:07 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Journalism's fake issue about AI systems: hallucinations. ",
                    "created": "Sun, 30 Apr 2023 13:41:17 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "A ridiculous standard. ",
                    "created": "Sun, 30 Apr 2023 13:42:53 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It's like saying you can find false info in Google. You certainly can. And no one thinks Google is less valuable because of it. ",
                    "created": "Sun, 30 Apr 2023 13:42:54 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Same with Wikipedia. It's often impossible to get wrong info corrected there. Also with Google, btw. ",
                    "created": "Sun, 30 Apr 2023 13:53:50 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Every time I write about ChatGPT in a place where people can comment, everyone talks about this. You're being programmed, by journalists.",
                    "created": "Sun, 30 Apr 2023 13:54:36 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "And btw, don't get me started on all the bullshit in journalism. We live in a world where people who can manipulate information do it, all the time. So far I'd give ChatGPT very high grades on accuracy, relative to other places where I look to as a reference.",
                    "created": "Sun, 30 Apr 2023 13:43:31 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "And you should always check your facts. The web has certainly trained us to always be suspicious. ",
                    "created": "Sun, 30 Apr 2023 13:43:46 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PS: I <a href=\"http://scripting.com/publicfolder/chatgpt/2023/04/30/ai-doesn-t-hallucinate.html\">asked</a> ChatGPT if it hallucinates: \"No, AI systems like ChatGPT do not hallucinate or make up facts in the way that humans might.\"",
                    "created": "Sun, 30 Apr 2023 13:45:39 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}