{
    "text": "John Naughton loves his Tesla",
    "created": "Wed, 24 Feb 2021 15:43:32 GMT",
    "type": "outline",
    "description": "\"It’s basically software with wheels.\"",
    "subs": [
        {
            "text": "In response to <a href=\"http://scripting.com/2021/02/23.html#a224008\">yesterday's bit</a> about Scoble and me lusting after a Tesla, I got a wonderful email from <a href=\"https://en.wikipedia.org/wiki/John_Naughton\">John Naughton</a> about his love of Tesla. Even better, he told me which one to get! :boom:",
            "created": "Wed, 24 Feb 2021 15:43:38 GMT",
            "subs": [
                {
                    "text": "I saw <a href=\"https://scobleizer.blog/2021/02/21/teslas-data-advantage-can-apple-or-others-keep-up/\">Scoble’s post</a>, which I thought was perceptive.  I was receptive to it because last year I took the plunge and bought a Tesla — a <a href=\"https://en.wikipedia.org/wiki/Tesla_Model_3\">Model 3</a> — and it’s been a transforming experience. What makes that remarkable is that I’m a recovering petrolhead — I had a 3.8 litre Mk II Jaguar towards the end of my grad student days — and believe me that was a big deal in those days.  So I’ve always been interested in cars, and over the years have owned lots of good and interesting ones.",
                    "created": "Wed, 24 Feb 2021 15:44:37 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "But the Tesla is something else.  It’s basically software with wheels.  Every week or so it gets a software update — mostly bug fixes or minor features added.  For example, it used to be quite a palaver to open the glove box: you had to go to the touchscreen, go down a level, find glove box and tap on the icon.  Now you have voice control and you just say “Open Glove Box”.  That came in a software update.  Every so often there are more consequential updates — there’s one coming soon to the Autopilot and, eventually, to the (optional) Full Self Drive software which, theoretically, enables a measure of autonomous driving. So it’s a car that improves steadily the longer you have it.",
                    "created": "Wed, 24 Feb 2021 15:48:30 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I’m not interested in FSD because I rather like driving. But also I’m getting older and I wanted a car that could look ahead and take avoiding action if I missed seeing something — which it already does when Autopilot (which is basically just smart cruise-control) is on.",
                    "flInCalendar": true
                },
                {
                    "text": "The Model 3 is a delight to drive — it’s as nimble as a Porsche (and indeed seems quicker — zero to 60 in 3.1 seconds — than even a Porsche 911).  And it’s soooo quiet. My wife and I can whisper and hear one another at 70mph on a freeway.",
                    "flInCalendar": true
                },
                {
                    "text": "The other big deal is that Tesla starting building a supercharger network almost as soon as they started building cars.  This was smart because the non-Tesla charging networks are still chaotic and often unreliable — which is why people with non-Tesla EVs continue to find long journeys sometimes erratic and problematic.",
                    "flInCalendar": true
                },
                {
                    "text": "If you do decide to go for one, I suggest you go for the long-range, dual-motor version of the Model 3.  That has all-wheel drive, which I reckon is necessary in the winter for where you live.",
                    "flInCalendar": true
                },
                {
                    "text": "And get a home charger, so that whenever you leave the house the car is fully charged.",
                    "flInCalendar": true
                },
                {
                    "text": "In a way, after I got the car I thought of you.  Tesla is what the automobile industry ought to have been doing when the tech arrived, just as you think the journalism/media business ought to have pivoted when the Internet and the Web arrived.",
                    "created": "Wed, 24 Feb 2021 15:44:44 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}