{
    "created": "2023-11-06T05:00:00.000Z",
    "flInCalendar": true,
    "name": "06",
    "path": "2023/11/06",
    "text": "November 06",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Janis, Yogi and David",
            "created": "Mon, 06 Nov 2023 14:44:54 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Several recommendations this morning with a common theme.",
                    "created": "Mon, 06 Nov 2023 14:37:26 GMT",
                    "type": "outline",
                    "flInCalendar": true
                },
                {
                    "text": "The latest <a href=\"https://500songs.com/\">500 songs podcast</a> is about <a href=\"https://500songs.com/podcast/episode-169-piece-of-my-heart-by-big-brother-and-the-holding-company/\">Janis Joplin</a>. Of course I listened to Joplin in the early 70s, and I remember where I was when I heard of her death. I always assumed she was the freak she presented herself as, that her singing came from her soul, but I learned from this episode that wasn't what we were seeing. That's what makes this podcast so interesting, it tells me about myself before I developed my fine-tuned skepticism, as we review the music of my Boomer life. I tended to believe the stories I was told. When I was a kid I loved to read biographies, but as time went by I knew some of the people who had bios written about them, in fact short bios were written about me in magazines. Since then I understand that the story and the actual person often have very little to do with each other. ",
                    "created": "Mon, 06 Nov 2023 14:37:45 GMT",
                    "type": "outline",
                    "image": "https://imgs.scripting.com/2021/06/26/baseballScene.png",
                    "flInCalendar": true
                },
                {
                    "text": "A similar story, a <a href=\"https://www.netflix.com/title/81712015\">biography</a> of <a href=\"https://www.metacritic.com/movie/it-aint-over/\">Yogi Berra</a>, that makes you want to cry for love of the man and for the tragedy that his fame as a character, obscured the fame he deserves as an athlete. This version of the story is that the personality and the player were the same person, that without the sense he had of other people and strong sense of self, he wouldn't have been nearly as great on the field. Very emotional for me, and it did change how I look at the Yankees (I'm a Mets fan from a family of Dodgers fans), and I never really appreciated him when he became a coach and then manager of the Mets. I always felt the two teams couldn't integrate that way. A well-told story, I hope some of it is true. :smile:",
                    "created": "Mon, 06 Nov 2023 14:40:31 GMT",
                    "type": "outline",
                    "flInCalendar": true
                },
                {
                    "text": "Finally a Fresh Air interview with <a href=\"https://www.npr.org/2023/11/01/1197958207/fresh-air-draft-11-01-2023\">David Byrne</a> of the Talking Heads. A very different personality from Janis or Yogi, obviously. I love the Talking Heads music, esp these days -- it's the best Peloton music. The interview is eye-opening, as he explains how he put his stage personality together and why he switched from violin to guitar as a kid. He also exudes confidence from a person who packaged his discomfort with himself as his message. ",
                    "created": "Mon, 06 Nov 2023 14:43:19 GMT",
                    "type": "outline",
                    "flInCalendar": true
                },
                {
                    "text": "I didn't realize until I wrote this up how well these three bits go with each other. ",
                    "created": "Mon, 06 Nov 2023 14:45:10 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}