{
    "created": "2023-11-13T05:00:00.000Z",
    "flInCalendar": true,
    "name": "13",
    "path": "2023/11/13",
    "text": "November 13",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Bluesky has a hidden feature no one knows about yet. :smile:",
            "created": "Mon, 13 Nov 2023 17:10:18 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Mastodon is like CP/M. Bluesky is like the Apple II. Threads is like the IBM PC (though not nearly as open). And Twitter is.. hmmm.",
            "created": "Mon, 13 Nov 2023 17:10:31 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "You know I don't always like the same soda. Sometimes it's <a href=\"https://www.coca-cola.com/us/en/brands/diet-coke\">Diet Coke</a>, and other times, <a href=\"https://www.drpepper.com/s/products/diet-dr-pepper\">Diet Dr Pepper</a>. But for the last year or so the drink of choice around these parts is <a href=\"https://www.coca-cola.com/us/en/brands/fresca-sparking-soda\">Fresca</a>. But you know what's funny. No matter what my favored drink is, it's always the one you can't get at the local <a href=\"https://stores.hannaford.com/ny/west-hurley/8444\">supermarket</a>. Always sold out. Very weird.",
            "created": "Mon, 13 Nov 2023 22:09:10 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I just got a link to a <a href=\"https://www.theinformation.com/articles/the-tech-evangelist-who-lives-life-according-to-the-tides\">story</a> on The Information about my longtime friend <a href=\"https://www.google.com/search?q=site%3Ascripting.com+Guy+Kawasaki\">Guy Kawasaki</a>. We had a couple of great adventures together, early in our careers, and I'll never forget the moment when he gave me the idea that blasted my company out of poverty to success. I would have loved to read the article, but to do so I'd have to sign on, and I'm sure they would sell my address, and I wouldn't be surprised if I had to subscribe. So as much as it pained me, I hit the back button and wrote this post to say I would have been happy to <a href=\"https://www.google.com/search?q=site%3Ascripting.com+ez+pass+for+news\">spend $1</a> to read the article, and authenticate myself with a service I control (ie no selling my identity thank you). We've been around this block so many times. The writing world of the web is full of disappointment like this. I've written this post 100,000 times by now. ",
            "created": "Mon, 13 Nov 2023 16:05:21 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2023/11/13/dollar.png",
            "flInCalendar": true
        }
    ]
}