{
    "created": "2023-11-23T05:00:00.000Z",
    "flInCalendar": true,
    "name": "23",
    "path": "2023/11/23",
    "text": "November 23",
    "type": "calendarDay",
    "subs": [
        {
            "text": "In the <a href=\"https://en.wikipedia.org/wiki/Thanksgiving#United_States_2\">US</a> we celebrate <a href=\"https://en.wikipedia.org/wiki/Thanksgiving\">Thanksgiving</a> with <a href=\"https://www.youtube.com/watch?v=WaKIX6oaSLs\">Alice's Restaurant</a>. ",
            "created": "Thu, 23 Nov 2023 14:05:42 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=WaKIX6oaSLs",
            "flInCalendar": true
        },
        {
            "text": "Journalists are still trying to land a punch on the AI sphere, but imho it's already too late. It's already far better at delivering the truth than all the reference sources on the web, including news orgs. One of the secrets to success in business, media and politics is to learn how to lead journalists to the story you want them to tell. There's are all kinds of tricks, I know because I succeeded in that world. When I ask ChatGPT to tell me about things that journalism got wrong that I know everything about, it gets it right. I don't know how that works, because what I think are their sources got it wrong. It's freaking amazing. Now I totally agree that the small group of super rich people who control tech are not people I'd like to see run the world, they break things I care about far too often. Too much power for people who can't or won't see outside their tiny shrinking world. ",
            "created": "Thu, 23 Nov 2023 14:28:11 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2023/11/23/turkey.png",
            "flInCalendar": true
        },
        {
            "text": "Someday Google will have a chatbot I can ask if YouTube TV can play Knicks and Mets games live, and if so how much extra does it cost. Navigating their website is hopeless. They must not want you to get that bit of info. They hint at the possibility of it, but I know from previous experience that the reason others do it that way is because they don't actually deliver on what they want you to think they deliver. I guess companies like that are betting that it's just too much trouble to get out of the deal, but the fact is it's incredibly easy to opt out of the deals, unlike with my cable provider, which makes cutting the cord and re-establishing it incredibly time-consuming. ",
            "created": "Thu, 23 Nov 2023 14:40:03 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"http://scripting.com/stories/2009/11/26/happyThanksgivingEverybody.html\">2009</a>: Every so often something happens, a family member or friend dies, and that makes the confusion come front and center. And once in a lifetime someone as close as a father dies, and that floors you. You get knocked down, and as you come back up, you're not the same person you were before. The mystery of life and the question of existence after life, they're always there, but they loom much larger after a loss.",
            "created": "Thu, 23 Nov 2023 14:38:31 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The Story of FeedLand",
            "created": "Thu, 23 Nov 2023 14:18:00 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "<i>Note: This story was written entirely by ChatGPT.</i>",
                    "created": "Thu, 23 Nov 2023 14:24:57 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "In the digital realm of FeedLand, a world pulsating with streams of information, there existed a unique society where knowledge and news were the sources of power. This world was composed of various domains, each representing different genres of information – from the News Mountains to the Blog Plains, the Podcast Peninsula, and beyond.",
                    "created": "Thu, 23 Nov 2023 14:23:06 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The protagonist of our story is a young, curious girl named Ada. In FeedLand, each individual had a personal Feed – a dynamic stream of information tailored to their interests and needs. Ada, however, was different. She had the rare ability to see and interact with all the Feeds in FeedLand, a talent that was both a gift and a burden.",
                    "flInCalendar": true
                },
                {
                    "text": "Ada's journey began when she noticed disturbances in the Feeds – information was getting muddled, important news was lost in a sea of trivial updates, and misinformation was spreading like wildfire. This chaos was causing confusion and conflict among the inhabitants of FeedLand.",
                    "flInCalendar": true
                },
                {
                    "text": "Determined to restore balance, Ada embarked on a quest to find the Core Source, the mythical origin of all Feeds in FeedLand. She believed that by reaching the Core Source, she could rectify the disturbances and bring order back to the information flow.",
                    "flInCalendar": true
                },
                {
                    "text": "Ada's adventure took her through diverse territories. In the News Mountains, she navigated through towering peaks of breaking stories and deep valleys of in-depth analyses. In the Blog Plains, she encountered a wide array of opinions and narratives, learning to discern the insightful from the mundane. The Podcast Peninsula challenged her with a cacophony of voices and perspectives, each vying for attention.",
                    "flInCalendar": true
                },
                {
                    "text": "Along her journey, Ada was accompanied by a group of companions, each representing different aspects of FeedLand's information ecosystem. There was Lex, a fact-checker with the uncanny ability to spot inaccuracies in seconds; Echo, a podcaster who could weave stories that captivated anyone who listened; and Pixel, a visual artist who could bring any information to life through graphics and animations.",
                    "flInCalendar": true
                },
                {
                    "text": "Together, they faced challenges like the Trolls of Misinformation, the Echo Chambers where no new thoughts could penetrate, and the Filter Bubbles that isolated communities from one another.",
                    "flInCalendar": true
                },
                {
                    "text": "Finally, they reached the Core Source, a vast, glowing nexus of data and information. Ada realized that the Core Source had become overwhelmed with the sheer volume and variety of information being generated. She used her unique ability to untangle the flows, filter out the noise, and establish new, more efficient pathways for information dissemination.",
                    "flInCalendar": true
                },
                {
                    "text": "As a result, the Feeds of FeedLand became clearer, more accurate, and more accessible to its inhabitants. Knowledge and news flowed harmoniously, enriching the lives of all who lived there.",
                    "flInCalendar": true
                },
                {
                    "text": "Ada's journey taught her the importance of critical thinking, discernment, and the responsible sharing of information. She continued to explore the ever-evolving landscape of FeedLand, always ensuring that the streams of information remained pure and beneficial.",
                    "flInCalendar": true
                },
                {
                    "text": "Her story became a legend in FeedLand, inspiring others to be mindful of the information they consumed and shared, making Ada a symbol of wisdom and guidance in the digital age.",
                    "created": "Thu, 23 Nov 2023 14:23:58 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Ada, the young hero of FeedLand.",
                    "created": "Thu, 23 Nov 2023 14:23:59 GMT",
                    "inlineImage": "https://imgs.scripting.com/2023/11/23/adaTheYoungHeroOfFeedland.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}