{
    "text": "What about the courts?",
    "created": "Sat, 01 Feb 2020 20:17:52 GMT",
    "type": "outline",
    "description": "Soon enough the courts will have to rule on whether the president is a monarch.",
    "subs": [
        {
            "text": "I was wondering how the courts will incorporate the <a href=\"https://en.wikipedia.org/wiki/Impeachment_trial_of_Donald_Trump\">Senate's decision</a> into their interpretation of the Constitution. ",
            "created": "Sat, 01 Feb 2020 20:18:07 GMT"
        },
        {
            "text": "Will they judge the executive as if the president is a monarch now?",
            "created": "Sat, 01 Feb 2020 20:30:40 GMT"
        },
        {
            "text": "They can't overrule the Senate, that seems clear from the Constitution.",
            "created": "Sat, 01 Feb 2020 20:18:24 GMT"
        },
        {
            "text": "Another question. What will the Repubs in the Senate do if/when Trump pushes the boundaries. For example, suppose he has a journalist killed. Lots of witnesses. He admits it. Assuming the House impeaches him, what does the Senate do? ",
            "created": "Sat, 01 Feb 2020 20:18:24 GMT"
        },
        {
            "text": "A less radical hypothetical. What if he arrests Hillary Clinton for interfering with his re-election. Seems likely that will go to court. Say the Supreme Court rules this is illegal or unconstitutional. Will Trump respect that even though the Senate appears to have said it's OK.",
            "created": "Sat, 01 Feb 2020 20:19:15 GMT"
        },
        {
            "text": "I imagine the scholars and judges are thinking about this now. This has been a precedent-setting trial. If they actually do acquit him when no one contests the truth, it appears the only part of the government that objects is the House. It seems the question will be raised in the courts as well. It'll appear on Roberts' desk before too long. Is the president really a king?",
            "created": "Sat, 01 Feb 2020 20:25:38 GMT"
        }
    ]
}