{
    "text": "Pseudo code and kitchen-table conversations",
    "created": "Mon, 07 Oct 2024 13:58:28 GMT",
    "type": "outline",
    "enclosure": "https://s3.amazonaws.com/scripting.com/publicfolder/downloads/podcasts/2024/10/07/pseudoCodeAndKitchenTableConversations.m4a",
    "enclosureType": "audio/mpeg",
    "enclosureLength": "10739428",
    "subs": [
        {
            "text": "Today's <a href=\"https://shownotes.scripting.com/scripting/2024/10/07/pseudoCodeAndKitchenTableConversations.html\">podcast</a> has nothing to do with the 30 year milestone, except that it is totally unscripted, stream of consciousness, for 30 minutes, on two topics.",
            "created": "Mon, 07 Oct 2024 13:41:58 GMT",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "The idea of what a programming language is, is about to be completely overturned. The verbs and nouns will, at least at first, be pretty much exactly like we do it now, but the way you specify how they work, how they interact both in the UI and on the backend, will be done more or less as you would document the user interface. The AI system is almost ready to work at that level. With a few more iterations by human designers it should all meet up in a place where the slogging type work I've been doing for 50+ years will be obsolete. We will all become anachronisms. All of us. Get ready for it. And btw I was the biggest skeptic of the idea of a higher level more human way of programming. Scoffed at the idea. Repeatedly. Never say you can't teach an old dog new tricks.",
                    "created": "Mon, 07 Oct 2024 13:42:35 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The second part is about kitchen-table conversations in families, the bored rantings of our ancestors, passed on lovingly from generation to generation. Should have realized that we did not turn a racial corner with the election of Obama, we all should have gotten prepared for the backlash from children of the slavers and fascists, who were raised alongside us as victims of slavery and fascism were raised to feel persecuted. We all revert to our comfortable roles. The question is can we rise above that and forget for a moment what our ancestors taught us as gospel and take an interest in going beyond that, or do we have to do another loop around the genocide and its consequences, which this time will be <i>far worse</i> than they were in the 1940s because of all the new war and computer tech and the damage done by the post-war growth. ",
                    "created": "Mon, 07 Oct 2024 13:45:42 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "I feel good about this podcast, because it has nothing to do with the milestone. I have an idea of what it feels like to have been blogging for 30 years, but no conclusions to offer that would mean anything to me or anyone else, except perhaps a psychologist. ",
            "created": "Mon, 07 Oct 2024 13:49:18 GMT",
            "flInCalendar": true
        },
        {
            "text": "I've been watching a lot of sports recently and the interviews with star athletes saying the same predictable bullshit after being asked how it felt to do whatever heroic thing they just did. All of TV and news is like that, none of it is news, all of it is predictable bullshit. That is probably why they have so much trouble reporting the truth about Trump and Musk. It doesn't fit into their job description, it's not in anyone's job to tell the truth. And <i>that's</i> the truth. ",
            "created": "Mon, 07 Oct 2024 14:07:40 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}