{
    "text": "I did a <a href=\"http://scripting.com/2019/08/06/155950.html\">roundup of thoughts</a> when this blog turned 25. I stand by what I wrote then, but I'd add this. My blog started because I needed content to test a script I had written that sent emails on my Mac using <a href=\"http://scripting.com/frontier/apps/Eudora.html\">Eudora</a>, which was an early <a href=\"http://scripting.com/frontier/apps/Eudora.html\">scriptable app</a> and I had a nice scripting system that worked with it. I looked around for <a href=\"http://scripting.com/davenet/1994/10/07/marccantersingsagain.html\">something</a> to send (30 years ago today), and shot out an email to the people whose business cards I had collected at various tech conferences. It was a thrill, so I did it <a href=\"http://scripting.com/davenet/1994/10/12/marcs10things.html\">again</a>, and <a href=\"http://scripting.com/davenet/1994/10/13/lettertocannavino.html\">again</a> and <a href=\"http://scripting.com/davenet/1994/10/14/howtoinvestinpdas.html\">three</a> <a href=\"http://scripting.com/davenet/1994/10/16/randybattatonpdas.html\">more</a> <a href=\"http://scripting.com/davenet/1994/10/17/pdasonparade.html\">times</a>, before I realized hey I could use this thing to get <a href=\"http://scripting.com/davenet/1994/10/18/billgatesvstheinternet.html\">my own ideas</a> out <a href=\"http://scripting.com/davenet/\">there</a>. And thus began <a href=\"http://scripting.com/\">this thing</a> that I still do to this day. Look at the <a href=\"http://scripting.com/2024/10/05/142118.html\">two</a> <a href=\"http://scripting.com/2024/10/06/142657.html\">posts</a> I wrote about WordPress in the last few days. There may be hope to find a blogosphere buried somewhere in there. And it may be possible to give them some sweet new writing tools so they can get excited about writing on the web the way we did all those years ago. I actually am kind of optimistic about that. Maybe we can stand up something in the midst of the noise. When we booted up podcasting, approx 20 years ago, we had a slogan -- \"Users and developers party together.\" It worked! That is still the way I want to build stuff, it's the only way I know how to do it. Blogging started out as a programming adventure and eventually became a form of literature. How about that. I'm up for doing more of that if you all are. But please expect to make contributions, don't expect it all to come to you for free, because as we know nothing really is free.  ",
    "created": "Mon, 07 Oct 2024 17:03:03 GMT",
    "type": "outline",
    "image": "https://imgs.scripting.com/2023/10/25/mookieWilson.png",
    "flInCalendar": true
}