{
    "text": "I ❤️ HTTPS",
    "created": "Wed, 03 Nov 2021 15:35:51 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "A user said they were surprised that I encouraged people to use HTTPS with their \"Drummer\" blogs, even though I <a href=\"http://this.how/googleAndHttp/\">speak out</a> against Google trying to force HTTPS on the open web.",
            "created": "Wed, 03 Nov 2021 15:36:09 GMT",
            "flInCalendar": true
        },
        {
            "text": "These are very different things!",
            "created": "Wed, 03 Nov 2021 15:39:06 GMT",
            "flInCalendar": true
        },
        {
            "text": "I want people to use my software in every way that makes sense, and if you're generating web content, which Drummer most certainly <a href=\"http://docserver.scripting.com/drummer/blogging.opml\">does</a>, HTTPS is one of the things people want to do. I support this. Let me say that slowly: I. Support. This.",
            "created": "Wed, 03 Nov 2021 15:36:40 GMT",
            "flInCalendar": true
        },
        {
            "text": "Further, I use HTTPS myself. I am glad my bank uses it. And the health clinic I use. ",
            "created": "Wed, 03 Nov 2021 15:40:18 GMT",
            "flInCalendar": true
        },
        {
            "text": "What I object to is Google trying to take ownership of the web. I love that the web is the platform with no platform vendor. We're all guests here and that includes big companies like Google. And guests don't make the rules. ",
            "created": "Wed, 03 Nov 2021 15:37:26 GMT",
            "flInCalendar": true
        },
        {
            "text": "I know some people run their lives such that they won't work with other people who don't see the world <i>exactly</i> as they do -- but I am not one of those people. Emphatically. I preach working together. It's my mission more than anything else. I am against walls that keep people out. Except with my private info, then I like them. See how that works?",
            "created": "Wed, 03 Nov 2021 15:38:09 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}