{
    "text": "One of the best investments I've made is in the <a href=\"https://en.wikipedia.org/wiki/S%26P_500\">S&P 500</a>. It's an <a href=\"https://www.investopedia.com/terms/i/indexfund.asp\">index fund</a>, the less famous of the two big ones, the other being the Dow Jones. It's a <a href=\"https://en.wikipedia.org/wiki/List_of_S%26P_500_companies\">collection of stocks</a>, chosen by a company named <a href=\"https://en.wikipedia.org/wiki/S%26P_Global\">S&P Global</a>. Simplifying just a little, they buy shares in those stocks and then in turn sell shares of the collection to everyone, people like you and me. The value of the fund is the totall of the value of all the stock it owns, and fluctuates as their prices change. Every day it goes up or down, like a stock. It means that even if one of these companies does badly, the collection doesn't crash. It's designed to reflect the value of the \"stock market.\" So why is the S&P 500 such a good investment? This is what I think, everyone has an opinion about this. It's the way presidents are evaluated. If the stock market is doing well, then analysts say \"the economy\" is doing well, and the president's approval rating goes up. It doesn't make any sense, but that's how it works. So the president will work really hard to make sure that your bet on the S&P 500 goes up and up and up, always, in good times and bad. Now, there are times when the S&P 500 will go down, but usually it goes up. If you put some money there it will probably grow. Over time it will grow a lot. You can <a href=\"https://www.google.com/finance/quote/.INX:INDEXSP\">track</a> the value of the S&P 500 here. Here's a <a href=\"http://scripting.com/images/2021/04/19/sp500graph.png\">graph</a> of the S&P 500 from 1981 to now. You can see it does go up, but there are times it goes down. You can buy shares in the S&P 500 from any brokerage firm. The list is open source, so any reputable broker can sell you an S&P 500 fund. They all, by definition, behave exactly the same, though commissions on transactions differ according to brokers. That's why I say I \"simplified\" just a little.",
    "created": "Mon, 19 Apr 2021 13:03:09 GMT",
    "type": "outline",
    "image": "http://scripting.com/images/2019/01/30/richieRich.png",
    "flInCalendar": true
}