{
    "text": "TV relationships",
    "created": "Mon, 02 Jan 2023 21:55:15 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I've been bingeing some highly rated but very mediocre TV series. What makes them so bad is how they present human relations. For example, it's very common for one character to approach another and ask \"Are you OK?\" with the clear implication that they are not. The person who is supposedly hurting, or sad, confused, troubled, about to die, grieving some horrific event (that we might know about) puts on a happy face and says \"No everything's fine, what makes you think I'm hurting, sad, confused etc?\" We know it's fake and so does the accuser. I imagine that a lot of people watching it think this kind of interaction is okay, but it's actually <a href=\"https://en.wikipedia.org/wiki/Gaslighting\">gaslighting</a> which is a terrible thing to do to another person.",
            "created": "Mon, 02 Jan 2023 21:51:54 GMT",
            "image": "http://scripting.com/images/2023/01/02/thePetries.png",
            "flInCalendar": true
        },
        {
            "text": "Another thing is how they portray romantic relationships. A wife is dancing wildly at a party. The husband grabs her and takes her home, and on the way back explains how embarrassing her behavior was to him. I want to yell at him -- hey who cares if you're embarrased. It has nothing to do with you. And she was having fun. I can imagine being married to you is pretty stressful. Etc etc. Or a young dude once gets to have sex with an older woman and is therefore obsessed with her for his whole life, even after he's married to a very nice age-appropriate woman. The way he describes his feelings might be the way an infant would describe their relationship with a caregiver. \"Without you I can't live,\" he says. Sorry but that's bullshit. The baby is dependent. No matter how you feel, you <i>can</i> live without your age-inappropriate GF. ",
            "created": "Mon, 02 Jan 2023 21:56:18 GMT",
            "flInCalendar": true
        },
        {
            "text": "I think about all the great shows I've binged many times and wish there were more out there. ",
            "created": "Mon, 02 Jan 2023 22:00:25 GMT",
            "flInCalendar": true
        },
        {
            "text": "If you're interested, here are <a href=\"http://my.bingeworthy.io/davewiner/\">my Bingeworthy ratings</a> for shows. ",
            "created": "Mon, 02 Jan 2023 22:00:41 GMT",
            "flInCalendar": true
        },
        {
            "text": "If you see something that you think I would love, feel free to drop me an email. ",
            "created": "Mon, 02 Jan 2023 22:25:41 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}