{
    "text": "The pilot said Fuck Trump",
    "created": "Sun, 31 Oct 2021 20:34:50 GMT",
    "type": "outline",
    "metaImage": "http://scripting.com/images/2021/10/31/southwestPlane.png",
    "description": "The passengers were stuck with a lunatic flying the plane.",
    "subs": [
        {
            "text": "First reaction of the <a href=\"https://news.yahoo.com/southwest-airlines-pilot-reportedly-used-172940102.html\">Southwest captain</a> saying Fuck Biden over the speakers was wow that's a line we didn't want to cross. Then it was pointed out by <a href=\"https://taibbi.substack.com/p/the-lets-go-brandon-freakout-goes\">Matt Taibbi</a> that <a href=\"https://www.youtube.com/watch?v=1zNr8Pf1QkY\">Robert De Niro</a> said Fuck Trump on national TV and the audience loved it, he got a standing ovation, said it again even.",
            "created": "Sun, 31 Oct 2021 20:34:59 GMT",
            "image": "http://scripting.com/images/2019/11/20/offWithTheirHeads.png",
            "flInCalendar": true
        },
        {
            "text": "That gets you thinking. But there's a difference between Biden and Trump. Biden will leave office peacefully, we all knew Trump wouldn't. So Fuck Trump was a cry for help, a plea for unity. We're all cursed by the fucker. Let's say out loud what the news people refuse to say.",
            "created": "Sun, 31 Oct 2021 20:37:25 GMT",
            "flInCalendar": true
        },
        {
            "text": "People who love Trump have nothing to fear from Biden. To think otherwise is lunacy, and when I think things through other people's lunacy doesn't enter into my reasoning. ",
            "flInCalendar": true
        },
        {
            "text": "Further, you're in a closed locked tube and this asshole is the fucking pilot. And he loves fascism, which is to say he is crazy. I want off the plane when I hear that. You get to turn off the TV show which you probably weren't watching anyway. But the passengers are stuck with a lunatic flying the plane. So it's not the same thing. ",
            "created": "Sun, 31 Oct 2021 20:41:35 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}