{
    "text": "The sad state of tech news in 2017",
    "created": "Sat, 24 Jun 2017 13:43:48 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "It won't take much to reboot the tech blogosphere, just a few bloggers with ideas who listen to each other and want to work with each other. That was the <a href=\"http://scripting.com/davenet/1996/02/08/holdinghandsincyberspace.html\">idea</a> behind blogrolls, to visibly show the relationships. ",
            "created": "Sat, 24 Jun 2017 13:43:55 GMT",
            "subs": [
                {
                    "text": "I'm still thinking about how to integrate a blogroll with the new design of \"Scripting News\". I pushed everything aside to get a clean look for the new site. I want to avoid bringing it all back. ",
                    "created": "Sat, 24 Jun 2017 14:32:17 GMT",
                    "permalink": "http://scripting.com/2017/06/24.html#a100617"
                }
            ],
            "permalink": "http://scripting.com/2017/06/24.html#a090655"
        },
        {
            "text": "So, we have a few people who are writing and listening. That's a needed first step. Next we need a way to announce and hear about new tech products. Not just ones that get VC backing or come from big companies. We already hear about those products through \"TechMeme\" and the pubs that contribute to it. We also have platform-specific news about tech products, it's more limited, but it's there.",
            "created": "Sat, 24 Jun 2017 13:44:09 GMT",
            "permalink": "http://scripting.com/2017/06/24.html#a090609"
        },
        {
            "text": "It will likely start with word of mouth among the bloggers. If <a href=\"http://altplatform.org/2017/06/20/building-a-blogroll-in-2017/\">Richard</a> is using a product and speaks highly of it, I'm likely to take a look. Especially if he says it fits into what I'm doing through the open formats my software already supports. ",
            "created": "Sat, 24 Jun 2017 13:52:04 GMT",
            "permalink": "http://scripting.com/2017/06/24.html#a090604"
        },
        {
            "text": "Then I want a river, a place where I can go to find out quickly what's new, in the way of products, not BigCo bluster or another $250 million VC deal. I want to know what my peers are doing. So I can learn from them, and so we can make our products work with theirs. ",
            "created": "Sat, 24 Jun 2017 13:52:04 GMT",
            "permalink": "http://scripting.com/2017/06/24.html#a090604"
        },
        {
            "text": "<i>Work together</i> is a phrase you'll hear me use a lot. It's the potential of tech, but it often isn't the attitude of tech. Even the smallest most independent developers dream of dominating. You can't work with people who dominate, even if they win. ",
            "created": "Sat, 24 Jun 2017 13:54:33 GMT",
            "permalink": "http://scripting.com/2017/06/24.html#a090633"
        },
        {
            "text": "I want to hear about products that are open to connecting to mine. ",
            "created": "Sat, 24 Jun 2017 20:53:41 GMT",
            "permalink": "http://scripting.com/2017/06/24.html#a040641"
        },
        {
            "text": "There have been times, often defined by news sources, that have created huge swells of compatible technology. To name a few: InfoWorld, PC WEEK, MacWEEK, TechCrunch. Very fond memories of the communities that gathered around each of those. ",
            "created": "Sat, 24 Jun 2017 13:48:02 GMT",
            "permalink": "http://scripting.com/2017/06/24.html#a090602"
        },
        {
            "text": "It's time for another. The opportunity is there. It's been a long time since we had an open development community that worked to create great new user experience without lockin. It's like riding a bicycle or swimming, you don't forget how to do it. And like tennis or baseball, you can't play without partners and competition. ",
            "created": "Sat, 24 Jun 2017 13:57:02 GMT",
            "permalink": "http://scripting.com/2017/06/24.html#a090602"
        }
    ],
    "permalink": "http://scripting.com/2017/06/24.html#a090648"
}