{
    "text": "Antisemitism is everywhere",
    "created": "Mon, 04 Aug 2025 14:33:15 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Academics, who speak scientific language, won't say \"there's no antisemitism at UCLA\" because they know that's not true. Antisemitism is everywhere. The question is how limiting and dangerous is it. And how often is it encountered. ",
            "created": "Mon, 04 Aug 2025 14:33:22 GMT",
            "flInCalendar": true
        },
        {
            "text": "I grew up in the 1960s in a Queens neighborhood where antisemitism was a real thing. We were blamed for World War II. If it weren't for Jews my uncle Pete would still be alive. That was the story. No doubt the kids heard that at home. ",
            "created": "Mon, 04 Aug 2025 14:34:06 GMT",
            "flInCalendar": true
        },
        {
            "text": "Antisemitism was bred into us at home. Because of all the abuse my parents and grandparents, uncles and cousins, suffered in Europe, before coming the US during the war, their own idea of what it meant to be Jewish was not entirely positive. You can't help but feel responsible in some ways for the abuse you suffer. And you can't help but pass that on to your kids. ",
            "created": "Mon, 04 Aug 2025 14:34:39 GMT",
            "flInCalendar": true
        },
        {
            "text": "There was and is a fair amount of pain associated with being Jewish in the United States. Fact.",
            "created": "Mon, 04 Aug 2025 14:35:11 GMT",
            "flInCalendar": true
        },
        {
            "text": "But: At UCLA? Harvard? Columbia? Please.  ",
            "created": "Mon, 04 Aug 2025 14:35:16 GMT",
            "flInCalendar": true
        },
        {
            "text": "At the same time scientists can admit that there is antisemitism at these places we must also acknowledge that to single these institutions out among all, is complete utter total fucking bullshit.",
            "created": "Mon, 04 Aug 2025 14:35:32 GMT",
            "flInCalendar": true
        },
        {
            "text": "That's a scientific appraisal, btw. Provable in peer-reviewed publications (though not submitted).",
            "created": "Mon, 04 Aug 2025 14:40:30 GMT",
            "isComment": "true",
            "flInCalendar": true
        },
        {
            "text": "Antisemitism is complex. We should be hearing, openly, what exactly the case is against these universities. The government is theoretically representing the Constitution and the people of the United States. The old \"no taxation without representation\" <a href=\"https://en.wikipedia.org/wiki/No_taxation_without_representation\">thing</a>. Let's hear the case in clear terms, and why the universities are supposedly so bad. ",
            "created": "Mon, 04 Aug 2025 14:40:33 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}