{
    "text": "July 10",
    "created": "Wed, 10 Jul 2019 14:39:44 GMT",
    "name": "10",
    "subs": [
        {
            "text": "A media hack is different from a software hack. Podcasting is a media hack. Sure, there was a little software needed to get the bootstrap going. But the innovation was the combination of HTTP, MP3 and RSS. It's like a S'more, which is a \"cookie hack.\"",
            "created": "Thu, 11 Jul 2019 00:24:55 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1149110505891672064",
            "image": "http://scripting.com/images/2019/07/10/smore.png"
        },
        {
            "text": "As a paying user of Dropbox who uses the web interface rarely, when I need to restore a file that's damaged, I don't appreciate them trying to make Dropbox into a lot more than it is, and thus making it hard to quickly find what I need to get my server back online. ",
            "created": "Wed, 10 Jul 2019 20:28:07 GMT",
            "type": "outline"
        },
        {
            "text": "I finished <a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+%22The+Power+Broker%22&t=h_&ia=web\">The Power Broker</a>, and there's absolutely no mention of <a href=\"https://www.vanityfair.com/culture/2017/04/jane-jacobs-citizen-jane-documentary\">Jane Jacobs</a> in the story. He told the story of the East Tremont neighborhood in the Bronx that was wiped out by the <a href=\"https://en.wikipedia.org/wiki/Cross_Bronx_Expressway\">Cross Bronx Expressway</a>, I thought that was the prelude to the <a href=\"https://www.curbed.com/2016/5/4/11505214/jane-jacobs-robert-moses-lomex\">Lower Manhattan Expressway</a>, but nothing, zip, as if <a href=\"https://en.wikipedia.org/wiki/Interstate_78_in_New_York#Lower_Manhattan_Expressway\">it never happened</a>. ",
            "created": "Wed, 10 Jul 2019 14:39:45 GMT",
            "type": "outline"
        },
        {
            "text": "Twittertube&trade;",
            "created": "Wed, 10 Jul 2019 20:15:16 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "If I ran Twitter, I'd create a developer toolkit for creating setups like screen2.io. You'd specify a YouTube video. The chat part of the interface would just be Twitter, so your Twitter followers would read what you're saying (or not, it would be a preference). Now I'd have a way to watch live video feeds from YouTube in Twitter. And of course the \"developers\" wouldn't be super techie devs. They would be people who are good discussion leaders, and people who are good at keeping spammers out. You could share revenue with them to make it really grow. You could call it twittertube. ",
                    "created": "Wed, 10 Jul 2019 20:15:25 GMT",
                    "image": "http://scripting.com/images/2019/07/10/threeStooges.png",
                    "urlvideo": "https://www.youtube.com/watch?v=w166-ljnIMU"
                }
            ]
        }
    ]
}