{
    "text": "July 18",
    "created": "Thu, 18 Jul 2019 12:36:51 GMT",
    "name": "18",
    "subs": [
        {
            "text": "I can't believe I agree with <a href=\"https://www.nytimes.com/2019/07/16/opinion/trump-2020.html\">Thomas Friedman</a>. We ought to pick the most boring and coherent presidential candidate -- the most plain and uncontroversial person on the stage. Nominate him or her, and then get ready to fight. I agree with Friedman, the things they agreed to in the debate were <i>insane. </i>They handed the election to Trump. We need to grab it back. My two picks: Klobuchar or Inslee. ",
            "created": "Thu, 18 Jul 2019 14:20:26 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://www.npr.org/2019/07/17/742818947/minnesota-sen-amy-klobuchar-turns-to-humor-to-distinguish-herself-among-candidat\">Amy Klobuchar gets it</a>. Trump is funny. He's a <a href=\"https://en.wikipedia.org/wiki/Caricature\">caricature</a>, a funny <a href=\"https://www.youtube.com/watch?v=YqyQfjDScjU\">impersonation</a> of a <a href=\"https://en.wikipedia.org/wiki/Benito_Mussolini\">strong man</a>. People who love him think he's hilarious. Entertaining. I've been saying <a href=\"http://scripting.com/2016/04/20/1203.html\">this</a> <a href=\"http://scripting.com/2016/04/28/1224.html\">since</a> <a href=\"http://scripting.com/liveblog/users/davewiner/2016/01/09/0815.html\">2016</a>. If you want to counter-program the rallies, which the Democrats, if they had an ounce of ambition, would have done from the start, what you need are old-style standup comedians. Unfortunately the good ones are dead. Joan Rivers (who <a href=\"https://www.youtube.com/watch?v=nN2C6ctpOhg\">liked</a> Trump, she was a real <a href=\"https://www.youtube.com/watch?v=j-5Q7yuaXjM\">asshole</a>, she didn't just play one on TV) or <a href=\"https://www.youtube.com/watch?v=qofdWFv7m0U\">Don Rickles</a>, <a href=\"https://www.youtube.com/watch?v=MecU2keW54I\">Rodney Dangerfield</a>, <a href=\"https://www.youtube.com/watch?v=KLODGhEyLvk\">George Carlin</a>. But there must be others. Get <a href=\"https://www.youtube.com/watch?v=LH_-9hD2xBY\">Bill Hader</a> to do a Joan Rivers impersonation. Or <a href=\"https://www.glamour.com/story/kate-mckinnon-best-celebrity-impressions-on-saturday-night-live\">Kate McKinnon</a>. Then you can leave the <a href=\"https://elizabethwarren.com/\">Democratic nominee</a> to talk about health care, securing the borders, the basic values of America. Let Trump compete with the comedians, which is appropriate because that's what he is. ",
            "created": "Thu, 18 Jul 2019 12:42:30 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/07/18/greatDictator.png"
        },
        {
            "text": "I am having an allergic reaction to the idea that those monsters at Trump <a href=\"https://www.newsobserver.com/news/politics-government/article232776672.html\">rallies</a> are Americans. I desperately want to join with others to say that the America I was born in doesn't belong to any one race or religion. I think every few generations we have to renew this very basic idea, that the <a href=\"https://en.wikipedia.org/wiki/United_States\">United States</a> is a <a href=\"https://en.wikipedia.org/wiki/E_pluribus_unum\">union</a>, out of many, one. ",
            "created": "Thu, 18 Jul 2019 13:20:29 GMT",
            "type": "outline"
        },
        {
            "text": "Everything's okay, I'm busy with house projects this week, so am mostly posting my thoughts <a href=\"https://twitter.com/davewiner\">to Twitter</a>. I know it's better to post them here. Hopefully I'll be near a computer more in the coming days. :boom:",
            "created": "Thu, 18 Jul 2019 12:36:52 GMT",
            "type": "outline"
        },
        {
            "text": "I've had contractors and workers coming through my house this week, lots of them. Where I live there's no cell service, so the ones who had smart phones could hook through my wifi. But a few of them didn't have phones and many of the rest, esp ones over 40, couldn't set up a new wifi access point. (I set it up for them.) Can you imagine doing a job that requires you to be away from the office most of every day without the ability to communicate? A reminder that not everyone is on the net, even in the US, in 2019.",
            "created": "Thu, 18 Jul 2019 13:15:39 GMT",
            "type": "outline"
        }
    ]
}