{
    "text": "The Mets weren't playing last night, and I'm kind of burning out on <a href=\"https://en.wikipedia.org/wiki/My_Brilliant_Friend_(TV_series)\">My Brilliant Friend</a> (I'll get back to it) so I sat down to watch Chris Hayes on MSNBC. I heard that the DoJ had <a href=\"https://www.cnn.com/2022/08/24/politics/barr-mueller-report/index.html\">released</a> the heavily redacted memo by former <a href=\"https://en.wikipedia.org/wiki/William_Barr\">Attorney General Barr</a>, the <a href=\"https://www.documentcloud.org/documents/22187584-barr-unredacted-memo\">one</a> that <a href=\"https://www.youtube.com/shorts/n5SRHdcPLAI\">basically said</a> that the Mueller Report (that we hadn't at the time seen) was a <a href=\"https://en.wiktionary.org/wiki/nothingburger\">Nothingburger</a>, <a href=\"https://www.cnn.com/2022/08/24/politics/barr-mueller-report/index.html\">without the redactions</a>. So I expected there would be something interesting on MSNBC. The show opens with an in-detail horse race story that said basically we fucked up and it wasn't a foregone conclusion that the Repubs would take Congress in the upcoming midterm election as we have been reporting since just after the 2020 election. Right. This is now horserace journalism of a higher order, the horserace we're judging is how well Hayes et al were doing at predicting the outcome of the election, which btw, is a theoretical thing because (pause here) THE FUCKING ELECTION STILL HASN'T HAPPENED. Sorry for screaming, but this is such a waste, and how could anyone possibly care about this. Every time they report <a href=\"https://en.wikipedia.org/wiki/Conventional_wisdom\">conventional wisdom</a>, they have driven far off course, they are no longer doing news, they are doing self-butthole examination. What a waste. And it's kind of obvious (imho) that Hayes has been going to the Tucker Carlson School School of Acting. He's trying to talk like him. It's really sad. Maybe MSNBC could just hire Carlson to work for them. After all if the Mets can buy players from <a href=\"https://en.wikipedia.org/wiki/Francisco_Lindor\">Cleveland</a> or the <a href=\"https://en.wikipedia.org/wiki/Max_Scherzer\">Dodgers</a>, why can't MNBC buy an actor from Fox News to play for them. The amount of actual news reporting on both networks is pitifully small. ",
    "created": "Thu, 25 Aug 2022 13:47:55 GMT",
    "type": "outline",
    "image": "http://scripting.com/images/2017/11/29/racehorse.png",
    "flInCalendar": true
}