{
    "text": "Wires scare normal people",
    "created": "Sat, 16 Mar 2019 18:46:38 GMT",
    "type": "outline",
    "description": "People find computers intimidating because of all the wires. I don't blame them, I would too. That's the great thing about iPhones I guess. No wires.",
    "subs": [
        {
            "text": "I was reminded of a story from Living Videotext in the 80s. We had a rule that every desk had to have a PC on it, which was somewhat radical for the 80s. That included our receptionist, Tammy, who was like my officemate, since my room was adjacent to the front entrance. We put a Toshiba desktop on the table next to her desk, and put a copy of ThinkTank on it, for notetaking, but she never used it. That was allowed too, the computer just had to be there. turned on and ready to go. ",
            "created": "Sat, 16 Mar 2019 18:46:46 GMT",
            "image": "http://scripting.com/images/2019/03/16/dgOne.png"
        },
        {
            "text": "One day we got a confidential demo of a <a href=\"https://en.wikipedia.org/wiki/Data_General-One\">new product</a> from Data General, the first battery powered PC-compatible laptop. This was a huge deal. I brought groups of all the employees in to show it to them, including of course Tammy.",
            "created": "Sat, 16 Mar 2019 18:48:06 GMT"
        },
        {
            "text": "When she saw it she said \"I would use that computer.\" I was puzzled. \"But Tammy that computer does exactly what your Toshiba does.\" She replied, but it doesn't have all those wires. ",
            "created": "Sat, 16 Mar 2019 18:48:36 GMT"
        },
        {
            "text": "I learned something memorable there. People find computers intimidating because of all the wires. I don't blame them, I would too. That's the great thing about iPhones I guess. No wires.",
            "created": "Sat, 16 Mar 2019 18:49:27 GMT"
        },
        {
            "text": "PS: While we were testing the DG/One we were also testing the first Macintosh. Both used 3.5 inch floppy drives. But the formats weren't compatible. I tried to communicate to both companies, without violating the others' NDA that there was an opportunity to be compatible, but neither were interested. ",
            "created": "Sat, 16 Mar 2019 18:49:27 GMT"
        }
    ]
}