{
    "created": "2022-02-01T05:00:00.000Z",
    "flInCalendar": true,
    "name": "01",
    "path": "2022/02/01",
    "text": "February 01",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Interop is the answer to dominance by large companies. A perfect time to build a ring of interop now is around Wordle clones. The word of the day should be the same across all clones, and there should be a single place where users' history is stored. What an incredible demo this would be. Journalists are rarely around when the new technologies are formed. By the time they are in the loop there's the cynicism of VCs, and journalism brings its own cynicism. They listen to the money and dismiss the individual. They assume the individual never survives an onslaught from huge companies. But there are times when the money doesn't win. ",
            "created": "Tue, 01 Feb 2022 17:36:32 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2022/01/16/crossword.png",
            "flInCalendar": true
        },
        {
            "text": "Wordle",
            "created": "Tue, 01 Feb 2022 12:49:43 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I'm sorry that the NYT bought Wordle.",
                    "created": "Tue, 01 Feb 2022 12:49:51 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Part of its appeal was that it was a nice web app that had no scaling issues, written by a person who was happy not to be a billionaire, and everyone was loving it.",
                    "flInCalendar": true
                },
                {
                    "text": "Now that it's attached to the NYT, there's an element of hate there too.",
                    "created": "Tue, 01 Feb 2022 12:50:05 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I thought maybe it would show the world that ordinary people who love their GF and want to make something nice for her and decides to share it with the world and retains his human-ness -- that software can be fun and doesn't have to be the usual hot mess of greed.",
                    "created": "Tue, 01 Feb 2022 12:50:05 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "BTW this is true, software <i>is</i> made by people, not icons, and I don't blame Mr Wordle for taking the money. I just hope he stays a nice person and doesn't get caught up in being more than a human being.",
                    "created": "Tue, 01 Feb 2022 12:50:36 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "See also: <a href=\"http://scripting.com/2016/05/31/1296.html\">Your human-size life</a>. ",
                    "created": "Tue, 01 Feb 2022 12:50:58 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "A tweet worth framing",
            "created": "Tue, 01 Feb 2022 18:36:46 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "This is <a href=\"https://twitter.com/brewster_kahle/status/1488576702817079297\">quite a tweet</a> from <a href=\"https://en.wikipedia.org/wiki/Brewster_Kahle\">Brewster Kahle</a>, the archiver of the open web, about podcasting. He quotes a <a href=\"http://scripting.com/2021/04/30.html#a130520\">post of mine</a> from April of last year. Basically when you sign an exclusive deal, good for you, but it's not a podcast anymore. To say it is is false advertising.",
                    "created": "Tue, 01 Feb 2022 18:23:36 GMT",
                    "type": "outline",
                    "flInCalendar": true
                },
                {
                    "text": "You don't get tweets like this every day.",
                    "created": "Tue, 01 Feb 2022 18:36:53 GMT",
                    "inlineImage": "http://scripting.com/images/2022/02/01/niceTweet.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}