{
    "created": "2022-02-03T05:00:00.000Z",
    "flInCalendar": true,
    "name": "03",
    "path": "2022/02/03",
    "text": "February 03",
    "type": "calendarDay",
    "subs": [
        {
            "text": "<a href=\"https://github.com/scripting/opmlPackage/issues/5\">Mike Krohn is a MORE user</a> who wants to move the outlines into a text-based format so he can use them in one of today's outliners. If you have any tips leave Mike a note <a href=\"https://github.com/scripting/opmlPackage/issues/5\">here</a>. ",
            "created": "Thu, 03 Feb 2022 23:27:38 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "If, at the end of your show you say \"Available where you get podcasts,\" then my friend, you have a podcast. If you have to say \"Only available on Spotify\" (or some other exclusive service), good for you, but it's not a podcast.",
            "created": "Thu, 03 Feb 2022 23:19:56 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "When people write about <a href=\"http://daytona.scripting.com/?q=wordle&collection=scriptingnews\">Wordle</a> and why it worked, don't forget Twitter. I doubt Wordle would have worked if Twitter didn't exist.  ",
            "created": "Thu, 03 Feb 2022 17:04:48 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Three Beatles songs I'm rediscovering in a whole new way: <a href=\"https://www.youtube.com/watch?v=t1Jm5epJr10\">I Am The Walrus</a>, <a href=\"https://www.youtube.com/watch?v=HtUH9z_Oey8\">Strawberry Fields</a>, <a href=\"https://www.youtube.com/watch?v=naoknj1ebqI\">Lucy In The Sky</a>. I'm probably going to re-do my sound system just to hear these songs fully. And who knows what's next. This excursion into the Beatles is one of the best things I've ever done. It's had an impact on how I write my software, believe it or not. Sitting in an English garden, waiting for the sun. If the sun don't come you get a tan from standing in the English rain.",
            "created": "Thu, 03 Feb 2022 15:12:34 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The Beatles made some really weird videos, <a href=\"https://www.youtube.com/watch?v=NAn6iDCpK5k\">like this one</a>, for <a href=\"https://www.youtube.com/watch?v=tCXsFjzMKdc\">Your Mother Should Know</a>. It's as if they were all dancing to a different song. ",
            "created": "Thu, 03 Feb 2022 15:33:38 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Facebook should not have changed their name. They should've stuck with Facebook, the product, and turned it around the way <a href=\"https://www.nytimes.com/2002/03/23/your-money/IHT-tylenol-made-a-hero-of-johnson-johnson-the-recall-that-started.html?unlocked_article_code=AAAAAAAAAAAAAAAACEIPuomT1JKd6J17Vw1cRCfTTMQmqxCdw_PIxftm3ieka3DODmwZiPUSHpLF_kDLaLskRvsPmiiKQNJHN7tqQfV-w6pWekxgUQ7tpZXBmpMFJT4yr8exWWMwxJXLGKw4_HrwY2KwLOM62L22o1edLDGqHfCJzixneFN1sOwOEDfNugwA1fCOV-1oxIE-mKdwW8xnRmwDYyWPuvP3CxQpMcGBZx3Z9lJmUr5GXznTytfPuO0GdFlXGkuGGC0kmRs06ttaPN0XOL-ubEJzPZqj3shCTzBgP4yrBJYuRoPLlr8MsbTFrRaEzMLe1OxhXewP_-uC6jDmQQ5pHLCGP1zxXSgbtixI_i5fuT2jXMI9gV4jVldyWYogpcKlX7qZ5oYvSiM&smid=url-share\">Johnson & Johnson</a> turned around Tylenol's rep after they were hacked.",
            "created": "Thu, 03 Feb 2022 13:55:26 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Apple's boastful robot, day 2",
            "created": "Thu, 03 Feb 2022 13:30:00 GMT",
            "type": "outline",
            "description": "Apple seems to have lost the ability to sell a $1300 phone on the web. ",
            "metaImage": "http://scripting.com/images/2022/02/03/1984.png",
            "subs": [
                {
                    "text": "Following up on yesterday's <a href=\"http://scripting.com/2022/02/02/202512.html?title=applesBoastfulRobot\">boastful robot</a> piece.",
                    "created": "Thu, 03 Feb 2022 13:30:08 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I got an <a href=\"http://scripting.com/images/2022/02/03/email1.png\">email</a> from Apple saying they were sending me a new iPhone to replace the one I never got. I wasn't sure how I should feel about this, because \"replace\" is the wrong adverb, and subsequent emails implied that I was somehow responsible for returning to them the phone I never got.  ",
                    "created": "Thu, 03 Feb 2022 13:31:18 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Then I got an <a href=\"http://scripting.com/images/2022/02/03/email2.png\">email</a> that said there was a problem processing my payment. Except I had already paid for the $1300 phone in full. Since I bought it at the end last month, I had even paid the credit card bill. And I used my Apple card, so Apple has the money. And the best part of the email, which I assume was written by a human being, is they said when I visit the page on their site the information they're looking for should be obvious and it's probably not really a big thing, but what the thing is? well that remained a mystery. In case you don't believe me, I've attached a <a href=\"http://scripting.com/images/2022/02/03/email2.png\">screen shot</a> of the email.",
                    "created": "Thu, 03 Feb 2022 13:39:17 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "So I still don't have the phone. According to their website they are still \"processing\" the replacement. It has not shipped yet, however it is expected to be delivered today. ",
                    "created": "Thu, 03 Feb 2022 13:34:25 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Something is right in Cupertino. This was the company that you could buy a new computer with a credit card at an Apple store and walk out with the new machine in a minute. You didn't even have to go to the cash register, the sales person had a device they could scan the card with, and another Apple person would bring the computer out, hand it to you, and off you go. I used to marvel at this. They pioneered the use of computer technology to smooth out the buying experience, but now my local electric utility company has this down better, even my local bank. Oh how the mighty have fallen. ",
                    "created": "Thu, 03 Feb 2022 13:35:04 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I remain an Apple shareholder. I hope they can fix this. It really needs to be redone from top to bottom. If they can't handle a $1300 sale for a phone and get it delivered without incident in seven days then they should shut down everything until they can do it. Start over. Fire everyone. It's just not worth continuing if this is how you're going to do business. ",
                    "created": "Thu, 03 Feb 2022 13:49:56 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Update: Apple had tried to charge \"my\" credit card $1 and it was declined. I don't understand why they were doing that, they had already charged me $1300 plus tax, but they did. Turns out it wasn't my credit card, somehow my card number was replaced with someone else's. In all saga of incompetence and bad design, turns out their database doesn't work. Or it was hacked? For a computer company that operates a huge cloud for its customers, this is shocking. So here's a <a href=\"http://scripting.com/images/2022/02/03/status.png\">screen shot</a> of the current status of my purchase. Can you tell when they think the computer will arrive, I sure can't. ",
                    "created": "Thu, 03 Feb 2022 19:17:11 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "What me Wordle?",
            "created": "Thu, 03 Feb 2022 17:31:39 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "",
                    "created": "Thu, 03 Feb 2022 17:31:55 GMT",
                    "image": "http://scripting.com/images/2022/02/03/nowordle.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}