{
    "created": "2022-02-08T05:00:00.000Z",
    "flInCalendar": true,
    "name": "08",
    "path": "2022/02/08",
    "text": "February 08",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Every company that automates dealing with customers has to get a human involved when the system encounters a situation is can't handle. <a href=\"http://scripting.com/2022/02/08/150327.html?title=appleUpsWeather\">Apple is today's problem</a> for me. Their products are too expensive for the amount of work they make you do when they screw up.",
            "created": "Tue, 08 Feb 2022 22:40:09 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Let there be one great summer Olympics venue, and one great winter Olympics venue. We don’t build a new United Nations every four years. We have to stop consuming so much. Let the Olympics be a leader here.",
            "created": "Tue, 08 Feb 2022 20:55:17 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Dems should be running ads now nailing the Repubs for trying to destroy American democracy. It's going on right now of course, and the Repubs actually agree, and probably don't have a defense. And the evidence is going to keep coming through the winter and into spring. So there will no shortage of new material for the ads. Why not attack now?? Just run ads on social media. I'll give you $100. Dems. Come on. It's <a href=\"https://www.youtube.com/watch?v=aDm4L7gjYNs&t=60s\">showtime</a>!",
            "created": "Tue, 08 Feb 2022 15:41:21 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/08/30/beetlejuice.png",
            "flInCalendar": true
        },
        {
            "text": "What's <a href=\"https://www.axios.com/canada-covid-protests-ottawa-106646b5-bc6c-4b2b-b250-c8bbde533830.html\">happening in Canada</a> shows that the system is fragile, it depends on everyone's goodwill. Any major city could be shut down any time for very little money. A new kind of war. Yes I do think Putin is attached to this.",
            "created": "Tue, 08 Feb 2022 15:27:29 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Where are the Beatles of software?",
            "created": "Tue, 08 Feb 2022 16:47:11 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I had a lot more time to think than I had to write when the power was out. I thought about the projects I've done in my long career. My goal always was to work with other people. I'm not kidding. I wanted to be part of the Beatles of software. But, what generally would happen was that people wanted to take over my projects and work on them, without me. It has happened over and over. An unmistakeable pattern. Every time I heard about it, I was really puzzled. Some of the people were software developers who should understand that when you get someone's source code you're getting a very small thing, relative to understanding all the decisions that went into it. If you take over the project you don't know any of that. And when it has happened, for example at UserLand, I knew there was trouble when one of the developers complained that there was too much code to figure out how it worked. He couldn't understand why there was so much of it! This was a guy who had shipped real products. Why would he be surprised by this? Doesn't he understand that it takes a lot of code to create something simple and consistent, so the human mind can deal with it. I have thought about his comment for years. And why didn't he call and ask me to walk him through it. I was alive, I would have taken his call and I would have helped because it would have been an example of that elusive \"working together\" thing that I've been searching for. ",
                    "created": "Tue, 08 Feb 2022 16:47:18 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "So many more examples. A friend tried to buy Radio UserLand. I would have worked with him. He didn't have to buy it to work on it. If he wanted stock I would have given him stock. ",
                    "created": "Tue, 08 Feb 2022 16:51:57 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "My problem is that I generate a shitload of projects, and I can't keep up with all of them so they languish. Yet for some reason all I get are predators. People who want to grab, naively, as if there were something to grab. Why doesn't anyone want to collaborate?",
                    "created": "Tue, 08 Feb 2022 17:06:26 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "When someone says the first thing they want to do in Frontier (it is open source, anyone can start from where we left off) is to make an easy but very fundamental change in how it works. It would break every bit of code that had been written to run in Frontier. It meant everything would have to be written starting from scratch. Why? It's a programming environment that has had a long life. Most of the value is in the software that has been to run on top of the kernel. Whatever this new thing is, if it ever sees the light of day, it should not be called Frontier. I guess these people want to be me, and having me around would make it hard to believe that's what was happening. I guess I make what I do look like fun? Hah. It's sometimes fun, but usually hard work and sometimes it hurts. ",
                    "created": "Tue, 08 Feb 2022 16:53:22 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Then there was the colleague at Harvard who told me he was taking over OPML. His exact words. What an idiot. ",
                    "created": "Tue, 08 Feb 2022 16:55:53 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Another person, a former friend also was going to take over OPML. He somehow convinced Harvard to let him run an OPML conference at the law school. And invited people. And they came. I can't imagine what the sessions were like. Never-never land. This was in the heyday of RSS, so I guess people figured anything I did was gold and could be just taken over. Amazed, I stopped working on OPML and I hope they all lost all the money they put into it. I have no sympathy to people who are so cold and brazen and wasteful, I can't stop thinking of words to describe how heinous it is. ",
                    "created": "Tue, 08 Feb 2022 17:31:02 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It happened with RSS too of course. I was talking with many of the VCs who ended up backing RSS startups before there were any. I thought they were talking to me about doing a startup. It wouldn't be a ridiculous idea, I had experience in all areas, had run a software company, been part of an IPO, obviously I knew how to build a standard even with the main standards bodies and big companies working against me. It never got to term sheets, the first I heard about the investments were the announcements. I couldn't believe it. They basically hired people who knew nothing about any of it. I guess they felt I understood too much? Maybe I offended them, if so, if they were adults they would have asked about it. They all lost every dollar they put into these ridiculous startups. ",
                    "created": "Tue, 08 Feb 2022 16:58:18 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "And then there was Adam Curry and his partner Ron Bloom. They raised $50 million to fund their podcasting startup. They hired someone to do the tech for them. As far as I know they lost all the money their investors put in. All along all I wanted out of it was to get to build a real devteam around the idea, and try out lots of approaches. It was way too early to bet on any one model. Again I don't think they had any idea what I do and how you make the tech work. Adam did understand the basic idea. There was no overlap in what I did and what they did. But they thought all they needed was to hire someone who supposedly did what I do. How could people be so stupid.",
                    "created": "Tue, 08 Feb 2022 17:12:29 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Then there was <a href=\"http://daytona.scripting.com/?q=twittergram&collection=scriptingnews\">TwitterGram</a>, which was Instagram before there was an Instagram. I actually managed to sell that to an incubator, but it was so weird all they wanted was to rip me off for my expenses. I ended up launching bit.ly for them, and I was paid $25K or so. I don't think they even bothered to find out what TG was. Wasn't it obvious that Twitter had left this huge open door -- no images. We knew users loved them, Flickr was already a big deal. That one would have made billions. It was ready to go.  Again, I don't think they were listening when I told them about it and demo'd it for them. Why? Why couldn't they hear it? I wasn't keep it anything like a secret, btw, it was all over my blog.",
                    "created": "Tue, 08 Feb 2022 17:14:37 GMT",
                    "image": "http://images.scripting.com/archiveScriptingCom/2008/05/15/postman.jpg",
                    "flInCalendar": true
                },
                {
                    "text": "I could keep going for a long time here. ",
                    "created": "Tue, 08 Feb 2022 17:16:45 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "So I was thinking about the Beatles of software. The closest anyone got as far as I know was Jobs and Woz, but I don't think that lasted very long. I don't know. So 48 hours with nothing to distract, got me to look deeper and question why I keep doing this stuff. It makes more sense that I spent the last four years prior to 2021 working only for myself. Last year I spent making software for others. I put a lot of time into it, wrote good docs, etc. The next thing I do might once again be for myself. Maybe that's all there is left now. But maybe there's still some collaboration possible. ",
                    "created": "Tue, 08 Feb 2022 17:00:29 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Reality is always good imho. ",
                    "created": "Tue, 08 Feb 2022 17:21:16 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Apple + UPS + weather",
            "created": "Tue, 08 Feb 2022 15:03:27 GMT",
            "type": "outline",
            "description": "Apple products are too expensive for the amount of work they make you do when they screw up.",
            "subs": [
                {
                    "text": "Apple, UPS and snow are a bad combo. ",
                    "created": "Tue, 08 Feb 2022 15:03:32 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "In good weather, I would have gotten my new phone on Jan 31. But the weather wasn't good, so it was delayed. On Feb 2 the case arrives. No phone, which just a guess, was stolen at UPS waiting for better weather. Apple said they were sending another phone but Apple's system lost my credit card number. That took a couple of days to sort out, and lots of time on the phone track down their system error -- somehow my credit card number was replaced on their server with someone else's number. Pretty disturbing considering Apple is a <i>computer</i> company. So that delayed them sending the replacement for the lost or stolen phone. Too bad for Dave because that was when we had good weather. It turned bad again, with power outages, and networks down, and now the second phone is caught in the <a href=\"http://scripting.com/images/2022/02/08/upsScreen.png\">UPS system</a>, and who knows when I'll actually get the phone. Thinking about asking for my money ($1300) back and buying the same phone at Amazon. Maybe their luck will be better. Both companies screwed up here, and neither of them has been willing to assign someone to fix the problem, and ignore what the computer tells them to do and get the phone to the customer already. I'm not at the North Pole. I have a car, the roads are clear, but it's looking like they lost this phone too. ",
                    "created": "Tue, 08 Feb 2022 15:03:45 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Screen shot from Apple store gives a clear picture of where we're at.",
                    "created": "Tue, 08 Feb 2022 15:10:39 GMT",
                    "inlineImage": "http://scripting.com/images/2022/02/08/appleStoreScreen.png",
                    "flInCalendar": true
                },
                {
                    "text": "All the Apple people have been nice, mostly overworked but polite and considerate. At one point I noted that we're just cogs being run by the computer bosses, software that ate our world, and they are making mistakes, and humans still have to do what they say. I think this is why everyone wants change. It's not nice to think where this is going. ",
                    "created": "Tue, 08 Feb 2022 15:11:15 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}