{
    "created": "2022-02-11T05:00:00.000Z",
    "flInCalendar": true,
    "name": "11",
    "path": "2022/02/11",
    "text": "February 11",
    "type": "calendarDay",
    "subs": [
        {
            "text": "It's harder for people to work together if their software doesn't.",
            "created": "Fri, 11 Feb 2022 15:14:25 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Update on the <a href=\"http://daytona.scripting.com/?q=iPhone%2013&collection=scriptingnews\">iPhone 13 Max</a>. It did not arrive yesterday. For a few hours last night the UPS report went back to saying there was an emergency that supposedly prevented the delivery. But this morning it's back on the truck. I <a href=\"https://twitter.com/davewiner/status/1491938203296751616\">posted</a> about it on Twitter after yesterday's no-show, the fifth such day, and got a response from Apple support. I gave them the order number via DM. They wanted lots of details but what did I need to say beyond \"I paid the money, I want the phone, or refund the money.\" For a company of Apple's size this shouldn't be hard unless it's a common occurrence. ",
            "created": "Fri, 11 Feb 2022 16:34:20 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "An interesting NBA trade -- former Knicks future-superstar <a href=\"https://www.espn.com/nba/story/_/id/33261228/sources-dallas-mavericks-trading-kristaps-porzingis-washington-wizards-spencer-dinwiddie-davis-bertans\">Kristaps Porzingas</a>, was traded to the Washington Wizards. There was a time when he was the hope of the future of all Knicks fans. 7' 3\" and he could shoot from downtown, defend, and do layups even. He was called a unicorn. But he left town in a huff, he hated the Knicks, and we did too then, so it was hard to blame him. And then things looked good for one year, but it didn't feel right, and they let go some of the people who made it work last year and brought in a couple of people who didn't really help, and the <a href=\"https://nypost.com/2022/02/09/knicks-rj-barrett-out-for-warriors-matchup-with-ankle-sprain/\">new Bright Hope</a> for the future isn't exactly bright. I wonder if he isn't getting tired of the Knicks spiraling-down culture by now. On the other hand the Knicks did beat the closest example of the Beatles of the NBA last night. A miracle! I didn't watch the game though. ",
            "created": "Fri, 11 Feb 2022 15:36:02 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/11/09/porzingas.png",
            "flInCalendar": true
        },
        {
            "text": "I heard on the <a href=\"https://www.wnyc.org/story/perfect-name-sports-franchise\">Brian Lehrer podcast</a> that the former Washington Redskins have <a href=\"https://apnews.com/article/washington-commanders-nfl-ae58a5d454501417d66b207259486b14\">changed</a> their name to the Washington Commanders, a stupid name. Their name should be the Washington <a href=\"http://scripting.com/2014/11/17/redskinsAmericans.html\">Americans</a>. I explained why <a href=\"http://scripting.com/2014/11/17/redskinsAmericans.html\">in 2014</a>. It's obviously the correct name, how come their process didn't come up with it. ",
            "created": "Fri, 11 Feb 2022 19:31:08 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Journalism, you can't have one standard for Repubs and another for Dems and have our trust.  ",
            "created": "Fri, 11 Feb 2022 15:26:35 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I'm working on <a href=\"http://tweets.opml.org/\">tweets.opml.org</a> today, adding two new feed types, hopefully adding some features for sharing links into structures of tweets. ",
            "created": "Fri, 11 Feb 2022 14:41:21 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}