{
    "created": "2022-02-12T05:00:00.000Z",
    "flInCalendar": true,
    "name": "12",
    "path": "2022/02/12",
    "text": "February 12",
    "type": "calendarDay",
    "subs": [
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1492588343367974912\">Poll</a>: Do you care about the SuperBowl?",
            "created": "Sat, 12 Feb 2022 20:43:48 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1492588343367974912",
            "flInCalendar": true
        },
        {
            "text": "I fixed a bug. There's an <a href=\"https://github.com/scripting/opmlPackage/issues/6\">encoding mismatch</a> between text coming from Twitter through its API, which is encoded in UTF-8, and text in OPML files which is encoded in ISO-8859-1. In outlines that only contain tweets the fix is simple.",
            "created": "Sat, 12 Feb 2022 17:23:05 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Perhaps part of Covid burnout is the realization at how insignificant our lives are. Almost 1 million dead, life goes on. Everyone wants to get back to normal. Maybe at a conscious level we don't get that indifference to human life also applies to those of us who are still alive.",
            "created": "Sat, 12 Feb 2022 14:41:37 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The <a href=\"https://www.cnet.com/tech/gaming/thank-you-wordle-its-been-fun/\">greatness of Wordle</a> is that it's made by one person. In the future, I hope, people will be amazed that it was considered normal for huge corporations to make software. Try to imagine Exxon writing I Am The Walrus. ",
            "created": "Sat, 12 Feb 2022 18:47:00 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The continuing saga of my <a href=\"http://daytona.scripting.com/?q=iPhone%2013&collection=scriptingnews\">iPhone 13</a> Pro. Of course it did not arrive yesterday even though UPS said it would arrive by 7PM. They're saying it once again <a href=\"http://scripting.com/images/2022/02/12/todaystatus.png\">today</a>. I signed up to receive updates on delivery events and in the first email they sent the full log of UPS actions with the second phone Apple shipped after UPS apparently lost the first phone. This log starts on Feb 4. I ordered the phone on Jan 27. The log is so long that i had to take two screen shots: <a href=\"http://scripting.com/images/2022/02/12/part1.png\">Part 1</a>. <a href=\"http://scripting.com/images/2022/02/12/part2.png\">Part 2</a>. Apple Support, after requesting I send them a DM on Twitter, hasn't responded after ~36 hours. $1300 plus tax, paid on 1/27, 16 days ago. We had two storms in this period, and one 2-day power outage, to be fair to Apple and UPS, but -- if they had delivered it in a timely fashion all that would have happened while I had my iPhone. They also mysteriously changed my credit card in their system and then tried to charge $1 to the account and it failed, holding the delivery up by 24 hours, and requiring me to spend an hour on the phone with an Apple person before even considering the possibility that they had the wrong number. To anyone who trusts Apple to store their data, this is something to be concerned about. Also I understand this happens frequently to customers. Maybe Apple is short-staffed, there is a labor shortage in the US. And stealing products while they are in shipment is a big problem, getting bigger all the time. ",
            "created": "Sat, 12 Feb 2022 14:09:16 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/08/15/chihuahua.png",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://en.wikipedia.org/wiki/Here,_There_and_Everywhere#Inspiration_and_background\">McCartney began writing</a> Here, There and Everywhere at Lennon's house in Weybridge while waiting for Lennon to wake up. He recalled: \"I sat out by the pool on one of the sun chairs with my guitar and started strumming in E. And soon had a few chords, and I think by the time he'd woken up, I had pretty much written <a href=\"https://www.youtube.com/watch?v=xdcSFVXd3MU\">the song</a>, so we took it indoors and finished it up.\"",
            "created": "Sat, 12 Feb 2022 18:29:18 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Théo Rysselberghe",
            "created": "Sat, 12 Feb 2022 17:16:49 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2022/02/12/canalInFlanders.png",
            "subs": [
                {
                    "text": "<a href=\"https://www.wikiart.org/en/theo-van-rysselberghe/canal-in-flanders-1894-1\">Canal in Flanders</a>, 1894.",
                    "created": "Sat, 12 Feb 2022 17:16:52 GMT",
                    "inlineImage": "http://scripting.com/images/2022/02/12/canalInFlanders.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}