{
    "created": "2022-02-13T05:00:00.000Z",
    "flInCalendar": true,
    "name": "13",
    "path": "2022/02/13",
    "text": "February 13",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I am <a href=\"https://twitter.com/davewiner/status/1492891287095320578\">tweeting</a> via RSS. This is fun. :boom:",
            "created": "Sun, 13 Feb 2022 23:06:01 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "iPhone 13 Pro, day 17",
            "created": "Sun, 13 Feb 2022 14:26:43 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "The <a href=\"http://daytona.scripting.com/?q=iphone%2013&collection=scriptingnews\">saga</a> continues...",
                    "created": "Sun, 13 Feb 2022 14:31:51 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I've been feeling pretty good lately, but when I have an interaction with Apple, I think seriously I should just write off the $1300 I paid for the iPhone 13 Pro and get a high-end Android phone. I probably won't because I'm locked in to so many Apple services. Sigh. ",
                    "created": "Sun, 13 Feb 2022 14:06:55 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Anyway, 17 days after buying the phone from Apple, $1300 plus tax, it is still not here. <a href=\"http://scripting.com/images/2022/02/13/upsAdvisory.png\">UPS says</a> it will be delivered tomorrow, but they've said that every day in the last week. The weather has been great, spring-like, sunny. They say it's an emergency. I think the emergency is they don't have the phone and their system is lying when it says it's on the truck and out for delivery. It's fair to assume it will not be here tomorrow, or ever. ",
                    "created": "Sun, 13 Feb 2022 14:27:17 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "On Tuesday in a call to Apple at 1-800-MYAPPLE, they said they were making an escalation request, but when I called the same number just now they said the same thing. I guess the earlier request must've gotten lost too. I tried working with Apple Support on Twitter, but they were even more obnoxious. They seriously told me it was my job to find the person to talk to at UPS who is holding up the delivery and work with them. If they had told me that when I bought the phone I would have found another way to buy it because I refuse to get involved with UPS which is an ancient rust belt company that has no ability to work with ordinary people (and they're really rude about it). Apple chose UPS, not me. I paid <i>Apple</i> for a phone, not UPS. ",
                    "created": "Sun, 13 Feb 2022 14:27:44 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Anyway the response I got from Apple Support on Twitter is utterly unbelievable. Here's a <a href=\"http://scripting.com/images/2022/02/13/appleCustomerService.png\">screen shot</a>. ",
                    "created": "Sun, 13 Feb 2022 14:28:58 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "They're doing something a lot of companies do on Twitter, saying they acknowledge your feeling of frustration or whatever. This is called <a href=\"https://en.wikipedia.org/wiki/Gaslighting\">gaslighting</a> and maybe someone in sales thinks the customer likes to be gaslighted. Maybe they weren't angry before you gaslighted them, but you can be sure they are after you do it. ",
                    "created": "Sun, 13 Feb 2022 14:34:12 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I called Apple this morning and got a more professional response. I'm waiting another three days to find out if they're going to return the money. The person recited some boilerplate saying that Apple will issue the refund when they receive the phone. I stopped her and repeated <i>I don't have the phone</i> so I can't return it.  If I were them, I'd have someone drive the freaking phone to me from an Apple store in the area. That is, if this is an uncommon occurrence. If they depend on their customers doing work for them to get their product, I expect for most people that will be a bridge too far. For me it is. When I buy a luxury item, and that's what this is, I want to be treated with basic respect. And I want to use the freaking product, not argue with Apple about who has to do what. They have to do it, I'm the customer. I paid for this experience. Geez Louise. ",
                    "created": "Sun, 13 Feb 2022 14:29:22 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Steve Jobs used to lecture on this. He told a story that I can't find a reference to right now, about how he wanted the person buying the Apple product to take it home, open it up, and have everything just work. He wanted all the glitches gotten rid of. I did a <a href=\"https://www.google.com/search?q=steve+jobs+on+customer+experience+taking+an+apple+product+home+from+store&rlz=1C5CHFA_enUS743US747&sxsrf=APq-WBvnj_IQeqJI5c3sHrI_AhRy2eDX5g%3A1644761941984&ei=VRMJYu7fO7ajptQP-M2FiAU&ved=0ahUKEwiu3qra7_z1AhW2kYkEHfhmAVEQ4dUDCA4&uact=5&oq=steve+jobs+on+customer+experience+taking+an+apple+product+home+from+store&gs_lcp=Cgdnd3Mtd2l6EAM6BwgAEEcQsAM6BAgjECc6BAghEApKBAhBGABKBAhGGABQtRBY2yZg2ydoA3ABeACAAdABiAGFDJIBBjE5LjAuMZgBAKABAcgBCMABAQ&sclient=gws-wiz\">quick search</a> and found lots of praise for Apple as a customer service company. Well these people who write so gushingly about their customer service prowess should check it out again. I don't think this is remotely the same company it was just a few years ago. ",
                    "created": "Sun, 13 Feb 2022 14:21:32 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}