{
    "created": "2022-02-19T05:00:00.000Z",
    "flInCalendar": true,
    "name": "19",
    "path": "2022/02/19",
    "text": "February 19",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I don't watch All-Star games ever since I realized that players never play defense, esp in the NBA. I also understand that sports are pretty meaningless even for \"real\" games. All-Star games are two levels of meaningless. That's as they say a bridge too far for me. ",
            "created": "Sat, 19 Feb 2022 16:32:53 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"http://scripting.com/images/2022/02/19/corruptHeadline.png\">This</a> is exactly the kind of <a href=\"http://scripting.com/images/2022/02/19/corruptHeadline.png\">headline</a> journalists fight you on if you say journalism did this or that. Facebook didn't do this, people who use Facebook did. Yeah it matters. Probably a good <a href=\"https://www.theverge.com/2022/2/19/22941291/facebook-canada-trucker-convoy-gofundme-groups-viral-sharing\">piece</a>, spoiled by a corrupt headline.",
            "created": "Sat, 19 Feb 2022 14:24:00 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Why didn't Zuck fight back?",
            "created": "Sat, 19 Feb 2022 16:41:39 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2022/02/19/facebookstockoversixmonths.png",
            "subs": [
                {
                    "text": "I saw a comment that <a href=\"http://scripting.com/images/2022/02/19/facebookstockoversixmonths.png\">Facebook lost</a> half its market cap because they changed the company's name to Meta. It rings true. It was a really stupid move. ",
                    "created": "Sat, 19 Feb 2022 16:41:49 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "They changed their name because journalism has the power to shape public opinion and markets and they've been trashing the company name, confusing the company with the platform and the user community. It's amazing to me how much power they still have.",
                    "created": "Sat, 19 Feb 2022 16:50:52 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "A few years ago they decided as if by osmosis to conflate the company with the things users do with their service. When the users do something evil, they say Facebook did it. It's beyone inaccurate. Underneath the error it seems to me there must be malice. ",
                    "created": "Sat, 19 Feb 2022 16:50:59 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Say it often enough and it sticks in the mind. ",
                    "flInCalendar": true
                },
                {
                    "text": "Facebook == evil. Over and over and over.",
                    "created": "Sat, 19 Feb 2022 16:51:03 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "So rather than try to clean up Facebook as a brand name, they just changed the name of the company and tried to disown the biggest cash cow ever. ",
                    "created": "Sat, 19 Feb 2022 16:51:04 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Funny thing is that Facebook the company has the best propaganda machine ever invented, but they don't use it for that purpose. If Zuck et al had chosen to usurp journalism's name shaping ability he could probably have destroyed them. ",
                    "flInCalendar": true
                },
                {
                    "text": "It wouldn't have made a difference to me or other people who don't have the power, but you wonder why they didn't use it? ",
                    "flInCalendar": true
                },
                {
                    "text": "Sure journalism would have screamed bloody murder. So what. Let them scream. ",
                    "created": "Sat, 19 Feb 2022 19:56:54 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PS: Recall that the word \"Facebook\" has <a href=\"http://scripting.com/2021/09/17/153104.html?title=facebookIsAtLeastEightThings\">at least 8 meanings</a>.",
                    "created": "Sat, 19 Feb 2022 19:56:55 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Everett Dirksen could tell a story",
            "created": "Sat, 19 Feb 2022 16:04:22 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2022/02/19/dirksen.png",
            "subs": [
                {
                    "text": "The other day I thought of <a href=\"https://en.wikipedia.org/wiki/Everett_Dirksen\">Everett Dirksen</a>, former Republican senator from Illinois. Probably hadn't thought of him in decades.",
                    "created": "Sat, 19 Feb 2022 16:04:30 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "As a kid, I found him endlessly entertaining. He was a funny looking guy and had a froggy kind of voice, but he told great stories, the kind of stories a pre-teen kid could get into.",
                    "created": "Sat, 19 Feb 2022 16:05:25 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Here's a <a href=\"https://www.youtube.com/watch?v=7Au2-J-3on0\">video</a> of Dirksen telling a story about lobbying.",
                    "created": "Sat, 19 Feb 2022 16:05:13 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Then I wondered what happened to the American politicians who could tell a story? There aren't many. Certainly not in Congress or the executive branch, or even the court. ",
                    "flInCalendar": true
                },
                {
                    "text": "I think this is a bigger problem than it first appears. Because to be good at telling a story is being good at relating to other humans. ",
                    "flInCalendar": true
                },
                {
                    "text": "But Trump is a good storyteller. People think that Trump resonated with his supporters because they're racists and narcissists, like Trump, but it could just be that he can tell a story. ",
                    "created": "Sat, 19 Feb 2022 16:11:11 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "His stories always have him as the hero, and tend to blame immigrants, people of color for all the problems, but a Woodie Guthrie or Will Rogers for example might get the same people to vote Democratic. That is if you still believe in the basic goodness of most people, which I desperately try to cling to.",
                    "created": "Sat, 19 Feb 2022 16:17:13 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}