{
    "created": "2022-02-27T05:00:00.000Z",
    "flInCalendar": true,
    "name": "27",
    "path": "2022/02/27",
    "text": "February 27",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I have to say I didn't give my paternal grandfather, <a href=\"http://daytona.scripting.com/?q=Baruch%20Winer&collection=scriptingnews\">Baruch Winer</a>, enough respect when I was young. He loved to talk, but didn't listen. He wore hearing aids. My mother, his daughter-in-law, was pretty sure he turned them off when we came to visit. Whenever we said anything he'd go \"What what did you say?\" So you'd say it again, at the top of your voice, and he still wouldn't hear. Repeat this a few times and remember your job is to listen. The things he said made no sense to me, a well-fed youngster in the America of the 1960s.  We listened. We tried. Every so often he'd use strange words like oligarch and plutocracy. He had the idea that my brother and father and I would join him in an uprising against the plutocracy. He'd say \"It's the plutocrracy, Daveed!\" in his thick Russian accent. These words were strange then, but it's funny how we use these words fairly regularly today. He had a vision of what was to come. One thing he said, loudly and clearly, I remember very well. \"David, some day the Nazis will come to America and this is what I want you to do.\" After a short pause he said the next part slowly. \"Get a gun. Go up on the roof -- and shoot them!\" My mother was horrified. He wasn't kidding. I wrote this off as the ramblings of an old and crazy man, out of touch with the world as it was then, in modern America where we flew coast to coast on 747s and listened to rock and roll, as he ranted in his row house in <a href=\"https://en.wikipedia.org/wiki/Canarsie,_Brooklyn\">Cararsie</a> in Brooklyn about a long-gone world in the old country. Here's why I'm telling this story today. My grandfather and his family ran for their lives in World War II, from the Nazis. They were living in <a href=\"http://daytona.scripting.com/?q=Bucharest&collection=scriptingnews\">Bucharest</a>, Rumania at the time. Before that they came from Odessa, Ukraine. Now, here we are, decades later, and once again, the old man's vision was perfect. I don't see myself getting on a roof and shooting Nazis, when they come -- but when I listen to the Ukraine people, many of whom not surprisingly <a href=\"https://twitter.com/EnglishUkraine/status/1497986717470580744\">look like me</a>, teachers, programmers, doctors, clerks, people from all walks of life, going up on the roofs of Kyiv and Odessa to shoot at Putin's soldiers who I guess are not all that different from Nazis. ",
            "created": "Sun, 27 Feb 2022 18:12:25 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2022/02/27/boozerAndLittleDave.png",
            "flInCalendar": true
        },
        {
            "text": "Today was my 100th Peloton ride. I'd say it's an everyday thing with me now. ",
            "created": "Sun, 27 Feb 2022 18:12:04 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}