{
    "text": "Good morning so-called Warrior fans!",
    "created": "Tue, 13 Jun 2017 12:04:24 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Yes there might be one or two real Warrior fans in the Bay Area. If you went to see them play in Oakland before Curry etc, then you're a real fan. If not, tell me why you care? Nothing exciting about a top team that acquires more top talent simply to make it past another team in the finals. ",
            "created": "Tue, 13 Jun 2017 12:11:11 GMT",
            "image": "http://scripting.com/2015/03/25/shrek.png",
            "permalink": "http://scripting.com/2017/06/13.html#a080611"
        },
        {
            "text": "Not that I'm crazy about Cleveland, they're the Eastern Division equivalent of the Warriors (I refuse to call them by their cute nickname, basketball is not a cute sport). ",
            "created": "Tue, 13 Jun 2017 12:11:29 GMT",
            "permalink": "http://scripting.com/2017/06/13.html#a080629"
        },
        {
            "text": "You have to suffer, for a long time, before you <i>earn</i> the title. Sport is highly moral. There's nothing exciting about winning the title using a checkbook. The Warriors are interesting in the same way the character played by <a href=\"http://www.vanityfair.com/hollywood/2017/06/silicon-valley-recap-haley-joel-osment-interview\">Haley Joel Osment</a> in Silicon Valley is interesting. ",
            "created": "Tue, 13 Jun 2017 12:04:42 GMT",
            "permalink": "http://scripting.com/2017/06/13.html#a080642"
        },
        {
            "text": "Now I look forward to seeing how many of the big <i>free agent</i> stars Cleveland and Golden State can re-sign. :cat:",
            "created": "Tue, 13 Jun 2017 12:08:01 GMT",
            "permalink": "http://scripting.com/2017/06/13.html#a080601"
        },
        {
            "text": "PS: I do feel happy for JR Smith and Iman Schumpert, two guys who the Knicks failed who just needed the kind of leadership an <a href=\"https://en.wikipedia.org/wiki/LeBron_James\">LBJ</a> can provide.",
            "created": "Tue, 13 Jun 2017 12:08:24 GMT",
            "permalink": "http://scripting.com/2017/06/13.html#a080624"
        },
        {
            "text": "PPS: When the Mets made the World Series in 2015 there were lots of people wearing Mets hats in NYC. It was so funny. Before that, a Mets-hat-sighting was a rare thing. Almost always got a nod and a thumbs up, because Mets fans were so rare. ",
            "created": "Tue, 13 Jun 2017 12:25:38 GMT",
            "permalink": "http://scripting.com/2017/06/13.html#a080638"
        },
        {
            "text": "PPPS: The Mets were one of two teams in MLB who were not the #1 team in a single county in the US. Can you name the other team? (The Mets are now more popular than the Yankees in NYC, though I don't expect that to last.)",
            "created": "Tue, 13 Jun 2017 12:26:45 GMT",
            "permalink": "http://scripting.com/2017/06/13.html#a080645"
        },
        {
            "text": "PPPPS: The Knicks suck, <a href=\"http://thesaurus.land/?word=perennial\">perennially</a>. Largely because of an inept narcissistic owner. So do the Nets. It's not unusual that NY basketball teams have the highest payroll, we are the largest, richest city in the US after all. But we can't seem to manage a team. Even when we get a <a href=\"https://en.wikipedia.org/wiki/Jeremy_Lin#New_York_Knicks_.282011.E2.80.932012.29\">gift</a> it's rejected as not sufficiently pious. ",
            "created": "Tue, 13 Jun 2017 12:27:38 GMT",
            "permalink": "http://scripting.com/2017/06/13.html#a080638"
        },
        {
            "text": "PPPPPS: I would not be opposed to NYC trading the Nets for another more interesting team. Like perhaps the Milwaukee Bucks? I like their style. They would be a good NY team. Nothing like that of course will ever happen, but a fan can dream.",
            "created": "Tue, 13 Jun 2017 12:29:37 GMT",
            "permalink": "http://scripting.com/2017/06/13.html#a080637"
        },
        {
            "text": "PPPPPPS: Failing that it would be cool to have Dolan sell the team to someone with a better organized brain. I thought former Mayor Bloomberg would be a good NBA team owner. ",
            "created": "Tue, 13 Jun 2017 12:32:15 GMT",
            "permalink": "http://scripting.com/2017/06/13.html#a080615"
        }
    ],
    "permalink": "http://scripting.com/2017/06/13.html#a080624"
}