{
    "text": "Steve Jobs as Frank Lloyd Wright",
    "created": "Mon, 04 Oct 2021 14:21:42 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "<i>This piece was originally published on October 6, 2011, the day after [[Steve Jobs]] died, ten years ago tomorrow. </i>",
            "created": "Mon, 04 Oct 2021 14:21:52 GMT",
            "flInCalendar": true
        },
        {
            "text": "In 1983, my little software <a href=\"http://en.wikipedia.org/wiki/Living_Videotext\">company</a> was lucky to be invited to work on Apple's new computer in development, the Macintosh. Back then Apple wasn't as secretive as it is today. Everyone knew something was coming. We knew what it was called, but no one was saying what it was.  ",
            "created": "Mon, 04 Oct 2021 14:22:47 GMT",
            "flInCalendar": true
        },
        {
            "text": "I gladly signed the agreement, and to this day I remember my first glimpse of the Mac. I arrived at a building on <a href=\"http://maps.google.com/maps?q=10460+Bandley+Drive,+cupertino,+ca&hl=en&ll=37.328093,-122.033772&spn=0.034364,0.027509&safe=off&client=firefox-a&hnear=10460+Bandley+Dr,+Cupertino,+California+95014&gl=us&t=m&z=15&vpsrc=6\">Bandley Drive</a> in Cupertino some time in August 1983, and was met by Mike Boich and [[Guy Kawasaki]] from the Mac team. As we walked to the conference room, I saw, out of the corner of my eye, a beige plastic box that was small and upright. And personal. How it said that to me, in just a glimpse, I have no idea. Is that a computer? Another thought popped into my head: It said \"I'm new.\" And that was something because back in those days everything was new. And it was personal, for me. All this from a fraction of a second look.  ",
            "created": "Mon, 04 Oct 2021 14:24:25 GMT",
            "flInCalendar": true
        },
        {
            "text": "Before that I had been an Apple II developer for a number of years, and was a devotee of Apple's products, though I also loved IBM's PC. There was a sense that we were all creating a new world, we all loved our work -- and Jobs and the people he nurtured at Apple, were leaders. I was on stage during the rollout of the Mac at Flint Center on <a href=\"http://www.wired.com/science/discoveries/news/2008/01/dayintech_0124\">January 24, 1984</a>. We shipped our product later that year and went on to have one of the first hits for the Mac. ",
            "created": "Mon, 04 Oct 2021 14:25:03 GMT",
            "flInCalendar": true
        },
        {
            "text": "But I want to tell a different story. Not a personal one, because I did not have a personal relationship with Steve Jobs. However, I built products that made it to market through his platforms. And in doing so, my vision was shaped by his. And later, with podcasting and RSS, I got to influence the direction of his products.  ",
            "flInCalendar": true
        },
        {
            "text": "I wish Jobs had been a blogger, had written about his design process, so I could quote something. But he was the opposite of a blogger. Jobs was a mass communicator. No one in my generation has mastered the art as Jobs did. Today, with the outpouring of feeling on the net, are people mourning the man, or the phenomena he could unleash, just by saying \"One more thing.\" ",
            "flInCalendar": true
        },
        {
            "text": "And he was a designer, even though people seem to be overlooking that in their remembrances, calling him more of a visionary. He got down in there and made small but very important design decisions about his products. Ones that had wide impact, for better, or worse. And often they weren't things his products did, rather things his products didn't do that defined them. ",
            "flInCalendar": true
        },
        {
            "text": "The Mac was full of them. No cursor keys, so you had to use the mouse to navigate. I doubt if money was the reason, though leaving out the cursor keys probably saved a bit, and allowed the other keys to be bigger. It also meant Apple had to design its own keyboard, because they all had cursor keys. ",
            "flInCalendar": true
        },
        {
            "text": "No hard drive. No expansion slots. No fan. ",
            "flInCalendar": true
        },
        {
            "text": "A standardized user interface. This was very controversial with software developers such as myself. We felt what we did was user interface design. What would we do if the UI was already designed. New ideas sometimes don't get accepted right away by everyone.  ",
            "flInCalendar": true
        },
        {
            "text": "And there were the almost-great ideas, like having networking built into every Mac starting with the Mac Plus. At the time networking wasn't even an option on IBM PCs. The networking, while a bold and great idea, didn't have the impact it should have had because the programming APIs were impossibly difficult. Had they been easy the Mac would have been the web, and we could have saved 20 years of incremental upgrades to turn the web into what the Mac was in 1984. #",
            "flInCalendar": true
        },
        {
            "text": "And at times Steve forgot where his ideas came from, or seemed to. He tormented Bill Gates, probably in jest, that he was stealing his ideas from Apple, when they both stole from Xerox. ",
            "flInCalendar": true
        },
        {
            "text": "I had some personal interactions with Jobs, but they weren't very special. I doubt if he knew who I was. He called me once, out of the blue -- to rant about the stupidity of people at Apple. This was in 1997 just after coming back. Even today, after all these years, I have a hard time saying I agreed with him, and I didn't say so in the conversation, I just stayed silent. He doesn't suffer fools quietly, that's for sure. Ooops, he didn't. Hard to think of him in the past tense. Why did he call me then? I have no clue. #",
            "flInCalendar": true
        },
        {
            "text": "One more thing. ",
            "flInCalendar": true
        },
        {
            "text": "In the first rush of memorials, people are comparing Jobs to Henry Ford (industrialist), Thomas Edison (inventor) or Walt Disney (media). But there's also a lot of <a href=\"http://en.wikipedia.org/wiki/Frank_Lloyd_Wright\">Frank Lloyd Wright</a> in there. All these men had imperfections, and greatness. But Wright's were, imho, more Jobsian than the others.  ",
            "created": "Mon, 04 Oct 2021 14:23:47 GMT",
            "flInCalendar": true
        },
        {
            "text": "\"He's so wonderfully prickly and famous for bursting into any house he built un-announced - just come in with a troop of people and show them the house, rearrange the furniture. He would even sneak into the houses to rearrange the furniture when the owners were away,\" T.C. Boyle wrote of Wright, but it also describes how early Mac developers felt after demoing their products for Steve. ",
            "created": "Mon, 04 Oct 2021 14:23:11 GMT",
            "flInCalendar": true
        },
        {
            "text": "To both Jobs and Wright the people who used their products were not as important as the computer or the building. More than the thing itself, what mattered to Wright, and I think what mattered to Jobs is the integrity of his vision. In a way it was a shame that the vision had to be instantiated.  ",
            "subs": [
                {
                    "text": "Jobs has also been compared to Leonardo Da Vinci, but I think that's something for historians to say, a couple of hundred years from now. Honestly, even comparing him to Ford or Edison is a bit over the top, because their achievements are understood with a hundred years of perspective. We are all contemporaries of Jobs, so our judgment isn't historical. He had a lot of impact on our lives, but that doesn't necessarily translate into a historical impact.",
                    "created": "Mon, 04 Oct 2021 14:22:59 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Of course that's what made their ideas so great and influential. Among the many Jobs quotes worth remembering, and quoting -- Artists ship. I agree. And when you ship, along with the vision, comes reality. And then you learn and ship again.  ",
            "flInCalendar": true
        },
        {
            "text": "There might still be Jobs shipments to come. We don't know what's in Apple's pipeline. But his thinking and vision, his person, will influence others and drive them to greatness, for generations to come.",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}