{
    "text": "Tech and democracy",
    "created": "Thu, 06 Mar 2025 14:24:46 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I found the <a href=\"https://www.techdirt.com/2025/03/04/why-techdirt-is-now-a-democracy-blog-whether-we-like-it-or-not/\">TechDirt piece</a> by Mike Masnick about being a democracy blog disturbing because imho it should have been about democracy at least since 2017, when it was clear that Twitter had just elected a president of the United States. That was a clear strong signal that tech and democracy were tightly connected. ",
            "created": "Thu, 06 Mar 2025 14:24:58 GMT",
            "flInCalendar": true
        },
        {
            "text": "At the time I tried to <a href=\"http://scripting.com/2017/01/14/whatIfTwtrIsBoughtByARepub.html\">raise the alarm</a>, in tech and in finance, that a Republican could buy Twitter for $12B, and that was a cheap price considering the value of the presidency in a tech entrepreneur's hands.",
            "created": "Thu, 06 Mar 2025 14:28:08 GMT",
            "flInCalendar": true
        },
        {
            "text": "My experience in Silicon Valley goes back to the late 70s, so I have a pretty good understanding of the personality of tech entrepreneurs.",
            "created": "Thu, 06 Mar 2025 14:28:21 GMT",
            "flInCalendar": true
        },
        {
            "text": "My blog, <a href=\"http://scripting.com/\">Scripting News</a>, has been about democracy since <a href=\"http://scripting.com/davenet/\">inception</a>, in 1994, though it has primarily been about technology. I got the same complaints that I should stick to tech, but I didn't see a line of separation. The stakes were large then, but now they're much larger and as Masnick notes, impossible to ignore. ",
            "created": "Thu, 06 Mar 2025 14:34:12 GMT",
            "flInCalendar": true
        },
        {
            "text": "In the mid-90s there was not much of a debate whether the First Amendment applied to the web, the consensus was that it did not! The NYT didn't defend the 1st A on the web, and <a href=\"https://en.wikipedia.org/wiki/Communications_Decency_Act\">Congress passed a law</a> saying the 1st A didn't apply and a Democratic president, Clinton, signed the law. That was a pretty clear signal. (We were saved by a Federal appeals court, otherwise who knows what we'd be doing now.)",
            "created": "Fri, 07 Mar 2025 01:25:38 GMT",
            "flInCalendar": true
        },
        {
            "text": "In tech, every generation thinks they're seeing a problem for the first time. This is almost never true. It's like anything else, we're iterative, going over the same issues again and again, and we have a chance to wake up at any point and learn from our mistakes and not repeat the previous cycle, but it seems we never do.",
            "created": "Fri, 07 Mar 2025 01:26:25 GMT",
            "flInCalendar": true
        },
        {
            "text": "Most important is that we <b>work together</b> and share what we learned. But first you have to be aware that there is history. You know the <a href=\"https://www.goodreads.com/quotes/634544-those-who-cannot-remember-the-past-are-condemned-to-repeat\">famous line</a> about people who \"cannot remember the past are condemned to repeat it.\"",
            "created": "Thu, 06 Mar 2025 14:25:28 GMT",
            "flInCalendar": true
        },
        {
            "text": "We have great historians working here, and TechDirt is more famous than Scripting News is now. It would be a shame if the historians overlooked the historic connection between tech and democracy because they weren't aware it was documented much earlier than 2025. And btw -- don't miss that <a href=\"https://this.how/googleAndHttp/\">Google et al</a> would like to deprecate the archive of the early web. No one is paying attention to that problem, and it's another way history is lost. The wisdom of the Google people forcing this on the rest of us is very much like the DOGE bros in DC today. ",
            "created": "Thu, 06 Mar 2025 14:25:29 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}