{
    "text": "September 4",
    "created": "Wed, 04 Sep 2019 13:17:01 GMT",
    "name": "04",
    "subs": [
        {
            "text": "A <a href=\"http://scripting.com/2019/09/04/theOnlineSystemOfTheUnitedStates.m4a\">podcast</a> about the online system of the United States. A social network where citizenship and membership are the same thing. True to the values of the country -- of the people, by the people, for the people. Obama didn't do it. Thank god Trump hasn't. I doubt if anyone but Andrew Yang is capable of imagining it. 16 minutes. PS: The guy who runs Twitter is <a href=\"https://en.wikipedia.org/wiki/Jack_Dorsey\">Jack Dorsey</a>. And Twitter's <a href=\"https://ycharts.com/companies/TWTR/market_cap\">market cap</a> is $33 billion. ",
            "created": "Wed, 04 Sep 2019 15:10:25 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2019/09/04/theOnlineSystemOfTheUnitedStates.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "8037987"
        },
        {
            "text": "BTW, <a href=\"http://scripting.com/2019/06/05/142857.html\">Elizabeth Warren</a> is still posting her position papers to a silo. The web needs her help. Sure tech companies seem warm and cuddly, but some things we should do for ourselves. This is one of them.",
            "created": "Wed, 04 Sep 2019 14:47:50 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://deadspin.com/mets-ninth-inning-bullpen-implosion-special-even-by-met-1837857317?scrollnorefresh=1\">The Mets lost</a> last night in an unbelievable way. I watched most of the game, switching back and forth between it and MSNBC. I started to go to bed after the Mets batted in the ninth, I thought for sure the game was over, merely a formality to get the last three batters out. The Mets <a href=\"https://www.espn.com/mlb/game?gameId=401076805\">were ahead</a> 10-4. The home team, the Nationals were defeated, in a <a href=\"http://scripting.com/images/2019/09/04/turner.png\">humiliatingly stupid way</a>, not just hitting, ptiching and base-running. Well by the time I got upstairs, with the game on my iPhone, I couldn't believe the score. Runners on second and third, tying run at the plate, one out. I thought well either they win or lose, I'm going to wash up, take my vitamins, brush my teeth, etc. Just as I was grabbing the toothbrush, a <a href=\"https://www.mlb.com/video/edwin-diaz-in-play-run-s-to-kurt-suzuki\">walk-off home run</a>. I decided then and there that this was the end of the Mets season. It was a nice run, August was great, but there's no way a team comes back from this. Not even the Mets. ",
            "created": "Wed, 04 Sep 2019 13:41:15 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/09/04/mrMet.png"
        },
        {
            "text": "BTW the <a href=\"https://youtu.be/LlgZfeLDFQk?t=317\">moment</a> when the Mets lost was when Pete Alonso, \"put the icing on the cake\" with a home run to put the Mets ahead 10-4. Don't ever say stuff like that. God is listening, esp when it's the Mets. ",
            "created": "Wed, 04 Sep 2019 14:03:25 GMT",
            "type": "outline"
        },
        {
            "text": "Seriously I'm glad the Mets lost the way they did last night. It reminds me that deep inside the Mets philosophy is not about winning. It's about being the Mets. To the core. ",
            "created": "Wed, 04 Sep 2019 13:57:40 GMT",
            "type": "outline"
        },
        {
            "text": "BTW, there's a game on at 1PM Eastern today <a href=\"https://www.youtube.com/watch?v=TzVSQJFoZHI\">on YouTube</a> of all places.",
            "created": "Wed, 04 Sep 2019 13:55:11 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=TzVSQJFoZHI"
        },
        {
            "text": "Maybe it's time for Mets fans to don Knicks fans' <a href=\"http://scripting.com/images/2019/09/04/knicksFansWithBagsOnHead.png\">headware</a>. ",
            "created": "Wed, 04 Sep 2019 13:50:45 GMT",
            "type": "outline"
        },
        {
            "text": "Someone who knows please start a blog called “British Politics for Dummies.” I want to understand wtf is happening.",
            "created": "Wed, 04 Sep 2019 13:33:09 GMT",
            "type": "outline"
        },
        {
            "text": "When I lived in <a href=\"https://www.google.com/maps/place/425+Manzanita+Way,+Woodside,+CA+94062/@37.419135,-122.2471517,17z/data=!3m1!4b1!4m5!3m4!1s0x808fa438d2e58d87:0x6c0dbc392cc6bf79!8m2!3d37.419135!4d-122.244963\">Woodside</a> I would see celebrities in town, like <a href=\"https://en.wikipedia.org/wiki/Joe_Montana\">Joe Montana</a>, <a href=\"https://en.wikipedia.org/wiki/Bill_Walsh_(American_football_coach)\">Coach Walsh</a>, <a href=\"https://en.wikipedia.org/wiki/Neil_Young\">Neil Young</a>, <a href=\"https://en.wikipedia.org/wiki/Joan_Baez\">Joan Baez</a>. One time I was waiting in line at the town pharmacy the tiny woman in front of me was <a href=\"https://en.wikipedia.org/wiki/Shirley_Temple\">Shirley Temple</a>. Yesterday after picking up prescriptions at the CVS in Woodstock (I get confused because the name is so similar to Woodside) as I was walking out I saw <a href=\"https://en.wikipedia.org/wiki/Michael_Lang_(producer)\">Mike Lang</a>, one of the promoters of the Woodstock festival in 1969 (where Joan Baez played, btw). Until I saw the <a href=\"https://www.pbs.org/wgbh/americanexperience/films/woodstock/\">PBS special</a>, I didn't realize what an accomplishment it was, because they did it without enough time or people or money. Of course the moment passed, I'm glad I didn't say anything because everyone should be able to stop in at the pharmacy without meeting strangers who feel they already know them. ",
            "created": "Wed, 04 Sep 2019 13:17:02 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/09/04/shirleyTempleDoll.png"
        },
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=1VuDjJ9KIxM\">There has to be an invisible sun</a>, gives its heat to every one. ",
            "created": "Wed, 04 Sep 2019 16:51:40 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=1VuDjJ9KIxM"
        },
        {
            "text": "Persist -- a new data behavior?",
            "created": "Wed, 04 Sep 2019 14:10:20 GMT",
            "type": "outline",
            "description": "A new storage attribute called persist. It can only apply to global objects.",
            "subs": [
                {
                    "text": "In JavaScript they have <a href=\"https://www.w3schools.com/jS/js_let.asp\">const, var and let</a> which control how things are stored. Every language has these. Using \"Frontier\", I got used to having persistent data storage. If I created something in the object database, the kernel took care of persisting it. I could just use it like memory that was always there, and didn't have to worry about saving it to files. I find all the time I wish that JavaScript had this. I think I may have finally figured out how that might work. ",
                    "created": "Wed, 04 Sep 2019 14:10:36 GMT"
                },
                {
                    "text": "Here's <a href=\"https://twitter.com/davewiner/status/1168981114083598336\">the idea</a>. A new storage attribute called persist. It can only apply to global objects. You could write this:",
                    "created": "Wed, 04 Sep 2019 14:11:56 GMT",
                    "subs": [
                        {
                            "text": "persist serialnum = 0;",
                            "created": "Wed, 04 Sep 2019 14:12:45 GMT"
                        }
                    ]
                },
                {
                    "text": "Then you could do normal operations on it like:",
                    "created": "Wed, 04 Sep 2019 14:12:57 GMT",
                    "subs": [
                        {
                            "text": "serialnum++;",
                            "created": "Wed, 04 Sep 2019 14:13:09 GMT"
                        }
                    ]
                },
                {
                    "text": "Next time the app runs it already has a value. Unlike with <i>var</i> or <i>const</i> the initialization code only runs when there is no <i>persist</i> object named serialnum (i.e. the first time the app runs with this value declared).",
                    "created": "Wed, 04 Sep 2019 14:13:13 GMT"
                },
                {
                    "text": "It would be easy to implement this in the language interpreter. It might even be possible with proxies. I don't understand them well enough yet to know. I also think you could do it with somewhat less elegant code using an NPM package.  ",
                    "created": "Wed, 04 Sep 2019 14:13:56 GMT"
                },
                {
                    "text": "Matt Terrenzio <a href=\"https://twitter.com/mterenzio/status/1169244024223481856\">asks</a> \"Persist where?\" My response: Somewhere. Anywhere really. Probably in a file on the local hard drive, stored in JSON. It could be in a database or in the cloud. It should be something that the developer can override, and it should default to something simple. ",
                    "created": "Wed, 04 Sep 2019 14:15:15 GMT"
                }
            ]
        }
    ]
}