{
    "text": "September 8",
    "created": "Sun, 08 Sep 2019 14:40:20 GMT",
    "name": "08",
    "subs": [
        {
            "text": "BTW, we know for sure that whatever door we leave open, <a href=\"https://www.washingtonpost.com/politics/noaa-staff-warned-in-sept-1-directive-against-contradicting-trump/2019/09/07/12a52d1a-d18f-11e9-87fa-8501a456c003_story.html\">Trump is going</a> to go through it. It's time to believe the worst and start closing the doors <i>before</i> he gets there. ",
            "created": "Sun, 08 Sep 2019 16:25:27 GMT",
            "type": "tweet",
            "tweetId": "1170735275200385025",
            "tweetUserName": "davewiner"
        },
        {
            "text": "The heroes machine",
            "created": "Sun, 08 Sep 2019 14:40:21 GMT",
            "type": "outline",
            "description": "Nothing is too dirty that their help can't be bought to clean it up.",
            "subs": [
                {
                    "text": "<i>Where are we left after Joi Ito <a href=\"https://www.techmeme.com/190907/p8#a190907p8\">resigned</a> yesterday from positions at MIT, the <a href=\"https://twitter.com/knightfdn/status/1170465388372594693\">Knight</a> and <a href=\"https://twitter.com/macfound/status/1170443088055144448\">MacArthur</a> Foundations, <a href=\"https://twitter.com/NYTimesPR/status/1170461340768645120\">the NY Times</a> and Harvard?</i>",
                    "created": "Sun, 08 Sep 2019 14:41:10 GMT"
                },
                {
                    "text": "The scandal exposes how money is used by the very rich to help erase reputations they got as they got so rich.",
                    "created": "Sun, 08 Sep 2019 14:41:12 GMT"
                },
                {
                    "text": "It's why I wrote <a href=\"http://scripting.com/2019/09/01.html#a115048\">here</a> a week ago that the last thing I want to see is a Netflix series on the life of Bill Gates. I know the things he did to make his money. I didn't begrudge him his initial victory. He was tougher and smarter and took bigger risks than his competitors. He stared down IBM, when they deserted him, and won. That's a story that should be told, because winning there, the way he did, was heroic. ",
                    "created": "Sun, 08 Sep 2019 14:43:12 GMT"
                },
                {
                    "text": "What Gates did after he achieved dominance is where it was no longer a matter of skill and determination. It was the old layer of technology trying to prevent the new layer from booting up. As the web was growing, when the people behind it were academics with little funding and inexperienced Silicon Valley startups, he tried to kill it. And he didn't give up. It was Bill Gates vs the future. ",
                    "created": "Sun, 08 Sep 2019 14:44:38 GMT"
                },
                {
                    "text": "The future needed our protection, but the press and government, and yes -- institutions like the <a href=\"https://en.wikipedia.org/wiki/MIT_Media_Lab\">MIT Media Lab</a>, and <a href=\"https://en.wikipedia.org/wiki/John_Brockman_(literary_agent)\">Brockman</a> -- they feed off the vast fortunes people like Gates accumulate. To them it's their blood, they operate a huge PR machine and a vanity press for billionaires, and unless the ones that make the huge money need redemption to become saints, like latter-day <a href=\"https://www.npr.org/2013/08/01/207272849/how-andrew-carnegie-turned-his-fortune-into-a-library-legacy\">Carnegies</a>, they won't get to be the heroes that reputation launderers like Negroponte and Joi Ito create.  ",
                    "created": "Sun, 08 Sep 2019 14:53:20 GMT"
                },
                {
                    "text": "Nothing is too dirty that their help can't be bought to clean it up.",
                    "created": "Sun, 08 Sep 2019 14:47:11 GMT"
                },
                {
                    "text": "And what suffers? The <a href=\"https://www.miamiherald.com/news/local/article232636792.html\">young</a>, and the <a href=\"https://twitter.com/CarlosLozadaWP/status/1170677124333785089\">future</a>. That is way too big a price to help Jeffrey Epstein and Bill Gates and probably many many others, try to make themselves the heroes of our age. ",
                    "created": "Sun, 08 Sep 2019 14:47:34 GMT",
                    "image": "http://scripting.com/images/2019/09/08/theTruthCanBeAdjusted.png"
                },
                {
                    "text": "My prescription? An austerity program at places like Harvard and MIT. Create new media and see how <i>little</i> money you can spend doing it. Join the open source development world. Let us help you. Stop worshipping the billionaires, they don't know how to get us out of the corner we're in as a civilization and honestly it doesn't seem that they want to. ",
                    "created": "Sun, 08 Sep 2019 14:55:48 GMT"
                }
            ]
        }
    ]
}