{
    "text": "September 11",
    "created": "Wed, 11 Sep 2019 14:55:42 GMT",
    "name": "11",
    "subs": [
        {
            "text": "I know how to be sure Trump doesn't win in 2020. It's <i>The Trump Soap</i> as <a href=\"http://scripting.com/2019/09/11.html#a162523\">described</a> below. Here's a 12-minute <a href=\"http://scripting.com/2019/09/11/theTrumpSoap.m4a\">podcast</a> that explains. The movie I mentioned was <a href=\"https://en.wikipedia.org/wiki/Get_Out\">Get Out</a>.",
            "created": "Wed, 11 Sep 2019 18:46:30 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2019/09/11/theTrumpSoap.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "5808736"
        },
        {
            "text": "Back in the day they used to broadcast <a href=\" https://en.wikipedia.org/wiki/Soap_opera\">soap operas</a> live. I assume they wrote the scripts the day before. So it would be interesting to use the same technique to dramatize the goings-on in the White House. Don't attempt to impersonate Trump and his staff, it's not funny or interesting -- maybe even given them different names to bring that home. Have them say and do the things the people in the White House are doing. Use your imagination. They can do things that haven't been reported on, or be dramatic flourishes.",
            "created": "Wed, 11 Sep 2019 16:25:23 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/09/11/tide.png"
        },
        {
            "text": "I was reminded with a note from a Boston friend that <a href=\"http://www.radiowoodstock.com/\">Radio Woodstock is pretty great</a>. It <a href=\"https://www.iheart.com/live/radio-woodstock-7332/\">is</a>. It might be a good substitute for disappointed <a href=\"https://www.sfgate.com/music/article/KFOG-Fogheads-react-final-day-rock-alternative-14419139.php\">KFOG</a> fans, of which I know at least a couple. \"Acoustic Saturday mornings now part of my weekends!\" If you have an Echo, you can listen by saying \"Alexa WDST please.\" Easy. :rocket:",
            "created": "Wed, 11 Sep 2019 20:04:01 GMT",
            "type": "outline"
        },
        {
            "text": "Yesterday's Fresh Air <a href=\"https://www.npr.org/2019/09/10/759384251/she-said-reveals-the-people-and-practices-that-protected-weinstein\">interview</a> with the NY Times reporters who exposed Harvey Weinstein is totally worth a listen.",
            "created": "Wed, 11 Sep 2019 18:12:24 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://www.newyorker.com/culture/cultural-comment/what-if-we-stopped-pretending\">Jonathan Franzen</a>: \"The climate apocalypse is coming. To prepare for it, we need to admit that we can’t prevent it.\" ",
            "created": "Wed, 11 Sep 2019 15:57:38 GMT",
            "type": "outline"
        },
        {
            "text": "Wouldn't it be great if all the <a href=\"https://www.nytimes.com/2019/09/11/opinion/apple-keynote-2019.html\">reporters in tech</a> got <a href=\"http://scripting.com/images/2019/09/11/appleJoke.png\">together</a> to see truly new stuff, without regard of which company it came from, or if it came from a company at all? The big message no one in <a href=\"https://en.wikipedia.org/wiki/The_Establishment\">the establishment</a> wants to hear (a term that's become precise these days) is that money does not yield progress. Jobs left a <a href=\"https://www.youtube.com/watch?v=8rwsuXHA7RA\">seed</a> for you all as a clue. It's <i>people</i> that make the difference, not piles of money. That's the big reboot of news we're waiting for. For our news to stop worshipping money and get down to telling us what's new. ",
            "created": "Wed, 11 Sep 2019 15:45:37 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=8rwsuXHA7RA"
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1171808443071696896\">Twitter</a> and <a href=\"https://www.facebook.com/dave.winer.12/posts/1026082827599122\">Facebook</a> feel equally important in news today, but in the future, if the archive of Twitter survives, it will probably be the more valuable, because except for blocking, it's on the web, where Facebook has access constraints that make it not a good record.",
            "created": "Wed, 11 Sep 2019 15:45:20 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1171808443071696896"
        },
        {
            "text": "I'm helping a publication do an oral history of podcasting. The writer is earnest, thoughtful, a good person. But... Would you read a history of cars written by someone who didn't know the basics of how cars work? It'll be a miracle if something coherent comes from this.",
            "created": "Wed, 11 Sep 2019 15:43:00 GMT",
            "type": "outline"
        },
        {
            "text": "On this day in 2001",
            "created": "Wed, 11 Sep 2019 15:35:54 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I was up and blogging early <a href=\"http://scripting.com/2001/09/11.html\">on this day in 2001</a>. If you visit the site you'll find that many of the links are broken, so you might want to try the archive.org <a href=\"https://web.archive.org/web/20070118082215/http://scripting.com/2001/09/11.html\">version</a>. It's in reverse-chronologic order, so read from the bottom and scroll up. ",
                    "created": "Wed, 11 Sep 2019 14:55:43 GMT"
                },
                {
                    "text": "What the day was like for me. It started as a normal blogging and programming day. A link to an article on Wired. A plug for David Banks' book new book on Microsoft. And then the day started for real. ",
                    "created": "Wed, 11 Sep 2019 15:01:57 GMT"
                },
                {
                    "text": "At 6:15AM I got an email from Bill Seitz with a link to a webcam in the Empire State Building pointing south. The World Trade Center was in the middle of the picture, smoke was coming out of the side of one of the buildings. He said a plane had hit the building. I had no TV. Emails came from people in New York, some with pictures. People sent me links to stories via email (remember this was before RSS was supported by most news orgs). Digital cameras were just starting to catch on, readers in Brooklyn and in lower Manhattan, with clear views of the scene, sent pictures. ",
                    "created": "Wed, 11 Sep 2019 15:07:37 GMT",
                    "image": "http://scripting.com/images/2019/09/11/nineEleven.png",
                    "collapse": "true",
                    "subs": [
                        {
                            "text": "I had no TV because I turned it off. I had become obsessed with cable news after the 2000 election. Didn't like it. I turned it back on later in 2001, when we started the war in Afghanistan.",
                            "created": "Wed, 11 Sep 2019 15:36:51 GMT"
                        }
                    ]
                },
                {
                    "text": "News orgs in New York had been knocked out, I was safe in California, but I grew up in New York, so I knew the geography. And later we'd learn that my father, a professor at Pace University hadn't been heard from. My mother, a school psychologist was on a rooftop in Brooklyn. ",
                    "created": "Wed, 11 Sep 2019 16:10:32 GMT"
                },
                {
                    "text": "That day my blog served the function that <a href=\"https://twitter.com/davewiner/status/1171807703372587008\">Twitter</a> and Facebook play today. The biggest story in the world, before or since. Only as much as one person could absorb, only the questions that occurred to that person. ",
                    "created": "Wed, 11 Sep 2019 15:06:22 GMT"
                }
            ]
        }
    ]
}