{
    "text": "September 12",
    "created": "Thu, 12 Sep 2019 08:25:03 GMT",
    "name": "12",
    "subs": [
        {
            "text": "<a href=\"http://scripting.com/2019/09/12/jodiKantorOnImportanceOfJournalismProcess.m4a\">Short audio excerpt</a> of <a href=\"https://en.wikipedia.org/wiki/Jodi_Kantor\">Jodi Kantor</a> of the NY Times on <a href=\"https://www.npr.org/2019/09/10/759384251/she-said-reveals-the-people-and-practices-that-protected-weinstein\">Fresh Air</a>, on the importance of journalism process. Inspiring. ",
            "created": "Thu, 12 Sep 2019 15:03:06 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2019/09/12/jodiKantorOnImportanceOfJournalismProcess.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "573630"
        },
        {
            "text": "A minor league football coach could figure out how to beat Trump. It requires minor collaboration between the Democratic Party and the entertainment world. We need programming to go up against Trump. The programming has to be about Trump, because he's made himself the story. But it has to tell the story he doesn't want told, in as dramatic a fashion as he tells his story. It doesn't have to be good drama, it won't reach into your soul and make you cry, it doesn't need to because Trump can't do that. What it has to do is fill you with rage. Grab and hold your attention. But it must not be done by the Democratic candidate. The Republican team only has one play. It's a game where the quarterback runs. So you just fill the field with defensive backs. When Trump moves, destroy him. When he moves again, destroy him again. With what? Acting, childish pranks and low comedy. ",
            "created": "Thu, 12 Sep 2019 14:24:32 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/08/21/bloatwareBoss.png"
        },
        {
            "text": "What <a href=\"https://twitter.com/davewiner/status/1172148975908151296\">nice internet users</a> do, in a Twitter thread.",
            "created": "Thu, 12 Sep 2019 19:26:17 GMT",
            "type": "outline"
        },
        {
            "text": "Elizabeth Warren's campaign has mastered <a href=\"https://twitter.com/ewarren/status/1171538730621915136\">humble snark</a>. ",
            "created": "Thu, 12 Sep 2019 18:01:19 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/ewarren/status/1171538730621915136"
        },
        {
            "text": "If you read this blog <a href=\"http://scripting.com/email/\">via email</a>, you can now see how long it has been running, at the bottom of the email message. We're getting close to 25 years. ",
            "created": "Thu, 12 Sep 2019 21:19:26 GMT",
            "type": "outline"
        },
        {
            "text": "If someone says something to you that hurts, and on reflection you're sure it was <i>because</i> it hurts, then turn around, walk out, and never look back.",
            "created": "Thu, 12 Sep 2019 14:37:42 GMT",
            "type": "outline"
        },
        {
            "text": "It was <a href=\"https://twitter.com/ProductHunt/status/1172140471671513088\">asked</a>: If you could take the next plane to any place, where would you go? I said I'd travel in time to when I was 22 and in love. :heart:",
            "created": "Thu, 12 Sep 2019 14:35:23 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/ProductHunt/status/1172140471671513088"
        },
        {
            "text": "Sorry last night's emails didn't go out until 4:25AM Eastern instead of 12:01AM. Here's the lesson I learned. When you change the password on an account, think about the apps that connect to that account, and change them too. ",
            "created": "Thu, 12 Sep 2019 08:25:04 GMT",
            "type": "outline"
        }
    ]
}