{
    "text": "September 16",
    "created": "Mon, 16 Sep 2019 14:57:25 GMT",
    "name": "16",
    "subs": [
        {
            "text": "Kavanaugh actually <a href=\"https://www.youtube.com/watch?v=YkYpLuY-pNQ\">blamed</a> \"revenge on behalf of The Clintons\" out loud and in public in his Senate confirmation hearings. So you don't have to look to what he did with <a href=\"https://twitter.com/search?q=kavanaugh+penis&ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Esearch\">his penis</a> in the past, really, to see why he shouldn't be on the court. He's as <a href=\"http://thesaurus.land/?word=unhinged\">unhinged</a> as Trump.",
            "created": "Mon, 16 Sep 2019 19:37:51 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=YkYpLuY-pNQ"
        },
        {
            "text": "<a href=\"https://thehill.com/homenews/house/461591-nadler-trump-impeachment-needed-to-vindicate-the-constitution\">Nadler</a>: Impeachment needed to vindicate the Constitution.    ",
            "created": "Mon, 16 Sep 2019 19:10:07 GMT",
            "type": "outline"
        },
        {
            "text": "24 years, 11 months and yadda yadda. It's going to be 25 years in less than a month. I have no idea what will happen then. ",
            "created": "Mon, 16 Sep 2019 21:47:25 GMT",
            "type": "outline"
        },
        {
            "text": "We wait for proof, then it comes, and go back to waiting for proof. We think we want proof, but what we really want is to not have proof. That is if you judge us by our actual behavior. Just a bit more normal, we'll deal with the truth when we have proof.",
            "created": "Mon, 16 Sep 2019 19:07:36 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/08/07/mrWhiteBreakingBadActionFigure.png"
        },
        {
            "text": "I've had neck pain and stiffness for the last few days, but it's better and finally it's feeling good enough that I could do something, so (like a fool?) I went for a 20-minute bike ride. My legs were <i>sooo</i> ready for this. I could have easily done an hour. But I stopped at 20 hoping my recovery would continue. ",
            "created": "Mon, 16 Sep 2019 21:39:34 GMT",
            "type": "outline"
        },
        {
            "text": "A corollary of your never knowing the <a href=\"https://www.brainyquote.com/quotes/philo_103409\">struggles</a> of other people. As the people you think about grow older, the chance they're dealing with serious health issues approaches certainty. So if you make work for them that might be one reason they don't do it. This is one of the most offensive things about what <a href=\"http://this.how/googleAndHttp/\">Google</a> is doing to the web. Make-work, security theater, whose main consequence won't be a more secure web, just a web with bigger holes in it.",
            "created": "Mon, 16 Sep 2019 18:36:22 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1173647157766905856\">Braintrust query</a>: I'm being quoted in an oral history about podcasting. I haven't seen the whole piece, but have been shown two quotes, ostensibly from me, that are similar to something I might have said, but use terms that I would not have used. The quotes sort of accurate, but they aren't literal quotes. A question for journalist friends. Is this standard practice? Should I object?",
            "created": "Mon, 16 Sep 2019 16:11:21 GMT",
            "type": "outline"
        },
        {
            "text": "Someday archaeologists will uncover random pictures from this era and wonder why the primates were in <a href=\"http://scripting.com/images/2019/09/16/pain.png\">so much pain</a>.  ",
            "created": "Mon, 16 Sep 2019 18:04:56 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/LouiseMensch/status/1173658688239874048"
        },
        {
            "text": "When I was a college student in New Orleans in the 1970s, I used to hang out at restaurants and bars on <a href=\"https://en.wikipedia.org/wiki/Oak_Street_(New_Orleans)\">Oak St</a> in Uptown. It's very close to the line separating the city and Jefferson Parish, and like most political lines in the area, it's marked by a <a href=\"https://en.wikipedia.org/wiki/Levee\">levee</a>. If one side floods it doesn't necessarily mean that the other does. It was also very close to the Mississippi River, which of course also has a levee. In this case you walk up the levee, and the river comes to within a few feet of the top, way above the level of the city. If the levee were to break, a huge volume of river water would flood the city. I understood at an intellectual level how precarious this place was. But Oak St was an affluent street in a mostly affluent area. Living there you had the sense that it will always be this way. It seemed impervious to catastrophe. <a href=\"http://scripting.com/2005/12/14.html\">Thirty years later</a>, after Katrina, I came back and Oak St was destroyed. A fire had raged through the area, unchallenged by fire fighters who were gone. The civilization that seemed so dependable had folded. The people had moved to other cities. New Orleans was almost empty. The point of the story is that climate change may seem theoretical because you live near an Oak St in whatever town you are in. But its stability, the foundation it's built on, is mostly in your imagination. ",
            "created": "Mon, 16 Sep 2019 15:32:06 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/10/04/goldenGirl.png"
        },
        {
            "text": "Yesterday I described <a href=\"https://en.wikipedia.org/wiki/Succession_(TV_series)\">Succession</a> as The Sopranos without the sentimentality and intellect.",
            "created": "Mon, 16 Sep 2019 14:57:26 GMT",
            "type": "outline"
        },
        {
            "text": "I <a href=\"https://github.com/scripting/persists/commit/54895bcb87e922b3c6f5276efe4bab540a1c3a17#diff-ab9b12629ba5466b92da76fd7cfe2e37\">fixed</a> a problem in the <a href=\"https://github.com/scripting/persists\">persists</a> package yesterday. When initializing a shared object, it ignored all non-scalar fields. I was using a daveutils routine copyScalars to do the copying. I wrote a new local routine that copies everything. I can't think of a reason it should only do scalars. It came up in an application I was writing. We're at that stage in this project where I try to use it as it was designed to be used and discover that the system guy (me) didn't correctly anticipate the needs of the app developer (also me).",
            "created": "Mon, 16 Sep 2019 15:00:52 GMT",
            "type": "outline"
        },
        {
            "text": "Jimmy Cliff: <a href=\"https://www.youtube.com/watch?v=vRoJyaZW6SA\">Sitting in Limbo</a>.",
            "created": "Mon, 16 Sep 2019 19:31:06 GMT",
            "urlvideo": "https://www.youtube.com/watch?v=vRoJyaZW6SA",
            "type": "outline"
        },
        {
            "text": "<span class=\"spHowLongRunning\"></span>",
            "created": "Mon, 16 Sep 2019 21:49:43 GMT",
            "type": "outline"
        }
    ]
}