{
    "text": "September 18",
    "created": "Wed, 18 Sep 2019 14:30:15 GMT",
    "name": "18",
    "subs": [
        {
            "text": "Today's <a href=\"https://www.nytimes.com/2019/09/18/podcasts/the-daily/harvey-weinstein-lisa-bloom.html\">Daily podcast</a> is about Harvey Weinstein. The reporters covering him for the NYT got access to the notes, letters and emails of <a href=\"https://en.wikipedia.org/wiki/Lisa_Bloom\">Lisa Bloom</a>, one of Weinstein's <a href=\"https://nationalinterest.org/blog/buzz/weinstein-may-be-monster-lawyers-who-enabled-him-are-real-villans-81086\">attorneys</a>, detailing the PR and legal campaign to get the story killed. Presumably these techniques worked in the past, but this time the story came out. ",
            "created": "Wed, 18 Sep 2019 19:55:35 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=b5ykNZl9mTQ\">Heart-breaking video</a> brings home what it would be like to be a kid with an active shooter inside your school. ",
            "created": "Wed, 18 Sep 2019 19:37:12 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=b5ykNZl9mTQ"
        },
        {
            "text": "I didn't have to read this <a href=\"http://nymag.com/intelligencer/2019/09/is-elizabeth-warren-electable.html\">piece</a> about whether or not Elizabeth Warren is electable vs Trump. Of course she is. She's just beginning to hit her stride. Let's push her to the top. It's up to us to decide if she's electable.",
            "created": "Wed, 18 Sep 2019 15:10:49 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/09/18/newYorker.png"
        },
        {
            "text": "One thing I would insist on from Warren -- if she wins -- is that she keep the people organized. The campaign does not stop if she's elected, actually that's when it kicks into super high gear. That was the mistake Obama made. We had a chance to install democracy everywhere.",
            "created": "Wed, 18 Sep 2019 15:38:48 GMT",
            "type": "outline"
        },
        {
            "text": "History will not be kind to Obama re Trump and Putin. He vastly underestimated both. And showed it, in both cases, publicly. Presidents can't do that. ",
            "created": "Wed, 18 Sep 2019 15:31:22 GMT",
            "type": "outline"
        },
        {
            "text": "Dave Carlick, marketer, a friend for decades. He did the <a href=\"https://www.google.com/search?q=\" cogitank+ergo+sum\"\"=\"\">Cogitank Ergo Sum</a> campaign for us, among others. He also pioneered what he called <a href=\"https://www.google.com/search?q=carlick+\" database+marketing\"\"=\"\">Database Marketing</a>. It's what the whole tech industry is based on now. He went on to do Netscape's first website, then became a VC, and a board member lots of places, but we still hang out like we did in the early 80s. Anyway, Dave was one of the first to subscribe to my blog via <a href=\"http://scripting.com/email/\">nightly email</a>, and the other day he told me an <a href=\"http://scripting.com/2019/09/15.html#a192924\">idea I posted</a> was good. That meant the world to me. For years there has been almost zero feedback to this blog from real-world friends. ",
            "created": "Wed, 18 Sep 2019 14:53:51 GMT",
            "type": "outline"
        },
        {
            "text": "Idea for a product. Customizable search engine with prefs. I'd like to have Wikipedia page come first in all searches for which there is a Wikipedia page. I think of Google and Wikipedia as if they were two branches of government. I use them to check up on the other. That's really how search has evolved for me in 2019. ",
            "created": "Wed, 18 Sep 2019 14:52:15 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://www.wnyc.org/shows/bl\">Brian Lehrer's show</a> today is all about <a href=\"https://en.wikipedia.org/wiki/Cokie_Roberts\">Cokie Roberts</a>. How she got away with being so forcefully opinionated and holding down a job at NPR, that's something to study. ",
            "created": "Wed, 18 Sep 2019 14:49:02 GMT",
            "type": "outline"
        },
        {
            "text": "I just bought a <a href=\"https://www.apple.com/apple-watch-series-5/\">new Apple Watch</a>. I wear mine all the time. The reason I got the upgrade? Always-on screen. It's a pain when riding my bike and I want to see what's on the watch, I have to take both hands off the handlebars to get the watch to show me. So I don't do it. I'm getting $100 back for my previous Apple Watch, still in perfect shape. ",
            "created": "Wed, 18 Sep 2019 14:30:16 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1174301386932203521",
            "image": "http://scripting.com/images/2019/09/18/appleWatch5.png"
        },
        {
            "text": "I used my <a href=\"https://www.apple.com/apple-card/\">Apple credit card</a> to buy the watch. Surprised they didn't streamline that, it shouldn't have required me to enter a number. They know who I am, my identity connects the store and the card. They didn't even acknowledge that I used their card. Apple, who has often set the bar really high for marketing awareness, missed an opportunity for an obvious <a href=\"https://www.youtube.com/watch?v=hzQaEtMwBw8\">high five</a>. They should also btw give you a discount for using their card, esp in early days. ",
            "created": "Wed, 18 Sep 2019 14:40:06 GMT",
            "type": "outline"
        }
    ]
}