{
    "text": "September 19",
    "created": "Thu, 19 Sep 2019 13:28:57 GMT",
    "name": "19",
    "subs": [
        {
            "text": "<a href=\"https://twitter.com/photomatt/status/1174704774446493696\">Matt Mullenweg</a>: \"I see open source as a hack to get people to work together that would otherwise compete. We could rebuild the same thing dozens of times, or make one really awesome version. I like that IE/Microsoft is using and improving Chromium, it also keeps Google honest.\" ",
            "created": "Thu, 19 Sep 2019 15:34:49 GMT",
            "type": "outline"
        },
        {
            "text": "If you haven’t watched Succession, <a href=\"https://twitter.com/davewiner/status/1174600115232956416\">here’s</a> a preview.",
            "created": "Thu, 19 Sep 2019 14:53:40 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1174600115232956416"
        },
        {
            "text": "Thanks for reading my <a href=\"http://scripting.com/email/\">blog via email</a>. I love the comments, esp since only I see them,  there's less grandstanding, pontificating, more hey here's a book you'd like, or I listened to that podcast too.",
            "created": "Thu, 19 Sep 2019 14:15:28 GMT",
            "type": "outline"
        },
        {
            "text": "My smoothie-making has evolved. In the evening I make orange juice from concentrate to drink, with ice, while watching the <a href=\"http://scripting.com/davenet/1995/04/24/thebaseballgod.html#2\">Mets</a>. I leave about 1/2 glass for the morning, when I throw in frozen fruit, a heaping tablespoon of yogurt and a bit of warm water, and zap it in the <a href=\"https://www.amazon.com/gp/product/B00DBQ1AIG/ref=ppx_yo_dt_b_search_asin_title?ie=UTF8&psc=1\">blender</a>. Pour it into a big glass and sip it for an hour or so while I write in the morning. It's delicious, cold, tasty and nutritious. I feel very loved. ",
            "created": "Thu, 19 Sep 2019 13:40:48 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/09/19/blender.png"
        },
        {
            "text": "Advice for Stallman",
            "created": "Thu, 19 Sep 2019 13:28:58 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Yesterday I got an email from <a href=\"https://en.wikipedia.org/wiki/Richard_Stallman\">Richard Stallman's</a> PR person, <a href=\"https://www.sylviapaull.com/\">Sylvia Paull</a>, who I've known for many years. She was updating me on how he had <a href=\"https://en.wikipedia.org/wiki/Richard_Stallman#Controversy_and_resignation_from_MIT_and_Free_Software_Foundation\">lost</a> his position at <a href=\"http://web.mit.edu/\">MIT</a> and at the <a href=\"https://www.fsf.org/\">FSF</a> in recent days. Of course I had been following the story. ",
                    "created": "Thu, 19 Sep 2019 13:29:05 GMT"
                },
                {
                    "text": "I offered advice, in an email, which I am including below. ",
                    "created": "Thu, 19 Sep 2019 13:39:41 GMT",
                    "subs": [
                        {
                            "text": "I feel for Stallman. On the other hand he had a long run and was <a href=\"https://en.wikipedia.org/wiki/Richard_Stallman#Honors_and_awards\">celebrated</a> in so many ways, given an office at MIT, had a foundation. Some of us would have loved that kind of support. ;-)",
                            "created": "Thu, 19 Sep 2019 13:33:03 GMT"
                        },
                        {
                            "text": "As his PR person I think you can help by first learning from others' mistakes in these situations. There have now been lots of them. A mistake a lot of people make is trying to fight back or argue with the judgement. I don't think that works. If he has the money, taking some time off, writing software perhaps, fixing bugs in other people's stuff. Not being such a big guy for a while. Live a <a href=\"http://scripting.com/2016/05/31/1296.html\">human-size life</a>. Imagine what he could come up with if he wasn't always out traveling and evangelizing? I've done it. I even write software just for myself these days, no intention to publish ever. ",
                            "created": "Thu, 19 Sep 2019 13:33:24 GMT"
                        },
                        {
                            "text": "Best advice is to slow down, set your expectations on a longer horizon, and do some self-improvement. ",
                            "created": "Thu, 19 Sep 2019 13:33:36 GMT"
                        }
                    ]
                }
            ]
        }
    ]
}