{
    "text": "September 22",
    "created": "Sun, 22 Sep 2019 12:22:48 GMT",
    "name": "22",
    "subs": [
        {
            "text": "As usual journalism is cutting Trump too much slack. Here's what actually happened, via <a href=\"https://duckduckgo.com/?q=%22occam%27s+news%22+site%3Ascripting.com&t=h_&ia=web\">Occam's News</a>, between Trump and the <a href=\"https://en.wikipedia.org/wiki/Volodymyr_Zelensky\">Volodymyr Zelensky</a>, president of Ukraine. First, Trump doesn't care if there's an actual investigation. He wants Zelensky to say there was, and Biden & Biden are being charged with something heinous that carries the death penalty in Ukraine. That's the first round of hype. Then Ukraine files for extradition of the Bidens. Trump goes through a whole drama, trying to decide whether or not to allow Biden & Biden to be deported to Ukraine, or try them in the US, for interfering with an election in a foreign country, <a href=\"https://en.wikipedia.org/wiki/Logan_Act\">usurping</a> the perogative of the <a href=\"https://en.wikipedia.org/wiki/Donald_Trump\">US govt</a>. The press reports on <i>Trump's Decision, </i>Day 1, Day 2 and so on. Reporters camp out in front of the White House all night waiting for a decision. Finally Trump emerges with AG Barr, he decides try them here, showing surprising mercy for the Bidens, it is reported almost everywhere. After all that Ukraine quietly receives the $250 million, of course with a <a href=\"https://en.wikipedia.org/wiki/Kickback_(bribery)\">taste</a> for Trump. My guess is that all this will still happen even though it's been <a href=\"https://www.nytimes.com/2019/09/22/us/politics/trump-ukraine-biden.html\">exposed</a>. And Pelosi still will not allow impeachment. ",
            "created": "Sun, 22 Sep 2019 20:47:32 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/08/21/trumpActionFigure.png"
        },
        {
            "text": "<a href=\"https://dhh.dk/\">DHH</a> wants something like the Scripting News nightly <a href=\"http://scripting.com/email/\">email</a> for people he follows on Twitter. It's doable, the Twitter API has what's needed, but I'm not sure most tweets would look good in email. Think of the hacks people use to tell stories on Twitter. It would be easier the other way around, to take essays and turn them into a series of Tweets. Of course I have an app for that -- \"Little Pork Chop\". There's also \"Happy Friends\", a web app I wrote in 2014. It still works, but I don't use it myself anymore. Not sure why. ",
            "created": "Sun, 22 Sep 2019 17:33:32 GMT",
            "type": "outline"
        },
        {
            "text": "I bet <a href=\"https://twitter.com/davewiner/status/1175833567303278592\">Steve Jobs</a> was a Mets fan. #lgm",
            "created": "Sun, 22 Sep 2019 18:23:54 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1175833567303278592"
        },
        {
            "text": "Want a protest? Here’s a plan that would get things to change. A permanent occupation of DC by 100K people demanding impeachment. Leave when your replacement arrives.",
            "created": "Sun, 22 Sep 2019 20:19:09 GMT",
            "type": "outline"
        },
        {
            "text": "I had never heard of <a href=\"https://en.wikipedia.org/wiki/Yacht_rock\">Yacht Rock</a> before listening to the <a href=\"https://www.nytimes.com/2019/09/06/podcasts/1619-black-american-music-appropriation.html?showTranscript=1\">third episode</a> of the 1619 podcast, which might be the best single episode of any podcast ever. If you love American music, you can, in a few minutes, find out what it is and where it came from. If you say \"Alexa play Yacht Rock\" you get a virtual radio station of the good stuff. ",
            "created": "Sun, 22 Sep 2019 18:17:13 GMT",
            "type": "outline"
        },
        {
            "text": "Want to have marches that scare \"Moscow Mitch\" and Nancy Pelosi? All over the country we pretend it's Election Day. Dress rehearsal. March to your local polling place and have a have a street fair with booths for the candidates, for causes and political parties. Let the candidates treat you to entertainment, food and drink. We should make Election Day as much anticipated as any holiday. Or even better, usurp an existing holiday like <a href=\"https://duckduckgo.com/?q=hate+halloween&t=h_&ia=web\">Halloween</a>. :boom: ",
            "created": "Sun, 22 Sep 2019 17:40:09 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/08/27/moscowMitchSmall.png"
        },
        {
            "text": "It would be great if we could make voting a party, a celebration, something to look forward to, not something you have to make time for. That would probably do more to improve the lives of all Americans than any other single thing. It's like the SuperBowl, the NBA Finals, Coachella or the Oscars, only better -- because we are the stars.",
            "created": "Sun, 22 Sep 2019 12:22:49 GMT",
            "type": "outline"
        }
    ]
}