{
    "text": "September 23",
    "created": "Mon, 23 Sep 2019 14:07:48 GMT",
    "name": "23",
    "subs": [
        {
            "text": "A long time since I <a href=\"https://twitter.com/davewiner/status/1176252987678887938\">said</a> of Trump \"Did he actually say that?\"",
            "created": "Mon, 23 Sep 2019 21:53:55 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1176252987678887938"
        },
        {
            "text": "We froze our social graph too soon, imho. My goal is to get the kind of discourse that happens on Twitter and Facebook to happen outside the silos, so a new generation of \"coders\" can try out a billion new ideas about how humans can ideate and organize in a global network environment.",
            "created": "Mon, 23 Sep 2019 15:08:37 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1176151290440802304"
        },
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=aSZzsWRx_IE\">Today's song</a> -- Red beans and rice, crawfish etouffee.",
            "created": "Mon, 23 Sep 2019 19:59:25 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=aSZzsWRx_IE"
        },
        {
            "text": "Pelosi's choice: 1. Get behind impeachment, now, fully, no conditions. 2. Step aside and let the new Speaker do it. (Update: There's a third choice -- Delegate all matters related to impeachment to a special prosecutor, a member of the House. I think Adam Schiff would be ideal. Pelosi can handle everything but impeachment. Refer all questions to the prosecutor.)",
            "created": "Mon, 23 Sep 2019 15:21:58 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://twitter.com/KevinMKruse/status/1175459701582172161\">Mythical headline from 1972</a>. The break-in at the Democratic National Committee’s headquarters at the Watergate Hotel raises troubling questions about just what it is that the Democrats are hiding there.",
            "created": "Mon, 23 Sep 2019 17:00:58 GMT",
            "type": "outline"
        },
        {
            "text": "Sometimes you have to <a href=\"https://www.youtube.com/watch?v=7sqXBB1ETU0\">make a choice</a> with no clue how things are going to turn out. That's been my experience in life. I can cite numerous examples. So now it gets real for all of us at the same time. And I'd say it's just been an illusion that it never was not thus.",
            "created": "Mon, 23 Sep 2019 15:17:07 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=7sqXBB1ETU0"
        },
        {
            "text": "Finally <a href=\"https://twitter.com/AriMelber/status/1176138536078196737\">MSNBC gets</a> to the real question. How the hell are we going to vote Trump out. We've only seen 1/10th (maybe) of one whistleblower leak. He must be making the <s>offer</s> demand he made to the Ukranian president to every despot in the world. ",
            "created": "Mon, 23 Sep 2019 14:33:22 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/AriMelber/status/1176138536078196737"
        },
        {
            "text": "Journalism needed a <a href=\"https://www.theatlantic.com/ideas/archive/2019/09/patient-zero-of-the-next-false-equivalence-epidemic/598573/\">re-think</a> for the <a href=\"https://www.eclectablog.com/2019/09/expecting-the-2020-election-to-save-us-from-trump-is-the-worst-bet-in-american-history.html\">2020 election</a>, and it didn't happen. We're in a bad place. Trump's corruption is \"priced-in\" so you can say Trump did something even more horrible than ever before and people go yeah, that's nice, but what are we going to do about it. If the past is any indication, nothing. And Trump can dirty-up Biden's name and create a nice false equivalence for the journos to relax into. We're all comfortable in doing what we do. We had a series of marches in 2017, and then settled back into complacency and complicity in the rise of authoritarianism in the US. If we want to stop it, protest won't do it. Resistance won't, or civil disobedience. We need a revolution now, and luckily our founders thought it might come to that, after all they had just fought one. In the Constitution are the tools to overturn the government, immediately. But we also need a revolution in journalism, an awakening, creating authority in expertise. What <a href=\"http://rebootnews.com/\">we used to</a> call <a href=\"https://gigaom.com/2013/06/04/when-sources-can-go-direct-do-we-need-journalism-less-or-do-we-need-it-more-than-ever/\">Sources Go Direct</a>. People we trust who know something about what they're talking about. It's time to rise to <a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+jfk+ask+not&t=h_&ia=web\">JFK's</a> <a href=\"https://www.brainyquote.com/quotes/john_f_kennedy_109213\">challenge</a>. My fellow Americans, ask not what your country can do for you, ask what you can do for your country. ",
            "created": "Mon, 23 Sep 2019 14:07:49 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/09/23/jfkAssasination.png"
        },
        {
            "text": "The <a href=\"http://scripting.com/email/\">nightly email</a> thing has been a big eye-opener. Real engagement has returned. On the web, not in a silo. I can't believe we found a way to crack the nut. Now I want to open up engagement in new ways. I have the benefit of all the paths we went down <a href=\"http://scripting.com/davenet/\">starting in 1994</a>. And I have lots of developed software running in JavaScript here that can be applied to new experiments. Exciting times. ",
            "created": "Mon, 23 Sep 2019 14:39:39 GMT",
            "type": "outline"
        }
    ]
}