{
    "text": "September 25",
    "created": "Wed, 25 Sep 2019 13:52:29 GMT",
    "name": "25",
    "subs": [
        {
            "text": "It's funny how my subconscious <a href=\"http://scripting.com/2014/09/04/wordsISayToMyselfAsIProgram.html\">gets in the loop</a> on my programming which is probably almost totally a higher-brain function. When I figure something out, here's what comes out of my mouth -- bang. That's a new one. It used to be bing and then ptahhh. Also thank you. Sometimes perfect. Then there was bingo bongo bingo. And now -- bang. Sometimes it's bang bang bang. There's no conscious thought behind these words. It's spontaneous. They just happen. It's as if my subconscious is watching, not entirely sure what's going on, like a black lab hanging out at my feet. He senses something has happened that's momentous and wants to participate. Verbally. ",
            "created": "Wed, 25 Sep 2019 15:35:24 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/09/25/blackLab.png"
        },
        {
            "text": "<a href=\"https://twitter.com/sorkinese/status/1176932633143652353\">Le tweet du jour</a>: Some of the stupidest criminals in the world are working right here in America. I've always been proud of that. ",
            "created": "Wed, 25 Sep 2019 18:54:25 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/sorkinese/status/1176932633143652353"
        },
        {
            "text": "This was <a href=\"http://scripting.com/images/2019/09/25/hrcSelfies.png\">v1.0</a> of the Warren selfie line.",
            "created": "Wed, 25 Sep 2019 15:47:11 GMT",
            "type": "outline"
        },
        {
            "text": "Now the conversation has turned to what Trump should be impeached for. I don't know the public opinion answer, or the legal answer, or the right answer for Nancy Pelosi, but here's the \"Occam's News\" answer. He's running a corrupt enterprise from the White House. He's turned it into the Trump Organization, using all the powers of the presidency to cover up his crimes and fill his pockets. <a href=\"https://en.wikipedia.org/wiki/Organized_crime\">Organized crime</a>. To live the life he was living before he was elected but on a much grander scale. This violates everything in the Constitution, because it was the founders intent, in every instance, to have the United States be self-governing, not a monarchy. ",
            "created": "Wed, 25 Sep 2019 14:35:16 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/09/25/kingTrump.png"
        },
        {
            "text": "I wish reporters would ignore what Trump just released, based on our <a href=\"https://twitter.com/davewiner/status/1176865480713195520\">experience</a> with the Mueller Report.",
            "created": "Wed, 25 Sep 2019 14:29:23 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1176865480713195520"
        },
        {
            "text": "Sometimes I wonder what would happen if one day I found I didn't have anything to write about. Heh. Like that's ever going to happen. Hello my name is Dave and I'm a \"NBB\".",
            "created": "Wed, 25 Sep 2019 14:52:11 GMT",
            "type": "outline"
        },
        {
            "text": "Yesterday I hit a pothole on a dirt road and I rolled over the handlebars. My instincts were good, I protected my head and neck, took the brunt on my ribcage and knee. It was a private place and a private experience. I laid there in the dirt for I have no idea how long, looked up at the sky through the trees, breathed, and was thankful it wasn't worse. Eventually I got myself up, dizzy, sat back down, breathed some more, righted myself and walked home. The bike wasn't rideable. I've rolled over handlebars once before, in Manhattan, in 2010, avoiding a collision with a car that was running a stop sign. That time I was in bed for days, this time it's not that bad. I'm already up and about. I love my bike, but today I feel betrayed. Not sure if it was really a hole in the road or a bike failure. I haven't had the will to look at the bike yet. I'm going to spend a day eating ibuprofen and being thankful. ",
            "created": "Wed, 25 Sep 2019 13:52:30 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/09/25/trekVerve.png"
        },
        {
            "text": "I started watching <a href=\"https://www.metacritic.com/tv/unbelievable/season-1\">Unbelievable</a> on Netflix. Almost at the end of episode 2. So far it makes me unbelievably angry. ",
            "created": "Wed, 25 Sep 2019 14:06:29 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://twitter.com/realrobinhood18/status/1176832048318861312\">Impeachment party</a>. How did they do this??",
            "created": "Wed, 25 Sep 2019 14:00:11 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/realrobinhood18/status/1176832048318861312"
        },
        {
            "text": "BTW, it's totally okay for you to forward the <a href=\"http://scripting.com/email\">nightly emails</a> to anyone you like. They can't unsub on your behalf because we send a confirming email to your account to unsub. If you don't confirm, your subscription remains. So if you want to share something you read here, please do. ",
            "created": "Wed, 25 Sep 2019 14:59:32 GMT",
            "type": "outline"
        }
    ]
}