{
    "text": "September 26",
    "created": "Thu, 26 Sep 2019 15:40:43 GMT",
    "name": "26",
    "subs": [
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1177258103605272584\">Poll</a>: Will Trump resign?",
            "created": "Thu, 26 Sep 2019 18:09:43 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1177258103605272584"
        },
        {
            "text": "What I <i>love</i> about the whistleblower is that it says that the US govt is still in there, it hasn't been dominated yet by the Nazis. Now that one whistleblower has emerged, hopefully there will be many more. A publication dedicated just to whistleblower coverage might be good.",
            "created": "Thu, 26 Sep 2019 16:04:04 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/09/26/skier.png"
        },
        {
            "text": "I assume Trump is deep in debt and scrambling to make  loan payments every month, and the people he owes money to aren't the kind who understand.",
            "created": "Thu, 26 Sep 2019 18:12:17 GMT",
            "type": "outline"
        },
        {
            "text": "If I could talk to Trump and he was really listening I'd day this. Trump you idiot, we all knew what you were doing, but we didn't have solid proof, like a tape or a transcript. You fucking moron, not only did you create the transcript, you released it to the public. ",
            "created": "Thu, 26 Sep 2019 17:28:10 GMT",
            "type": "tweet",
            "tweetId": "1177273829397344256",
            "tweetUserName": "davewiner"
        },
        {
            "text": "I was pissed that Schiff went ahead with the hearing, but then I wonder if his real audience is the dozen or so would-be whistleblowers who are dealing with a government that insists everything is privileged. He's saying to them, that's what they say about everything, you have to resist that. If necessary come to me, directly and we'll help. ",
            "created": "Thu, 26 Sep 2019 16:48:43 GMT",
            "type": "outline"
        },
        {
            "text": "Here's what's weird. The Trump/Barr team has been obstructing everything. It's all been privileged. Tax returns. McGahn testimony, etc. Today they gave up. They could have said the whistleblower report was privileged. Would have been consistent. They didn't. ",
            "created": "Thu, 26 Sep 2019 16:47:19 GMT",
            "type": "outline"
        },
        {
            "text": "So where can a citizen get a look at this <a href=\"https://intelligence.house.gov/uploadedfiles/20190812_-_whistleblower_complaint_unclass.pdf\">whistleblower report</a> that is not behind a paywall?",
            "created": "Thu, 26 Sep 2019 15:48:52 GMT",
            "type": "outline"
        },
        {
            "text": "I wish there was a text version of the report so I could use a dark color and amp up the size. There should be a whistleblower's CSS file I can edit. Make this stuff easy on the eyes. ",
            "created": "Thu, 26 Sep 2019 16:10:31 GMT",
            "type": "outline"
        },
        {
            "text": "I don't see why the Dems went ahead with the public hearing today, given that the whistleblower report <a href=\"https://www.politico.com/story/2019/09/26/congress-releases-whistleblower-complaint-alleging-trump-abused-his-office-1514008\">came</a> <a href=\"https://intelligence.house.gov/uploadedfiles/20190812_-_whistleblower_complaint_unclass.pdf\">out</a> before the hearing. The hearing only made sense if the report was being withheld. We're not impeaching the acting DNI. This hearing only made sense of they were stonewalling. They're doing to the whistleblower what Barr did to the Muller Report. They need a showrunner, someone with an outsider's perspective. Schiff, Nadler, Pelosi are lost in the weeds. (Though unlike some, I thought Schiff's intro was brilliant.)",
            "created": "Thu, 26 Sep 2019 15:40:44 GMT",
            "type": "outline"
        }
    ]
}