{
    "text": "Fighting autocracy with marketing",
    "created": "Sat, 12 Jun 2021 16:44:46 GMT",
    "type": "outline",
    "metaImage": "http://scripting.com/images/2021/06/12/blackLivesMatter.png",
    "description": "Point the finger at the traitors, make them pay a political price for their insurrection. ",
    "subs": [
        {
            "text": "Joe Trippi's <a href=\"https://podcasts.apple.com/us/podcast/id1523896927?i=1000525032434\">latest podcast</a> focused me on realistic next steps fighting Republican autocracy. Here are my comments in a bulleted list. I wrote this quickly, so think of it as a memo, not a manifesto. ;-)",
            "created": "Sat, 12 Jun 2021 16:45:04 GMT",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "Joe, glad you're hooked up with the Lincoln Project people. They were doing well marketing against insurrection until the 2020 election.  ",
                    "created": "Sat, 12 Jun 2021 16:47:45 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The task they set themselves up to do is done. They were trying to convince Repubs it was ok to vote for a Democrat. That was great for the 2020 election but it's a small part of the campaign that should be running now.",
                    "created": "Sat, 12 Jun 2021 16:47:49 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "They (or someone) must be ready to position the next huge insurrection event, with online advertising, in real time as it's happening, and in the immediate aftermath. ",
                    "created": "Sat, 12 Jun 2021 16:47:51 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "If such an operation were in existence on Jan 6, we wouldn't have had to wait for the DOJ to tell us what happened (they never have). Now, no amount of marketing will change that the events of Jan 6 are fuzzy and uncertain in our minds, even though in fact they aren't. No one focused our minds on the criminality of the president. We've never gotten an account of what the president was doing during the insurrection, yet the new administration must have that information? Why are we not running ads demanding that the information be released. ",
                    "created": "Sat, 12 Jun 2021 16:47:52 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "So we remain confused, no one has taken charge of communicating about that event. That's how the human mind works. It's why when Barr lied about the Mueller Report his spin stuck, even though later we knew he was lying. ",
                    "created": "Sat, 12 Jun 2021 16:47:54 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The question the new Lincoln Project should always be raising: \"Why is this traitor still in Congress? Repeat that theme over and over. Point the finger at the traitors, make them pay a political price for their insurrection. ",
                    "created": "Sat, 12 Jun 2021 16:47:56 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "When one of them does something really insidious, demand that they be removed from Congress right now. Put the question into the reports in NYT, WP, CNN, MSNBC, et al.",
                    "created": "Sat, 12 Jun 2021 16:47:57 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Jan 6 was not the last act of insurrection. Any day now there will be another. We must be ready to communicate about it. ",
                    "created": "Sat, 12 Jun 2021 16:47:59 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "If such a marketing channel existed, ordinary people like me will be able to do something instead of sitting around worrying and thinking no one will hear me so why bother. Our contribution will be in dollars to run ads, and feet marching in protest. ",
                    "created": "Sat, 12 Jun 2021 16:48:01 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Marketers are in a position to do a lot of good. I think Lincoln Project should change their name and add Dems and independents to the project. It can't just be former Republicans at this point. ",
                    "created": "Sat, 12 Jun 2021 16:48:07 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "From now on campaigns <i>never shut down.</i> Tattoo that on your forehead. It's a mistake we're still making and it must stop. The need to communicate about events is persistent.",
                    "created": "Sat, 12 Jun 2021 16:48:11 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}