{
    "text": "We're complicit",
    "created": "Mon, 09 Jul 2018 01:17:14 GMT",
    "type": "outline",
    "description": "We could do more to stop Trump. We're all hoping to continue with our lives and careers, that somehow we'll get through this without having to give up anything as individuals. That someone else will make the sacrifice.",
    "subs": [
        {
            "text": "Back in the 90s, when Microsoft was doing horrible things to the web and hoping to get away with it, I had friends who worked there. I often wondered how they explained it to themselves. They must know that what Microsoft is doing is wrong, and those of us outside of the company don't make a distinction they would probably like us to make. I didn't see a difference between the company and the people who worked there. It was hard to reconcile the affection I felt for them personally with the actions of the company. ",
            "created": "Mon, 09 Jul 2018 01:17:20 GMT",
            "image": "http://scripting.com/images/2018/07/08/redAndBlueStates.png"
        },
        {
            "text": "I mention this now, long after the events are past, because of an image and a <a href=\"https://twitter.com/krassenstein/status/1015951386050224130\">tweet</a> that showed that thousands of people in Brussels are marching against our president. I thought, that's cool, but soon they will be marching against the United States. They won't and shouldn't make a distinction between the country and our president, for the same reason we didn't make a distinction between <a href=\"https://en.wikipedia.org/wiki/Bill_Gates\">Bill Gates</a> and the people who worked at Microsoft. ",
            "created": "Mon, 09 Jul 2018 01:18:50 GMT"
        },
        {
            "text": "When you go to Europe, there isn't a change in attitude that you can perceive. I went there when we invaded Iraq, creating the refugee crisis that is now causing so many problems there. No one seemed to blame me for what our government was doing. Same thing in June when I visited Italy. People seem to understand that Americans who travel outside the United States aren't to blame for Trump. But in fact, <i>we are.</i>",
            "created": "Mon, 09 Jul 2018 01:20:08 GMT"
        },
        {
            "text": "We could do more to stop Trump. We're all <a href=\"https://twitter.com/StephenKing/status/1015987159642394625\">hoping</a> to continue with our lives and careers, that somehow we'll get through this without having to give up anything as individuals. That someone else will make the sacrifice. I don't think that's how it works. We're missing chance after chance to stop this. We all have to work for each other, not just for ourselves. This is a change that Americans are not yet ready to make. I hope when and if it happens it isn't too late. ",
            "created": "Mon, 09 Jul 2018 01:22:57 GMT"
        }
    ]
}