{
    "text": "First notes from the BKC 25 reuninon",
    "created": "Fri, 08 Sep 2023 22:23:35 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "My first thoughts on coming home, not well organized.",
            "created": "Fri, 08 Sep 2023 22:26:33 GMT",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "I'm back home after an incredible couple of days at the Berkman 25 year reunion. ",
                    "created": "Fri, 08 Sep 2023 22:24:10 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I was there 20 years ago. ",
                    "created": "Fri, 08 Sep 2023 22:24:17 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "We were on a roll toward inventing social media. We had learned a lot and were practicing it, and if we had continued, there's at least a chance there would be an open alternative to Facebook and Twitter now instead of all the trouble caused by their dominance. ",
                    "created": "Fri, 08 Sep 2023 22:25:07 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It probably wouldn't have needed much if any money, btw. ",
                    "created": "Fri, 08 Sep 2023 22:27:31 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I believe investors would have wanted to invest on our terms in open source development at a university in 2003, but I didn't have the idea developed at the time enough to propose it. ",
                    "created": "Fri, 08 Sep 2023 22:37:34 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Very independently of my Berkman experience in 2014 I was <a href=\"http://scripting.com/2014/10/30/developingBetterDevelopers.html\">thinking</a> all about how an academic institution should welcome people back every few years to contribute to an ongoing open source project. If we had been able to do that for blogging, podcasting, RSS starting in 2003, and growing as the user base grew, with volunteers coming back to work on it whenever there was a need, and using the university to teach new generations how to do what the older generation knew how to do, I think it might have worked. At least it would have given the users a seat at the table when deciding how the technology would evolve. ",
                    "created": "Fri, 08 Sep 2023 22:25:33 GMT",
                    "image": "https://imgs.scripting.com/2020/03/22/accordionPlayer.png",
                    "flInCalendar": true
                },
                {
                    "text": "It felt as if I had been forgotten in the Berkman world, but that was not the case. I was surprised at how much love there was there. ",
                    "created": "Fri, 08 Sep 2023 22:26:05 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I say if you get a chance to go back 20 years in time and hang out with the people you knew then -- <i>do it.</i> So much of what you remember comes from the perspective of someone 20 years younger. You now know what happened. The story went on. You're in a fantastic place to learn, and you're also going to feel love stronger than you could have back then, because love grows enormously over time, even if you're not consciously aware of it. ",
                    "created": "Fri, 08 Sep 2023 22:26:11 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I described getting my fellowship at Berkman like being a kid, given a Harvard business card and told to go have fun. :smile: ",
                    "created": "Fri, 08 Sep 2023 22:42:42 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "<a href=\"https://hls.harvard.edu/office-of-event-scheduling-and-support/gallery-of-event-spaces/\">Harvard Law School</a> knows how to build <a href=\"https://imgs.scripting.com/2023/09/08/harvardLawClassroom.png?nodialog=true\">classrooms</a> for discourse.  ",
                    "created": "Fri, 08 Sep 2023 14:28:30 GMT",
                    "type": "outline",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}