{
    "text": "It's different after its gone",
    "created": "Tue, 30 Apr 2024 12:57:35 GMT",
    "type": "outline",
    "enclosure": "http://scripting.com/2024/04/30/weNeedMoreChange.m4a",
    "enclosureType": "audio/mpeg",
    "enclosureLength": "5941456",
    "description": "We're already living in the authoritarian state we're worried about. We haven't caught up with that reality yet.",
    "subs": [
        {
            "text": "<i>Note: This post is the summary of a <a href=\"http://scripting.com/2024/04/30/weNeedMoreChange.m4a\">podcast</a>. </i>",
            "created": "Tue, 30 Apr 2024 13:01:38 GMT",
            "flInCalendar": true
        },
        {
            "text": "When my mother died in 2018, it didn't settle in that the context in which I lived, my whole life, was gone. ",
            "created": "Tue, 30 Apr 2024 12:57:45 GMT",
            "flInCalendar": true
        },
        {
            "text": "She lived in the house I was raised in. Very little had changed in that house. I hadn't lived there since I went away to college, but it still defined who I was, an adult who didn't live in his childhood home. When we sold the house, the last time I saw it, it was empty, and that was when it hit me. That part of my life is over. I no longer have a home I can return to.",
            "created": "Tue, 30 Apr 2024 13:16:07 GMT",
            "flInCalendar": true
        },
        {
            "text": "The same is true with our understanding of who we are as adult American citizens. Until now we felt we had a vote. But that is over, unless we change our view of the country we live in. It's not that it's about to change, which is what you hear in the news, and on social web -- <i>it has already changed. </i>",
            "created": "Tue, 30 Apr 2024 12:58:19 GMT",
            "flInCalendar": true
        },
        {
            "text": "We now understand that Trump may be above the law but that masks a bigger truth, the Supreme Court is already above the law. They take bribes, openly. They cannot be prosecuted (just try it and see what happens). They openly side with the insurrection, yet don't recuse when deciding issues of what to do with the insurrectionists. They imagine the president is a monarch. ",
            "flInCalendar": true
        },
        {
            "text": "We're already living in the authoritarian state we're worried about. We haven't caught up with that reality yet. ",
            "created": "Tue, 30 Apr 2024 12:59:23 GMT",
            "flInCalendar": true
        },
        {
            "text": "Our government is more concerned about our right to own guns than it is with our right to own our own bodies. Stop for a moment and let that sink in. If I said you don't own your own body, what would you think I'm talking about? Answer: Slavery. ",
            "flInCalendar": true
        },
        {
            "text": "If we did catch up with that reality, we would start organizing now to undo that mistake. We would not only re-elect Biden in a landslide, but we'd insist that he expand the court to 100 members serving 10-year terms each, retroactive. And thus we would eliminate one of the huge problems in our system of government. Have they proved they need this kind of correction? Yes, the overturning of Roe, and the lack of prosecution of Trump for trying to overthrow the government are all the proof we need. ",
            "created": "Tue, 30 Apr 2024 13:00:09 GMT",
            "flInCalendar": true
        },
        {
            "text": "And from then-on, no politician in any branch of government would take us for granted.",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}