{
    "text": "Mark Zuckerberg, let Facebook rejoin the open web",
    "created": "Fri, 05 Jan 2018 14:10:03 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Mark Zuckerberg, CEO of Facebook, <a href=\"https://www.techmeme.com/180104/p16#a180104p16\">posted</a> his beginning-of-year <a href=\"http://scripting.com/images/2018/01/05/zuckerbergNewYear.png\">message</a> yesterday. It's full of big ideas, but we don't need inspiration, we need Facebook to rejoin the open web, to simply peer with it.  ",
            "created": "Fri, 05 Jan 2018 14:10:13 GMT",
            "image": "http://scripting.com/images/2017/12/17/melo.png"
        },
        {
            "text": "Facebook owes its existence to the open web. If it didn't exist Facebook wouldn't have been possible. But instead of feeding it, the way a smart corporation maintains a natural resource on which it depends, they've done the predictable thing, they've exhausted it, polluted it, cut it off, left it to die. Google does it too, and together they are destroying the <a href=\"http://scripting.com/liveblog/users/davewiner/2015/12/27/0724.html\">commons</a> that serves as the incubator for new ideas, for new Facebooks and Googles, new literary forms, new ways of delivering news. ",
            "created": "Fri, 05 Jan 2018 14:11:33 GMT"
        },
        {
            "text": "The fact that I have to post a <a href=\"http://scripting.com/images/2018/01/05/zuckerbergNewYear.png\">screen shot</a> of his message is a perfect demo of the problem. I could have posted this on Facebook, but then I wouldn't have been able to use links, style or images. The post couldn't have a title. And if I wanted to include a podcast I couldn't. Or I could post it on my blog, as I have, and link to the screen shot, because who knows what you'll see if I post a <a href=\"https://www.facebook.com/zuck/posts/10104380170714571?pnref=story\">direct link</a> to the message. ",
            "created": "Fri, 05 Jan 2018 14:13:04 GMT"
        },
        {
            "text": "Let's work together. I want the best of the open web and Facebook, and Mark you're in the way of that. You'll have done a full year's worth of work if you let Facebook rejoin the open web.",
            "created": "Fri, 05 Jan 2018 14:22:40 GMT"
        }
    ]
}