{
    "text": "October 1",
    "created": "Tue, 01 Oct 2019 13:35:14 GMT",
    "name": "01",
    "subs": [
        {
            "text": "Because Barr is in such a <a href=\"https://politicalwire.com/2019/10/01/the-dangerous-position-of-william-barr/\">precarious position</a>, and he's smart, he must have factored in the risk before going out on the limb. He's betting that he and Trump et al will be able to toss the Constitution in a trash can, and govern any way they want, without oversight and inconvenient co-equal branches of government. We're at much at risk as he is.",
            "created": "Tue, 01 Oct 2019 18:08:36 GMT",
            "type": "outline"
        },
        {
            "text": "Trump is breaking the Constitution. Openly, and it'll never be repaired if he isn't cancelled. We should have fought this \"civil war\" a long time ago, but all the time we delay the chances of our form of govt surviving goes down.",
            "created": "Tue, 01 Oct 2019 18:22:32 GMT",
            "type": "outline"
        },
        {
            "text": "20-minute <a href=\"http://scripting.com/2019/10/01/25Years.m4a\">podcast</a> about the origins of \"Scripting News\". The original idea, 25 years ago, was letting go of product ideas that I wouldn't be able to commercialize. It, in turn, generated ideas that would define a huge <a href=\"https://en.wikipedia.org/wiki/Web_2.0\">industry</a>. The big idea of blogging would turn out to be \"Sources Go Direct\". ",
            "created": "Tue, 01 Oct 2019 17:27:40 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2019/10/01/25Years.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "10006906",
            "image": "http://scripting.com/images/2019/10/01/25.png"
        },
        {
            "text": "In less than a week <a href=\"http://scripting.com/\">my blog</a> will be 25 years old. If it were a person it would be able to rent a car. ",
            "created": "Tue, 01 Oct 2019 16:38:09 GMT",
            "type": "outline"
        },
        {
            "text": "In the almost-25 years of blogging on <a href=\"http://scripting.com/\">scripting.com</a>, I did take a few weeks off here and there. In the 90s, mostly to take week-long massage classes, at <a href=\"https://en.wikipedia.org/wiki/Harbin_Hot_Springs\">places</a> where there was no internet access, which was  common back then, believe it or not.",
            "created": "Tue, 01 Oct 2019 17:16:05 GMT",
            "type": "outline"
        },
        {
            "text": "My two cents on changing Facebook to keep its power manageable. 1. Its social graph should be a public resource. Spin it out. The APIs should be open like the web APIs are. 2. Facebook should peer with the open web, so it isn't a silo.",
            "created": "Tue, 01 Oct 2019 14:00:47 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1179027922612555776\">2017</a>: You can fake caring but you can't fake showing up.  ",
            "created": "Tue, 01 Oct 2019 13:38:50 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1179027922612555776"
        },
        {
            "text": "Why is it that the future-of-news conversation is exclusive to people who have a vested interest in the way things are. If we've learned anything about the future -- of everything -- is that it's disruptive to the way things are. ",
            "created": "Tue, 01 Oct 2019 13:35:15 GMT",
            "type": "tweet",
            "tweetId": "1179027197673295874",
            "tweetUserName": "davewiner"
        },
        {
            "text": "The September posts are archived, <a href=\"https://github.com/scripting/Scripting-News/blob/master/blog/opml/2019/09.opml\">in OPML</a>. ",
            "created": "Tue, 01 Oct 2019 14:44:30 GMT",
            "type": "outline"
        }
    ]
}