{
    "text": "October 4",
    "created": "Fri, 04 Oct 2019 12:43:40 GMT",
    "name": "04",
    "subs": [
        {
            "text": "More whistleblowers please. :pray:",
            "created": "Sat, 05 Oct 2019 02:28:38 GMT",
            "type": "outline"
        },
        {
            "text": "Trump isn’t playing multidimensional chess, and neither is Putin. His goal was to reduce the US to chaos. Our elections are now meaningless. Mass killings by people with automatic weapons. No sense of normalcy. The news people are focused on impeachment, but since just after the 2016 election have buried the big story. The US has been defeated. We're occupied. We live in <a href=\"https://en.wikipedia.org/wiki/Vichy_France\">Vichy</a> America. The president is a <a href=\"https://www.vox.com/2018/7/16/17576956/transcript-putin-trump-russia-helsinki-press-conference\">Russian asset</a>. It's all out in the open, but until the whistleblower, no one, not Mueller, not the Repubs in Congress, not the Dems in Congress, nor the Dems running for president, have had the guts to say the truth out loud. We all hope someone else will take the risk. We have to fight to get out of this. It's going to be bloody. But the longer we wait the worse it'll be.",
            "created": "Fri, 04 Oct 2019 12:57:34 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/09/30/russianDressing.png"
        },
        {
            "text": "This is the <a href=\"https://www.vox.com/2018/7/16/17576956/transcript-putin-trump-russia-helsinki-press-conference\">moment</a> Trump should have been impeached. It was obvious at that point who Trump was/is. ",
            "created": "Fri, 04 Oct 2019 16:21:59 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1180101787409408000\">2 years ago today</a>: It's too easy for one person to shoot 600.",
            "created": "Fri, 04 Oct 2019 12:46:14 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1180101787409408000"
        },
        {
            "text": "<a href=\"https://www.axios.com/ruth-bader-ginsburg-aberration-us-history-polarization-a291fb03-94fd-40fe-88ab-3839dfbef5a1.html\">RBG says</a> historians will view today's political climate as an aberration. My two cents. This will be remembered as the time we all waited for someone else to take the risk, not wanting to disturb our lives. The spoiled citizens of a country that fought wars without a draft, that got tax cuts in time of war, inflated our economy as we inflicted chaos on others.",
            "created": "Fri, 04 Oct 2019 16:58:16 GMT",
            "type": "outline"
        },
        {
            "text": "There should be a user interface standard for <a href=\"http://scripting.com/images/2019/10/04/baseballGameStatus.png\">this object</a>. There are minor differences in layout, but all have the same info.",
            "created": "Sat, 05 Oct 2019 02:07:34 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://twitter.com/KamalaHarris/status/1179810620952207362\">Kamala Harris</a>, presidential candidate, wants Twitter to suspend Donald Trump's Twitter account. My two cents. This is what’s wrong with today’s net, that it’s up to one unelected unaccountable tech exec to decide if the elected president has a voice. Twitter has too much power. They endow people they like with millions of followers, and delete accounts for friends. No one has to listen to Trump. I’ve had him blocked for years.",
            "created": "Fri, 04 Oct 2019 12:43:41 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/10/04/vinylRecordInsertFor45s.png"
        }
    ]
}