{
    "text": "October 5",
    "created": "Sat, 05 Oct 2019 15:29:21 GMT",
    "name": "05",
    "subs": [
        {
            "text": "Trump throws <a href=\"https://www.axios.com/trump-blamed-rick-perry-call-ukraine-zelensky-8178447a-0374-4ac6-b321-a9454b0565d4.html\">Rick Perry under the bus</a>. What if Perry's popularity goes up as a result? Think about it.",
            "created": "Sun, 06 Oct 2019 03:01:35 GMT",
            "type": "outline"
        },
        {
            "text": "Why are we impeaching the president, big picture. Our system has gone off the rails, we've got a monarch in the White House. This impeachment is the second <a href=\"https://en.wikipedia.org/wiki/American_Revolution\">American Revolution</a> and has the same goal as the first, to depose a king. And again, we have to change the rules so it won't happen again.",
            "created": "Sat, 05 Oct 2019 16:58:01 GMT",
            "type": "outline"
        },
        {
            "text": "An idea. If <a href=\"https://www.frontpagelive.com/2019/10/05/impeachment-or-lost-election-what-if-trump-just-refuses-to-leave/\">Trump refuses to leave</a> the White House, change its name to Federal Penitentiary #248, place guards at all doors, no one goes in or out. No Internet access, no food. The constitutional president governs from <a href=\"https://en.wikipedia.org/wiki/President%27s_Guest_House\">Blair House</a>. Trump comes out or dies there. Either way, eventually the White House is torn down, as a symbol of the imperial presidency. From now on the president <i>strictly</i> follows the Constitution, no more undeclared wars, Congress appropriates the money. Impeachment hearings start immediately after the Inauguration, and at the first sign of the breach of the Constitution, the president is impeached and removed. It's not going to be a glamorous job in the future. We're getting rid of our second king, and we must make sure no usurper like Trump can turn the office of President into an authoritarian pulpit. Burning the White House to the ground serves as a symbol of that transition. ",
            "created": "Sat, 05 Oct 2019 15:37:00 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/10/05/creamyRussianDressing.png"
        },
        {
            "text": "My mother taught me that when people resort to name-calling that means they're wrong and they know it. ",
            "created": "Sat, 05 Oct 2019 15:29:22 GMT",
            "type": "tweet",
            "tweetId": "1180505383359647747",
            "tweetUserName": "davewiner"
        }
    ]
}