{
    "text": "October 8",
    "created": "Tue, 08 Oct 2019 13:03:47 GMT",
    "name": "08",
    "subs": [
        {
            "text": "Welcome to the 26th year of Scripting News. ",
            "created": "Tue, 08 Oct 2019 13:03:48 GMT",
            "type": "outline"
        },
        {
            "text": "I ordered a new <a href=\"https://www.amazon.com/gp/product/B07KGVB6D6/ref=ppx_yo_dt_b_asin_title_o02_s00?ie=UTF8&psc=1\">Amazon Fire Cube</a>. I have a relatively old Apple TV, and was looking to upgrade because of a problem I'm having with the Roku version of the Spectrum app. I'm 99% sure the problem is with Spectrum, whose support people point the finger at Roku, which I think is BS. I considered buying a new Apple TV, but I've been using Alexa more and  more, and I find I miss it on my TV-watching system in the living room. This tells you something about how Amazon is moving to dominate TV. People think Trump is the new boss, but I'm pretty sure it's Bezos. Imagine if they bought Roku, which is the OS of my TCL television. Imagine if the OS goes down another level and takes Spectrum out of the software-development business (and I assume Verizon et al) which would be a blessing. They really don't do this very well. The wild card, the one company that could redefine news is Twitter, as I wrote <a href=\"http://scripting.com/2019/10/07/165641.html\">yesterday</a>. I wonder if anyone in the future-of-news world has comments? ",
            "created": "Tue, 08 Oct 2019 13:59:20 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/10/08/amazonFireCube.png"
        },
        {
            "text": "A long <a href=\"https://news.ycombinator.com/item?id=21178885#21179244\">thread</a> on Hacker News about yesterday's anniversary. One commenter said \"I feel bad for Dave. He was so early to the table on so many occasions yet he was left behind and never really made it big monetarily. He is the definition of missing the boat.\" I replied \"Please don't feel bad. I was never trying to make a lot of money from the web. I had lots of opportunities to sell out. I did that once, in the 80s, and that has funded my creative work ever since. Money isn't that useful, I learned, pretty early-on. Here's a <a href=\"http://scripting.com/2016/05/31/1296.html\">piece</a> I wrote about that recently.\" I'd add that I <i>was</i> disappointed that when the VCs started RSS companies and then podcast companies, they did it with other people, with imho predictably bad results. That was disappointing, but what the hell, no one made any money from those things, and I get to enjoy the podcasts and feeds as much as anyone. And for that I'm grateful. I also wish people like Zuckerberg cared more about the ecosystem, but he and I look at the world differently. ",
            "created": "Tue, 08 Oct 2019 20:40:28 GMT",
            "type": "outline"
        },
        {
            "text": "I started \"Scripting News\" in 1994, which I'm sure if you read this blog, you now know and wish I'd stop mentioning. Heh. One more time. I was 39 years old then, an age that to me now seems impossibly young, but to me at the time, felt really <i>really</i> old. I'm 25 years older now, 64, and in the US a lot of shit happens at 65, most important to me, <a href=\"https://duckduckgo.com/?q=Medicare&t=hz&ia=web\">Medicare</a>. Apparently at that point, the cost of my health insurance will go down dramatically, and the coverage will go up dramatically. Not that I feel I'm wanting any medical care now that I can't get, and I can certainly afford the payments. Anyway this an awkard moment because I have no idea what the fuck Medicare actually is. I go to the websites and they tell me how much I have to learn, but they don't teach it. I am highly motivated to learn, but I'd love to have a user interface that was like GEICO's website for buying auto insurance, or the Digital Ocean page for sizing your applet. I'd like to just check off some boxes, and see the numbers change. If I want to spend $500 per month I could have this coverage, or that, or something else. It seems enough people go through this that it's worth a little investment?",
            "created": "Tue, 08 Oct 2019 14:06:51 GMT",
            "type": "outline",
            "image": "http://scripting.com/2016/06/01/grandpa.png"
        },
        {
            "text": "Fascinating <a href=\"https://twitter.com/PitchingNinja/status/1181268716056657925\">video</a> overlays a fastball and curveball. You can clearly see why it's so hard to hit a major league pitch.",
            "created": "Tue, 08 Oct 2019 13:29:55 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/PitchingNinja/status/1181268716056657925"
        },
        {
            "text": "If I ever get it together to write a book, I think <a href=\"http://scripting.com/2016/05/31/1296.html\">this piece</a> will be the preface. Maybe its title will be the title of the book? ",
            "created": "Tue, 08 Oct 2019 13:53:09 GMT",
            "type": "outline"
        },
        {
            "text": "Feed-less podcast-like things",
            "created": "Tue, 08 Oct 2019 20:38:09 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "We need a new name for podcast-like things that have no feeds, are locked behind a paywall, can't be archived, cited or shared, and don't create any kind of record. ",
                    "created": "Tue, 08 Oct 2019 20:38:22 GMT"
                },
                {
                    "text": "Something like \"Dead-end-cast.\"",
                    "created": "Tue, 08 Oct 2019 20:38:40 GMT"
                },
                {
                    "text": "Or \"Business-model-cast.\"",
                    "created": "Tue, 08 Oct 2019 20:38:43 GMT"
                },
                {
                    "text": "Or \"VC-friendsly-cast.\""
                }
            ]
        }
    ]
}