{
    "text": "October 16",
    "created": "Wed, 16 Oct 2019 13:42:57 GMT",
    "name": "16",
    "subs": [
        {
            "text": "I had a theory that <a href=\"https://twitter.com/axios/status/1184546297191260164\">Lindsey Graham</a> was becoming Trump's little buddy so he could be the Goldwater to Trump's Nixon, when the time came. ",
            "created": "Wed, 16 Oct 2019 19:55:44 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/axios/status/1184546297191260164"
        },
        {
            "text": "We keep coming back to <a href=\"https://www.youtube.com/watch?v=DG0ch202prY\">this scene</a> from The West Wing.  \"You guys are worried about drowning, it's the fall that's gonna kill you.\"",
            "created": "Wed, 16 Oct 2019 15:37:13 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=DG0ch202prY"
        },
        {
            "text": "Here's a radical idea. How about a Democratic presidential candidate who runs as a conservative. That would blow a lot of minds imho. Here's the deal. Restore the American Revolution and the Constitution. Fix bugs in Obamacare, prepare for a national debate on further healthcare reform, to be discussed without a gun to our heads. Repeal the tax cuts passed by Republicans, they were an obvious corrupt act. Have to do something to punish the Repubs for Merrick Garland. Create a new foundation for respectful discourse in America. It's time for some honor and self-respect, America. You've been acting like a spoiled rich kid.",
            "created": "Wed, 16 Oct 2019 14:26:57 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/10/16/uncleSam.png"
        },
        {
            "text": "I want Obama to run again. <a href=\"https://twitter.com/davewiner/status/1184481434435801089\">This Obama</a>. ",
            "created": "Wed, 16 Oct 2019 14:49:34 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=kzXcNgCr0nk"
        },
        {
            "text": "President spoiled rich kid",
            "created": "Wed, 16 Oct 2019 19:20:50 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "As we all know President Trump is a spoiled rich kid.",
                    "created": "Wed, 16 Oct 2019 19:21:10 GMT"
                },
                {
                    "text": "Spoiled in the worst way. "
                },
                {
                    "text": "So our government is that of a spoiled rich kid."
                },
                {
                    "text": "The previous Repub president was also a spoiled rich kid, only diff is he discovered Christ and corporate graft. "
                },
                {
                    "text": "Trump went straight to the mob."
                }
            ]
        },
        {
            "text": "Breaking Bad overview",
            "created": "Wed, 16 Oct 2019 19:21:28 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "<i>Spoiler alert for everything. Sorry. I should really put this piece on <a href=\"http://spoilers.io/\">spoilers.io</a>, if it only existed.</i>",
                    "created": "Wed, 16 Oct 2019 19:34:08 GMT"
                },
                {
                    "text": "I'm on episode 8 of the final season of Breaking Bad, and I can now tell you why I cringe when people say it's the best TV show ever. I couldn't have said exactly why before. ",
                    "created": "Wed, 16 Oct 2019 19:21:36 GMT"
                },
                {
                    "text": "I like all kinds of crime stories. I like Goodfellas and Pulp Fiction. The Godfather is the best movie ever made. The Maltese Falcon. The Departed. I love them all, and they all have one thing in common. The lead character is sympathetic. Tony Soproano is the mob boss who is seeing a shrink and has a neurotic wife whose approval he desperately wants. He's sympathetic. Would Succession be as good if Logan Roy wasn't proud of his son for being so awful? :boom:",
                    "created": "Wed, 16 Oct 2019 19:22:10 GMT"
                },
                {
                    "text": "But Breaking Bad? I absolutely hate Walter White. Every episode provides new reasons to hate him. That's the central idea of the show. How hateable can we make Walter White? I hate that so many sympathetic people die before he goes. Gus Fring was sympathetic. Mike Ehrmentraut. I forget all the characters who die (I'm going to re-discover them now). All his adversaries are sympathetic. But he's an absolute worst piece of shit he could possibly be <i>and the show is all about him. </i>",
                    "created": "Wed, 16 Oct 2019 19:23:46 GMT",
                    "image": "http://static.scripting.com/larryKing/images/2013/09/09/ww.jpg"
                },
                {
                    "text": "One more thing. I'm a huge fan of Bojack Horseman. And his sidekick, like Gilligan to the Skipper, like Sgt Schultz to Col Klink, is <a href=\"https://bojackhorseman.fandom.com/wiki/Todd_Chavez\">Todd Chavez</a>. Who is played by Aaron Paul who plays Jesse Pinkman on Breaking Bad. And this time around, I hear Todd's voice when Jesse speaks. It's funny! Of course there's more overt satire in Bojack, even though I'm sure the Breaking Bad writers meant it to be funny in a hateful way. ",
                    "created": "Wed, 16 Oct 2019 19:26:08 GMT"
                },
                {
                    "text": "So I admire Breaking Bad. I am in awe of it, everything about it. But I also hate it because I have to focus on a character who I thoroughly despise. ",
                    "created": "Wed, 16 Oct 2019 19:27:33 GMT"
                }
            ]
        }
    ]
}