{
    "text": "October 18",
    "created": "Fri, 18 Oct 2019 13:46:15 GMT",
    "name": "18",
    "subs": [
        {
            "text": "<a href=\"https://en.wikipedia.org/wiki/Nixon_goes_to_China\">Nixon going to China</a> is a political story worth studying. Sometimes a moderate can be more progressive. The electorate is weird that way. ",
            "created": "Fri, 18 Oct 2019 16:39:25 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/10/18/nixon.png"
        },
        {
            "text": "I wish there were an Amy Klobuchar <a href=\"https://duckduckgo.com/?q=klobuchar+action+figure&t=h_&iax=images&ia=images\">action figure</a>. It should be a requirement for a serious presidential candidate. BTW, \"action figure\" is an adult-acceptable term for \"doll.\" I like them because they have white backgrounds and therefore look good in the right margin of my blog. I'd accept a nicely-cropped publicity photo, or a <a href=\"https://www.google.com/search?safe=off&rlz=1C5CHFA_enUS743US747&sxsrf=ACYBGNRAn_hn0qhFy73cHX9vwDBSGIcSmA:1571407618476&q=site:scripting.com+trump+head&tbm=isch&source=univ&sa=X&ved=2ahUKEwjy4ZXH_aXlAhWswFkKHaO6BpAQsAR6BAgJEAE&biw=1139&bih=1119\">disembodied head</a> like the ones I use for Trump.",
            "created": "Fri, 18 Oct 2019 14:04:29 GMT",
            "type": "outline"
        },
        {
            "text": "Just noticed GitHub has a <a href=\"http://scripting.com/images/2019/10/18/newGitHubHomePage.png\">new</a> home page. A bit motivated by Twitter perhaps. I like where they're going. Can't stop to take a closer look right now, just thought it was worth a mention. ",
            "created": "Fri, 18 Oct 2019 14:59:59 GMT"
        },
        {
            "text": "<a href=\"http://scripting.com/2018/10/18.html\">A year ago</a> I went digging around what remains of the <a href=\"http://bloggercon.scripting.com/\">BloggerCon</a> website, <a href=\"http://this.how/bloggercon/\">restoring</a> pieces like the <a href=\"http://scripting.com/archives/bloggerCon/I/participants/\">participant list</a> and the <a href=\"http://this.how/bloggercon/#1539876200000\">grids</a>. The first BloggerCon was 16 years ago, in 2003. It was the where the term <a href=\"http://bloggercon.scripting.com/iv/format.html\">unconference</a> was coined. ",
            "created": "Fri, 18 Oct 2019 13:46:16 GMT",
            "type": "outline"
        },
        {
            "text": "Would Brooks vote for Warren?",
            "created": "Fri, 18 Oct 2019 13:54:42 GMT",
            "type": "outline",
            "description": "He explains why Warren's election won't change anything, where electing a moderate Democrat would. I agree. ",
            "subs": [
                {
                    "text": "I always wonder why people disclaim that they don't like me before they point to something I've written as being relevant or important. So I won't tell you what I think of David Brooks. :boom: ",
                    "created": "Fri, 18 Oct 2019 13:59:10 GMT"
                },
                {
                    "text": "<a href=\"https://www.nytimes.com/2019/10/17/opinion/trump-warren-2020.html\">His column</a> in today's NYT is worth reading. He asks if it's Trump v Warren, who he, a moderate Republican, will vote for. I'll save you the suspense, it's Warren. Good, Brooks has a soul and isn't an idiot. ",
                    "created": "Fri, 18 Oct 2019 13:59:44 GMT",
                    "image": "http://scripting.com/images/2019/06/05/elizabethWarren.png"
                },
                {
                    "text": "Four years of Warren, who imho likely will be as ineffective a president as Jimmy Carter, is way better than four years of the accelerated lunacy of Trump. The United States, seriously, would not survive that. I don't think we'll survive another 1.5 years, which is why impeachment and removal is an urgent matter. ",
                    "created": "Fri, 18 Oct 2019 14:00:19 GMT"
                },
                {
                    "text": "He says \"If the party nominated one of those six, you really could see the Democrats gather progressives and moderates into an enduring majority coalition as the Republicans recede into old, white, rural obsolescence. You could see movement on a range of issues where large majorities are already stacked on one side: guns, climate change, reducing income inequality, expanding health coverage.\" ",
                    "created": "Fri, 18 Oct 2019 14:00:58 GMT"
                },
                {
                    "text": "I agree. A lot of change would be possible with a centrist Democrat in the presidency, they might even be possible with Warren. I like the progressive ideas, and I think our chance of progress is better if we elect a moderate in 2020. ",
                    "created": "Fri, 18 Oct 2019 14:01:34 GMT"
                },
                {
                    "text": "Like <a href=\"https://en.wikipedia.org/wiki/Nixon_goes_to_China\">Nixon going to China</a>, something worth considering, a moderate Democrat could be more effectively progressive than Warren. ",
                    "created": "Fri, 18 Oct 2019 16:37:05 GMT"
                }
            ]
        },
        {
            "text": "Breaking Bad report",
            "created": "Fri, 18 Oct 2019 17:15:21 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "As with previous installments, this contains spoilers. ",
                    "created": "Fri, 18 Oct 2019 17:15:33 GMT",
                    "image": "http://scripting.com/images/2019/10/18/jessePinkman.png"
                },
                {
                    "text": "I got up to <a href=\"https://www.hollywoodreporter.com/live-feed/breaking-bad-5-shocking-quotes-629629\">the</a> <a href=\"https://en.wikipedia.org/wiki/Ozymandias_(Breaking_Bad)\">episode</a> where Hank dies. A very pivotal scene. Walt loses his money to the Nazis, of course Hank dies as does his friend Gomez. Walter White comes unglued. All logic says, based on previous Walter White choices, that Hank must die. The Nazi, Jack, knows it, Hank knows it. Hank, after hearing Walter offer the Jack $80 million to let Hank live, must have been touched, because his final words were: \"You want me to beg? You're the smartest guy I ever met, and you're too stupid to see -- he made up his mind 10 minutes ago.\" It's a beautiful scene. And of course none of the events taking place wouldn't have happened if Walter weren't so blinded by his obsession with money, and his feelings about Jesse. ",
                    "created": "Fri, 18 Oct 2019 17:15:45 GMT"
                },
                {
                    "text": "I still hate Walter White, I guess I never doubted the depth of his character, he has a heart, and it's breaking now. ",
                    "created": "Fri, 18 Oct 2019 17:18:52 GMT"
                }
            ]
        },
        {
            "text": "Using git for code distribution",
            "created": "Fri, 18 Oct 2019 14:53:19 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I'm working on a project using <a href=\"https://github.com/steveukx/git-js#readme\">simple-git</a> in Node, and have what I think should be a simple application, not sure how to do it. ",
                    "created": "Fri, 18 Oct 2019 14:53:27 GMT",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "I have a local called myAppFolder containing the source for an application. Various JavaScript files, a package.json, folders for user data and stats. ",
                            "created": "Fri, 18 Oct 2019 14:54:27 GMT"
                        },
                        {
                            "text": "A location on GitHub, a <a href=\"https://github.com/scripting/test2\">repo</a> called test2 with a <a href=\"https://github.com/scripting/test2/tree/master/helloworld\">folder</a> whose path is helloworld/ that is meant to have the most up to date version of the files from the location on GitHub. ",
                            "created": "Fri, 18 Oct 2019 14:55:41 GMT"
                        },
                        {
                            "text": "It's a one-way sync, from the server to the local folder. ",
                            "created": "Fri, 18 Oct 2019 15:18:46 GMT"
                        }
                    ]
                },
                {
                    "text": "I have <a href=\"https://gist.github.com/scripting/397be0cf030bc3709eb73f3deb6f5912\">code</a> that clones the repo, but that gets a copy of everything in the repo. ",
                    "created": "Fri, 18 Oct 2019 15:10:46 GMT"
                },
                {
                    "text": "I just need to keep up to date with one folder. ",
                    "created": "Fri, 18 Oct 2019 15:19:08 GMT"
                },
                {
                    "text": "Any help much appreciated.",
                    "created": "Fri, 18 Oct 2019 15:14:55 GMT"
                },
                {
                    "text": "PS: I opened this as an <a href=\"https://github.com/steveukx/git-js/issues/403\">issue</a> on the simple-get repo. ",
                    "created": "Fri, 18 Oct 2019 15:25:26 GMT"
                }
            ]
        }
    ]
}