{
    "text": "October 20",
    "created": "Sun, 20 Oct 2019 17:56:13 GMT",
    "name": "20",
    "subs": [
        {
            "text": "To reporters: Someone should ask Trump how relevant he feels the Constitution is to his job and Congress's job.",
            "created": "Sun, 20 Oct 2019 18:31:47 GMT",
            "type": "outline"
        },
        {
            "text": "Too many remotes, still",
            "created": "Sun, 20 Oct 2019 17:56:14 GMT",
            "type": "outline",
            "description": "Apple TV will not get a lot of use. It doesn't have anything over Roku, and they make me put down the Roku remote and pick up theirs. ",
            "subs": [
                {
                    "text": "This started out being a review of the new Apple TV but the real story is same as it ever was, the living room networking situation is still a mess. ",
                    "created": "Sun, 20 Oct 2019 17:57:28 GMT",
                    "image": "http://scripting.com/images/2019/03/31/rokuRemote.png"
                },
                {
                    "text": "The reason -- <a href=\"http://scripting.com/images/2019/10/20/tooManyRemotes.png\">too many remotes</a>.",
                    "created": "Sun, 20 Oct 2019 18:32:28 GMT"
                },
                {
                    "text": "This tale started when the Spectrum app for Roku broke, I could no longer access my favorites. That meant every time I wanted to find a program, I had to fish through all the channels. I've learned over the years which channels I need, basically MSNBC, CNN, HBO, Showtime, the stations that have Law & Order, channels that carry the sports teams I follow. I imagine it's pretty similar for other people. After all these years you develop paths, and program the system accordingly. At this point, I'm not willing to use Spectrum without favorites. But I have been, and it's unacceptable.",
                    "created": "Sun, 20 Oct 2019 17:58:16 GMT"
                },
                {
                    "text": "Their support is also ridiculous. They want you to jump through the same set of hoops every time no matter what the problem is. I do what they ask, even though I have a theory about what happened. I'm pretty sure they broke something in an upgrade. I can tell I'm using a new version, they made little UI changes, at the same time Favorites stopped working. That's an Occam's Razor type thing. More evidence -- my Favorites are still there on my iPhone, iPad and in the new Apple TV. ",
                    "created": "Sun, 20 Oct 2019 18:01:12 GMT"
                },
                {
                    "text": "Which brings me to why I was interested in Apple TV in the first place. I thought perhaps I could just use Apple TV to access Spectrum, working around the breakage. $199 is a lot of money to spend to do that, but I had an extra HDMI port open on my TV, and I wanted to see what's new there, so why not. I had an old Apple TV, btw -- but the Spectrum app wasn't available for it. ",
                    "created": "Sun, 20 Oct 2019 18:05:16 GMT"
                },
                {
                    "text": "So I've spent a few days with Apple TV, trying to fit it into my routine. But it's not a good fit for mostly UI reasons. ",
                    "created": "Sun, 20 Oct 2019 18:06:10 GMT",
                    "subs": [
                        {
                            "text": "I have to use their remote. The Roku remote, which to me is the most natural, doesn't work with Apple TV. The Apple remote is innovative. Now I see why they were making a big deal about track pads. But it's slow and error-prone, compared to clicking the arrows on the Roku remote. ",
                            "created": "Sun, 20 Oct 2019 18:06:52 GMT"
                        },
                        {
                            "text": "But there's the problem now of having two remotes. One of my rules for design is \"One way is better than two, no matter how much better the second is.\" I bet Apple can prove that their remote is better. But on Rokui I think they should just use the Roku remote. I remember when I first shipped Mac software in 1984, I wanted to design my own (better) user interface. After a year or so we gave up on that and just used the Mac standard interface, even though it wasn't good for what we were doing. The pressure not to make people master a second UI was too great. ",
                            "created": "Sun, 20 Oct 2019 18:08:08 GMT"
                        },
                        {
                            "text": "And there's a third way -- the Mac mouse and keyboard to control Mac Mini, that I've had hooked into my living room TV for 15 years or so. In the old days it was very useful. These days, I prefer to use the streaming services. I use the Mac for demos, and to show videos of my own, though I could use the Apple TV for that. Honestly I don't know why I have a Mac under my TV these days, but I do.",
                            "created": "Sun, 20 Oct 2019 18:09:58 GMT"
                        }
                    ]
                },
                {
                    "text": "The net-net is that the Apple TV will not get a lot of use. It doesn't have anything over Roku, and they make me put down the Roku remote and pick up theirs. The Apple remote is weird, it doesn't work the way I feel it should. I'm sure they think I'm wrong, but I remember that I'm the customer, and there's an adage that goes with that too. ",
                    "created": "Sun, 20 Oct 2019 18:11:26 GMT"
                },
                {
                    "text": "\"curly\"",
                    "created": "Sun, 20 Oct 2019 18:12:40 GMT"
                }
            ]
        }
    ]
}