{
    "text": "October 23",
    "created": "Wed, 23 Oct 2019 12:22:55 GMT",
    "name": "23",
    "subs": [
        {
            "text": "We need a Wikipedia for news. A landing page for each story, with a summary, and pointer to coverage of all major news sites. As they all adopt paywalls I find it's hard to pick a good story to point to from pieces on my blog. Also I don't like pointing to news pages that are overloaded with crapware. Two bits of prior art. <a href=\"https://politicalwire.com/\">Political Wire</a> and <a href=\"https://www.memeorandum.com/\">Memeorandum</a>. I like Political Wire's synopses, and Memeorandum's accumulation of links and tweets. Merge those two ideas, and cover more than politics, that's the basic idea. And also use relatively future-safe server tech. ",
            "created": "Wed, 23 Oct 2019 13:29:02 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/01/14/mlk.png"
        },
        {
            "text": "We're having the fight to preserve the Constitution and rule of law, right now, today. It's debatable the extent to which the president is above the law, but certainly no one else is. Or are they? The Repubs are <a href=\"https://www.cnbc.com/2019/10/23/republicans-crash-secure-room-disrupt-testimony-in-impeachment-probe.html\">testing</a> that today.",
            "created": "Wed, 23 Oct 2019 18:42:10 GMT",
            "type": "outline"
        },
        {
            "text": "CNN is <a href=\"https://www.engadget.com/2019/10/23/cnn-newsco-news-aggregator-service/\">prepping</a> an online news aggregator to counter tech giants. Every big news site should be an aggregator and compete with Facebook. I was pitching CNN on this in 2004, fifteen years ago.",
            "created": "Wed, 23 Oct 2019 17:08:46 GMT",
            "type": "outline"
        },
        {
            "text": "The Ukrainian government has more backbone and honor than the supposedly honest American press, who were happy to <a href=\"http://scripting.com/images/2019/09/29/butHerEmailsYetAgain.png\">throw the election</a> to Trump for a few bucks.",
            "created": "Wed, 23 Oct 2019 16:08:31 GMT",
            "type": "outline"
        },
        {
            "text": "This is the best thing I've read on <a href=\"https://en.wikipedia.org/wiki/Toxic_masculinity\">toxic masculinity</a>. Imho it's a disease of the society not of one gender.",
            "created": "Wed, 23 Oct 2019 13:27:20 GMT",
            "type": "outline"
        },
        {
            "text": "After reading about <a href=\"https://www.memeorandum.com/191022/p100#a191022p100\">Taylor’s testimony</a> it’s amazing that there are still people as competent, honest and brave in our government, esp one who was appointed by Pompeo. I was of the belief they had all been removed.",
            "created": "Wed, 23 Oct 2019 13:20:45 GMT",
            "type": "outline"
        },
        {
            "text": "I may have found a workaround for the problems with Dropbox, but there are still <a href=\"https://twitter.com/davewiner/status/1186980696667103234\">outages at Amazon</a> causing problems elsewhere in Dave's Server Land. As Ringo Starr used to sing, <a href=\"https://www.youtube.com/watch?v=bvEexTomE1I\">It Don't Come Easy</a>. ",
            "created": "Wed, 23 Oct 2019 12:22:56 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=bvEexTomE1I"
        }
    ]
}