{
    "text": "October 24",
    "created": "Thu, 24 Oct 2019 14:30:04 GMT",
    "name": "24",
    "subs": [
        {
            "text": "As I've been <a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+%22bojack+horseman%22&t=h_&ia=web\">saying</a> since it started, <a href=\"https://www.theguardian.com/tv-and-radio/2019/oct/24/how-bojack-horseman-became-a-surprise-heartbreaking-hit\">Bojack Horseman</a> is one of the most consequential and riveting shows ever. And totally entertaining. People can't seem to accept that a cartoon could be all that. It can. The first half of the <a href=\"https://www.newsweek.com/bojack-horseman-season-6-netflix-1467313?fbclid=IwAR1x3_NtlXIgIYewpInO5oFyjjRIArLFQmm5SataD2UZNudvOe32qejxAFo\">sixth season</a> is on Netflix tonight. ",
            "created": "Thu, 24 Oct 2019 18:00:46 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/10/24/diane.png"
        },
        {
            "text": "I feel sorry for <a href=\"https://en.wikipedia.org/wiki/Richard_Engel\">Richard Engel</a> on MSNBC. His <a href=\"https://www.msnbc.com/11th-hour/watch/trump-withdrawal-of-u-s-troops-makes-putin-the-kingmaker-in-syria-71871557542\">reporting from Syria</a> raises a question that his colleagues in the US don't want to discuss. Russia moving in to take over from the US is no accident, it was the plan. In America for some reason they don't want to incorporate the obvious fact that Trump works for Russia, not for the United States. Over and over, for years, they pretend they don't know this. Why?",
            "created": "Thu, 24 Oct 2019 20:31:47 GMT",
            "type": "outline"
        },
        {
            "text": "I'd like to put down a bet. Another scandal will come out that has a cash quid pro quo. ",
            "created": "Thu, 24 Oct 2019 20:32:36 GMT",
            "type": "outline"
        },
        {
            "text": "Reporting on the demonstration put on by Republican House members yesterday, CNN repeated the claim that Repubs were being denied entry to the Shiff hearings. This is why the Repubs do these stunts, because journalism doesn't report the news in a realistic way. The technically correct lead-in would be: <i>Repubs put on a dishonest demo, trying to attract naive press coverage.</i> Now would be a good time to change the game with Repubs, because they don't have a choice but to accept reasonable rules re lies.",
            "created": "Thu, 24 Oct 2019 16:21:25 GMT",
            "type": "outline"
        },
        {
            "text": "On Facebook I <a href=\"http://scripting.com/images/2019/10/24/dearLeaderOrDrugDealer.png\">saw Trump</a> referred to as <i>dear leader</i> and my mind read <i>drug dealer. </i>It really happened, I'm not making this up. :banana:",
            "created": "Thu, 24 Oct 2019 15:02:54 GMT",
            "type": "outline"
        },
        {
            "text": "I hear they're doing a sequel to <a href=\"https://en.wikipedia.org/wiki/The_Matrix_(franchise)\">The Matrix</a>. May I suggest Matt Gaetz as <a href=\"https://en.wikipedia.org/wiki/Agent_Smith\">Agent Smith</a>. Adam Schiff as <a href=\"https://en.wikipedia.org/wiki/Morpheus_(The_Matrix)\">Morpheus</a>. AOC as <a href=\"https://en.wikipedia.org/wiki/Neo_(The_Matrix)\">Neo</a>, and Maxine Waters as <a href=\"https://en.wikipedia.org/wiki/The_Oracle_(The_Matrix)\">The Oracle</a>. ",
            "created": "Thu, 24 Oct 2019 15:06:48 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/12/15/neo.png"
        },
        {
            "text": "I'm glad to hear that <a href=\"https://twitter.com/amyklobuchar/status/1187374005906542592\">Amy Klobuchar</a> has qualified for the next Democratic debate. I want a candidate that everyone can get behind and that includes Republicans and former Obama voters who voted for Trump. We need a president who wins in a landslide, takes both houses, and someone who knows how to get things done in our political system. When we've elected \"outsiders\" the results have never been good for us. But Klobuchar's <a href=\"https://twitter.com/amyklobuchar/status/1187478894045257731\">confidence</a> isn't there yet. Warren has it, as does Sanders, but neither has the ability to govern with the full support of most Americans. We have to think clearly about how our political system will work after Trump. ",
            "created": "Thu, 24 Oct 2019 14:30:05 GMT",
            "type": "outline"
        }
    ]
}