{
    "text": "October 25",
    "created": "Fri, 25 Oct 2019 13:22:04 GMT",
    "name": "25",
    "subs": [
        {
            "text": "I wrote <a href=\"http://scripting.com/stories/2007/04/28/twitterAsCoralReef.html\">Twitter as Coral Reef</a> after meeting with <a href=\"https://twitter.com/jack\">Jack Dorsey</a> in 2007 and hearing his vision for Twitter as a platform. It was a good vision. ",
            "created": "Fri, 25 Oct 2019 13:22:05 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/10/29/microsoftBrain.png"
        },
        {
            "text": "Over the decades I've spun out a number of individual developers from teams I lead. That started when I sold Living Videotext to Symantec in 1987. I left the company a few months after the deal closed. I wasn't smart or patient enough to try to fit into someone else's company, and I had a <a href=\"http://frontier.userland.com/\">project</a> I really wanted to do. Here's the interesting thing. When I called back the developers I had left behind, and asked if they would collaborate on interop with my new product, they told me how they work for a big company now and can't collaborate with someone like me. Heh. I knew that they were working on a project with Apple called <a href=\"https://en.wikipedia.org/wiki/Bedrock_(framework)\">Bedrock</a>. Anyway, it happens all the time. Once they or I leave the nest, they don't see the value of continuing the collaboration. You'd think, schooled in the power of <a href=\"http://essaysfromexodus.scripting.com/priorArtDesignMethod\">prior art</a> and <a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+interop&t=h_&ia=web\">interop</a>, they'd want to go forth in the world and create more interop, but big companies are a big influence on the people who work there. Even relatively small companies (like Symantec in the 80s) have a lot of inward pull. ",
            "created": "Fri, 25 Oct 2019 13:24:41 GMT",
            "type": "outline"
        },
        {
            "text": "I have a <a href=\"https://www.waterfurnace.com/literature/premier/sp1555.pdf\">geothermal</a> heating and cooling <a href=\"https://www.waterfurnace.com/\">system</a> that works well, is supposed to be efficient (I haven't used it enough to verify) but there is one thing that sucks about it. When it turns on there's a huge slamming sound. Like a garage door. You can't sleep through it. It's jarring even when you're awake. I get mixed opinions. Some say the loud sound is just the way it works, and others say it's wrong, they have used geothermal systems that worked just like any other forced air heating or cooling system. Anyway I have the problem solved for now, at least in October. I don't turn the heat on. I use a space heater at night, and keep the bedroom door closed. But we haven't had a frost yet. Then I'll <a href=\"https://www.redcross.org/get-help/how-to-prepare-for-emergencies/types-of-emergencies/winter-storm/frozen-pipes.html\">need</a> another answer. ",
            "created": "Fri, 25 Oct 2019 13:41:16 GMT",
            "type": "outline"
        },
        {
            "text": "I think <a href=\"http://scripting.com/2019/03/17/135334.html#a144043\">Trump wants Biden</a> to run against, despite the \"optics,\" because he's the only Democrat who makes Trump seem young. In other words, surprise -- for the #1 narcissist, the reason is vanity. 💥",
            "created": "Fri, 25 Oct 2019 15:33:53 GMT",
            "type": "outline"
        },
        {
            "text": "On this day in 1986",
            "created": "Fri, 25 Oct 2019 16:34:02 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I watched <a href=\"https://www.youtube.com/watch?v=7ujwjqIldwU\">Game 6</a> of the 1986 World Series at my brother's apartment in Palo Alto, with our father.",
                    "created": "Fri, 25 Oct 2019 16:34:39 GMT",
                    "urlvideo": "https://www.youtube.com/watch?v=7ujwjqIldwU"
                },
                {
                    "text": "At the moment the ball went through Buckner's legs, I remember vividly my father rolling around on the floor.",
                    "created": "Fri, 25 Oct 2019 16:35:00 GMT"
                },
                {
                    "text": "It was the one time in a lifetime I saw my father let go."
                },
                {
                    "text": "It was wonderful."
                }
            ]
        }
    ]
}