{
    "text": "October 26",
    "created": "Sat, 26 Oct 2019 16:44:37 GMT",
    "name": "26",
    "subs": [
        {
            "text": "The new half-season of <a href=\"https://en.wikipedia.org/wiki/BoJack_Horseman#Season_6_(Part_One)\">BoJack Horseman</a> was of course very good. I gulped it down in two sittings. Can't wait for the final episodes on Jan 31.",
            "created": "Sat, 26 Oct 2019 17:14:16 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/06/24/trumpHead.png"
        },
        {
            "text": "I had a thought early in the Trump presidency that we should offer him a <a href=\"https://www.amazon.com/Trump-Art-Deal-Donald-J/dp/0399594493\">deal</a>. He could have $25 billion cash if he resigns immediately. That number goes down by a billion every month he stays. So he would have a very clear picture of how much the misery of being president was costing him. It would be good for us because it's a small amount of money, all things considered, and if we ever elect a president who would take the deal, we would <i>want</i> them to take the deal. I would say we could start there right now. Pelosi gets together with Moscow Mitch and visits the White House.",
            "created": "Sat, 26 Oct 2019 16:44:38 GMT",
            "type": "outline"
        },
        {
            "text": "I hear some Democrats are getting crazy about the choices we have for president. They're trying to think of someone to come in and save the day. They come up with the usuals, Bloomberg, Kerry, even HRC again. But what about <a href=\"https://en.wikipedia.org/wiki/Jay_Inslee\">Jay Inslee</a>, governor of Washington state? Really smart, thinks well on his feet, confident, has executive experience. Republicans would like him. I don't know about blacks, but he's so much more confidence-inspiring than Biden imho. ",
            "created": "Sat, 26 Oct 2019 17:03:46 GMT",
            "type": "outline"
        },
        {
            "text": "Oh Kyrie get over yourself",
            "created": "Sat, 26 Oct 2019 17:28:03 GMT",
            "type": "outline",
            "description": "Kyrie Irving thinks he's going to conquer NYC. LOL please don't make me laugh. ",
            "subs": [
                {
                    "text": "<a href=\"https://nypost.com/2019/10/25/kyrie-irvings-boldest-knicks-shot-nets-going-to-take-over-the-entire-city/\">Kyrie Irving</a> doesn't understand NY sports if he thinks the Nets are going to \"take over\" the city. He shouldn't say stuff like that if it's really his intention. More likely he'll be traded in two years to Chicago as a backup point guard. People will say, \"Remember Kyrie Irving? He had such a promising career. What happened to him?\" He should remember how NY chews up players who think they're bigger than the city. :boom: ",
                    "created": "Sat, 26 Oct 2019 17:18:15 GMT",
                    "type": "outline",
                    "image": "http://static.scripting.com/larryKing/images/2013/01/06/frazier.gif"
                },
                {
                    "text": "Let me explain. NY sports fans, except for Yankees fans who they may actually temporarily get a number of because all they care about is winning, suffer for very long periods waiting for their team to rebound. With the Knicks it seems to never happen. But we suffer anyway. We don't want the city to win Kyrie, we want <i>the Knicks</i> to win. We're tired of people rubbing their shit all over the Knicks. If you want to be loved by the city, and that's where we begin, you have to understand this. We aren't a prize to be won, we're loyalty that must be earned. Over generations. I went to Knicks games with my grandfather. Not much chance my loyalty will ever switch, Kyrie, but if you want my respect, you shouldn't say stupid shit like that.",
                    "created": "Sat, 26 Oct 2019 17:22:31 GMT",
                    "type": "outline"
                },
                {
                    "text": "One thing you may not appreciate coming from New Jersey is just how huge the city is. One basketball player, no matter how great he is, cannot conquer the city. Even the Mets in 1969 didn't. For a few days everyone was happy, then life went on. And we don't like arrogant assholes. Unfortunately the Knicks are currently owned by one, but we hope that is just a temporary thing. ",
                    "created": "Sat, 26 Oct 2019 17:29:50 GMT"
                }
            ]
        }
    ]
}