{
    "text": "October 27",
    "created": "Sun, 27 Oct 2019 16:29:42 GMT",
    "name": "27",
    "subs": [
        {
            "text": "Very few people use the <a href=\"http://scripting.com/images/2019/10/27/chatTabScreenShot.png\">Chat tab</a>, so I took it out of the list of active tabs. I'm going to keep looking for the best form of interaction for blog readers. Right now, it seems to be Twitter. The software is still running and can be accessed at <a href=\"http://chat.scripting.com/\">chat.scripting.com</a>. ",
            "created": "Sun, 27 Oct 2019 17:49:03 GMT",
            "type": "outline"
        },
        {
            "text": "I'm sorry I don't watch NFL games because Kaepernick. It's the least I can do.",
            "created": "Sun, 27 Oct 2019 20:52:13 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/09/26/colin.png"
        },
        {
            "text": "I'm trying to watch <a href=\"https://en.wikipedia.org/wiki/The_Spy_(TV_series)\">The Spy</a> on Netflix, but I keep expecting <a href=\"https://www.youtube.com/watch?v=iJZO5Hge2DY\">Borat</a> to show <a href=\"https://www.youtube.com/watch?v=Vb3IMTJjzfo\">up</a>. I'm watching for it. Anyway it's not that good. What is good that I found at random is the 1998 movie <a href=\"https://en.wikipedia.org/wiki/A_Simple_Plan_(film)\">A Simple Plan</a>. It got great reviews, but don't watch the trailer, it's a total spoiler. On Amazon.",
            "created": "Sun, 27 Oct 2019 20:56:51 GMT",
            "type": "outline"
        },
        {
            "text": "I bet it's going to turn out that Al Baghdadi was working with a famous Democrat to rig the 2016 election. \"The server\" will turn up in several places along with \"the missing emails.\"",
            "created": "Sun, 27 Oct 2019 20:27:49 GMT",
            "type": "outline"
        },
        {
            "text": "All is right with the world. The Knicks are 0-3. Some norms will never be broken, it seems. BTW, they say the last time the Knicks had a winning team was <a href=\"http://scripting.com/2014/11/13/jeremyLinWasACoralReef.html\">2012</a>. Already a long time ago. Here's what happened in a <a href=\"http://static.scripting.com/larryKing/images/2014/02/25/meloLin.gif\">single image</a>.",
            "created": "Sun, 27 Oct 2019 20:34:41 GMT",
            "type": "outline"
        },
        {
            "text": "One of the many things wrong with our president is he never wins. He always feels he has to sell. Can you imagine, never a moment to relax, kick back, and savor your accomplishments? What a terrible way to live.",
            "created": "Sun, 27 Oct 2019 16:29:43 GMT",
            "type": "outline"
        },
        {
            "text": "Wow some feeds go back years. Feed readers have to allow for this possibility. Here's an <a href=\"http://river6.scripting.com/feedviewer?url=http://rss.art19.com/the-daily\">example</a>, the Daily podcast. It has items going back to Feb 2017. ",
            "created": "Sun, 27 Oct 2019 17:47:41 GMT",
            "type": "outline"
        },
        {
            "text": "I find that I can't watch Mike Pence on TV anymore. In my mind I've written him off. It's no longer Mike Pence season. I feel the same way about Mike Pence as I feel about Game of Thrones.",
            "created": "Sun, 27 Oct 2019 20:48:48 GMT",
            "type": "outline"
        }
    ]
}