{
    "text": "October 31",
    "created": "Thu, 31 Oct 2019 13:58:07 GMT",
    "name": "31",
    "subs": [
        {
            "text": "The intro of this <a href=\"https://techcrunch.com/2019/10/31/how-i-podcast-im-listenings-anita-flores/\">TechCrunch piece</a> about podcasting got me to do a <a href=\"http://scripting.com/2019/10/31/theBeautyOfPodcasting.m4a\">podcast</a> myself. \"The beauty of podcasting is that anyone can do it. It’s a rare medium that’s nearly as easy to make as it is to consume.\" Thank you. That was by design.",
            "created": "Thu, 31 Oct 2019 16:40:02 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2019/10/31/theBeautyOfPodcasting.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "4745475"
        },
        {
            "text": "In today's podcast I talk about the 20th anniversary of the idea of podcasting. Not as soon as I thought: October 26, 2020. Having a <a href=\"http://scripting.com/2000/10/26.html\">blog archive</a> is useful. Here's a <a href=\"http://scripting.com/images/2019/10/31/podcastingCreationDay.png\">screen shot</a> of the relevant bit.  ",
            "created": "Thu, 31 Oct 2019 20:11:47 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=qaHLd8de6nM\">Obama</a>: \"People who do good really stuff have flaws.\"",
            "created": "Thu, 31 Oct 2019 17:30:00 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=qaHLd8de6nM"
        },
        {
            "text": "If the Repubs don't all work for Putin by now, they should be and probably are thanking the Dems, privately of course, for standing up for the co-equal branches idea at the heart of the Constitution. Without that their jobs would be meaningless. No power at all.",
            "created": "Thu, 31 Oct 2019 18:01:58 GMT",
            "type": "outline"
        },
        {
            "text": "Facebook is important. The man who created it deserves respect for that. No one else did it. If anyone would minimize his accomplishment it would be me, but I'm in awe of it. Start there. How can we work together to get the most out of what he built.",
            "created": "Thu, 31 Oct 2019 16:55:23 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/10/31/handbookRecentlyDeceased.png"
        },
        {
            "text": "I assume the NYT thinks that any ad that quotes the NYT is okay. But there are so many lies in the NYT. We need better grounding in truth before we can hold anyone else to only running truthful ads.",
            "created": "Thu, 31 Oct 2019 15:58:12 GMT",
            "type": "outline"
        },
        {
            "text": "In tweets today Trump is saying he's doing a good job as president. That's fair, they're half-truths and lies, but it's political speech so it doesn't have to be true. That is an American norm. The op-ed writers appear to not know this. ",
            "created": "Thu, 31 Oct 2019 14:22:11 GMT",
            "type": "outline"
        },
        {
            "text": "Trump vs the Constitution",
            "created": "Thu, 31 Oct 2019 18:17:22 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I wish journalism would consider that it's not Dems v Trump rather it's Trump v Constitution.",
                    "created": "Thu, 31 Oct 2019 18:17:30 GMT"
                },
                {
                    "text": "The Constitution needs protecting. The Repubs are for some reason willing to let the Democrats carry the ball alone. ",
                    "created": "Thu, 31 Oct 2019 18:17:44 GMT"
                },
                {
                    "text": "But when it gets to the Senate they won't have that luxury.",
                    "created": "Thu, 31 Oct 2019 18:20:48 GMT"
                }
            ]
        },
        {
            "text": "NPR reporting is Republican",
            "created": "Thu, 31 Oct 2019 13:58:08 GMT",
            "type": "outline",
            "description": "NPR isn't reporting the news, they're reporting Republican spin.",
            "subs": [
                {
                    "text": "NPR isn't reporting the news, they're reporting Republican spin.",
                    "created": "Thu, 31 Oct 2019 13:58:18 GMT"
                },
                {
                    "text": "For example this morning they talked for a half hour about the impeachment inquiry as a partisan issue, repeating the Republican claim that it's bad for the inquiry to be private. They said the Democrats in 1998 had the same objection, which wasn't true, because then there was a special prosecutor, Ken Starr, who did his inquiry in private before issuing his public report. As far as I know the Democrats never said this inquiry should be held in public. Even if they had it wouldn't have been. There are rules about the process designed to protect the accused and the process. NPR never presented the other side, how this all looks from the point of view of the Democrats, or more importantly, the Constitution, which is really what Trump has offended. (Could they cover a story without it being totally and inappropriatey partisan?)",
                    "created": "Thu, 31 Oct 2019 13:58:42 GMT",
                    "image": "http://scripting.com/images/2018/12/18/santa.png"
                },
                {
                    "text": "This is why the hearings have been private. ",
                    "created": "Thu, 31 Oct 2019 14:00:00 GMT",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "The DoJ wouldn't appoint a special prosecutor, so the House had to do it themselves.",
                            "created": "Thu, 31 Oct 2019 14:00:25 GMT"
                        },
                        {
                            "text": "Such inquiries are private to protect the accused because, if there is no indictment, they want to limit damage.",
                            "created": "Thu, 31 Oct 2019 14:00:35 GMT"
                        },
                        {
                            "text": "They want testimony to be private so the witnesses can't get their stories aligned.",
                            "created": "Thu, 31 Oct 2019 14:02:34 GMT"
                        }
                    ]
                },
                {
                    "text": "The Repubs also complained, through their NPR voice, that the president should have been given a chance to present his evidence. He <i>was</i> given the chance, and chose to try to obstruct the process instead of participating. Makes the Republican complaint seem hollow. ",
                    "created": "Thu, 31 Oct 2019 14:01:06 GMT"
                }
            ]
        }
    ]
}