{
    "text": "Trump can't arrest McFaul",
    "created": "Thu, 19 Jul 2018 13:25:08 GMT",
    "type": "outline",
    "description": "Someone would ask Hey boss, how exactly do you plan to get McFaul to show up for this interrogation? That would be the end of the discussion. ",
    "subs": [
        {
            "text": "Re exaggeration to feed our <a href=\"http://scripting.com/2018/07/19/131456.html\">rage addiction</a> -- a classic example. The president is considering whether to accept Putin's proposal to give Mueller access to the twelve <a href=\"https://en.wikipedia.org/wiki/Main_Intelligence_Directorate\">GRU</a> hackers in exchange for being given access to <a href=\"https://en.wikipedia.org/wiki/Michael_McFaul\">Ambassador McFaul</a> and <a href=\"https://en.wikipedia.org/wiki/Bill_Browder\">Bill Browder</a> and a few others. ",
            "created": "Thu, 19 Jul 2018 13:19:12 GMT",
            "image": "http://scripting.com/images/2018/07/19/strongman.png"
        },
        {
            "text": "This was a cause to set our hair on fire? It's a fantasy. It might happen in a few years if Trump is able to establish a dictatorship with no rule of law. No doubt he fantasizes about that, but it isn't happening now.  ",
            "created": "Thu, 19 Jul 2018 13:33:07 GMT"
        },
        {
            "text": "Yet Maddow and McFaul and a hundred reporters we'd like to respect pretend that Trump could do this! Hah. He's having a meeting about it, says Maddow. The mood is somber. This is gross malpractice. She must know it's no threat, that someone in the meeting would ask Hey boss, how exactly do you plan to get McFaul to show up for this interrogation? That would be the end of the discussion. No judge would sign a subpoena. No cop would arrest him. What would the charge be? We have the rule of law in the US, and thank goodness it's holding. ",
            "created": "Thu, 19 Jul 2018 13:26:22 GMT"
        },
        {
            "text": "There is plenty to be upset about, but this is a cheap thrill. The liberal media is being every bit as bad as Fox News. Cut it out. We have minds, we're educated and we know when you're bullshitting. This is bullshit.",
            "created": "Thu, 19 Jul 2018 13:24:25 GMT"
        }
    ]
}