{
    "text": "Finding myself in therapy",
    "created": "Thu, 21 Sep 2017 13:22:27 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I was in <a href=\"https://en.wikipedia.org/wiki/Psychotherapy\">therapy</a> for eight years, a long time ago, and while I often asked for advice there was only one time when the therapist gave it. ",
            "created": "Thu, 21 Sep 2017 13:22:39 GMT",
            "image": "http:///scripting.com/images/2017/09/21/tree.png"
        },
        {
            "text": "She said this: Sometimes people are wrong. ",
            "created": "Thu, 21 Sep 2017 13:26:00 GMT"
        },
        {
            "text": "There had been a family trip I wasn't allowed to participate in. I had asked to go, and was told no. I was angry and disappointed. I couldn't find a way for it to make sense. Her point was this. They are being bad family members. You can stop grappling with this. You can stop trying to see it from their point of view because they are just wrong.  ",
            "created": "Thu, 21 Sep 2017 13:23:15 GMT"
        },
        {
            "text": "I asked why this time she made an exception. She said she was human too, and didn't want to go through this with me, yet again. I suppose she wondered why I couldn't figure it out. Or maybe she thought I was ready to hear it. I learned something about myself then, that through nature and/or nurture, my sense of self had disappeared. I had lost the ability, if I ever had it, to see things from my own point of view. It was a big day for me. I'll probably never forget it. ",
            "created": "Thu, 21 Sep 2017 13:24:13 GMT"
        },
        {
            "text": "After that event, I saw lots of opportunity to see things from my own point of view. An example. I had gone to a conference and had mistakenly scheduled two things for the same time. I was fretting. What do I do about this? Which one should I go to and which should I blow off? My new inner voice found the answer, in a question: What do you <i>want</i> to do? That would not have occurred to me before. ",
            "created": "Thu, 21 Sep 2017 13:27:37 GMT"
        },
        {
            "text": "The <a href=\"https://www.thecut.com/2017/09/why-wont-my-therapist-just-tell-me-what-to-do.html\">piece</a> that inspired this story tries to answer the question of why therapists don't just tell you what to do. The purpose of therapy is to help you discover yourself. I know that sounds dorky and new-age-y, but it is literally what you're doing. You're bouncing around the world, looking for answers everywhere but the only place that can provide them, inside yourself. But if you don't know you exist, how can you find that place? A therapist patiently shines the light on that space, over and over, hoping that this year, or maybe next, you'll figure it out. ",
            "created": "Thu, 21 Sep 2017 13:29:03 GMT"
        }
    ]
}