{
    "text": "Belch water",
    "created": "Thu, 29 Apr 2021 11:42:23 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "\"Greps wasser\" is the Yiddish word for seltzer. ",
            "created": "Thu, 29 Apr 2021 11:43:09 GMT",
            "flInCalendar": true
        },
        {
            "text": "It translates literally to \"belch water.\"",
            "created": "Thu, 29 Apr 2021 11:45:14 GMT",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://en.wikipedia.org/wiki/The_Three_Stooges\">The Three Stooges</a> playing with <i>greps wasser.</i>",
            "created": "Thu, 29 Apr 2021 11:42:26 GMT",
            "inlineImage": "http://scripting.com/images/2021/04/29/threeStoogesFightingWithSeltzerBottles.png",
            "flInCalendar": true
        },
        {
            "text": "<b>Mit gas</b>",
            "created": "Thu, 29 Apr 2021 21:51:37 GMT",
            "flInCalendar": true
        },
        {
            "text": "Another story. First time I visited Switzerland in 2000, to go to the World Economic Forum conference in Davos, I was very impressed by many things, including the two types of bottled water that were available called 1. Still and 2. Mit gas. It still makes me laugh. You know in English \"mit gas\" is something you say when you're farting a lot. I am mit gas, I might have said to my German grandmother, <a href=\"http://www.greatvavavoom.com/stories/storyReader$124\">Lucy Kiesler</a>. She thought I was a nice boy except when I said things like that. ",
            "created": "Thu, 29 Apr 2021 21:47:14 GMT",
            "flInCalendar": true
        },
        {
            "text": "Three of my grandparents, Rudy Kiesler (her husband), Baruch and Sima Winer, were Jewish, but Lucy Kiesler was Lutheran from Hamburg in north Germany. Blonde hair and blue eyes. I think she was actually kind of anti-semitic, which is weird because she married a Jew. She might have done it to get back at her parents, the story went. Or she might have been confused. She died at 66, my first grandparent to go, when I was a grad student in Madison. I used to stay at her <a href=\"https://www.google.com/maps/@40.5735367,-73.863431,3a,75y,49.15h,87.25t/data=!3m6!1e1!3m4!1sH90kfd-HjSqxwYfJBxsdGQ!2e0!7i16384!8i8192\">house</a> in Rockaway when my parents traveled. It was a nice place, just a few blocks from one of the <a href=\"=!3m7!1e1!3m5!1smG2Z5B0rVCc-oDpPMiCurQ!2e0!6shttps:%2F%2Fstreetviewpixels-pa.googleapis.com%2Fv1%2Fthumbnail%3Fpanoid%3DmG2Z5B0rVCc-oDpPMiCurQ%26cb_client%3Dmaps_sv.tactile.gps%26w%3D203%26h%3D100%26yaw%3D95.56618%26pitch%3D0%26thumbfov%3D100!7i16384!8i8192\">best beaches</a> anywhere. Really good waves. She was born over a hundred years ago (I could do the math, approximately, she was 66 in 1977, so I guess that says she was born in 1911? Her brother, my great uncle, <a href=\"https://en.wikipedia.org/wiki/Arno_Schmidt\">Arno Schmidt</a>, is a famous German novelist, in intellectual circles. When I tell people from Germany that I'm related to Arno Schmidt, they either look at me like I'm an idiot (Schmidt is a common name in Germany!) or the they are impressed. I inherited a lot from her, for better or worse. :rocket:",
            "created": "Thu, 29 Apr 2021 21:52:36 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}