{
    "text": "Universities can help preserve the web",
    "created": "Sat, 12 May 2018 16:40:45 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I've asked this question for years. It's a question that should be on the mind of everyone who has personally created a website with its own domain name. The question: What happens when I die? ",
            "created": "Sat, 12 May 2018 16:41:05 GMT",
            "image": "http://scripting.com/images/2018/05/12/polandSpring.png"
        },
        {
            "text": "It's not hypothetical. I am holding on to sites for two relatives who have passed on. My mother's blog was (and is) hosted on wordpress.com, so that's pretty well taken-care-of, I hope. But my father and uncle had their own domains.",
            "created": "Sat, 12 May 2018 16:42:01 GMT"
        },
        {
            "text": "Then there's a matter of <a href=\"http://scripting.com/\">scripting.com</a> and all the other domains I've started over the years. In those sites are notes about early web technologies, and how they came to be. These will be interesting to future scholars. I know because I'm interested in how, for example, the subways were started in the United States (Boston was <a href=\"https://en.wikipedia.org/wiki/History_of_the_MBTA\">first</a>, not New York, and a <a href=\"https://en.wikipedia.org/wiki/Frank_J._Sprague\">key invention</a> made it <a href=\"https://www.youtube.com/watch?v=Ptj004XFH0c\">possible</a>). I'm glad historians have the records to refer to. I want to be sure that future historians have access to what I've written about the early development of the web, and the links I've kept in my blog. (In general, I am interested in how all technologies boot up, the older the better.)",
            "created": "Sat, 12 May 2018 16:42:52 GMT",
            "urlvideo": "https://www.youtube.com/watch?v=Ptj004XFH0c"
        },
        {
            "text": "Yes, I know about archive.org, but that's a backup. A very important piece! I'd like to keep the actual sites around. I'd like to put down some money now to reserve the name and protect the contents of the site, for perpetuity, or as long as possible. :rocket:",
            "created": "Sat, 12 May 2018 16:45:04 GMT"
        },
        {
            "text": "It struck me that this is a service that the alumni associations of the two universities I attended could provide, for a fee of course. Universities tend to be long-lived, and they are places where historians work, so they can hopefully be trusted not to modify the contents of the sites.",
            "created": "Sat, 12 May 2018 16:45:39 GMT"
        },
        {
            "text": "As far as I know, no university does this. ",
            "created": "Sat, 12 May 2018 16:46:41 GMT"
        },
        {
            "text": "And it need not be limited to the schools you have attended. If another university offered the service, I'd give them the money. ",
            "created": "Sat, 12 May 2018 17:06:17 GMT"
        },
        {
            "text": "The service, to be clear has two parts:",
            "created": "Sat, 12 May 2018 16:47:11 GMT",
            "flNumberedSubs": "true",
            "subs": [
                {
                    "text": "Keep the name scripting.com registered for perpetuity. In other words, pay the $10 registration fee every year.",
                    "created": "Sat, 12 May 2018 16:47:29 GMT"
                },
                {
                    "text": "Keep the static content accessible over HTTP. ",
                    "created": "Sat, 12 May 2018 16:47:52 GMT"
                }
            ]
        },
        {
            "text": "For that, you'd be entitled to $1000, say. Or even more, possibly. It should be hugely profitable. And why wait until I die. Let's start hosting the static sites there asap. :boom:",
            "created": "Sat, 12 May 2018 16:48:04 GMT"
        },
        {
            "text": "PS: This is a service they'd provide for free to faculty. Many universities probably already do, but not the domain name part.",
            "created": "Sat, 12 May 2018 17:08:01 GMT"
        }
    ]
}