{
    "text": "The love of the Mets",
    "created": "Mon, 30 Sep 2019 13:31:06 GMT",
    "type": "outline",
    "description": "This year's Mets weren't a great team, yet -- but the seeds of greatness were definitely there. Can't wait for opening day 2020 season. ",
    "subs": [
        {
            "text": "I watched the last Mets game of the 2019 season yesterday. I guess  alot of people did, we wanted to see the rarest of things -- a Mets home run hitter. No Met had ever had the most home runs in MLB in a season, but Pete Alonso, a rookie pulled it off. He also set the record for most home runs in a season by a rookie. And he has a flair for public relations and is a natural born leader.",
            "created": "Mon, 30 Sep 2019 13:31:29 GMT",
            "image": "http://scripting.com/images/2019/09/30/metsCap.png"
        },
        {
            "text": "The game went into extra innings, and it looked for sure that the Mets would lose it after unbelievably bad relief pitching, which for the 2019 Mets is saying a lot. But in the bottom of the 11th, a miracle. With runners on first and second, <a href=\"https://www.nydailynews.com/sports/baseball/mets/ny-dominic-smith-walk-off-home-run-atlanta-braves-20190929-now4zxifajf6zaja7al57ystau-story.html\">Dom Smith</a>, who had been injured and hadn't come to the plate since July, hit a three-run home run for a dramatic and hugely spirited walk-off win. It's fitting that the Mets didn't make the playoffs this year, and also fitting that this lovely young team went out with such a flourish after it appeared the season would end in utter disappointment. ",
            "created": "Mon, 30 Sep 2019 13:33:31 GMT"
        },
        {
            "text": "I've loved the Mets since 1962. It's a family tradition among the Winers and Kieslers. There's a new crew, rookies, a Cy Young winner and the certain Rookie of the Year. And an awkward but fun and loving group of misfits who somehow reach into your heart and give you a glimpse of their coming greatness. This is the cycle of the Mets. Can't wait for opening day in 2020. ",
            "created": "Mon, 30 Sep 2019 13:35:55 GMT"
        }
    ]
}