{
    "text": "The Halliburton Choke",
    "created": "Mon, 26 May 2025 12:38:01 GMT",
    "type": "outline",
    "description": "They will call this dance The Halliburton Choke. Reggie Miller made it famous and Halliburton made it ridiculous, and vice versa.",
    "subs": [
        {
            "text": "I never really had any opinion about the Indiana Pacers. ",
            "created": "Mon, 26 May 2025 12:38:15 GMT",
            "flInCalendar": true
        },
        {
            "text": "Honestly I was surprised they even made the playoffs this year.",
            "created": "Mon, 26 May 2025 12:39:04 GMT",
            "flInCalendar": true
        },
        {
            "text": "And they did catch the Knicks with their pants down, after clearing out the reigning champion Boston Celtics in the second round of the playoffs this year, it took some time before they found their balance again. We learned, again, that we need to have some minutes every game where Brunson takes a long well-deserved rest, so there's room for KAT to lead the team (our other all-star and all-NBA player), and make sure the other Knicks get a chance to shine, and give the Pacers something to guess about. Brunson is great at charging the rim against all odds, but you don't make the Finals if that's the only trick in your quiver. Hopefully we don't have to keep learning that lesson. ",
            "created": "Mon, 26 May 2025 12:39:14 GMT",
            "flInCalendar": true
        },
        {
            "text": "The Halliburton Choke.",
            "created": "Mon, 26 May 2025 12:52:41 GMT",
            "inlineImage": "https://imgs.scripting.com/2025/05/26/halliburtonChoke.png",
            "flInCalendar": true
        },
        {
            "text": "My advice for Halliburton, take a moment and breathe and realize <i>this series isn't over.</i> The Knicks have a say in it too. And the two teams are remarkably well matched. And despite what the pundits say, there's nothing very special about the Pacers, in fact they have some growing up to do. Halliburton, if they should happen to win another game this year, should learn that either of the first two games in the series could easily have gone the other way. And so should the freaking pundits, when they focus on how great the Pacers were and how pitiful the Knicks are. The Pacers won the first game by three points, and the second one by five. And the Knicks won the third game by six. Could have gone the other way too. And the Knicks are fucking great at overcoming 20-point deficits. The absolute best in the NBA. I have to remember that too, because there was a point in yesterday's game where I gave up. Dave of little faith. ",
            "created": "Mon, 26 May 2025 12:41:20 GMT",
            "flInCalendar": true
        },
        {
            "text": "They will call this dance The Halliburton Choke. <a href=\"https://www.ebay.com/itm/155665636105\">Reggie Miller</a> made it famous and Halliburton made it ridiculous, and vice versa.  ",
            "created": "Mon, 26 May 2025 12:38:46 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}