{
    "text": "Why Tesla FSD is unsafe",
    "created": "Tue, 21 May 2024 11:47:12 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Here's what I've learned from <a href=\"https://www.google.com/search?q=site%3Ascripting.com+tesla\">owing</a> a Tesla Model Y with <a href=\"http://scripting.com/2024/04/10/230303.html\">Full Self Driving</a>. I don't believe it's safe. It absolutely does require your full attention at all times. You are still driving the car. I've seen it do crazy stuff in simple situations. I've seen it panic, basically throw its hands in the air and say Dave this is your problem. That's why you always have to be ready, as if you were driving the car yourself because at any moment you could be. You never know when it's going to happen. Now focus on that moment. Your car has given up and turned the driving over to you. How much experience do you have with that? Do you know where to look? Do you hit the brakes or veer to the left or right? If you're an experienced driver, a lot of these reactions are completely programmed into the lower levels of the brain. You don't have to think at all. When the car panics, I tend to panic. If I had 10 or 20 years experience with this connection, then I guess it's probably safe. But not the way it is. ",
            "created": "Tue, 21 May 2024 11:36:14 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2024/05/21/teslaModelY.png",
            "flInCalendar": true
        },
        {
            "text": "I'm amazed there aren't more terrible accidents with FSD, and that Tesla still promotes this as \"self-driving,\" which it is not. ",
            "created": "Tue, 21 May 2024 11:49:41 GMT",
            "flInCalendar": true
        },
        {
            "text": "Also, I love my Tesla. Every time I get into that mofo I feel privileged. It looks like a Toyota Camry but drives like a muscle car. I might still switch to a <a href=\"https://www.caranddriver.com/kia/ev9\">Kia EV9</a>, at some point, if it drives as well as the Tesla, simply because the nearest Telsa dealer is over an hour away, and the <a href=\"https://www.romeokia.com/\">Kia dealer</a> is in <a href=\"https://en.wikipedia.org/wiki/Kingston,_New_York\">Kingston</a> which is practically in the neighborhood. ",
            "created": "Tue, 21 May 2024 11:49:55 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}