{
    "text": "The Leftovers don't warm up",
    "created": "Sun, 02 Jan 2022 15:23:17 GMT",
    "type": "outline",
    "metaImage": "http://scripting.com/images/2022/01/02/leftovers.png",
    "description": "Watch the first season in its entirety. Then watch the last episode of the last season.",
    "subs": [
        {
            "text": "I've been feeling a little under the weather the last few days so I decided it was time for a binge-watch of something familiar, <a href=\"https://en.wikipedia.org/wiki/The_Leftovers_(TV_series)\">The Leftovers</a> on HBO. I had watched it when it came out, one episode at a time, over three seasons. ",
            "created": "Sun, 02 Jan 2022 15:18:26 GMT",
            "flInCalendar": true
        },
        {
            "text": "I think this is a series that was never meant to be binged, because it became harsh and ridiculous, but I remembered it had a great ending. It was one of those science fiction plots that actually makes sense. Unlike <a href=\"https://en.wikipedia.org/wiki/Lost_(TV_series)\">Lost</a>, for example, that sputtered out at the end and never explained the mystery -- Leftovers very much does explain itself. And the crazy thing is that I didn't remember the plot until I watched the whole thing and it was explained in the last scene of the last episode of the final season. ",
            "created": "Sun, 02 Jan 2022 15:24:21 GMT",
            "flInCalendar": true
        },
        {
            "text": "So if you want to watch the show, here's what I recommend. Watch the first season in its entirety. Then watch the last episode of the last season. You might not understand some of the setup, but you'll totally get the punchline, and it's a good one and worth it. The rest of it is crap imho, and I'm surprised the show has held on to its <a href=\"https://www.metacritic.com/tv/the-leftovers\">high rating</a>. I think maybe we need to re-review these shows after they've been out there for a few years to see if they hang together as rapid-watches. ",
            "created": "Sun, 02 Jan 2022 15:25:06 GMT",
            "flInCalendar": true
        },
        {
            "text": "One thing about the show, not sure if it's the cause, but my dreams have been a lot more vivid and annoying the last few nights while I've been doing the binge. ",
            "created": "Sun, 02 Jan 2022 15:23:39 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}