{
    "text": "The Future of RSS",
    "created": "Sat, 04 Nov 2023 15:06:32 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Last Tuesday I did a <a href=\"http://scripting.com/2023/10/31.html#a214551\">podcast</a> specifically for Tim Carmody. But you can listen to, and I hope you do.  ",
            "created": "Sat, 04 Nov 2023 14:57:35 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I do this from time to time, when I want to work with someone, I often will speak directly to them in public. Because <a href=\"https://www.google.com/search?q=site%3Ascripting.com+working+together\">working together</a> is the only way to bootstrap open systems. I did it because I saw Tim, who I know as a smart tech writer, a creative person and thinker, as someone who could appreciate how little it takes to start a bootstrap. ",
            "created": "Sat, 04 Nov 2023 15:06:46 GMT",
            "flInCalendar": true
        },
        {
            "text": "It worked. Yesterday he wrote a <a href=\"https://kottke.org/23/11/the-future-of-rss-is-textcasting-1\">piece on kottke.org</a> that got a lot of coverage. It got a lot of people thinking about \"textcasting\" and \"RSS\". ",
            "created": "Sat, 04 Nov 2023 15:08:24 GMT",
            "flInCalendar": true
        },
        {
            "text": "The coolest thing he said are the first four words in the headline. <i>The Future of RSS</i> -- you know I've never seen anyone write those four words because RSS got so thoroughly maligned by the bigco's of tech, they really did a number on RSS, probably because it was so freaking good and so freaking simple. Who needs big tech companies to make it usable for you if it's basically usable all on its own. :boom:",
            "created": "Sat, 04 Nov 2023 15:35:19 GMT",
            "flInCalendar": true
        },
        {
            "text": "Tim made the point I couldn't make on my own. People must think I have a conflict with RSS, but I've never made any money from RSS, I advocate on its behalf because I think it's the right thing to do. And I wanted to show Tim that if he did it, people would listen. And they did! Oh my. I heard about it from so many people. Did you see this piece on Kottke!? I was told/asked yesterday over and over. ",
            "created": "Sat, 04 Nov 2023 15:09:23 GMT",
            "flInCalendar": true
        },
        {
            "text": "And maybe people are now beginning to see that RSS would make the perfect connective protocol in addition to the more complex ActivityPub for the next generation of social networks. He also got me excited, now knowing that I am not the only person trying to push this boulder up a hill. ",
            "created": "Sat, 04 Nov 2023 15:10:00 GMT",
            "flInCalendar": true
        },
        {
            "text": "Feeds are still there to help tie everything together. RSS only exists because people want it to exist. The more you want it to exist, the more it will. ",
            "created": "Sat, 04 Nov 2023 15:10:25 GMT",
            "flInCalendar": true
        },
        {
            "text": "So Tim, let's keep beating the drum. The goal as far as I'm concerned is to craft the perfect environment for writers on the web. We still have not tried to do that, because the BigCo's have convinced us that we need to be locked-in to get anything out of the tech. Well I'm here to tell you that's not true. And in the coming weeks and months I hope to prove it to you. ",
            "created": "Sat, 04 Nov 2023 15:10:44 GMT",
            "flInCalendar": true
        },
        {
            "text": "It's time to <i>do</i> stuff. Let's all work together on this. You'd be amazed how few people it takes to get something like \"textcasting\" going. ",
            "created": "Sat, 04 Nov 2023 15:11:05 GMT",
            "flInCalendar": true
        },
        {
            "text": "PS: I don't agree with everything Tim said in his list of four needs. I don't need metrics or moderation. Believe me, I know about abuse, I knew about it before all of you did, because in the beginning I was the target of most of the abuse in the blogosphere. I learned some fundamental things about abuse, don't offer people a way to abuse you and you won't be abused. It means don't think of this as a conversational medium, and don't count on everyone hearing you. Use it for thinking out loud, and be happy when people hear you, but don't expect it.",
            "created": "Sat, 04 Nov 2023 15:13:43 GMT",
            "flInCalendar": true
        },
        {
            "text": "PPS: At the end Tim asks what his role is. He's a writer and damned good one and one who thinks about how his writing gets to readers. I haven't found many writers who are thinking about that, but imho they <i>all</i> should be, esp right now when the dominance of tech companies is so iffy, when the possibilities are so open. I write software for writers, so I exist to make Tim happy. I want to be sure he can use the writing tools he loves (btw, maybe more than one, for different kinds of writing). ",
            "created": "Sat, 04 Nov 2023 15:36:57 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}