{
    "text": "Joy Reid and the jarring",
    "created": "Sat, 28 Apr 2018 17:50:53 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "<a href=\"https://www.hollywoodreporter.com/news/msnbcs-joy-reid-says-i-genuinely-do-not-believe-i-wrote-hateful-things-1106686\">Joy Reid's apology</a>: \"I genuinely do not believe I wrote those hateful things, because they are completely alien to me.\"",
            "created": "Sat, 28 Apr 2018 17:51:05 GMT"
        },
        {
            "text": "I think she's lying. It's just not believable. ",
            "created": "Sat, 28 Apr 2018 17:51:23 GMT",
            "image": "http://scripting.com/images/2018/04/28/jar.png"
        },
        {
            "text": "I think if Reid were honest she'd say -- yes it was jarring for me to see a man kissing a man. And go from there to a broader message of healing. It's hypocritical of us to put down other people for feeling this way. Maybe we can listen better, and accept that other people find jarring what we find normal and remember when it felt jarring for us, and not hold it against them, as we wouldn't want it to be held against us. Had Joy Reid said that, I would be cheering her. ",
            "created": "Sat, 28 Apr 2018 17:54:02 GMT"
        },
        {
            "text": "Unless zombies did actually modify her blog post. :boom:",
            "created": "Sat, 28 Apr 2018 19:47:59 GMT"
        },
        {
            "text": "Truth is it <i>is</i> still somewhat jarring to see two men walking in the park holding hands. But <a href=\"http://thesaurus.land/?word=jarring\">jarring</a> is ok. In fact jarring is good. It means a limit you have, something that's holding you back, is breaking. Eventually jarring turns into unusual, which becomes nothing, just part of life in the big city.",
            "created": "Sat, 28 Apr 2018 17:52:38 GMT"
        },
        {
            "text": "I took a walk in the middle of writing this piece, and noticed a male couple in front of me, holding hands. Normally I wouldn't have noticed it, but now it's on my mind.",
            "created": "Sat, 28 Apr 2018 19:41:44 GMT"
        },
        {
            "text": "Get this -- 20 years ago it felt weird to me to hug another man. I got over it. But sometimes it still feels weird. It still feels more natural for me to hug a woman. ",
            "created": "Sat, 28 Apr 2018 17:53:32 GMT"
        },
        {
            "text": "One more thing: Had she been a man, or not a journalist, I doubt if journalists and politicians would have been as accepting of her non-apology <a href=\"https://www.thedailybeast.com/joy-reid-apologizes-for-homophobic-posts-she-doesnt-remember-writing\">apology</a>. ",
            "created": "Sat, 28 Apr 2018 19:44:38 GMT"
        }
    ]
}