{
    "text": "A mutual defense pact against racism",
    "created": "Thu, 12 Jul 2018 14:34:59 GMT",
    "type": "outline",
    "description": "As a white person I can't become black. But I can make a statement that I stand with them. ",
    "subs": [
        {
            "text": "A Twitter account called <a href=\"https://twitter.com/BlkAndPr0ud/status/1016367865400832000\">Black and Proud</a> addresses white people: ",
            "created": "Thu, 12 Jul 2018 14:35:08 GMT",
            "subs": [
                {
                    "text": "<i>Please stop saying 'I don't see color.' Instead -- I see you and your struggle, because of your skin color. I will stand with you to end racism. </i>",
                    "created": "Thu, 12 Jul 2018 14:51:50 GMT"
                }
            ]
        },
        {
            "text": "I agree. Race <i>is</i> visible, and the statement that you don't see it is ludicrous. We see it. To say otherwise is to push it aside. I've written about this a few times before, once in an explainer about <a href=\"http://scripting.com/liveblog/users/davewiner/2016/01/17/0880.html\">Black Lives Matter</a>, and what it means, from a white person's perspective. ",
            "created": "Thu, 12 Jul 2018 14:37:24 GMT"
        },
        {
            "text": "I want to do more. I feel compelled, not just to make life safer and simpler for people of color, but also to put up a roadblock to racism, to let it know that it will encounter resistance. Some things are better kept under cover. Racism for sure is one of them. ",
            "created": "Thu, 12 Jul 2018 14:39:01 GMT"
        },
        {
            "text": "In the past I've <a href=\"http://scripting.com/2016/12/30/theMlkButtonsArrived.html\">proposed</a> that we all wear Martin Luther King buttons. I felt his <a href=\"http://scripting.com/images/2017/12/09/mlk.png\">image</a> was perfect because he's a black man, he preached non-violence, and was active, not passive, in his quest for equality and fairness. A white person wearing a <a href=\"http://scripting.com/images/2017/12/09/mlk.png\">MLK button</a> makes a statement of equivalence. Treat me as you would treat a black person. If a majority of whites wore these buttons it would make a promise to our fellow citizens, that if there's trouble, we're standing with you. <i>When</i> there's trouble. ",
            "created": "Thu, 12 Jul 2018 14:39:49 GMT",
            "image": "http://scripting.com/images/2017/12/09/mlk.png"
        },
        {
            "text": "It would be like Article 5 in NATO. An attack on one of us is an attack on all of us. As a white person I can't become black. But I can make a statement that I stand with people of color. ",
            "created": "Thu, 12 Jul 2018 14:49:50 GMT"
        }
    ]
}