{
    "text": "Mid-day ramble",
    "created": "Fri, 13 Dec 2024 16:18:41 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "There was a moment a couple of years ago when Mastodon was gaining traction in a serious way when I thought that Automattic should do something publicly to demonstrate support for it because I felt that WordPress and Mastodon were two sides of the same important coin. ",
            "created": "Fri, 13 Dec 2024 16:18:50 GMT",
            "flInCalendar": true
        },
        {
            "text": "As you know, I've felt as a writer that we've been tragically limited by the idea that Twitter popularized that there was glory in removing features that writers could use. As if to say that writers were over-using things like links, simple styling, titles, the ability to edit, or to finish a thought. These were all very basic features of writing on the web before 2006, as they should have been. ",
            "created": "Fri, 13 Dec 2024 16:25:54 GMT",
            "flInCalendar": true
        },
        {
            "text": "Somehow a mass psychosis took over and there was a belief that these limits were good. I am shaking my head as I write this. It's as ridiculous an idea as the one that's going around at the top levels of our <a href=\"https://www.reuters.com/world/us/trump-discuss-ending-childhood-vaccination-programs-with-rfk-jr-2024-12-12/\">future</a> <a href=\"https://www.nytimes.com/2024/12/13/health/aaron-siri-rfk-jr-vaccines.html?unlocked_article_code=1.hE4.9RTQ.LzniX-N7b4Jd&smid=bs-share\">government</a> that we should <a href=\"https://www.mayoclinic.org/diseases-conditions/history-disease-outbreaks-vaccine-timeline/polio\">bring polio back</a> to the children of America and the world.  ",
            "created": "Fri, 13 Dec 2024 16:21:35 GMT",
            "flInCalendar": true
        },
        {
            "text": "Anyway, by supporting Mastodon, I hoped people would make the link between WordPress, which has none of those limits, yet is very popular for publishing on the web, and Mastodon, which I (it turns out correctly) believed would navigate away from those limits given enough time. ",
            "created": "Fri, 13 Dec 2024 16:21:44 GMT",
            "flInCalendar": true
        },
        {
            "text": "I think I sent an email or a text message to Matt, or wrote a note on their Slack system, communicating with Matt is an iffy thing, not sure if the idea got through. Then this morning, I woke in the middle of the night, and realized that what I wished for was actually there. Without any fanfare at all. I could write on WordPress and it would <a href=\"https://mastodon.social/@daveverse.wordpress.com@daveverse.wordpress.com/113644817289884129\">appear on Mastodon</a>. How is that not <i>exactly</i> what I asked for? And theoretically at least (someone should test this) you can access my WordPress writing on Threads, the system that Facebook launched to (as it turns out) compete with Bluesky! (In addition to Twitter, which is no longer called Twitter of course.) What a strange world it is. ",
            "created": "Fri, 13 Dec 2024 16:22:00 GMT",
            "flInCalendar": true
        },
        {
            "text": "And in the interim, the focus has gone off the social web, imho because the limits are still very much in force at Bluesky, which still insists a post can only have 300 freaking characters and no links, styles etc blah blah blah and yadda yadda. <i>We're still having this argument. </i>Programmers vs writers. The world has lost its mind. ",
            "created": "Fri, 13 Dec 2024 16:23:11 GMT",
            "flInCalendar": true
        },
        {
            "text": "And in another thread there are idiots who propose trying to vilify and presumably <a href=\"https://en.wikipedia.org/wiki/Cancel_culture\">cancel</a> people <a href=\"http://scripting.com/2024/12/12/161258.html\">who</a> drive Teslas as if the car you use for transport is as trivial a possession as a fur coat. ",
            "created": "Fri, 13 Dec 2024 16:23:46 GMT",
            "flInCalendar": true
        },
        {
            "text": "I'm having a great day, no sarcasm, all of a sudden I feel like we might actually be winning, again. ",
            "created": "Fri, 13 Dec 2024 16:23:47 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}