{
    "text": "Before moving on to this year's BOTY, I thought HCR could help figure out how we could move past merely reporting on Trump's danger to democracy, something that was clear going back to 2015, the news could start reporting on The Resistance, what we're doing to prevent the end of democracy. And in order for that to happen, we have to do newsworthy things for them to write about! We're not doing that. It started out well, with the <a href=\"https://en.wikipedia.org/wiki/2017_Women%27s_March#:~:text=The%20Women's%20March%20was%20a,to%20the%20rights%20of%20women.\">Woman's March on January 20, 2017</a>, but that was it. We can and must keep showing up, and I'm not advocating huge marches, I want to see neighborhood-level marching. Once a month, rain or shine, we all walk (if possible) or drive to our voting places, where there will be music, food, people with ideas, dancing, whatever you like. Making civic participation a regular thing. You go because you want to be there. Not against something but <i>for</i> all of us. All we have to do is figure out how this works, how to beat the drum, to get the ball rolling. The idea is that if we got close to 100 percent voter participation, our democracy would be in the best shape it's been in probably since inception. I had another idea that's worth considering. We should all wear the same button, just a picture, no slogans, an idea of what we stand for as Americans. It could be an American flag, or it could be a photo of <a href=\"http://scripting.com/2016/12/30/theMlkButtonsArrived.html\">Martin Luther King</a>. The latter was my choice. People love the button, but it didn't catch on. If we all did, it's omission would be noticed, and we'd know there's someone we should talk with about America and offer them a free button, nicely, if they'll put it on right now. Anyway, I'm putting this out there again, and I'll keep doing it. ",
    "created": "Mon, 11 Dec 2023 13:59:26 GMT",
    "type": "outline",
    "image": "https://imgs.scripting.com/2020/06/17/mlkButton.png",
    "flInCalendar": true
}