{
    "text": "Succession notes",
    "created": "Mon, 29 May 2023 13:45:19 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Spoilers! Spoilers!",
            "created": "Mon, 29 May 2023 22:26:58 GMT",
            "flInCalendar": true
        },
        {
            "text": "I imagine during the day I'm going to think of a few random things about Succession. Be sure this is 100% top to bottom spoiler. ",
            "created": "Mon, 29 May 2023 13:45:24 GMT",
            "flInCalendar": true
        },
        {
            "text": "A nice thing about Succession: The Roy kids could fuck each other up and all the while they're still a family. They spent a lot of time on that in the last episode. Trying to give us a glimpse of the future for them. Now the ways the hurt each other will be more mundane, more like a normal 0.0001 percenter. ",
            "created": "Mon, 29 May 2023 13:43:12 GMT",
            "flInCalendar": true
        },
        {
            "text": "Succession is a parody, that's what makes it so entertaining. And they play games with us, distract us into overlooking what was obvious -- what eluded all three of the kids, even though the adults were constantly reminding them that they didn't compete at the level they thought they did. ",
            "created": "Mon, 29 May 2023 13:49:22 GMT",
            "flInCalendar": true
        },
        {
            "text": "I just got some quiet time to think about the story of Succession, and the whole show was constructed brilliantly to leave you with the feeling that how could we not all have seen this coming, it was just math. Once the ",
            "created": "Mon, 29 May 2023 21:55:58 GMT",
            "flInCalendar": true
        },
        {
            "text": "The ending of Succession was like a magic trick, revealed. The answer was right before us. Impossible to miss. Yet..",
            "created": "Mon, 29 May 2023 22:20:58 GMT",
            "flInCalendar": true
        },
        {
            "text": "I can't speak for anyone else, but I was led astray by this speech from Karl, about Tom: “You’re a clumsy interloper and no one trusts you. The only guy pulling for you is dead. And now, you’re just married to the ex-boss’ daughter, and she doesn’t even like you. And you are fair and squarely fucked.”",
            "created": "Mon, 29 May 2023 22:21:06 GMT",
            "flInCalendar": true
        },
        {
            "text": "Pretty close to the beginning Marcia said: \"He made you a playground and you think it's the world.\"",
            "created": "Mon, 29 May 2023 22:21:17 GMT",
            "flInCalendar": true
        },
        {
            "text": "Logan said, recently: \"You are not serious people.\"",
            "created": "Mon, 29 May 2023 22:21:20 GMT",
            "flInCalendar": true
        },
        {
            "text": "Logan was a monster. The Swede is a monster. The kids are journalists, pundits. A tribute band if that. They think there are plays. As if they were performing for spin. But the Swede lies and steals and cheats. He was the guy who was Logan's successor, if you think it was Tom, sorry Tom is the next Gerri.",
            "created": "Mon, 29 May 2023 22:21:28 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}