{
    "text": "ChatGPT is great, reason #897",
    "created": "Mon, 29 May 2023 19:39:42 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I am an infrequent SQL query writer. My knowledge of the language is pretty limited, but I'm pretty good at understanding the kinds of things it can do, and since I am an experienced programmer, I can specify my needs in fairly accurate technical terms, they just don't happen to be in the SQL programming language. That's where ChatGPT is very useful! ",
            "created": "Mon, 29 May 2023 19:39:59 GMT",
            "flInCalendar": true
        },
        {
            "text": "I wrote out my query in pseudocode, ie English --",
            "created": "Mon, 29 May 2023 19:41:30 GMT",
            "subs": [
                {
                    "text": "I have a database with three tables, feeds and subscriptions and users. If a user subscribes to a feed there is a record in the subscriptions table connecting the two. I want a query that tells me which feeds have 0 subscribers.",
                    "created": "Mon, 29 May 2023 19:41:50 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "In the old days before ChatGPT I'd write a <a href=\"https://www.google.com/search?q=site%3Ascripting.com+%22braintrust+query%22\">braintrust query</a>, put it on my blog and the odds were pretty good that in 24 hours I'd have the answer, and would feel grateful and proud. That of course would be after putting in a few minutes trying to find the answer using Google and StackExchange. ",
            "created": "Mon, 29 May 2023 19:42:22 GMT",
            "flInCalendar": true
        },
        {
            "text": "Now I just <a href=\"https://chat.openai.com/share/aad60d06-4d3f-4279-ae6f-dd0296426f3e\">feed it to ChatGPT</a> and it translates it for me, to good SQL code, and in ten minutes I have the query and the answer:",
            "created": "Mon, 29 May 2023 19:43:37 GMT",
            "flCodeSubs": "true",
            "subs": [
                {
                    "text": "SELECT feeds.feedurl, feeds.title FROM feeds LEFT JOIN subscriptions ON feeds.feedurl = subscriptions.feedurl GROUP BY feeds.feedurl, feeds.title HAVING COUNT(subscriptions.feedurl) = 0;",
                    "created": "Mon, 29 May 2023 19:51:52 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "I edited it a bit because it assumed field names where I used slightly different names. And I never said that fields had URLs that identify them, and we must use that, not the unique integer ID that each row also has. ",
            "created": "Mon, 29 May 2023 19:44:31 GMT",
            "flInCalendar": true
        },
        {
            "text": "It worked. Turns out there are 872 feeds in <a href=\"https://feedland.org/\">feedland.org</a>'s database that have no subscribers. I'm looking for ways to make the feed reading part of FeedLand perform better, and time spent reading feeds no one is watching could be a place for savings. ",
            "created": "Mon, 29 May 2023 19:45:36 GMT",
            "flInCalendar": true
        },
        {
            "text": "ChatGPT, you have made me a more confident and creative programmer. ",
            "created": "Mon, 29 May 2023 19:46:33 GMT",
            "flInCalendar": true
        },
        {
            "text": "Huzzah!",
            "created": "Mon, 29 May 2023 19:53:45 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}