{
    "text": "Signed up for Medicare",
    "created": "Thu, 16 Apr 2020 16:17:33 GMT",
    "type": "outline",
    "description": "Medicare is not the panacea they say it is. We deserve better, and not just those 65 or older.",
    "subs": [
        {
            "text": "I just completed signing up for Medicare including a <a href=\"https://www.medicare.gov/sign-up-change-plans/types-of-medicare-health-plans/medicare-advantage-plans\">Medicare Advantage Plan</a>. My two cents. When <a href=\"https://www.youtube.com/watch?v=9XKoar34gBI\">Bernie says</a> \"Medicare for All\" -- no I don't think so. It's a bastard child. Complicated and convoluted. Obviously something that has been fought over repeatedly in Congress. And in the end, after getting educated, and coming back again and again, I did what everyone seems to, shrug their shoulders, pick a plan and hope for the best.",
            "created": "Thu, 16 Apr 2020 16:18:00 GMT",
            "image": "http://scripting.com/images/2020/04/16/cannedCherries.png"
        },
        {
            "text": "The medical system should work like this. ",
            "created": "Thu, 16 Apr 2020 16:19:04 GMT",
            "flNumberedSubs": "true",
            "subs": [
                {
                    "text": "You need health care.",
                    "created": "Thu, 16 Apr 2020 16:19:01 GMT"
                },
                {
                    "text": "You get health care.",
                    "created": "Thu, 16 Apr 2020 16:19:19 GMT"
                },
                {
                    "text": "That's it.",
                    "created": "Thu, 16 Apr 2020 16:19:02 GMT"
                }
            ]
        },
        {
            "text": "Medicare isn't that. It's way better than I what I've had up till now, ObamaCare, which was a vast improvement over what I had before that (I'd call it Maybe I'm Covered We'll Find Out When I Need It-care). It feels like graduating, finally I get treated like I matter, a little. And I'm pretty sure that if I get in deep shit medically I wll be helped. ",
            "created": "Thu, 16 Apr 2020 16:27:30 GMT"
        },
        {
            "text": "But why should you have to wait until you're 65 to get that?",
            "created": "Thu, 16 Apr 2020 16:19:34 GMT"
        },
        {
            "text": "PS: I'm not 65 yet, but soon. :boom:",
            "created": "Thu, 16 Apr 2020 16:19:44 GMT"
        },
        {
            "text": "PPS: It feels like that great <a href=\"https://www.youtube.com/watch?v=c3XX_z5wZn0\">moment</a> in Goodfellas where Paulie says to young Henry Hill \"You broke your cherry!\" Basically every moment in Goodfellas is a great moment, btw. ",
            "created": "Thu, 16 Apr 2020 16:21:02 GMT"
        }
    ]
}