{
    "text": "We. Have. To. Work. Together.",
    "created": "Sun, 06 Dec 2020 16:33:22 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "When we were first rolling out podcasting in the winter of 2004, we had a hard time getting anyone in established media to listen. I think people could have understood, but they didn't make the effort to listen. ",
            "created": "Sun, 06 Dec 2020 16:33:26 GMT",
            "image": "http://scripting.com/images/2017/05/30/elephant.png",
            "flInCalendar": true
        },
        {
            "text": "It does take effort to listen, I've seen it in myself. We just have our heads down and are focused on what we do. It's even worse today, sixteen years later.",
            "created": "Sun, 06 Dec 2020 16:34:23 GMT",
            "flInCalendar": true
        },
        {
            "text": "Trump stumbled across the idea we were selling, me, @ev, the other blogging and RSS folk. Trump understood it intuitively, we understood it technologically (and some of us as writers and designers).",
            "flInCalendar": true
        },
        {
            "text": "<i>So now this method of communication is owned by the tabloids, only worse. Real journalism is reduced to writing about the hoaxes spread in the more powerful media channel. </i>",
            "created": "Sun, 06 Dec 2020 18:04:19 GMT",
            "flInCalendar": true
        },
        {
            "text": "To win, we have to work together. The people with a vision for how the tech could help, and the people who are able to actually run the complex machinery of government.",
            "flInCalendar": true
        },
        {
            "text": "We. Have. To. Work. Together.",
            "created": "Sun, 06 Dec 2020 16:33:30 GMT",
            "flInCalendar": true
        },
        {
            "text": "In the past when that happened, when there was real collaboration, the result was explosive, in a good way.",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}