{
    "text": "Testing and contact tracing",
    "created": "Fri, 10 Apr 2020 15:02:26 GMT",
    "type": "outline",
    "description": "Google and Apple have the data, but they're legitimately scared of the backlash.",
    "metaImage": "http://scripting.com/images/2020/04/10/contacts.png",
    "subs": [
        {
            "text": "Testing and contact tracing is central to turning the lights back on before there's a Covid19 vaccine. Since the US government isn't doing it, we have to do it. We can't afford to wait. Lives and livelihoods are at stake. Too important.",
            "created": "Fri, 10 Apr 2020 15:02:37 GMT"
        },
        {
            "text": "<b>Testing</b>",
            "created": "Fri, 10 Apr 2020 15:05:23 GMT",
            "collapse": "false"
        },
        {
            "text": "Testing is doable. Since the FDA is a bottleneck maybe <a href=\"https://www.bloomberg.com/opinion/articles/2020-04-09/california-declares-independence-from-trump-s-coronavirus-plans\">California</a>, New York, New Jersey, Connecticut, Illinois, Masachusetts and any other state who cares about its people can break free, or work with the US government's FDA to loosen things up so we can get say 10 million tests done per day for the forseeable future. You should be able to get one whenever you want one.  ",
            "created": "Fri, 10 Apr 2020 15:02:42 GMT"
        },
        {
            "text": "I heard on the <a href=\"https://www.wnyc.org/shows/bl\">Brian Lehrer Show</a> this <a href=\"https://www.wnyc.org/story/how-testing-will-help-us-get-back-regular-life/\">morning</a> that the testing part apparently is doable, we can scale it up. It'll cost $100 billion to start, but if it got us out of this mess a month sooner it would be a good investment. ",
            "created": "Fri, 10 Apr 2020 15:04:55 GMT"
        },
        {
            "text": "<b>Contact tracing</b> ",
            "created": "Fri, 10 Apr 2020 15:05:19 GMT",
            "collapse": "false"
        },
        {
            "text": "<a href=\"https://www.npr.org/sections/health-shots/2020/04/10/831200054/cdc-director-very-aggressive-contact-tracing-needed-for-u-s-to-return-to-normal\">Contact tracing</a> is easily solved, very quickly. It's more of a political problem than a technological one.",
            "created": "Fri, 10 Apr 2020 15:13:15 GMT"
        },
        {
            "text": "<a href=\"https://privatekit.mit.edu/\">MIT has an app</a> for contact tracing. It has the right privacy configuration, the information isn't shared without you sending the data somewhere. By default it never leaves your phone. But the MIT app is on very few phones. ",
            "created": "Fri, 10 Apr 2020 15:05:36 GMT"
        },
        {
            "text": "On the other hand, Apple and Google and others have <i>very good</i> data for contact tracing and their apps are widely deployed. World-wide. We wouldn't just be solving the problem for the US, we'd be doing it for everyone everywhere who has an iPhone or Android phone. ",
            "created": "Fri, 10 Apr 2020 15:05:42 GMT"
        },
        {
            "text": "But they are reluctant to even say they can do it for fear of the backlash. It's time to have this conversation. Maybe the surveillance aspect of the new technology is worth supporting if it saves lives and can easily be turned off, by the user, when we're no longer in crisis. ",
            "created": "Fri, 10 Apr 2020 15:05:43 GMT"
        },
        {
            "text": "My friend <a href=\"https://en.wikipedia.org/wiki/Doc_Searls\">Doc Searls</a> is the expert on this. I'll ask him what he thinks. ",
            "created": "Fri, 10 Apr 2020 15:05:47 GMT"
        },
        {
            "text": "<b>Update</b>",
            "created": "Fri, 10 Apr 2020 17:14:08 GMT"
        },
        {
            "text": "Shortly after this piece was posted, <a href=\"https://blog.google/inside-google/company-announcements/apple-and-google-partner-covid-19-contact-tracing-technology\">Apple and Google announced</a> they're going to work together on contact tracing. Wow. That's quick turnaround! :boom:",
            "created": "Fri, 10 Apr 2020 17:14:10 GMT"
        }
    ]
}