{
    "text": "I support the students",
    "created": "Sun, 05 May 2024 14:01:47 GMT",
    "type": "outline",
    "description": "Americans have a responsibility to think for ourselves.",
    "metaImage": "https://imgs.scripting.com/2024/05/05/bringthetroopshome.png",
    "subs": [
        {
            "text": "As a boomer who marched on Washington as a high school student, who started an underground newspaper, and organized student strikes, I support today's students making their political opinions heard. I also see journalists doing what they did in the 60s and 70s, reporting on violence as if it were caused by the protestors, which wasn't true then and I'm pretty sure it isn't true now. ",
            "created": "Sun, 05 May 2024 14:03:36 GMT",
            "image": "https://imgs.scripting.com/2024/05/05/marchOnWashington.png",
            "flInCalendar": true
        },
        {
            "text": "And they describe them as Palestinians, when that also is certainly not what's really going on. My guess is that 99% of them are American students, who, growing up were taught that America had great values, only to discover that America often has taken the wrong side in a war, as we are now in the war between Hamas and Israel. ",
            "created": "Sun, 05 May 2024 14:03:51 GMT",
            "flInCalendar": true
        },
        {
            "text": "We shouldn't have taken a side in that war, as long as Israel insists on killing massive numbers of civilians in Gaza. Yes, what Hamas did was unsupportable, and provocative, and just plain wrong, but Israel is killing far more people than Hamas did, and further, it's exactly what Israel, which pretends to represent Holocaust survivors, should <i>not</i> be doing, perpetrating a new Holocaust. ",
            "created": "Sun, 05 May 2024 14:03:56 GMT",
            "flInCalendar": true
        },
        {
            "text": "As Americans we have a responsibility to think for ourselves, and that's why I support the students. They aren't right or wrong, but they are continuing the legacy of free speech in the US, and our government and journalists are lining up against them, which to me is as tragic in the 2020s as it was in the 1970s.",
            "created": "Sun, 05 May 2024 14:04:49 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}