{
    "text": "The Nets lose, and that's just fine",
    "created": "Sun, 20 Jun 2021 14:36:56 GMT",
    "type": "outline",
    "metaImage": "http://scripting.com/images/2021/06/20/quickley.png",
    "description": "This Nets team was founded to win. Having lost, do they have any reason to exist?",
    "subs": [
        {
            "text": "People who think sports are trivial haven't really thought it through, imho. Sports teach you how to think about things that are confusing in everyday life in clear terms with almost immediate outcomes. Sports is a training ground for strategic and philosophical intelligence.   ",
            "created": "Sun, 20 Jun 2021 14:39:00 GMT",
            "flInCalendar": true
        },
        {
            "text": "The latest version of the basketballl Nets were formed by players who cared not a whit about anything other than winning. They probably need to be reminded what team they're playing for (i.e. the [[Brooklyn Nets]]). Kyrie is playing for Team Durant, as is Harden and the others. Durant, who has already won championships, was bored, is a sour person, who on coming to NYC thought it was <a href=\"https://www.nyknicksnews.com/kevin-durant-the-cool-thing-right-now-is-not-the-knicks/\">okay</a> to <a href=\"https://bleacherreport.com/articles/2857179-nets-kevin-durant-says-the-cool-thing-right-now-is-not-the-knicks\">dis the team</a> that everyone in NYC knows sucks horribly, epicly, a self-sabotaging monster of a basketball team that despite everything NY basketball fans love. Love. We love them KD. But we don't like it when players from Seattle, Oklahoma and \"Golden State\" (where ever that is) come to NY and tell us our team sucks. <i>You</i> suck you asshole, and the only NYers who are going to root for your Nets are the ones who root for the [[Yankees]]. This Nets team was founded to win. Having lost, do they have any reason to exist? So today Knicks fans breathe a sigh of relief. There is a basketball god after all, and the Knicks still rule NY. When the Nets show some hubris, when they commit to a long-term relationship with NY basketball fans, then and only then will the deserve real NY fans, not the fake fairweather fans. ",
            "created": "Sun, 20 Jun 2021 14:41:15 GMT",
            "image": "http://scripting.com/images/2019/07/02/knicks.png",
            "flInCalendar": true
        },
        {
            "text": "This outcome, losing in the second round, was perfectly predictable. Maybe there should be a rule, once you win two championships you should retire, because from that point on there are no more thrills available to you, and like [[LeBron]], destroyer of humble franchises in Miami and Cleveland (twice!) would do less damage if he just invested in VC-backed tech companies and forgot about bringing his sourness to basketball. ",
            "created": "Sun, 20 Jun 2021 14:43:58 GMT",
            "flInCalendar": true
        },
        {
            "text": "Sports teaches those of us who will never achieve the height of a [[Kevin Durant]] to appreciate what we have. This year the Knicks rose off the energy KD fed the team and <a href=\"http://scripting.com/2021/05/13/124739.html?title=knicksClinchImEcstatic\">exceeded all expectations</a>. Next year and the year after I'll root for the Knicks, god willing. But if they ever mortgage their future, as the Nets did, to get three vagabond superstars to try to win a title in one year, I'll be shaking my head and  will look for another hopeless cause to identify with until the Knicks come back to earth. ",
            "created": "Sun, 20 Jun 2021 14:45:36 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}