{
    "text": "Father's Day",
    "created": "Sun, 20 Jun 2021 16:04:15 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I dislike all the <a href=\"https://www.urbandictionary.com/define.php?term=Hoopla\">hoopla</a> about Father's Day since I don't have one. ",
            "created": "Sun, 20 Jun 2021 16:04:22 GMT",
            "flInCalendar": true
        },
        {
            "text": "My father died in 2009. As they say \"after a long illness.\" Cancer.",
            "created": "Sun, 20 Jun 2021 16:04:37 GMT",
            "flInCalendar": true
        },
        {
            "text": "I called the day he died <a href=\"http://scripting.com/stories/2009/10/03/fathersDay.html\">Father's Day</a>. From that moment on I could remember my father the way I wanted to, and try to remember that the things I didn't like were given to him by his father and his father's father, all the way back to the beginning, which in our case was probably a <a href=\"https://en.wikipedia.org/wiki/Shtetl\">shtetl</a> somewhere in the Ukraine or Belarus or Russia. ",
            "created": "Sun, 20 Jun 2021 16:04:57 GMT",
            "flInCalendar": true
        },
        {
            "text": "The one thing we bonded on was outliners. My father loved [[ThinkTank]]. He was a huge evangelist for it, as a college professor in NY, and a consultant to large businesses on marketing and management, he preached the gospel of seeing what you think. I now realize he wanted me to do, then, what I see now that I need to do. I wish he was alive today to use the tools we're creating now. ",
            "created": "Sun, 20 Jun 2021 16:06:31 GMT",
            "flInCalendar": true
        },
        {
            "text": "He didn't understand what I was doing when I was developing it, but he loved it after it was done. This might give tech adventurers some hope. Your parents might not understand what you're doing today, but when it's ready to go, they might become believers. ",
            "created": "Sun, 20 Jun 2021 16:10:11 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}