{
    "text": "Handmaid's Tale, season 2",
    "created": "Mon, 30 Jul 2018 12:56:41 GMT",
    "type": "outline",
    "description": "Over the weekend I watched the second season of Handmaid's Tale. Here are my comments and questions.",
    "subs": [
        {
            "text": "Over the weekend I watched the second season of <a href=\"https://en.wikipedia.org/wiki/The_Handmaid%27s_Tale_(TV_series)\">Handmaid's Tale</a>.",
            "created": "Mon, 30 Jul 2018 12:56:49 GMT"
        },
        {
            "text": "Note: A few mild spoilers, nothing imho that would interfere with the full-on HMT experience, until the very end, well labeled, which you should not read until you've watched the show. ",
            "created": "Mon, 30 Jul 2018 13:05:18 GMT"
        },
        {
            "text": "It's super dark and depressing. The first few episodes aren't too bad, that gets you hooked, and then you're in for 10 hours of very seriously depressing stuff, with only a few outlets for the rage that builds. A trip to Toronto, for example, reminds you that the rest of the world is still as it was. It's just the US, now called <a href=\"http://scripting.com/images/2018/07/30/gilead.png\">Gilead</a>, that's gone crazy.",
            "created": "Mon, 30 Jul 2018 12:57:02 GMT"
        },
        {
            "text": "The season is all about separating children from their mothers. Pretty <a href=\"https://www.businessinsider.com/zero-tolerance-border-separations-permanent-ice-director-2018-6\">timely</a> for the US. It was also timely for me, since my mother died earlier this year. It helped me better understand our relationship from her side. Perhaps. I think they idealize motherhood a bit. I think that's also deeply ingrained in our culture, perhaps because mothers have so much influence over how we perceive reality from the beginning of our lives.",
            "created": "Mon, 30 Jul 2018 12:58:22 GMT",
            "image": "http://scripting.com/images/2012/09/23/corn.gif"
        },
        {
            "text": "It does the job of a good binge-watch. You get pulled into its reality. This last weekend I was in the Handmaid's Tale world. I had no patience for the news in the real world of 2018. All I could think about was the pack of lies they're selling as news. I felt I was getting a better idea of our world by watching the fictional world of HMT. ",
            "created": "Mon, 30 Jul 2018 13:00:28 GMT"
        },
        {
            "text": "Now for the spoilers. Don't read if you haven't watched. :boom:",
            "created": "Mon, 30 Jul 2018 13:23:06 GMT"
        },
        {
            "text": "Spoilers in the form of questions..",
            "created": "Mon, 30 Jul 2018 13:12:23 GMT",
            "flNumberedSubs": "true",
            "subs": [
                {
                    "text": "Why were Emily and Janine released from the <a href=\"https://www.bustle.com/p/where-are-the-colonies-in-the-handmaids-tale-this-terrifying-location-is-the-last-place-you-want-to-end-up-8875242\">Colonies</a>?",
                    "created": "Mon, 30 Jul 2018 13:12:31 GMT"
                },
                {
                    "text": "Aunt Lydia is a sympathetic character? Hard to parse.",
                    "created": "Mon, 30 Jul 2018 13:13:25 GMT"
                },
                {
                    "text": "<a href=\"https://en.wikipedia.org/wiki/Bradley_Whitford\">Bradley Whitford</a> must be a star in the third season. He still seems like Josh Lyman to me, even though he's now one of the Commanders of Gilead. ",
                    "created": "Mon, 30 Jul 2018 13:13:39 GMT"
                },
                {
                    "text": "WTF is up with June's decision to give up Holly in the last scene of the last episode?",
                    "created": "Mon, 30 Jul 2018 13:14:07 GMT"
                }
            ]
        }
    ]
}