{
    "created": "2022-05-09T04:00:00.000Z",
    "flInCalendar": true,
    "name": "09",
    "path": "2022/05/09",
    "text": "May 09",
    "type": "calendarDay",
    "subs": [
        {
            "text": "It'd be interesting to see the results of a poll: 1. Do you wear a mask to protect against transmission of Covid? 2. Are you in favor of repealing Roe v Wade to force people who are pregnant to go through months of painful, risky and expensive medical procedures? ",
            "created": "Mon, 09 May 2022 19:03:41 GMT",
            "type": "tweet",
            "tweetId": "1523741481311391744",
            "tweetUserName": "davewiner",
            "flInCalendar": true
        },
        {
            "text": "I started reading Heather Cox Richardson's <a href=\"https://www.amazon.com/How-South-Won-Civil-War/dp/0190900903\">How the South Won the Civil War</a> and I can tell it's going to be another transformative reading for me. There's a basic bug in the American myth of self-reliance, the bug is this -- it's a lie. Humanity is like an ant colony. Our lives follow a rigid template that's <s>hard</s> impossible to break out of. Unless you're a hermit, you pay taxes, get the same medicine as everyone else, celebrate the same holidays (even non-Christians in the US observe Christmas in some fashion). You are only unique in your mind, but even there, where you are free to be different, there's a lot of conformity. We rely on each other, there is no such thing as a pioneer on the open range, fending for himself. Richardson doesn't say any of those things, at least not in the beginning of the book, instead she describes the American myth. And as I'm reading it, I recognize it as the argument between the people and the oligarchs that's still raging. We think of it as North vs South but that's all part of the puppetry. We're being manipulated into blaming each other for nothing, distracting us from what we could be if we didn't pander to the oligarchs. Really looking forward to this read.",
            "created": "Mon, 09 May 2022 13:15:25 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2022/05/09/howTheSouthWonTheCivilWar.png",
            "flInCalendar": true
        },
        {
            "text": "Twitter Pro",
            "created": "Tue, 10 May 2022 02:19:42 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Journalists and pundits have been doubting that Twitter/Musk can double their revenue with subscriptions. I don't doubt they can because Twitter in all the years they've been around has never even tried to make products that run on their platorm for money. ",
                    "created": "Tue, 10 May 2022 02:19:48 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "So here's a Twitter package I'd pay for and so would a lot of other people.",
                    "created": "Tue, 10 May 2022 02:21:00 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Call it <a href=\"https://twitter.com/davewiner/status/1523656621833875457\">Twitter Pro</a>:",
                    "created": "Tue, 10 May 2022 02:21:19 GMT",
                    "flNumberedSubs": "true",
                    "subs": [
                        {
                            "text": "Posts can have titles.",
                            "created": "Tue, 10 May 2022 02:21:10 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Simple styling.",
                            "created": "Tue, 10 May 2022 02:21:14 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Links.",
                            "created": "Tue, 10 May 2022 02:21:39 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Podcasts. ",
                            "created": "Tue, 10 May 2022 02:21:41 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Unlimited length.",
                            "created": "Tue, 10 May 2022 02:21:16 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "$10 per month.",
                    "created": "Tue, 10 May 2022 02:21:11 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I'd pay. Without a moment's hesitation. ",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}