{
    "created": "2022-05-13T04:00:00.000Z",
    "flInCalendar": true,
    "name": "13",
    "path": "2022/05/13",
    "text": "May 13",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Twitter-as-a-service from AWS would kick ass.",
            "created": "Fri, 13 May 2022 21:20:16 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "You know that <a href=\"https://www.youtube.com/watch?v=jRcMsqCbzWk\">scene</a> in <a href=\"https://www.metacritic.com/movie/annie-hall-1977\">Annie Hall</a> where Woody Allen gets into an argument with a Columbia professor about <a href=\"https://en.wikipedia.org/wiki/Marshall_McLuhan\">Marshall McLuhan</a>, who is waiting off-camera to refute support Allen. McLuhan says to the professor: \"You know nothing of my work. How you ever got to teach to teach a course in anything is totally amazing.\" Allen looks at the camera: \"Boy if life were only like this.\" Well anyway, on Twitter, I am regularly pulled out from behind a poster to support someone who thinks \"RSS\" is doing fine. I'm supposed to play the role of McLuhan. I would enjoy that once, but not all the time for decades. :boom:",
            "created": "Fri, 13 May 2022 20:57:36 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1525117952105885701\">Poll</a>: Is Twitter too big to fail?",
            "created": "Fri, 13 May 2022 17:14:34 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://www.washingtonpost.com/technology/2022/05/12/twitter-celebrities-musk/\">Re celebs and Twitter</a>. They certainly are coming back, unless you think Twitter is over. These things go in cycles. Because the celebs are gone, one new name is going to emerge from twitter, because they can stand out by being the one on twitter, and for a while all the new ones will appear on twitter until that phase is over when the story that the celebs are gone will repeat. ",
            "created": "Fri, 13 May 2022 14:21:56 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1525088455851745284\">Poll</a>: What are the odds that Musk actually acquires Twitter? My bet is it's virtually zero. Why? The difficulties of Twitter have become more apparent, and at the same time, the difficulties of the companies he already controls have gotten bigger with the collapse of the tech stock market. Owning Twitter is a hobby he can't afford now.",
            "created": "Fri, 13 May 2022 12:46:19 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}