{
    "created": "2022-05-16T04:00:00.000Z",
    "flInCalendar": true,
    "name": "16",
    "path": "2022/05/16",
    "text": "May 16",
    "type": "calendarDay",
    "subs": [
        {
            "text": "The more you make a certain <a href=\"https://news.yahoo.com/rep-elise-stefaniks-staff-reportedly-004533903.html\">upstate NY congressperson</a> famous for pissing off libs, the more popular you make her with her constituents. Sometimes it's better to just stifle.",
            "created": "Mon, 16 May 2022 17:39:07 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2022/05/16/chuck.png",
            "flInCalendar": true
        },
        {
            "text": "Interesting results from <a href=\"https://twitter.com/davewiner/status/1525839800183431174\">yesterday's poll</a> about when life begins. Clearly the poll got spammed by right-to-lifers, many hours after the poll went up, the proportion who said life begins at conception shot up from 10 percent to over 35. A poll like this of course only means what you personally take from it, it has no mathematical significance. It's as if I asked a group of people in a subway car what they think, but the car was only going to my neighborhood. ",
            "created": "Mon, 16 May 2022 14:12:18 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I've been using <a href=\"https://www.hover.com/\">Hover.com</a> for years, and have a lot of domains parked there, and I wish I could get the list of domains into my outliner easily. I don't need a full API, just a page that lists all my domains in an OPML file. Access it through the browser and save it locally. Read it into my outliner as a file. And then I can do whatever I want. It seems like an easy thing to implement. Not sure how many other people would use it right away, but I bet a bunch would use it once it was available. :smile:",
            "created": "Mon, 16 May 2022 14:02:08 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "BTW, speaking of Hover, they took out the <a href=\"http://scripting.com/2019/12/16/170209.html\">killer feature</a> I wrote up in 2019. I read their explanation (sorry can't find it now), it has to do with DNS tech of course, it's why the other guys don't do it either. But it really seemed to work and made my setup a little more flexible, which is something we really look for from DNS. Helps keep our sites working. ",
            "created": "Mon, 16 May 2022 14:07:32 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Twitch did an amazing job, turning off the <a href=\"https://www.cnn.com/2022/05/15/business/twitch-livestream-buffalo-massacre/index.html\">livestream of the Buffalo shooter</a> in two minutes. The current governor of NY, <a href=\"https://en.wikipedia.org/wiki/Kathy_Hochul\">Kathy Hochul</a>, says that isn't good enough. As usual, NPR completely mangled the story. They should get reporters who have some idea of what livestreaming is before reporting on it. ",
            "created": "Mon, 16 May 2022 13:30:19 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "For the Knicks, we set our expectations low, and therefore are not disappointed. <a href=\"https://twitter.com/NBA_NewYork/status/1525964167198433283\">This is the equivalent</a> of winning the championship. It's just as gratifying.",
            "created": "Mon, 16 May 2022 13:36:12 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}