{
    "created": "2022-05-17T04:00:00.000Z",
    "flInCalendar": true,
    "name": "17",
    "path": "2022/05/17",
    "text": "May 17",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Today I wrote a Node app that reads an OPML subscription list, loops over all the feeds and only passes on the ones that are reachable and parseable. Yes, I plan to share the code, because it's useful and also good example code for reading and writing lists, and reading feeds. ",
            "created": "Tue, 17 May 2022 16:49:04 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I've stopped doing <a href=\"http://daytona.scripting.com/?q=Wordle&collection=scriptingnews\">Wordle</a>. I start, and then I get to the third guess and think of something I'd rather do.",
            "created": "Tue, 17 May 2022 16:48:19 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "One of the coolest things about the web is that people do tutorials with videos showing how they do things like install a new antenna on your roof, or put together an Adirondack chair. When people bad mouth the web, they forget about miracles like that.",
            "created": "Tue, 17 May 2022 16:47:03 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Making Twitter quieter",
            "created": "Tue, 17 May 2022 17:06:41 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "A thread from Twitter converted to a post. Someday I'm going to have to write a script to do this automatically.",
                    "created": "Tue, 17 May 2022 17:10:03 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "If Twitter had a Steve Jobs type leader he'd come up with a brilliant idea, akin to noise-cancelling headphones (and call it that), and explain how satisfying it can be to tell the trolls to shut the fuck up. Ahhhh nice and quiet. ",
                    "created": "Tue, 17 May 2022 17:06:47 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I used to live on noisy streets in Palo Alto and Berkeley. I moved to NYC, even worse (I lived in the West Village, then the East Village) until I moved uptown and then ahhh nice and quiet. Moved to the mountains, even better! There's something to be said for a little peace. ",
                    "created": "Tue, 17 May 2022 17:07:04 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Here's how I made my twtr quiet. At the first sign of trollish behavior, I mute or block. Works great. ",
                    "created": "Tue, 17 May 2022 17:07:47 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The trollish behavior is basically anyone who wants to argue with you. People who say unfair things and you want to point out how unfair they are. If you find yourself protesting, the chances you're communicating with a troll approach 100 percent. ",
                    "created": "Tue, 17 May 2022 17:08:13 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "To determine if the person conversing with you is a troll, look at your own feelings. If you feel they misunderstand you and want to correct them -- it's a troll. ",
                    "created": "Tue, 17 May 2022 17:08:28 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "We've learned so much about trolls. Trolls aren't nearly as frustrating as newbies who refuse to turn them off and insist on setting them straight <i>for all to see. </i>Ohhh, that's exactly what they want. It's like having a cat who brings home dead birds. I'm sure the cat meant well, but..",
                    "created": "Tue, 17 May 2022 17:08:36 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "And btw, in 2022, the entire Republican Party platform is trolling. ",
                    "created": "Tue, 17 May 2022 17:08:57 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Whoever runs Twitter needs the sass of Steve Jobs with his incredible ability to make simple ideas simple. Noise-cancelling headphones for Twitter. Instead of focusing on trying to diminish the brightness of the sun, give everyone sunglasses. ",
                    "created": "Tue, 17 May 2022 17:09:32 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "A Repub is someone who likes to troll Libs. ",
                    "created": "Tue, 17 May 2022 17:09:48 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "A Lib is someone who thinks Repubs want to know why they're wrong. ",
                    "created": "Tue, 17 May 2022 17:09:52 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "One of the coolest things about the web is that people do tutorials with videos showing how they do things like install a new antenna on your roof, or put together an Adirondack chair. When people bad mouth the web, they forget about miracles like that. That said, there must be videos that demo how to shut down the trolls yourself.",
                    "created": "Tue, 17 May 2022 17:09:55 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}