{
    "created": "2022-05-19T04:00:00.000Z",
    "flInCalendar": true,
    "name": "19",
    "path": "2022/05/19",
    "text": "May 19",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I don't get where people who are selling their stock are putting the proceeds. Anything that's \"safe\" will be subject to inflation.",
            "created": "Thu, 19 May 2022 21:41:35 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Repubs and world domination",
            "created": "Thu, 19 May 2022 15:59:31 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2022/05/19/goldwater.png",
            "description": "Putin, Xi and the Republican who 'wins' in 2024 will dominate the world, unless we change, radically, now.",
            "subs": [
                {
                    "text": "If no one had ever climbed the tallest mountain in the world, you can be sure there would be people whose life goal is to be the first to climb it.",
                    "created": "Thu, 19 May 2022 15:59:32 GMT",
                    "image": "http://scripting.com/images/2021/04/07/harrison.png",
                    "flInCalendar": true
                },
                {
                    "text": "No one person has ever dominated the entire world economy. And there have always been people who wanted to be the first. And in no time in human history has it been more possible, and the resulting power been more awesome. And the people who want it, will soon have it.  ",
                    "created": "Thu, 19 May 2022 16:00:10 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Probably some of them aren't actually trying to dominate the world, some probably just want to kill a lot of people. And that sure is happening. Covid. ",
                    "created": "Thu, 19 May 2022 21:31:35 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "But here's the really scary part. When Hitler tried to achieve world domination in the 1940s, he controlled a very small country, and even though he managed to grow it significantly through war, he never got close to dominating the world.",
                    "created": "Thu, 19 May 2022 16:01:20 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I think if he had come before FDR, there's a fair chance the US would've sided with Germany, not the allies. Why do I say that? Slavery. It was a very Nazi-like thing we did there. Hitler learned a lot from slavery in the US. America's philosophy with its big ideas was a lie. Our corrections have been big, but short-lived, the post Civil War reconstruction, the New Deal, and the period after WW II when the Repubs foolishly bet too much too early with Goldwater, yielding a huge Democratic majority and a president (Johnson) was knew how to use the power. But it quickly snapped back with Nixon's Silent Majority. And Reagan. And the Bushes. And Trump and who knows what comes next, but it's going in the wrong direction, obviously.",
                    "created": "Thu, 19 May 2022 16:01:51 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "World domination is definitely at stake in the fight between the Repubs and everyone else. Remember, this isn't a small country like Germany in the 30s, we're the military behemoth with the reserve currency for the world. The Repubs won't have to fight a world war to get further than any world dominator has ever gotten. They will have that from Day 1. No need to fight anyone. Putin and Xi will be at the inaugural. NATO will not be invited.",
                    "created": "Thu, 19 May 2022 16:04:31 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I've read a lot of American history in the last two years when it dawned on me how big the lie was we were told in school. It seems in the last few years we've been starting to tell more truth to the kids, and the Repubs are putting a stop to that.",
                    "created": "Thu, 19 May 2022 16:05:29 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Anyway, lots of destruction if we don't get in the way of the Republican Party's assumption of power. ",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}