{
    "created": "2022-05-21T04:00:00.000Z",
    "flInCalendar": true,
    "name": "21",
    "path": "2022/05/21",
    "text": "May 21",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Amazing, <a href=\"https://www.killington.com/the-mountain/webcams/mountain/superstar-cam\">they're</a> still <a href=\"http://scripting.com/images/2022/05/21/killingtonSkier.png\">skiing</a> at <a href=\"https://en.wikipedia.org/wiki/Killington_Ski_Resort\">Killington</a>. ",
            "created": "Sat, 21 May 2022 20:57:59 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I bought a <a href=\"http://daytona.scripting.com/?q=tesla&collection=scriptingnews\">Tesla</a> and I love the car, but I never thought it would become a <a href=\"https://twitter.com/nypost/status/1527788745239371776\">MyPillow</a> type <a href=\"https://www.google.com/search?q=mypillow+guy\">thing</a>.",
            "created": "Sat, 21 May 2022 20:52:04 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I am a JavaScript programmer. I've learned to stack my code via indentation when it could all be done more simply the way you do it in most other languages. It's provable. I can never understand why developers who have worked on the language itself aren't as bothered by this as I am. I realized there might be one difference, something that's been a foundation for all my programming work -- before I was a programmer, I was a math major. In math, you're always looking for broader and simpler statements that you can derive from more narrower and more complicated truths. In a sense that's what math is. So perhaps the language designers of JavaScript didn't study math? This has been a vexing puzzle for me ever since I moved into JavaScript. Not how to simplify JS, that's clear -- rather why don't other people see it, or if they do why don't they fix it?",
            "created": "Sat, 21 May 2022 15:32:07 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I'm always telling people who think about products to learn about <a href=\"https://en.wikipedia.org/wiki/Positioning_(marketing)\">positioning</a>. Unless you understand how the human mind works, how can you market something to humans? It's like becoming a driver, you have to learn what all the controls do. And how products fit into people's minds is one of the biggest controls, and you'd be surprised how not-different people's minds are when it comes to positioning. An example. An ad I saw on Facebook recently for <a href=\"https://freshcleantees.com/\">T-shirts</a> of all things. How many brands of T-shirts can you think of? Probably not too many, but you know there are a lot of them. None have any particular meaning. But what about a T-shirt that Looks Good On You? That's a position. A <a href=\"https://www.youtube.com/watch?v=tUgl-LFrlPw&t=228s\">ladder</a> that no one, so far, is positioned on. Maybe the ladder doesn't exist? Positioning has lots of examples of those. But sometimes it does, and it's huge. Think of all the brands that defined new ladders. Like Starbucks. Tesla. Nike. Coca Cola. There was coffee before Starbucks and cars, shoes and cold drinks before these brands carved out new segments of these markets and because they were first in the prospects' minds, they own them, until they throw away their positioning, which many products do, foolishly, through <a href=\"https://en.wikipedia.org/wiki/Product_line_extension\">line extension</a>. Heinz is a company that does not understand positioning and is as a result destroying their #1 brand. Think about Heinz. What does the name mean to you? Ketchup, right? Then, recently they decided there are lots of <i>different</i> ketchups, <a href=\"https://www.heinz.com/products/0000000117\">look</a> at all of them! And they named them all Heinz. Oy. I bet when you add the sales of all the different Heinz ketchups, it's less than standard good old Heinz ketchup. Go to the grocery store, look for ketchup and try to find the Heinz ketchup you grew up with. Good luck!  Line extension is a bad idea. If you own the top spot on a ladder, don't do line extension. You'll lose out to someone who specializes in what you used to own. <a href=\"http://daytona.scripting.com/?q=positioning&collection=scriptingnews\">So much to say</a> about this.  ",
            "created": "Sat, 21 May 2022 14:47:57 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2022/05/21/positioning.png",
            "imageLink": "https://www.amazon.com/Positioning-Battle-Your-Al-Ries/dp/0071373586",
            "flInCalendar": true
        },
        {
            "text": "Avis is #2 on the ladder. And they owned it, beautifully. ",
            "created": "Sun, 22 May 2022 02:09:40 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2022/05/21/avisCantAffordNotToBeNice.png",
            "flInCalendar": true
        }
    ]
}