{
    "created": "2022-05-26T04:00:00.000Z",
    "flInCalendar": true,
    "name": "26",
    "path": "2022/05/26",
    "text": "May 26",
    "type": "calendarDay",
    "subs": [
        {
            "text": "We like sports because they last beyond one person's lifetime. We don't bring our disagreements to ballgames (at least not amongst fans of the same team). We can hate the owner of the our team (and we do) but we know that no one really owns a team. ",
            "created": "Thu, 26 May 2022 15:04:35 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The mass shootings are a TV show we've all watched to the point where we're all prepared to be actors in the pageant if the show comes to our town. There was actually a report on this phenomenon on NPR when the Virginia Tech rampage happened. ",
            "created": "Thu, 26 May 2022 14:53:03 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "My adverse reaction to the second Covid booster (I assume, I had three vaccinations on Tuesday) got even worse yesterday. And the pain from the shots in both arms made it hard to sleep. But last night was much better. Hopefully I'll be able to get some programming done today, to get back on track with the current project.  ",
            "created": "Thu, 26 May 2022 14:18:16 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Yesterday I <a href=\"http://scripting.com/2022/05/25.html#a161417\">wrote</a> that I am irony-deficient. It's kind of a joke, but it's also the truth, as all good jokes are. You could say something ridiculous, intending it to be humorous, but I won't get it. I take things at face value. That's why I find April Fools so disturbing. But if you do it a lot I'll be tuned in, and you'll never get me again. I think it's a good thing to be irony-deficient btw. The universe is amazing and amazing things actually happen all the time. Being ID just means you have an open mind. ",
            "created": "Thu, 26 May 2022 14:12:52 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Every time you want to understand why the Repubs appear to be against the USA it's because they are. They are the Putin Party. We seem to be constantly forgetting that as if this were the <a href=\"https://www.metacritic.com/movie/memento\">movie</a> <a href=\"https://www.youtube.com/watch?v=4CV41hoyS8A\">Memento</a>. ",
            "created": "Thu, 26 May 2022 14:10:14 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "You are the establishment",
            "created": "Thu, 26 May 2022 20:54:56 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I was told by a post-boomer that the boomers might have started out promising but eventually we became the establishment. I thought to myself \"what an idiot.\" Give me credit, I didn't say it out loud. gave it some thought first.",
                    "created": "Thu, 26 May 2022 20:55:04 GMT",
                    "image": "http://scripting.com/images/2017/09/04/peterRojas.png",
                    "flInCalendar": true
                },
                {
                    "text": "Here's why it's an idiotic thing to say.",
                    "created": "Thu, 26 May 2022 20:55:16 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Every one of us from the moment we're born, or maybe even from the moment of conception if the Supreme Court has its way, is a member of the establishment. ",
                    "created": "Thu, 26 May 2022 20:55:47 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "As if there were a way to live outside the grid that ties all our lives and fates together. ",
                    "created": "Thu, 26 May 2022 20:56:10 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "<a href=\"http://daytona.scripting.com/?q=ken%20kiesler&collection=scriptingnews\">My</a> <a href=\"http://www.greatvavavoom.com/\">hippie uncle</a>, born in 1945, actually tried not to be part of the establishment. He bought some <a href=\"https://www.google.com/maps/place/Crescent+Beach,+FL+32080/@29.7543309,-81.2748106,1104m/data=!3m1!1e3!4m5!3m4!1s0x88e69977c882aea5:0xe61a1afbdfe01fae!8m2!3d29.76886!4d-81.2536786\">land</a> in northeast Florida in the early 70s, which at the time was still pretty wild, and they set up a hippie commune that was off the grid. no electricity, phone, no city water or sewer. He was an inventive guy, so he built a windmill and water tower. They grew stuff, but when they got sick or traveled they rejoined the rest of us as part of the establishment. They smoked Marlboros, paid for those with money they made doing <a href=\"https://en.wikipedia.org/wiki/Macram%C3%A9\">macramé</a> and sold to hippy dippy head shops through a distributor -- very establishment if you ask me. Turns out even if you're ready to make a full commitment to living an alternate lifestyle, it's basically impossible. ",
                    "created": "Thu, 26 May 2022 20:56:15 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "And pointless. Proves nothing. No one of our lives is important in the bigger context. Stopping this juggernaut of civilization is something even the richest megabillionaire sad to say can't influence very much. We all die. We are all living beyond our means from a survival standpoint. And there is nothing any of us can do about it. That's why my younger friend was saying something idiotic. :boom:",
                    "created": "Thu, 26 May 2022 20:58:04 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}