{
    "text": "May 2",
    "created": "Thu, 02 May 2019 13:57:36 GMT",
    "name": "02",
    "subs": [
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1124099138327597056\">Poll</a>: If the final three episodes of Game of Thrones leaked tonight, would you stop everything and watch them or would you wait?",
            "created": "Thu, 02 May 2019 23:52:28 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1124099138327597056"
        },
        {
            "text": "Lots of people were working on classified ads on the web in the 90s. I had my own project, the <a href=\"http://scripting.com/ads/helpWanted.html\">archive</a> is still <a href=\"http://scripting.com/fatpages/suites/classAds.html\">there</a>. Journalists should stop <a href=\"https://www.vanityfair.com/news/2019/05/the-markup-craig-newmark-journalism?verso=true\">saying</a> Craig Newmark is responsible. Progress happens. The web is better at classified ads. That's the story.",
            "created": "Thu, 02 May 2019 19:51:09 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/05/02/piano.png"
        },
        {
            "text": "The Trump obstruction has <a href=\"http://scripting.com/images/2019/05/02/metaObstruction.png\">gone meta</a>. It's now layers deep, like <a href=\"https://en.wikipedia.org/wiki/Inception\">Inception</a>. First Trump obstructed. Now <a href=\"https://twitter.com/SpeakerPelosi/status/1123967382450515976\">Barr</a> is obstructing Trump's obstruction. ",
            "created": "Thu, 02 May 2019 15:04:54 GMT",
            "type": "outline"
        },
        {
            "text": "As the Airplane used to <a href=\"https://www.youtube.com/watch?v=clXoGIzUN50\">sing</a>, one pill makes you larger... ",
            "created": "Thu, 02 May 2019 15:07:08 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=clXoGIzUN50"
        },
        {
            "text": "I've been taking pictures of my countryside explorations, and found that my top of the line <a href=\"https://en.wikipedia.org/wiki/IPhone_XS\">iPhone</a> isn't doing a good enough job, so I thought I'd try dusting off the old <a href=\"https://en.wikipedia.org/wiki/Canon_EOS_5D\">Canon EOS 5D</a> my father left me, and see what it can do. I went though some of the pictures, the quality is amazing, esp for a camera that's over ten years old. Here's a small bit of a <a href=\"http://scripting.com/images/2019/05/02/lafayetteStreet2011.png\">picture</a> I took on <a href=\"https://www.google.com/maps/place/Bleecker+St+%26+Lafayette+St,+New+York,+NY+10012/@40.7259294,-73.9968293,17z/data=!3m1!4b1!4m5!3m4!1s0x89c259855fdd5293:0xd39ec45d9866811e!8m2!3d40.7259294!4d-73.9946406\">Lafayette St</a> in NYC. It does beautiful work. ",
            "created": "Thu, 02 May 2019 14:12:14 GMT",
            "type": "outline"
        },
        {
            "text": "A longtime blogging friend <a href=\"http://www.danconover.com/\">Dan Conover</a> is writing on Facebook these days, which is a shame, because his best pieces get me thinking enough that I want to write my own post that expands on his thinking, like the one he wrote the other day about splitting the US in two. Dan lives in South Carolina. Former journalist. I met him on my visit to Spartanberg in <a href=\"http://scripting.com/2005/02/15.html\">2005</a>, as part of a great auto tour through the south. I learned a lot at every stop. So Dan wrote that the problems of the US are much bigger than a terrible choice for president in 2016, it has to do with the compromise that was made at the beginning of the country when it was just 3 million people (today's population of Oklahoma) because they built a country around two very different economies and cultures -- agrarian and urban. It's only grown more pronounced in 2019. We just can't live together. The US needs a Brexit. Of course we aren't going to get one (it's impossible). I wish you could read his whole piece. ",
            "created": "Thu, 02 May 2019 13:57:37 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/05/02/southCarolinaMap.png"
        }
    ]
}