{
    "text": "May 6",
    "created": "Mon, 06 May 2019 14:22:35 GMT",
    "name": "06",
    "subs": [
        {
            "text": "A browser JavaScript challenge. Here's a <a href=\"http://scripting.com/playingcards/\">demo app</a>. Use the up and down arrow keys to move from card to card. When you get to the bottom of the screen the cursor moves to an object that is not visible. I want to scroll the window vertically to make the cursor object fully visible. If you look at <a href=\"http://scripting.com/playingcards/code.js\">the code</a>, you'll see a routine named  <i>scrollToMakeVisible. </i>The goal is to fill in the body of that routine. I've opened a <a href=\"https://github.com/scripting/Scripting-News/issues/116\">thread</a> to discuss. ",
            "created": "Mon, 06 May 2019 20:19:08 GMT",
            "type": "outline"
        },
        {
            "text": "BTW, if the House doesn't impeach Trump we've <a href=\"https://www.axios.com/trump-obstruction-of-justice-former-prosecutors-b5599d27-681f-4944-b04c-9743224f55e2.html?utm_source=facebook&utm_medium=social&utm_campaign=organic&utm_content=1100&fbclid=IwAR0t5DISMJo8hs8ixlZCKEzT8t2eqBe3B7q5-3K8lqt5d68mEIemBkMo370\">established</a> a precedent that will be hard to undo. It means an end to co-equal branches. It's a license for the executive to do whatever it wants. I wonder if people who think there's a good outcome possible from non-impeachment have thought this through. Trump may or may not be a bumbling fool with evil intent. But it's not hard to imagine a more competent fascist taking his place, and then what.",
            "created": "Mon, 06 May 2019 18:55:23 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/05/17/mrNatural.png"
        },
        {
            "text": "I find GORKA! fascinating because of his utter depravity and smarminess and the fact that some people obviously feel he is educated and sophisticated. I like GORKA! even better when he is being humiliated <a href=\"https://twitter.com/existentialfish/status/1125414269179310082\">to his face</a>.",
            "created": "Mon, 06 May 2019 16:26:13 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/existentialfish/status/1125414269179310082"
        },
        {
            "text": "I tried cross-posting but it doesn't work. I <a href=\"http://scripting.com/2016/09/04/endingAnExperiment.html\">wrote</a> it up. The problem is that the silos don't support cross-posting in any direction. They really want to be worlds unto themselves. The web, as far as they're concerned, isn't worth supporting, even though they couldn't exist without it. ",
            "created": "Mon, 06 May 2019 16:12:57 GMT",
            "type": "outline"
        },
        {
            "text": "Facebook is to the web what a text editor is to a spreadsheet.",
            "created": "Mon, 06 May 2019 14:22:36 GMT",
            "type": "outline"
        },
        {
            "text": "The Netflix documentary, <a href=\"https://en.wikipedia.org/wiki/Knock_Down_the_House\">Knock Down the House</a>, is very good. I'm only half way through it, but it's opened my eyes.",
            "created": "Mon, 06 May 2019 14:23:07 GMT",
            "type": "outline"
        }
    ]
}