{
    "text": "May 8",
    "created": "Wed, 08 May 2019 12:44:33 GMT",
    "name": "08",
    "subs": [
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=ZybYIJtbcu0\">Tuca and Bertie</a> is changing my life. ",
            "created": "Thu, 09 May 2019 03:04:01 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=ZybYIJtbcu0"
        },
        {
            "text": "At least we know one leading Democrat won't compromise. Elizabeth Warren said it so <a href=\"https://www.realclearpolitics.com/video/2019/05/07/warren_defends_call_to_impeach_trump_no_political_convenience_exception_to_the_constitution.html\">clearly</a> last night on MSNBC. Our moment of compromise will come when we are forced to take a loyalty oath to Trump. You may be sure you won't do it, but in the moment you will have a conundrum as to whether or not you sign the pledge.",
            "created": "Wed, 08 May 2019 15:41:23 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/05/08/uncleSam.png"
        },
        {
            "text": "New <a href=\"http://scripting.com/?tab=chat\">chat</a> feature. Ted posted a chat message yesterday that I didn't see for many hours. Not good. Disqus used to send me an email message when a new comment is posted. So I added that feature here. I now get an email when a message is posted. So I should be responding more quickly, if I have a response that is. :rocket:",
            "created": "Wed, 08 May 2019 15:08:32 GMT",
            "type": "outline"
        },
        {
            "text": "<i>Meddled</i> is the wrong word for what the Russians did to the 2016 election. The proper word is hacked. The Russians hacked the 2016 election. I'm a longtime software developer and know what hacking is. This was hacking.",
            "created": "Wed, 08 May 2019 13:59:06 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://www.nytimes.com/column/paul-krugman\">Paul Krugman</a> has been writing for decades about how Repubs are wrong and hypocritical about economics. He's very persuasive and of course I totally agree. Now the Dems have been wrong too, also for decades, about not standing up to the Repubs breaking our system of government. At <a href=\"https://slate.com/news-and-politics/2019/05/nancy-pelosi-impeachment-obama-wall-street-torture.html\">every step</a> they choose to ignore and overlook instead of investigating and fighting. It happened regarding torture in Iraq, the financial crisis, the Merrick Garland nomination, etc. It'd be interesting if Krugman could write one of his famous pieces about the Dems. Repubs aren't listening to him, but Democrats are. There is no option now but to stand up for the Constitution, or there will be no election to win in 2020. They can't put it off any longer, this is the end of Congress if they don't. Someone outside of government who people listen to, needs to say this. ",
            "created": "Wed, 08 May 2019 13:48:06 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/05/08/krugman.png"
        },
        {
            "text": "Feedback for WAMC",
            "created": "Wed, 08 May 2019 12:44:34 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I have something to say about <a href=\"https://www.wamc.org/\">WAMC</a>. Every time I tune in <a href=\"https://www.wamc.org/topic/alan-chartock-message-president\">Alan Chartock</a> is talking. He's their expert on everything, but all he says are platitudes. The first time he got my ire up he said \"Everyone knows that X\" and it pissed me off because X is not true (imho). He likes Joe Biden and Israel. He talks and talks and no one interrupts him, no wonder -- he owns the station (or so it seems).",
                    "created": "Wed, 08 May 2019 12:44:57 GMT",
                    "image": "http://scripting.com/images/2019/05/08/curiousGeorge.png"
                },
                {
                    "text": "I have to listen to NPR to retain my sanity in the morning over coffee while getting my mind organized for the day ahead."
                },
                {
                    "text": "I can't believe everyone doesn't hate him."
                },
                {
                    "text": "Someone tell him to chill out please. Or retire. Yeah that would do it.",
                    "created": "Wed, 08 May 2019 14:02:20 GMT"
                },
                {
                    "text": "PS: There was a Law & Order <a href=\"https://lawandorder.fandom.com/wiki/Seed\">episode</a> where it turned out that a fertility doctor had been impregnating patients with his own sperm. There was a small army of his children in NYC. Not sure if it was based on a true story. Anyway that's what it's like.",
                    "created": "Wed, 08 May 2019 14:02:21 GMT"
                }
            ]
        }
    ]
}