{
    "text": "May 12",
    "created": "Sun, 12 May 2019 13:17:07 GMT",
    "name": "12",
    "subs": [
        {
            "text": "My <a href=\"http://scripting.com/2018/02/26/024939.html\">mother</a> was in my dreams last night. I remember one part. She's in the other room lying down reading, something she did a lot, and for some reason I called her on the phone. We hadn't spoken in a long time. She said \"an angel is calling\" in a very sentimental way. She never said stuff like that. This morning I wonder maybe I was the one who died? Happy Mother's Day mom, where ever you are, or where ever I am. :heart:",
            "created": "Sun, 12 May 2019 13:17:08 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/11/15/kristaps.png"
        },
        {
            "text": "If you need reading glasses and use a computer, <a href=\"https://www.amazon.com/gp/product/B00NHUVFGS/ref=ox_sc_saved_title_1?smid=ATVPDKIKX0DER&psc=1\">these are great</a>, because they are multifocus. Good for reading the screen (medium distance) as well as up-close.",
            "created": "Sun, 12 May 2019 17:31:42 GMT",
            "type": "outline"
        },
        {
            "text": "New feature in the <a href=\"http://scripting.com/?tab=chat\">chat tab</a>, permalinks. If you roll your mouse over <a href=\"http://scripting.com/images/2019/05/12/permalink.png\">the time</a>, next to the author's name, you'll see it's a link. Click the link to get to a page with just that item on it. It's a permalink to the <a href=\"http://chat.scripting.com/story?day=2019/05/12/&id=136\">story page</a> for the item. That means you can point to a comment the same way you'd point to a blog post. It will continue to work even after there's a rollover of the chat stream (a fresh start that I'll do periodically). However story pages will not survive moderation, so this isn't a place to write a blog post. Respect the <a href=\"http://guidelines.scripting.com/\">comment guidelines</a>. :boom:",
            "created": "Sun, 12 May 2019 15:12:28 GMT",
            "type": "outline"
        },
        {
            "text": "My Facebook Manifesto",
            "created": "Sun, 12 May 2019 16:22:46 GMT",
            "type": "outline",
            "description": "We have to have more than Zuck's mind working on this.",
            "subs": [
                {
                    "text": "We're getting the downside of networking and not enough of the upside because progress is stalled due to Facebook's dominance. ",
                    "created": "Sun, 12 May 2019 16:22:51 GMT",
                    "image": "http://scripting.com/images/2019/05/12/chairmanMeow.png"
                },
                {
                    "text": "If they had created a thriving ecosystem not underneath them but alongside them, no one would be talking about about breaking it up, it would already be in pieces.",
                    "created": "Sun, 12 May 2019 16:23:04 GMT"
                },
                {
                    "text": "Everyone who's ever pursued a monopoly in tech should see (now) why it's a dead end. And people who in their hearts felt the web should stay open, you were right, it's the only sustainable option.",
                    "created": "Sun, 12 May 2019 16:23:09 GMT"
                },
                {
                    "text": "It's easy and economical for Zuck to give up his monopoly and it doesn't require divestiture or breaking up. And it's necessary to get the web growing again.",
                    "created": "Sun, 12 May 2019 17:28:17 GMT"
                },
                {
                    "text": "Key point: We have to have more than Zuck's mind working on this.",
                    "created": "Sun, 12 May 2019 16:23:16 GMT"
                }
            ]
        }
    ]
}