{
    "text": "May 14",
    "created": "Tue, 14 May 2019 12:29:33 GMT",
    "name": "14",
    "subs": [
        {
            "text": "I'm watching the HBO miniseries <a href=\"https://en.wikipedia.org/wiki/Chernobyl_(miniseries)\">Chernobyl</a>. The USSR had a lid on leaks, but the world was figuring out what was going on because the radiation spread far outside the USSR. There was huge fear that this was the end of everything. I don't recall how we survived. ",
            "created": "Tue, 14 May 2019 20:33:53 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/05/14/ussrFlag.png"
        },
        {
            "text": "I made the <a href=\"https://www.npmjs.com/package/davefeedread\">davefeedread</a> package a little more robust. Under some circumstances the lower-level feedparser package will return a length for an enclosure of \"None\". This is not what my apps were expecting and as a result we missed a bunch of podcasts due to errors. Zero is much easier to handle, and there really is no correct value if the length is omitted, since it is required by RSS 2.0. But what can you do -- this is the real world, and it happens. Examples -- Radio Lab, Here's the Thing. I added a simple workaround. If the value is None, we set it to 0. Result: More podcasts to listen to. :boom: ",
            "created": "Tue, 14 May 2019 17:20:54 GMT",
            "type": "outline"
        },
        {
            "text": "Twitter is a great open identity server. I use it in all my apps. If they added simple storage, we'd be looking at a new world of networked apps. This was Jack Dorsey's original idea for Twitter as a platform, btw.",
            "created": "Tue, 14 May 2019 20:17:33 GMT",
            "type": "outline"
        },
        {
            "text": "I gave in and ordered an <a href=\"https://www.amazon.com/gp/product/B0794W1SKP/ref=ppx_yo_dt_b_asin_title_o00_s00?ie=UTF8&psc=1\">Amazon Echo</a>. No more <a href=\"http://scripting.com/2019/05/08/124434.html\">WAMC in the morning</a>. And whatever else comes along with the Echo. I welcome Jeff Bezos new overlord of my home.",
            "created": "Tue, 14 May 2019 12:29:34 GMT",
            "type": "outline"
        },
        {
            "text": "You have no idea how strange it was to see <a href=\"https://twitter.com/jayrosen_nyu/status/1122702732090138625\">Jay Rosen</a> in a comedy skit on Samantha Bee's show. If you had asked me to predict the probability that I would see that in my lifetime, I would have said infinitesimal, such a small number it's impossible to measure. Life is strange. And when people say things like \"We all know X\" -- remember this story. You never really know for sure what can happen. ",
            "created": "Tue, 14 May 2019 17:35:16 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/jayrosen_nyu/status/1122702732090138625"
        },
        {
            "text": "Someone please do an explainer on \"Constitutional Crisis\" because I'm not sure people get how serious it is. ",
            "created": "Tue, 14 May 2019 17:43:30 GMT",
            "type": "outline"
        }
    ]
}