{
    "text": "May 17",
    "created": "Fri, 17 May 2019 13:14:08 GMT",
    "name": "17",
    "subs": [
        {
            "text": "A good afternoon <a href=\"https://www.youtube.com/watch?v=h_7q9_EJYvE\">song</a> (no hidden meaning).",
            "created": "Fri, 17 May 2019 19:57:19 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=h_7q9_EJYvE"
        },
        {
            "text": "<a href=\"https://www.memeorandum.com/190517/p3#a190517p3\">Look</a> at what the AG is doing now. He's going to change the rules so the Mueller investigation is retroactively illegal. I bet they put some <a href=\"https://www.foxnews.com/politics/trump-calls-2016-campaign-spying-treason-warns-of-long-jail-sentences\">FBI people</a> on trial. That'll completely put an end to investigations. In their calculations, people who work in government have to decide who they fear most, Trump or what comes after Trump.",
            "created": "Fri, 17 May 2019 16:56:27 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1129405186055782400\">Poll</a>: \"Thinking of famous series finales, Sopranos, Deadwood, Six Feet Under, Breaking Bad, Mad Men, Lost. Will the end of Game of Thrones give resolution, or will it leave you wanting more?\"",
            "created": "Fri, 17 May 2019 15:16:05 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1129405186055782400"
        },
        {
            "text": "Suppose the <a href=\"https://www.youtube.com/watch?v=C-fLC1dJi78\">worst person in the world</a> has a great idea, but you aren't listening because you don't like this person. In normal times you would be the main loser. But if the idea could help us avert the climate or constitutional meltdowns, we all lose because of your pride. That's why I try to listen to smart people even if it hurts my ego.",
            "created": "Fri, 17 May 2019 14:49:00 GMT",
            "type": "outline"
        },
        {
            "text": "Resist efforts to divide us. When people say that a certain <a href=\"https://duckduckgo.com/?q=old+white+men+abortion&t=h_&ia=web\">class</a> of people, based on age, race or gender, is responsible for something bad, it probably isn't true. If it isn't and you perpetuate the lie, you're doing Trump's work, and you should <i>stop doing that. </i>",
            "created": "Fri, 17 May 2019 14:24:13 GMT",
            "type": "outline"
        },
        {
            "text": "My auto insurance company wants me to try a new app that will rate my driving safety using GPS and motion detector in my iPhone. What they don't say is if it will affect my insurance rates. ",
            "created": "Fri, 17 May 2019 13:14:09 GMT",
            "type": "outline"
        },
        {
            "text": "Rating the integrity of guests",
            "created": "Fri, 17 May 2019 13:14:30 GMT",
            "type": "outline",
            "description": "A simple way of measuring the integrity of the people interviewed on cable news shows.",
            "subs": [
                {
                    "text": "I had an idea watching <a href=\"https://youtu.be/IjbqLTFP8Rs?t=44\">this clip</a> from MSNBC, where a reporter does something unusual, he stops the person he's interviewing for BS, and then for not answering his question. This is so common in cable news, it's the #1 reason I switch channels.",
                    "created": "Fri, 17 May 2019 13:14:39 GMT",
                    "image": "http://scripting.com/images/2019/05/17/scotchTape.png"
                },
                {
                    "text": "So here's the idea -- an organization, perhaps sponsored by Knight or Newmark, maintains a database of people who are interviewed on cable news. For each, the number of questions they were asked, the number of times they did and didn't answer the question. A simple way of measuring the integrity of the interviewee. And also the interviewer. ",
                    "created": "Fri, 17 May 2019 13:19:27 GMT"
                },
                {
                    "text": "You could publish an index for each of the shows. Do they tend to invite people on who actually answer questions? And then you could have an index for each network. They like horse race journalism. Turn it around, make the quality of their reporting a horse race. ",
                    "created": "Fri, 17 May 2019 13:29:06 GMT"
                },
                {
                    "text": "Twist: Penalize the show double if the person has been on before and evaded the questions both times. Fool me once, okay, ask to be fooled again, I'm a fool for listening to you. :boom:",
                    "created": "Fri, 17 May 2019 13:20:48 GMT"
                },
                {
                    "text": "Another index: Time spent talking vs how many ideas discussed. For a few people the ratio would be infinite, they just speak in a word salad, they say nothing. A great <a href=\"https://en.wikipedia.org/wiki/Michael_Steele\">example</a> is the former head of the RNC.  The best ratio, most substance to time talked would be interesting too. <a href=\"https://en.wikipedia.org/wiki/Michelle_Goldberg\">Michelle Goldberg</a> seems to be the best. She ramps up quickly, says something interesting, doesn't repeat herself unless asked. ",
                    "created": "Fri, 17 May 2019 13:21:32 GMT"
                }
            ]
        }
    ]
}