{
    "text": "May 22",
    "created": "Wed, 22 May 2019 13:03:50 GMT",
    "name": "22",
    "subs": [
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=OwzKWrNdg7I\">Turkeys in my back yard</a>. I shot this through a window, unfortunately when I went outside to get a clearer picture they turned and ran away. I wasn't going to hurt them.",
            "created": "Wed, 22 May 2019 20:23:18 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=OwzKWrNdg7I"
        },
        {
            "text": "A friend asked me now that it's over what do I think of Game of Thrones. She hasn't watched the show, but knows that I did. I don't have a ready answer. Here's an analogy. What do I think of San Francisco? I lived in the Bay Area for a long time, and for a very short time I lived in the city (on <a href=\"https://www.google.com/maps/@37.7946708,-122.4315458,3a,75y,353.51h,107.8t/data=!3m7!1e1!3m5!1s9Q1ncHGu2Ee6BQC28d5WWg!2e0!6s%2F%2Fgeo2.ggpht.com%2Fcbk%3Fpanoid%3D9Q1ncHGu2Ee6BQC28d5WWg%26output%3Dthumbnail%26cb_client%3Dmaps_sv.tactile.gps%26thumb%3D2%26w%3D203%26h%3D100%26yaw%3D185.01842%26pitch%3D0%26thumbfov%3D100!7i13312!8i6656\">Broadway</a>). There are some things that are incredible about it, the weather down the peninsula is about as perfect as weather can be about eight months a year. Food is excellent. Lots of smart people. I had a lot of very positive experiences there. But the traffic is awful and you always have to be prepared for an earthquake, and I've lived through one, and didn't like it. People are obsessed with money, I find that dull, which is probably the main reason I left. I've been watching GoT for a long time. It's impossible to say what I think of it. It's a thing. It's like asking me what I think of a close relative, perhaps one who just died. ",
            "created": "Wed, 22 May 2019 13:03:51 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/05/22/khaleesi.png"
        },
        {
            "text": "Now I think the best season finale ever was <a href=\"https://en.wikipedia.org/wiki/Six_Feet_Under_(TV_series)\">Six Feet Under</a>. The show wasn't pretentious, in fact its point was to make mundane the most dramatic thing that happens to each of us. So the ending was an ending and nothing more. I'm not going to spoil it here. I think there needs to be a site where you can keep your watching history and you can write things like this with enough metadata so it knows not to show it to you if you haven't seen the finale of the show I'm writing about. Maybe in Internet 4.0. ",
            "created": "Wed, 22 May 2019 13:17:11 GMT",
            "type": "outline"
        },
        {
            "text": "The only show that I can think of that didn't punt on the ending was <a href=\"https://en.wikipedia.org/wiki/Mad_Men\">Mad Men</a>. The end was a surprise, but someone I knew had guessed it. It was clever and satisfying. The Sopranos ending was almost a pure punt (we did find out the ending for a few characters in the last episode). Unlike a lot of people -- I liked the ending. I also liked the ending of Lost. Someday someone will do a show (like Seinfeld duh) that disclaims up front to be about nothing, therefore the finale, by definition will be nothing. I guess that was also Newhart. I didn't watch either of them. ",
            "created": "Wed, 22 May 2019 13:19:30 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=Exf63KPXF6w\">Video</a> of the last scene in Mad Men.",
            "created": "Wed, 22 May 2019 15:43:40 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=Exf63KPXF6w"
        },
        {
            "text": "One of the best things I read about GoT was in a <a href=\"https://www.facebook.com/larry.ob/posts/10157254612263064\">Facebook post</a>. Maybe you can read it. I'm not going to port it. Not my job. :-)",
            "created": "Wed, 22 May 2019 13:22:41 GMT",
            "type": "outline"
        },
        {
            "text": "GoT spoiler. <i>NakedJen do not read. </i>The sanest ending for GoT would be Khaleesi doesn't destroy Kings Landing. She takes the throne. (Keep the end of Cersei and Jaime.) She marries Jon Snow, and he takes up sculpting or pottery, maybe farming and bends the knee. Everyone relaxes and has a good time.",
            "created": "Wed, 22 May 2019 13:50:01 GMT",
            "type": "outline"
        }
    ]
}