{
    "text": "May 27",
    "created": "Mon, 27 May 2019 19:14:08 GMT",
    "name": "27",
    "subs": [
        {
            "text": "Feeling much better. My appetite has returned, somewhat, and I took a 20-minute walk at a brisk pace through the woods. Very uplifting. And I watched two excellent movies today, <a href=\"https://en.wikipedia.org/wiki/Cold_War_(2018_film)\">Cold War</a> and <a href=\"https://en.wikipedia.org/wiki/Roma_(2018_film)\">Roma</a>. It was not part of a plan, I just stumbled on them while browsing on Amazon and Netflix. Both were slow and quiet, very dramatic, and beautiful in every way. Perfect movies. Such an unusual thing! Two in one day? Wow. ",
            "created": "Mon, 27 May 2019 19:14:09 GMT",
            "type": "outline"
        },
        {
            "text": "Over the last few days I've also watched the full second season of <a href=\"https://en.wikipedia.org/wiki/Barry_(TV_series)\">Barry</a>, am caught up on Gentleman Jack and Chernobyl, all on HBO.  I know people rave about Barry, but like the second season of <a href=\"https://en.wikipedia.org/wiki/Killing_Eve\">Killing Eve</a>, it is a letdown. It's funny that's for sure because Bill Hader is an amazing comedian, like a Jim Carrey or Robin Williams. It's easy to watch, it kills a few hours, but won't give you a lot to think about. It's like popcorn. I think both shows were hurt by running while Game of Thrones was finishing up, btw. It kind of sucked all the air out of the room. Amazingly, now I have absolutely no interest in reading about GoT, where just a week ago, that's pretty much all I wanted to read about. ",
            "created": "Mon, 27 May 2019 19:18:41 GMT",
            "type": "outline"
        },
        {
            "text": "I was intrigued by <a href=\"https://en.wikipedia.org/wiki/Gentleman_Jack_(TV_series)\">Gentleman Jack</a> through the first few episodes. The principal character, Anne Lister, played by <a href=\"https://en.wikipedia.org/wiki/Suranne_Jones\">Suranne Jones</a>, is very appealing and has an unusual problem, which she sets out to solve, all while leading her remarkable life. I'm not being sarcastic. I was drawn to it because I watched <a href=\"https://en.wikipedia.org/wiki/Doctor_Foster_(TV_series)\">Doctor Foster</a> which also starred Jones, and it was riveting, and kept my attention through two seasons. But the potential of Gentleman Jack never seems to come together and the show drags and repeats, for what? She's brilliant, but we see before she does that what's she's chasing is unattainable. Or so it seems, the season is only half-done. But the elements of a great show are there so hopefully it's turn around. Episode 5 airs tonight on HBO at 10PM.",
            "created": "Mon, 27 May 2019 19:22:42 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://en.wikipedia.org/wiki/Chernobyl_(miniseries)\">Chernobyl</a>, a 5-part miniseries, is something you should watch. It's a really well done thriller about a historic event that I didn't really understand at the time, but I remember how freaked out we all were that it was the end of the world. Now it's easy to watch because we know that it more or less worked out, the world is still here. Episode 4 airs tonight on HBO at 9PM.",
            "created": "Mon, 27 May 2019 19:30:12 GMT",
            "type": "outline"
        }
    ]
}