{
    "text": "May 29",
    "created": "Wed, 29 May 2019 15:13:30 GMT",
    "name": "29",
    "subs": [
        {
            "text": "Request to journalists. When impeachment is discussed instead of talking about Democrats, say it's the House that's taking it up. That's more accurate, and it helps reduce the partisanality of it. Esp now that there's a Repub pushing for impeachment.",
            "created": "Wed, 29 May 2019 16:50:44 GMT",
            "type": "outline"
        },
        {
            "text": "I always thought, for some reason, that the <a href=\"https://en.wikipedia.org/wiki/Yacc\">YACC</a> source for Frontier was lost, but I looked in the repo and searched for YACC, and there it was in <a href=\"https://github.com/scripting/frontier/blob/856cccf694b3d4c8c27d2fe3634221564e331e59/Common/source/langparser.y\">langparser.y</a>. I still want a nice scripting language for my JavaScript outliner, and it can't be JavaScript.  There's some great food for thought here, and lots of memories. The last time I worked at this level was in the late 80s. Thinking maybe of starting with this syntax for a simple scripting language that can be plugged into JS apps. ",
            "created": "Wed, 29 May 2019 16:31:12 GMT",
            "type": "outline"
        },
        {
            "text": "I wish the Mueller Report was an HBO or Netflix series. The actor who plays Trump should be a <a href=\"https://www.indiewire.com/2017/08/best-tv-presidents-ever-1201868686/\">TV president</a>, yet do the corrupt, desperate and sad things he does. Create a contrast betw the president we deserve and the one we have.",
            "created": "Wed, 29 May 2019 16:15:14 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=emmPSEgYkP0"
        },
        {
            "text": "I just realized that Mueller is like <a href=\"https://en.wikipedia.org/wiki/Michael_Clayton_(film)\">Michael Clayton</a>. Specifically, the scene at the end of the movie with Tilda Swinton and George Clooney. The <a href=\"https://www.youtube.com/watch?v=6E2z-1Mi6Zo&feature=youtu.be&t=81\">pivotal line</a>: \"I'm not the guy that you kill.\" Translated to Mueller, \"I'm not the guy that testifies.\" He's right. Like Michael Clayton, Mueller is a fixer. He was given a mess to sort out, and he did. Along the way there were indictments. But he did his job. It's now Congress's job. ",
            "created": "Wed, 29 May 2019 15:24:38 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/05/29/truthAdjustment.png"
        },
        {
            "text": "Mueller: \"Read the report.\"",
            "created": "Wed, 29 May 2019 15:13:31 GMT",
            "type": "outline"
        }
    ]
}