{
    "created": "2023-05-02T04:00:00.000Z",
    "flInCalendar": true,
    "name": "02",
    "path": "2023/05/02",
    "text": "May 02",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Today's song: <a href=\"https://www.youtube.com/watch?v=ZV9DNpkfak0\">And She Was</a>. <i>A good song to Peloton to. </i>",
            "created": "Tue, 02 May 2023 12:53:08 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=ZV9DNpkfak0",
            "flInCalendar": true
        },
        {
            "text": "Somehow it's especially sad that <a href=\"https://www.cbc.ca/news/entertainment/gordon-lightfoot-dead-1.6828991\">Gordon Lightfoot died</a>, because his music reaches into my heart and pulls out really strong feelings. Always has. Now the strong feelings are in gratitude of all he has given us. If you have a moment, here's a <a href=\"https://www.youtube.com/watch?v=FuzTkGyxkYI\">song</a> that demonstrates. ",
            "created": "Tue, 02 May 2023 13:20:03 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "People aren't thinking, imho, clearly about the dangers of AIs. The science fiction stories about AI were written long ago by people who never used the tech. Before there was social media, before someone like Trump was elected president using a product called Twitter. Yet all we're hearing from journalism and the pundits, including the CS professors, are rehashes of what Isaac Asimov, Philip Dick and Arthur C Clarke wrote about in the 1960s.",
            "created": "Tue, 02 May 2023 18:29:15 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2023/05/02/marktwain.png",
            "flInCalendar": true
        },
        {
            "text": "I asked ChatGPT for a list of <a href=\"http://scripting.com/publicfolder/chatgpt/2023/05/02/sci-fi-ai-authors-dangers.html\">ten well-known science fiction authors</a> who wrote about the dangers of artificial intelligence. ",
            "created": "Tue, 02 May 2023 18:32:09 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Here's something maybe to not look forward to. Next time you call for customer service, you will speak with one of ChatGPT's cousins. It will sound like a human, but will be clear it's not. Beg for mercy from a machine, a machine that's programmed to sound like they care, while being obstinate. Just try and cancel a subscription to the NY Times. ",
            "created": "Tue, 02 May 2023 15:44:26 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Watching last night's NBA playoff game, the announcer would say if a shot went in or spun out of the basket before it's clear, visually, which way it was going. Is this a deliberate delay of the video feed, or a technical glitch somewhere in the network?",
            "created": "Tue, 02 May 2023 15:56:57 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Succession spoilers, don't read. I love how the Swede calls the Roy brothers a <a href=\"http://scripting.com/publicfolder/chatgpt/2023/05/02/tribute-band-definition.html\">tribute band</a>. When you watch the newest episode a second time, you realize that they have something, each of them. Kendall is creative, and is a Steve Jobs type showman who can think on his feet. Shiv is a plotter, networker and manager. Roman is a <a href=\"http://scripting.com/publicfolder/chatgpt/2023/05/02/meaning-of-machiavellian.html\">Machiavellian</a> monarch. They don't necessarily let scruples get in their way. Each of them has part of Logan's personality, and all are good at it, they just didn't necessarily know while he was alive, trying to exist in his shadow. This epside is where the turned from klutzes to <a href=\"https://www.youtube.com/watch?v=LZTaXjt2Ggk&t=265s\">serious people</a> perhaps with potential for greatness. And Tom fits in there too, we find out in the last scene of the most recent episode. I like that. I identify with Tom.",
            "created": "Tue, 02 May 2023 13:00:41 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I want my chatbot partner to do projects with me. I write an outline to organize the work. I put things where they belong as they are created. Nothing new about that, I've been working this way since the 80s. But the bot can help me manage it. I got an idea how this could work when I chose a codename for a new product using ChatGPT to make suggestions. It led me to a new more creative approach and I think a more interesting name. I hope it learned from what I did and may help other people choose names in the future. I just did an outline for the project and I'm not sure how I would give it to my friend the bot. We used to think of uploading our brains to computers, well isn't that what I'm doing now? It's a level or two above what I do with GitHub, but a similar idea. You can see how my brain works, either way. I'm making an effort to leave that as something others might learn from in the future. ",
            "created": "Tue, 02 May 2023 12:55:19 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/02/10/gumby.png",
            "flInCalendar": true
        },
        {
            "text": "It's time",
            "created": "Tue, 02 May 2023 11:56:28 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "It's time to do whatever you were sent here to do.",
                    "created": "Tue, 02 May 2023 11:56:30 GMT",
                    "inlineImage": "http://scripting.com/images/2023/05/02/itsTimeToDoWhatYouWereSentHereToDo.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}