{
    "created": "2023-05-03T04:00:00.000Z",
    "flInCalendar": true,
    "name": "03",
    "path": "2023/05/03",
    "text": "May 03",
    "type": "calendarDay",
    "subs": [
        {
            "text": "On <a href=\"https://nostr.com/\">NOSTR</a>, here's a <a href=\"https://iris.to/note18lguw55uyqymf0jwlekvl9rwjx37aswval0e7pzy56m5pk2cysuqh3h7l5\">message</a> you can reply to. The <a href=\"https://gist.github.com/scripting/d550de1b47921532c238180965695bcc\">raw data</a>.  ",
            "created": "Wed, 03 May 2023 17:16:25 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Quitting Twitter doesn't protect from what <a href=\"https://www.npr.org/2023/05/02/1173422311/elon-musk-npr-twitter-reassign\">Musk is threatening</a> NPR with. Not hard to imagine how that could be abused.",
            "created": "Wed, 03 May 2023 13:25:00 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The Knicks won. The series is now tied 1-1. They were losing until the very end of the game when a couple of bad calls went our way (truth), but also -- our passes were finding the open man, and the shots were going down. I tried to watch the beginning of the next game, the Lakers vs the Warriors, but I just couldn't get the energy. Instead I watched the <a href=\"https://en.wikipedia.org/wiki/MSG_Network\">local station</a> postgame coverage of the Knicks. It was fun to see them so excited. They have a star, <a href=\"https://en.wikipedia.org/wiki/Monica_McNutt\">Monica McNutt</a>, who is so cool, I could <a href=\"http://scripting.com/images/2023/05/03/monicaMcnutt.png\">watch her</a> talking about jello and oatmeal and find it fascinating. It's sad that the men on MSG don't seem to see her, but someone there must get she's the future and the <a href=\"https://en.wikipedia.org/wiki/Bill_Pidto\">little troll</a> is funny as long as he shuts up after repeating himself once or twice. I will watch the next Lakers game, hoping they lose in a horrific way. I think LeBron should step aside. And hey it was great to see <a href=\"https://nypost.com/2023/05/02/carmelo-anthony-gets-garden-ovation-at-knicks-heat-game-2/\">Melo welcomed</a> so warmly at the Knicks game. We will always love Melo. Finally thank goodness there isn't another Knicks game until Saturday. I need some time to process the possibility that the Knicks <i>could</i> be going to the conference finals. ",
            "created": "Wed, 03 May 2023 12:43:25 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I have a 5th generation iPad Mini that I use all the time. It's a couple of years old and the battery doesn't hold a charge very well. So I decided to treat myself to a new mini, and since there's a new version, the 6th generation, I went for that. I also decided to get 64GB instead of the 256GB I have on the current one, because these days most of the video I watch is streamed, not downloaded, and I don't use that much space, or so I thought. After four attempts to transfer the contents of the old iPad to the new one, each one taking hours, I gave up. The design of the transfer app is terrible. You have to be there for the whole process, because it asks questions after long pauses. It doesn't do enough preflighting. So it takes an hour before it decides it can't do the transfer because the old one has too much data for the new one. I hoped they would do something smarter than just refusing to do the transfer. I don't really care if it moves any of the movies or audio files. What matters is that it correctly moves the apps and the configuration data for the apps, the stuff that takes a huge amount of time to do manually. In the end, I realized this wasn't any fun, and remembered how Steve Jobs obsessed over the unwrapping experience of new Apple products, and felt sad that Apple didn't hold on to that value very well. Instead I'm going to buy a 5th gen iPad Mini from Amazon and save a hundred dollars. I won't be able to do a trade-in, so maybe I'll find a deserving person to send my old iPad to instead. Or maybe I'll just stick with the old mini until its battery completely fails. ",
            "created": "Wed, 03 May 2023 11:57:00 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2023/05/03/ipadMini.png",
            "flInCalendar": true
        },
        {
            "text": "To Apple's credit, it is very easy, via their website, to cancel a purchase and arrange a return. ",
            "created": "Wed, 03 May 2023 12:19:51 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Today's song: <a href=\"https://www.youtube.com/watch?v=1lWJXDG2i0A\">Free Fallin</a>.",
            "created": "Wed, 03 May 2023 20:46:47 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=1lWJXDG2i0A",
            "flInCalendar": true
        },
        {
            "text": "Real hair?",
            "created": "Wed, 03 May 2023 14:34:58 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2023/05/03/wilburies.png",
            "subs": [
                {
                    "text": "I <a href=\"https://www.youtube.com/watch?v=92cF_KCH7TU\">love</a> <a href=\"https://www.youtube.com/watch?v=oVx_8mj-UyE\">all</a> <a href=\"https://www.youtube.com/watch?v=_PLq0_7k1jk\">these</a> <a href=\"https://www.youtube.com/watch?v=fFnOfpIJL0M\">musicians</a>, <a href=\"https://www.youtube.com/watch?v=z9nkzaOPP6g\">but</a> as a man with thinning hair (an understatement) I wonder how many of the men in this picture are wearing wigs. Jeff Lynne and Roy Orbison are obvious. The only one I'm pretty sure isn't wigged is Tom Petty, and it's <i>possible</i> that's a very good wig. I don't believe that's Bob Dylan's real hair, and I am absolutely sure at some point Paul McC switched to a wig, and I think there's a pretty good chance George Harrison is wearing one as well. (My father was convinced <i>all</i> the Beatles were wearing wigs in 1964!) Not that there's anything wrong with wigging, esp if your appearance is a big part of your product.",
                    "created": "Wed, 03 May 2023 14:34:09 GMT",
                    "image": "http://scripting.com/images/2023/05/03/beatleWig.png",
                    "flInCalendar": true
                },
                {
                    "text": "<a href=\"https://en.wikipedia.org/wiki/Traveling_Wilburys\">The Traveling Wilburys</a>",
                    "created": "Wed, 03 May 2023 14:35:06 GMT",
                    "inlineImage": "http://scripting.com/images/2023/05/03/wilburies.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}