{
    "created": "2023-05-10T04:00:00.000Z",
    "flInCalendar": true,
    "name": "10",
    "path": "2023/05/10",
    "text": "May 10",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Today's song: <a href=\"https://www.youtube.com/watch?v=t9a1JQi7G3k\">People Like Us</a>. ",
            "created": "Wed, 10 May 2023 14:53:56 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=t9a1JQi7G3k",
            "flInCalendar": true
        },
        {
            "text": "I did some more editing to the <a href=\"http://textcasting.org/\">Textcasting</a> doc. ",
            "created": "Wed, 10 May 2023 12:08:40 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I've been using Bluesky, it's more inviting to Twitter users than Mastodon. But most of that is cosmetics. The Mastoverse could be made easier. Factored. Facelift. I don't think it would necessarily be hard, but it might be politically controversial. Most important, there needs to be simple-to-use toolkits that support the common API between all the <a href=\"https://en.wikipedia.org/wiki/ActivityPub\">A/Pub</a> apps, so every developer doesn't have to reinvent the interface. API calls that look exactly like what the user does, create post, edit post, reply to post, view replies, get timeline, etc. ",
            "created": "Thu, 11 May 2023 03:22:25 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I'm trying once again to transfer the contents of an old iPad to a new iPad. It insists on installing a new version of the OS before proceeding. While that is happening the original iPad times out. When I try to restart the transfer, it hangs. Come back hours later, still hung. Then I tried to get the new machine to restore factory settings but it wouldn't accept my password, after a long wait. Tried it three or four times and thought maybe it needs wifi turned on to do this. It does. Okay now, with the new machine restored to factory settings, it has started the new OS install again. I started this at 7AM, now it's almost noon. I did do other stuff. My wifi is fast btw, so installing a new version here should be fast relative to other setups. But after all this time I don't believe I'm any closer to having the transfer of data even start. It's starting to look like reinstalling all the apps and data by hand would be faster. (Update: He's a <a href=\"http://scripting.com/images/2023/05/10/installNow.png\">screen shot</a> of where the new iPad gets stuck. That little star thing is spinning. I tried clicking on <i>Install Now</i> and nothing seems to happen. I'm just going to leave it there and come back in a couple of hours.)",
            "created": "Wed, 10 May 2023 15:52:35 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/05/30/spikeLeeKnicksFan.png",
            "flInCalendar": true
        },
        {
            "text": "Don't ask me about the Knicks for a few weeks at least. They're down 3-1 in the series against Miami. I thought it was amazingly honest of Julius Randle to <a href=\"https://twitter.com/sny_knicks/status/1655766957260517378\">say</a> the Miami Heat may \"want it more.\" Honest and foolish, because it more or less guarantees the Knicks trade him, but who in gods name is going to want him, and at what price. He's an talented athlete and huge and fast and has a great shot, but he's a loser. I'm reminded of the last Knicks playoff series against Miami, when one of their <a href=\"https://bleacherreport.com/articles/1167509-amare-stoudemire-punches-fire-extinguisher-and-gets-stitches\">star players</a> got mad and <a href=\"https://www.espn.com/new-york/nba/story/_/id/7875526/2012-nba-playoffs-amare-stoudemire-new-york-knicks-injures-hand-loss\">cut his hand</a> on a fire extinguisher in the Knicks locker room. There was still more basketball to play! Fucking idiot. They weren't out of it yet. And Randle's Knicks aren't out of it yet either. I don't think Randall can play in tonight's game, btw. He shouldn't even suit up. Maybe they can bring someone up from the G League. (If you're reading this in the nightly email, the outcome of tonight's game is already known. I haven't totally given up yet. But tonight could end the season.)",
            "created": "Wed, 10 May 2023 12:25:16 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/05/13/knicksFan.png",
            "flInCalendar": true
        },
        {
            "text": "Spoiler: <a href=\"https://nypost.com/2023/05/10/rj-barrett-came-up-big-in-knicks-game-5-victory-over-heat/\">Knicks win</a> and live to fight another day. <i>Whew. </i>",
            "created": "Thu, 11 May 2023 03:23:40 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}