{
    "created": "2023-05-11T04:00:00.000Z",
    "flInCalendar": true,
    "name": "11",
    "path": "2023/05/11",
    "text": "May 11",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Today's song: <a href=\"https://www.youtube.com/watch?v=XOnqh7LplTs\">The Swimming Song</a>.",
            "created": "Thu, 11 May 2023 21:44:31 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=XOnqh7LplTs",
            "flInCalendar": true
        },
        {
            "text": "I wonder if there's been a dropoff in use of sites like <a href=\"https://stackexchange.com/\">Stack Exchange</a> and <a href=\"https://www.w3schools.com/\">W3Schools</a> with the advent of \"ChatGPT\"? Yes, <a href=\"https://www.similarweb.com/amp/blog/insights/ai-news/stack-overflow-chatgpt/\">apparently</a>.",
            "created": "Thu, 11 May 2023 14:22:04 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I used <a href=\"https://rsslay.nostr.moe/\">rsslay</a> to turn my <a href=\"http://data.feedland.org/feeds/davewiner.xml\">linkblog feed</a> into a Nostr <a href=\"javascript: alertDialog ('npub1szkpl6qxz9kvmx5dgfve6m3h9tyqt3zua646fhqp8r5z4wskny3s4dz9nc')\">public key</a>. I haven't figured out how to use it yet.  ",
            "created": "Thu, 11 May 2023 18:13:13 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://dave.micro.blog/2023/05/11/how-i-edit.html\">How I edit</a> my micro.blog posts. ",
            "created": "Thu, 11 May 2023 13:32:10 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I think we should work together to create a great library of Hello World apps for all social networks, regardless of our feelings about their value. Some people value Nostr, some like Bluesky. I know people who believe in Twitter. Why should our software care? I want to make all these systems equal in some way. It's a good time to be inclusive, imho. Hello World-level interop is a good place to start. ",
            "created": "Thu, 11 May 2023 13:01:35 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "BTW, I've re-learned recently that the hate some people in Silicon Valley have for me is real. Obviously I've known about it for years. There have been some really egregious outbursts, like the time I was invited to Mozilla to explain \"RSS\" from my point of view and it was an ambush. The source of the hate in some cases must be jealousy -- I guess they feel constrained by having jobs inside shit companies that they feel that limits their creativity. They must think what I do is easy, and if only they had the freedom to create whatever they want they could do what I do. I've seen that in action. I also write publicly and I try to be interesting in the way I write, partially because I write to amuse myself, but I also try hard not to make it personal. I don't mind telling Jack Dorsey, for example, to sit down, because he's a very public figure and his actions have big consequences. Just one example. I also feel free to say that I think the culture of Silicon Valley is poisonous. The rest of the world seems to have caught on to that idea. Or some people just don't like me as a person. But that's no excuse to behave awfully. I find that when I do something awful, I hurt myself more than the other person. I learned that a long time ago, so I try hard not to do it. I empathize with them a bit, they feel pain and try to give a little of it to me. Something like this just happened on Bluesky. A \"joke\" about exactly what I'm writing about here. I thought about responding to it on Bluesky, but instead blocked the troll and respond here instead. You should care about how you treat people, especially people who your peers have decided it's okay to hate on. You don't <i>have</i> to behave badly. And if you do that's your choice, it's not something you can blame them for. :boom:",
            "created": "Thu, 11 May 2023 11:25:59 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/09/03/mrToad.png",
            "flInCalendar": true
        },
        {
            "text": "Also when I say Mozilla is a shit company (I didn't actually <i>say</i> it, but it was a pretty obvious connection) it should be understood that is imho only. Some people think Mozilla is the best company ever. Like the <a href=\"https://en.wikipedia.org/wiki/Blind_men_and_an_elephant\">blind men and the elephant</a>. In my experience Mozilla has always been an impediment to progress. They are careless and mean-spirited. Why? It has no culture, no vision, no engineering philosophy. A lot of immature people running wild. A frat-house atmosphere. And saying Mozilla is shitty is not much of a distinction, most if not all Silicon Valley companies are shitty. I think the underlying cause is that there are far too many programmers. If we had better (and fewer) platforms and tools then individuals could make their own software, they wouldn't have to work at companies. I'm certainly a test-case for that. It works for me, though I wish it were easier. Silicon Valley has zero respect for people who do it themselves. They don't even admit we exist. :smile:",
            "created": "Thu, 11 May 2023 13:07:01 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/08/30/beetlejuice.png",
            "flInCalendar": true
        },
        {
            "text": "Follow-up on the iPad transfer <a href=\"http://scripting.com/2023/05/10.html#a155235\">saga</a>. I finally found a way that works. Before starting, go to the old iPad, and in Settings, choose a command that prepares the iPad for the transfer by backing it up to iCloud (I don't remember what the command was, but they make it easy to find because they apparently remember you're trying to do this). The iCloud service is free for this purpose. Then wipe the new iPad and when it boots up, it'll offer an opportunity to use the iCloud backup. By choosing this, you remove the old iPad from the update. This is important because if it isn't involved, it can't time-out. Then let it update the OS (you don't have a choice) and once that's done, let it go ahead and use the iCloud backup. This means you have to stick around while it's updating the OS, a process that takes about 1/2 hour. The good news is, after that, it will do the transfer without any more interaction. I came back a few hours later and the new iPad was exactly like the old one. It remembers all your passwords, so you don't even have to enter them again. I think Apple could make this work better by writing some docs that tell you to do basically what I've said here, and save the users a lot of time, and since I already returned a new iPad because I couldn't get this to work, they would make real money from making this work better. I bought a \"renewed\" iPad which costs considerably less than a new one, and none of this money went to Apple. BTW, I think \"renewed\" in my case meant a new iPad in shrinkwrap, from a couple of years ago, that was never sold for some reason. :rocket:",
            "created": "Thu, 11 May 2023 11:15:15 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/08/18/indianaJones.png",
            "flInCalendar": true
        },
        {
            "text": "I love Diet Coke. Everything about it. I am a modern man.",
            "created": "Thu, 11 May 2023 21:41:54 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}