{
    "created": "2023-05-13T04:00:00.000Z",
    "flInCalendar": true,
    "name": "13",
    "path": "2023/05/13",
    "text": "May 13",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Not only is my personal NBA season over for the year, but there are no NBA games to watch today, for the first time in the postseason. I'll get at least one more fix tomorrow in the last game that I have anything invested in, game 7 between Philadelphia and Boston. After that, what's left? Hmmm. Going outside, gardening, bike riding, swimming, maybe the Mets? Is it time for that yet? I don't know. Oy. Such problems. I guess I can take the <a href=\"http://scripting.com/images/2023/04/27/knicksFansWithBagsOverHeads.png\">paper bag</a> off my head now.",
            "created": "Sat, 13 May 2023 17:21:37 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2022/05/30/quickley.png",
            "flInCalendar": true
        },
        {
            "text": "I now have the ability to cross-post to both Mastodon and Bluesky from my linkblogging tool. Meanwhile the world keeps burning. ",
            "created": "Sat, 13 May 2023 16:19:53 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "There are so many things wrong with Bluesky. I've started to list them on Bluesky itself, but I seriously doubt any people on the team will pay attention. What we need more than anything are social networks that don't bury their heads in the sand and try to do it all themselves. They're making the same mistakes Twitter made, but 17 years later, with the benefit of hindsight that they are not using. And they re-invent old things, when the world solved those problems a long time ago. For example, they handle links the same way I did in <a href=\"https://web.archive.org/web/20000815211629/http://scriptingnews.userland.com/xml/scriptingnews2.xml\">Scripting News format</a> in <a href=\"http://scripting.com/davenet/1997/12/15/scriptingNewsInXML.html\">1997</a>. Great, it was a good idea, but it didn't happen that way, instead we use HTML. How could they believe that it will work this way. <a href=\"http://essaysfromexodus.scripting.com/priorArtDesignMethod\">Prior art</a>. Please. Yes I like the user interface because it is so much like Twitter it's like comfort food. But that isn't enough. We liked a lot of things for a while, but then the limits will catch up. Again what we need is what's spelled out in the \"Textcasting\" spec. <b>A social network that works for writers</b>. I put that in bold because no one seems to be able to hear this. Okay back to life, I'm done with pissing in the wind for today. :smile:",
            "created": "Sat, 13 May 2023 16:20:36 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "One of my gripes with Bluesky is that I can't post a pointer to <a href=\"https://staging.bsky.app/profile/davew.bsky.social/post/3jvmjxtgpdu2m\">something I wrote there</a>, because unless you have a Bluesky account, you won't get there. It's a publishing tool no? The root of the word publishing is 'public.' Please.",
            "created": "Sat, 13 May 2023 16:29:00 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I know why the MAGAs are like they are. They feel like they've been left behind by what's now the future that they weren't ready for. I'm having that feeling myself as new AI-based stuff starts to come out. Really hard keeping up with all the new ideas and somewhat demoralizing. ",
            "created": "Sat, 13 May 2023 17:25:16 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2023/05/13/modernTimes.png",
            "flInCalendar": true
        }
    ]
}