{
    "created": "2023-05-14T04:00:00.000Z",
    "flInCalendar": true,
    "name": "14",
    "path": "2023/05/14",
    "text": "May 14",
    "type": "calendarDay",
    "subs": [
        {
            "text": "My Bluesky posts now have an <a href=\"https://rss.firesky.tv/?filter=%40davew\">RSS feed</a>, thanks to <a href=\"https://rss.firesky.tv/?filter=%40johnspurlock\">John Spurlock</a>. It's got stuff that Mastodon's RSS feed doesn't. This is <i>awesome. </i>",
            "created": "Sun, 14 May 2023 22:01:17 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I know Facebook is supposedly evil, but it has been a constant for me, because i can communicate with friends I've had for decades as if we still lived in the same city we used to, even though many of them have moved back to where they came from (as I did). I don't think Facebook is any more or less evil than any other system where I'm a <a href=\"http://scripting.com/stories/2010/11/14/welcomeToYourHamsterCage.html\">hamster</a> spinning a wheel and someone else is going to make billions off of the collection of hamsters.",
            "created": "Sun, 14 May 2023 16:05:38 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The holy grail of social media",
            "created": "Sun, 14 May 2023 15:48:50 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Networks designed for writing.",
                    "created": "Sun, 14 May 2023 15:48:54 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The holy grail of social media. ",
                    "flInCalendar": true
                },
                {
                    "text": "Twitter, Facebook, Google stood in the way of this. ",
                    "flInCalendar": true
                },
                {
                    "text": "But it’s all reforming now, not the way people thought it would just a few weeks ago. ",
                    "flInCalendar": true
                },
                {
                    "text": "It’s fair to assume there will be more change in coming weeks.",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Why are new social nets so nice?",
            "created": "Sun, 14 May 2023 13:45:45 GMT",
            "type": "outline",
            "description": "On a new network there isn't much of a caste system yet.",
            "subs": [
                {
                    "text": "When I ran a BBS in the early 80s, we’d get hacked from time to time, and usually they’d wipe the database, which left us with a fresh start, and for a while everything would be nice and simple, until it got all clogged up again. So there was a <a href=\"https://en.wikipedia.org/wiki/Silver_lining_(idiom)\">silver lining</a> to getting hacked. :smile: ",
                    "created": "Sun, 14 May 2023 13:41:40 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Another phenomenon that might be at play. Remembering <a href=\"https://www.clubhouse.com/\">Clubhouse</a>, the voice-only twitter, was wonderful until it became a <a href=\"https://blog.oup.com/2017/08/origins-juggernaut-jagannath/\">juggernaut</a> then it was filled with spam and influencers, and the <a href=\"http://scripting.com/publicfolder/chatgpt/2023/05/14/understanding-comradery.html\">comradery</a> that people loved at first was gone.",
                    "created": "Sun, 14 May 2023 13:46:01 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "So Twitter is old and clogged. Its rules are more or less set in stone. A new network, where there isn't much of a caste system, or it can be avoided, has more potential. People are on somewhat of a level playing field. The trolls haven't gotten organized yet. Whatever it is, Bluesky is nice. But it will get clogged too, and they should prepare for that by being more open to different uses. ",
                    "created": "Sun, 14 May 2023 13:49:20 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "One thing they're all missing is that these are writing environments first, so studying writing on computers would make sense. If they did, they'd instantly get some important new ideas for features users would love. ",
                    "created": "Sun, 14 May 2023 13:51:45 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}