{
    "created": "2023-05-21T04:00:00.000Z",
    "flInCalendar": true,
    "name": "21",
    "path": "2023/05/21",
    "text": "May 21",
    "type": "calendarDay",
    "subs": [
        {
            "text": "An old friend Steve Smith, who tends to like sports teams from Los Angeles, asks how I could not admire LeBron James. I suppose I <i>could</i> admire him, if I wasn't so tired of him. And I don't like what he pioneered in basketball, the idea that a player not a team wins championships. He did that when he moved to Miami and then back to Cleveland and now in Los Angeles. His selling proposition was \"buy my contract and I'll bring you a championship.\" I had enough of that when he relocated to Cleveland. I've seen other players do it, like <a href=\"http://daytona.scripting.com/?q=durant&collection=scriptingnews\">Kevin Durant</a> who I also despise, and teams that fall for it over and over like the Brooklyn Nets, only to find out not only that it doesn't (usually) work, but that who the fuck cares if <i>that's</i> how you win a championship. Another reason I don't like LeBron is that <a href=\"https://www.google.com/search?q=site%3Ascripting.com+melo\">Melo</a> can't get a job and LeBron still has one. They're of the same <a href=\"https://en.wikipedia.org/wiki/2003_NBA_draft\">generation</a>, and Melo never won a championship, that's his own fault, not blaming LeBron for that. But everyone from LeBron's era is retired now, except LeBron and maybe Chris Paul, who's probably been done for a couple of years now and hasn't admitted it yet. And I don't like Los Angeles teams in general, having lived in New York and the Bay Area, that factors into it as well. That, and sports is the one area where you're still allowed to have opinions about things, in this age when opinions are often considered <a href=\"http://scripting.com/images/2023/05/21/toxic.png?nodialog=true\">toxic</a>. ",
            "created": "Sun, 21 May 2023 13:27:18 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2023/05/21/melo.png",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"http://ai.scripting.com/2023/05/21/chatgpt-the-sims.html\">Imagine</a> a combination of ChatGPT and The Sims.",
            "created": "Sun, 21 May 2023 18:34:39 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The difference",
            "created": "Sun, 21 May 2023 18:43:13 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "The difference between Dems and Repubs..",
                    "created": "Sun, 21 May 2023 18:43:25 GMT",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "Democrats never threaten to default.",
                            "created": "Sun, 21 May 2023 18:43:38 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Repubs always threaten to default if a Democrat is president, and never threaten to default if a Republican is president.",
                            "created": "Sun, 21 May 2023 18:43:45 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "This is a very simple fact that seems to <a href=\"https://www.britannica.com/dictionary/elude\">elude</a> most reporters. ",
                    "created": "Sun, 21 May 2023 18:44:50 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It's not \"both sides suck equally.\"",
                    "created": "Sun, 21 May 2023 18:45:49 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Just like..",
            "created": "Sun, 21 May 2023 13:21:55 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2023/05/21/sims.png",
            "description": "You always clash with people you're close to. Who else are you going to clash with?",
            "subs": [
                {
                    "text": "Has a close friend or lover ever said you're doing something bad just like their mother or father once did? That's not your fault. The best thing is to breathe a bit, and love your friend who is living in memory and not the moment and -- you are not responsible for what their parent did.",
                    "created": "Sun, 21 May 2023 13:22:03 GMT",
                    "image": "http://scripting.com/images/2022/04/22/aSim.png",
                    "flInCalendar": true
                },
                {
                    "text": "BTW, just because your parents left you wanting more love or a special kind of love doesn't mean they were bad parents. You always clash with people you're close to. Who else are you going to clash with? Sometimes people think someone is bad just because you didn't do that they wanted you to do. That's not your responsibility either. And that doesn't make you a bad person.",
                    "created": "Sun, 21 May 2023 13:22:19 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "In my family, growing up, we never lived up to our mother's idea of a perfect family, the family she felt she deserved. When I finally figured out this was what was going on I tried to show her that she wasn't doing her part to create a perfect family, that became just another one of her many grievances! So now I see this behavior everywhere I look. Sometimes I think everyone I know feels they deserve a <a href=\"https://en.wikipedia.org/wiki/Leave_It_to_Beaver\">Leave It To Beaver</a> lifestyle or <a href=\"https://en.wikipedia.org/wiki/The_Adventures_of_Ozzie_and_Harriet\">Ozzie and Harriet</a>, or <a href=\"https://en.wikipedia.org/wiki/The_Courtship_of_Eddie%27s_Father\">Courtship of Eddie's Father</a>. That's the problem with culture, they give us a totally <a href=\"https://en.wikipedia.org/wiki/Hallmark_Cards\">Hallmark</a> view of what life should be like. It's entertainment, and it's compelling but it's also complete bullshit. Yet many of us think that's the ideal for life and if they aren't getting it they're deprived.",
                    "created": "Sun, 21 May 2023 13:22:28 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I've seen great teachers of meditation get caught up in their movies, everyone does it. The trick is to be conscious sometimes and see yourself as part of a very hard to describe humanity, and to take what comes to you as what was meant to be. My mother in her later years said things like that but I don't think she really believed it.",
                    "created": "Sun, 21 May 2023 13:22:38 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PS: My mom was a badass. She fought for school desegregation in Queens. Got a PhD after she finished raising her kids. Born in Prague in 1932, ran from the Nazis a few years later, in a baby carriage. Moved from her parents house to her married house. She had a tough life. Cared a lot, probably more than was good for her.",
                    "created": "Mon, 22 May 2023 02:47:36 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}