{
    "created": "2023-05-30T04:00:00.000Z",
    "flInCalendar": true,
    "name": "30",
    "path": "2023/05/30",
    "text": "May 30",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Podcast: <a href=\"http://scripting.com/2023/05/30/chatGptAndLearning.m4a\">ChatGPT and learning</a>. 12 minutes.",
            "created": "Tue, 30 May 2023 23:14:24 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2023/05/30/chatGptAndLearning.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "6196458",
            "flInCalendar": true
        },
        {
            "text": "Succession: A lot of people still think Tom was the winner. He was not. He got a Tom job, not the job the Roy kids wanted, expected, felt entitled to. That job went to Matsson. Who Logan chose as his successor. We all got wrapped up in the <a href=\"http://scripting.com/images/2023/05/30/bullshitBullshitEverythingsBullshit.png\">delusion</a> of the kids. Succession was performance art. And <i>we</i> are the performers. And most people haven't yet seen the brilliance of it. ",
            "created": "Tue, 30 May 2023 12:54:56 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2023/05/30/youAreBullshit.png",
            "flInCalendar": true
        },
        {
            "text": "Sometimes I wonder if there's anything but bullshit on social media. And maybe instead of controlling AI bots, we should control the idiocracy of social media and start using that wonderful intellect we give ourselves so much credit for. The fact is that our online selves are mostly bullshit. ",
            "created": "Tue, 30 May 2023 12:22:42 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "My friend <a href=\"https://www.google.com/search?q=site%3Ascripting.com+NakedJen\">NakedJen</a> came to visit last year, first time I'd seen her in many years. Well what a delight. She's so smart and righteous and funny. She's a tiny but fierce person. And she had a new thing she said: BULLSHIT -- very loudly whenever conversation got around to that topic. I now say <i>bullshit</i> myself more often and more emphatically and when I do it on my blog I think of NakedJen doing her thing. ",
            "created": "Tue, 30 May 2023 12:23:57 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I <a href=\"https://www.google.com/search?q=site%3Ascripting.com+NakedJen\">searched this blog</a> for NakedJen and Google, whose AI is reallllly dumb, <a href=\"http://scripting.com/images/2023/05/30/didYouMeanNakedMen.png\">suggests</a> that perhaps I meant Naked Men? Well no, Google -- that's not what I meant. One time when I searched for my mother on my blog with Google, it suggested a different name. My mother and I have the same last name. Why would Google think I mis-spelled my own mother's name? I think they still need to do a little work on their intelligence. ",
            "created": "Tue, 30 May 2023 12:27:10 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}