{
    "text": "I turned off Maddow last night in disgust",
    "created": "Tue, 10 Oct 2017 14:21:56 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Last night I turned off the Rachel Maddow show in disgust. Never thought that would happen. They're going after Facebook on the flimsiest of pretense. She made it sound like there was collusion, something nefarious, as if Zuckerberg had sold out the United States to Russia to make Facebook richer. ",
            "created": "Tue, 10 Oct 2017 14:22:04 GMT",
            "image": "http:///scripting.com/images/2017/10/10/maude.png"
        },
        {
            "text": "I have no idea why they're doing it, but it was coordinated. Ari Melber, earlier in the evening, became a panelist on his own show, and expressed the same ridiculous ideas. So much so that longtime tech journalist <a href=\"https://twitter.com/DavidKirkpatric\">David Kirkpatrick</a> started interviewing Melber. Melber was full of it, but Kirkpatrick was more polite. It doesn't reflect well on the rest of MSNBC's reporting.",
            "created": "Tue, 10 Oct 2017 14:22:39 GMT"
        },
        {
            "text": "I don't know what they're doing, it was never exactly journalism, but now it's become total advocacy. It's wrong and dishonest and as fake as anything you hear on Fox. I'll give her another try, maybe there's an innocent explanation, but they crossed over into something mean and evil last night, and I'm not going to support that. ",
            "created": "Tue, 10 Oct 2017 14:23:32 GMT"
        },
        {
            "text": "BTW, I am not a fan of Facebook, the company or the product, or Zuck. I do think they're evil, but not very likely in the way that Maddow et al say. Maybe it'll turn out they're onto something, then I'll apologize. But I think the odds of that are miniscule. ",
            "created": "Tue, 10 Oct 2017 14:37:49 GMT"
        },
        {
            "text": "Like I said I don't know what they're trying to do but whatever it is I'm sure it will end up restricting the First Amendment rights of users of the net. I don't think most  journalists give a damn about that, they care about their rights, not ours. Never have I seen a better demo of that than last night on Maddow, a former hero of mine. ",
            "created": "Tue, 10 Oct 2017 14:26:38 GMT"
        }
    ]
}