{
    "text": "A teaching hospital for tech",
    "created": "Mon, 11 Sep 2023 13:50:01 GMT",
    "type": "outline",
    "description": "More learning from the reunion",
    "subs": [
        {
            "text": "<i>More learning from last week's reunion.. </i>",
            "created": "Mon, 11 Sep 2023 14:33:33 GMT",
            "flInCalendar": true
        },
        {
            "text": "One of the things I learned about my experience at Berkman at the reunion last week was the disconnect between a research center that was about <i>doing</i> more than studying technology, as Berkman was in 2003 and 2004 when I was there, and the fact that terms were limited, in theory to a single year, although most people were there for more than a year, some considerably more. The one-year model was basically unworkable in something as new and flexible as the internet was. The pull to <i>do</i> was so strong, had so much potential, and the <i>doing</i> because of the nature of the net was based on working with other people created a problem when the term was over. ",
            "created": "Mon, 11 Sep 2023 13:50:11 GMT",
            "image": "https://imgs.scripting.com/2020/08/29/hope.png",
            "flInCalendar": true
        },
        {
            "text": "The problem is that if what you do in your term works, and then have to leave, what becomes of the work? Can you take it with you? In my case, the work to organize political and academic blogging and podcasting, not really. A lot of it depended on being anchored in a university. It probably could have been moved, not much of it depended on Harvard, or even being in the northeastern US. But I didn't begin to know how to find a uni that could adopt such a project (very likely one did not exist). But that might be something you want to attach to a Berkman, a way to evolve out of the incubator to a <a href=\"https://this.how/phoenix/\">teaching hospital</a> for tech. ",
            "created": "Mon, 11 Sep 2023 13:50:46 GMT",
            "flInCalendar": true
        },
        {
            "text": "Why do you want to continue? Because in tech, you're never done. People still think there's such a thing as an invention. It's a <a href=\"http://scripting.com/davenet/1995/09/03/wemakeshittysoftware.html\">process</a>. You're always learning from users, and new ideas for applications come from use of the previous layer, working with other projects to build new interop, and all the while maintaining freedom to choose for the users. It's always <a href=\"http://scripting.com/davenet/2000/11/30/bootstrapping.html\">bootstrapping</a>. Learning from learning. ",
            "created": "Mon, 11 Sep 2023 14:04:06 GMT",
            "flInCalendar": true
        },
        {
            "text": "Instead we left all this work ready to be picked off by the VCs and that's what happened. You got Twitter and Facebook, Spotify, etc instead of more BloggerCons. Our path was cut off, ready to be taken over by Google Reader, without an open alternative that could not be <a href=\"http://scripting.com/2022/03/12/154157.html?title=googleReaderNineYearsLater\">erased</a> by the whim of a billionaire founder. Why did we let that happen and why are we not examining that history to avoid doing it again?",
            "created": "Mon, 11 Sep 2023 14:24:54 GMT",
            "flInCalendar": true
        },
        {
            "text": "In all the discussions at the Berkman reunion, no one considered the possibility that what they call capitalism (see <a href=\"http://scripting.com/2023/09/11/135001.html#a213456\">below</a>) would take over open tech was anything other than inevitable. Sad, because it <i>wasn't</i> inevitable. Proof -- we got it right with podcasting. It has not been taken over. We learned from our experience with blogging, and we were able to build on that, and with just one little iteration we were able to do something that I'm totally sure we could have repeated. But we didn't. All we did was make sure the users knew they were entitled to choice. That stuck with podcasting to this day. That's why it worked.",
            "created": "Mon, 11 Sep 2023 14:06:45 GMT",
            "flInCalendar": true
        },
        {
            "text": "I believe more and more the ideas in Developing Better Developers, <a href=\"http://scripting.com/2014/10/30/developingBetterDevelopers.html\">both</a> <a href=\"https://this.how/phoenix/\">versions</a>, are the right approach to meld academia and tech. ",
            "created": "Mon, 11 Sep 2023 13:52:43 GMT",
            "flInCalendar": true
        },
        {
            "text": "Also I learned in the last few days that <a href=\"https://ucospo23.sched.com/\">UC Santa Cruz</a> is already going down that path. More on that as I learn more. ",
            "created": "Mon, 11 Sep 2023 13:52:56 GMT",
            "flInCalendar": true
        },
        {
            "text": "PS: I don't agree that what the silos were doing is well described as capitalism, which can exist with constraints like users having choice. What we got was totally unrestrained capitalism, and it might have been limited not by laws but by realistic choices that compete that offer choice. Where we got viable products launched before the predators came along they were constrained that way. ",
            "created": "Mon, 11 Sep 2023 21:34:56 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}