{
    "text": "But the web isn't safe!",
    "created": "Thu, 08 Mar 2018 19:03:11 GMT",
    "type": "outline",
    "description": "Lots of things aren't safe. Skiing. Bike riding in Manhattan. We do them anyway. You can't be safe all the time. Life itself isn't safe. ",
    "subs": [
        {
            "text": "<i>A new <a href=\"http://this.how/googleAndHttp/#1520523527000\">section</a> in the Google and HTTP faq, cross-posted.</i>",
            "created": "Thu, 08 Mar 2018 19:03:54 GMT"
        },
        {
            "text": "Twitter and Facebook are like <a href=\"https://en.wikipedia.org/wiki/AOL\">AOL</a> in the old pre-web days. They are run by companies who are committed to provide a safe experience. They make tradeoffs for that. Limited linking. No style. Character limits. Blocking, muting, reporting, norms. Etc etc. Think of them as Disney-like experiences. ",
            "created": "Thu, 08 Mar 2018 15:38:53 GMT"
        },
        {
            "text": "Google says the web is not safe. That is correct. We don't want every place to be safe. So people can be wild and experiment and try out new ideas. It's why the web has been the proving ground for so much incredible stuff over its history.  ",
            "created": "Thu, 08 Mar 2018 15:40:00 GMT"
        },
        {
            "text": "Lots of things aren't safe. Skiing. Bike riding in Manhattan. We do them anyway. You can't be safe all the time. Life itself isn't safe. ",
            "created": "Thu, 08 Mar 2018 19:05:39 GMT"
        },
        {
            "text": "If Google succeeds in making the web controlled and bland, we'll just have to reinvent the web outside of Google's sphere. Let's save some time, and create the new web out of the web itself. ",
            "created": "Thu, 08 Mar 2018 15:40:47 GMT"
        },
        {
            "text": "PS: Of course we want parts of the web to be safe. Banking websites, for example. But my blog archive from 1997? Really there's no need for special provisions there. ",
            "created": "Thu, 08 Mar 2018 15:49:26 GMT"
        }
    ]
}