{
    "text": "The tech industry and Google",
    "created": "Mon, 23 Jan 2023 19:51:13 GMT",
    "type": "outline",
    "description": "Google could just create something new and market it as being 'more secure' and leave the open web alone",
    "metaImage": "http://scripting.com/images/2023/01/23/oilspill.png",
    "subs": [
        {
            "text": "I was chatting with a leader of tech, a person who has made huge money on the open web. I don't want to say this person's name because my goal isn't to shame them, rather to provide a rebuttal in public where it won't just go into the trash -- I hope -- where there might actually be some listening. ",
            "created": "Mon, 23 Jan 2023 19:40:45 GMT",
            "image": "http://scripting.com/images/2023/01/23/exxonLogo.png",
            "flInCalendar": true
        },
        {
            "text": "If Google owned the web when my friend's company was starting up, it's likely Google wouldn't have permitted their product to launch because they were competing with a Google product. But the web was an open platform, no one controlled who could deploy a web app, so my friend had a chance. But Google is now taking that power for itself and there's very little resistance. Right now Google and a number of other organizations are taking ownership of the web, but it's mostly Google. ",
            "created": "Mon, 23 Jan 2023 19:52:17 GMT",
            "flInCalendar": true
        },
        {
            "text": "As I've <a href=\"http://this.how/googleAndHttp/\">written before</a>, Google's first change to the web, now that they apparently feel they own it, will mean losing a lot of the archive of the web because it won't be possible to update those sites to comply with Google's rules for what constitutes a legal website. But the web is a fantastic archive medium. And losing the archives, that's not something a big company should be allowed to decide. It would be like saying Exxon could decide if beaches should be protected from oil spills. We'd never let them take that power, they would be stopped, they <i>have</i> been <a href=\"https://www.epa.gov/laws-regulations/summary-oil-pollution-act\">stopped</a>. But there's Google, doing it in the Age of the Web, saying we own this and if you don't like we'll just shut you down. You know, like Apple and iPhone apps. ",
            "created": "Mon, 23 Jan 2023 19:52:57 GMT",
            "flInCalendar": true
        },
        {
            "text": "We have to put up with this on corporate platforms, there's no choice -- but the web doesn't belong to them. And my friend, who really is someone I like on a personal level, is going along with it. We are opponents in this, and I hope he comes around and realizes that not only do we need the archives, we need the web to be an open playground for innovation. And having tasted this power once, you have to know Google isn't finished, it'll happen again, and again. ",
            "created": "Mon, 23 Jan 2023 19:53:30 GMT",
            "flInCalendar": true
        },
        {
            "text": "And of course Google could just create something new and market it as being \"more secure\" and leave the open web alone. You gotta wonder why they didn't just do that. ",
            "created": "Mon, 23 Jan 2023 19:54:03 GMT",
            "flInCalendar": true
        },
        {
            "text": "PS: I asked Chatgpt <a href=\"https://chat.openai.com/chat/f1631d0c-cb60-400c-8194-59745ec05b6f\">who owns the web</a>. It's not Google. ",
            "created": "Tue, 24 Jan 2023 01:45:16 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}