{
    "text": "Would Brooks vote for Warren?",
    "created": "Fri, 18 Oct 2019 13:54:42 GMT",
    "type": "outline",
    "description": "He explains why Warren's election won't change anything, where electing a moderate Democrat would. I agree. ",
    "subs": [
        {
            "text": "I always wonder why people disclaim that they don't like me before they point to something I've written as being relevant or important. So I won't tell you what I think of David Brooks. :boom: ",
            "created": "Fri, 18 Oct 2019 13:59:10 GMT"
        },
        {
            "text": "<a href=\"https://www.nytimes.com/2019/10/17/opinion/trump-warren-2020.html\">His column</a> in today's NYT is worth reading. He asks if it's Trump v Warren, who he, a moderate Republican, will vote for. I'll save you the suspense, it's Warren. Good, Brooks has a soul and isn't an idiot. ",
            "created": "Fri, 18 Oct 2019 13:59:44 GMT",
            "image": "http://scripting.com/images/2019/06/05/elizabethWarren.png"
        },
        {
            "text": "Four years of Warren, who imho likely will be as ineffective a president as Jimmy Carter, is way better than four years of the accelerated lunacy of Trump. The United States, seriously, would not survive that. I don't think we'll survive another 1.5 years, which is why impeachment and removal is an urgent matter. ",
            "created": "Fri, 18 Oct 2019 14:00:19 GMT"
        },
        {
            "text": "He says \"If the party nominated one of those six, you really could see the Democrats gather progressives and moderates into an enduring majority coalition as the Republicans recede into old, white, rural obsolescence. You could see movement on a range of issues where large majorities are already stacked on one side: guns, climate change, reducing income inequality, expanding health coverage.\" ",
            "created": "Fri, 18 Oct 2019 14:00:58 GMT"
        },
        {
            "text": "I agree. A lot of change would be possible with a centrist Democrat in the presidency, they might even be possible with Warren. I like the progressive ideas, and I think our chance of progress is better if we elect a moderate in 2020. ",
            "created": "Fri, 18 Oct 2019 14:01:34 GMT"
        },
        {
            "text": "Like <a href=\"https://en.wikipedia.org/wiki/Nixon_goes_to_China\">Nixon going to China</a>, something worth considering, a moderate Democrat could be more effectively progressive than Warren. ",
            "created": "Fri, 18 Oct 2019 16:37:05 GMT"
        }
    ]
}