{
    "text": "Knicks update",
    "created": "Sat, 18 May 2024 13:27:21 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "TL;DR: For the 80,000th time -- the Knicks suck!",
            "created": "Sat, 18 May 2024 14:20:19 GMT",
            "flInCalendar": true
        },
        {
            "text": "All the <a href=\"http://scripting.com/2024/05/17/134201.html\">funny farting</a> didn't make a difference last night. The Knicks were <a href=\"https://sports.yahoo.com/nba-playoffs-pacers-lock-down-knicks-to-force-game-7-030512562.html\">blown out</a>, again (sigh), by the Indiana team. My dear friend NakedJen texted me from Oklahoma of all places (I don't know how she got there, or why, she must be on her way to some other place, maybe Dallas?) that the Knicks are trying to kill her. Sums it up perfectly. I gave myself leave after the first few minutes of the fourth quarter, seeing where this thing was going. I went to bed, and knew that when I woke up there would be a Game 7 at the Garden on Sunday (3:30PM Eastern). I'm not sure how I feel about that. ",
            "created": "Sat, 18 May 2024 13:05:17 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2021/05/13/knicksFan.png",
            "flInCalendar": true
        },
        {
            "text": "The odds are probably pretty good that the Knicks will win that game, but maybe they should just let it go, and we can pick this up again in October. By then all the injured players should be back, and maybe there will be an incredible new free agent signed over the summer, so we're not so dependent on one superstar, who is great, but has off nights, like last night. Why didn't he let any other Knicks try to fill in for him, when he's double teamed that means someone is open. I was screaming at the TV during the game, let someone someone else shoot dammit! Oh my gods. I hate game 7's when my team is in the game. I don't mind it if other people's teams are in a death match like that. ",
            "created": "Sat, 18 May 2024 14:22:03 GMT",
            "flInCalendar": true
        },
        {
            "text": "Oh well. Here we go.",
            "created": "Sat, 18 May 2024 14:21:21 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}