{
    "text": "Should you blog on Facebook or the web?",
    "created": "Sun, 18 Jun 2017 13:31:58 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I no longer blog on Facebook. It sickens me to think I ever did. But I wanted the engagement, or I was confused, a bit of both, but more of the latter. ",
            "created": "Sun, 18 Jun 2017 13:32:12 GMT",
            "image": "http://scripting.com/images/2017/06/18/dandelion.png",
            "permalink": "http://scripting.com/2017/06/18.html#a090612"
        },
        {
            "text": "Engagement on Facebook comes in the form of comments. But the comments rarely illuminate. They're mostly echoes of ideas that I've heard many times before. Tired worn-out ideas. Ideas that weren't interesting the first time, and are weary-inducing the 19th time. ",
            "created": "Sun, 18 Jun 2017 13:38:53 GMT",
            "permalink": "http://scripting.com/2017/06/18.html#a090653"
        },
        {
            "text": "Here I've set it up so there is no response mechanism. I want to learn to write that way. I hope to write a book at some point. And that is mostly an exercise in writing for yourself. There's no engagement until you're done. A book is like a freezer for ideas. Blogging is more like a dandelion spreading its seed in the wind. ",
            "created": "Sun, 18 Jun 2017 13:33:33 GMT",
            "permalink": "http://scripting.com/2017/06/18.html#a090633"
        },
        {
            "text": "You can blog on Facebook, but you won't be able to link. I can blog on the web and link, and leave a record (try finding a previous post on Facebook sometime), but hey searching on the web is getting worse not better. Google doesn't really want search to work, they want you to see their ads.",
            "created": "Sun, 18 Jun 2017 13:35:02 GMT",
            "permalink": "http://scripting.com/2017/06/18.html#a090602"
        },
        {
            "text": "Anyway, you can keep blogging on Facebook, and I still use it so I might see what you wrote. There'd be a better chance of that if you post on the web.",
            "created": "Sun, 18 Jun 2017 13:37:43 GMT",
            "permalink": "http://scripting.com/2017/06/18.html#a090643"
        },
        {
            "text": "<i>And</i> if you post on the web, because it's open, independent developers can make it work better. On Facebook you have to wait for Facebook to make it better. And by now you should know how futile that is, you're not a user to them, you're the product.",
            "created": "Sun, 18 Jun 2017 13:52:11 GMT",
            "permalink": "http://scripting.com/2017/06/18.html#a090611"
        }
    ],
    "permalink": "http://scripting.com/2017/06/18.html#a090658"
}