{
    "text": "Comments on Afghanistan",
    "created": "Mon, 16 Aug 2021 12:52:12 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I grew up in the time of the Vietnam War. I was draft age, had a low lottery number, no exemptions, and was flunking out of high school, so the prospect of being drafted was pretty real. ",
            "created": "Mon, 16 Aug 2021 12:45:12 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "One thing I was absolutely sure of was that none of the people who were draft age in that time would start another war like Vietnam, but then <a href=\"https://en.wikipedia.org/wiki/George_W._Bush\">one of them</a> did. ",
            "created": "Mon, 16 Aug 2021 12:52:44 GMT",
            "flInCalendar": true
        },
        {
            "text": "It became a debacle just like Vietnam. But with a few differences. No draft and no body bags. And far fewer American casualties. ",
            "created": "Mon, 16 Aug 2021 12:52:51 GMT",
            "flInCalendar": true
        },
        {
            "text": "The idea of the US converting a country we know nothing about and don't want to know anything about into a country modeled after the US is just as wrong today as it was in the 60s and 70s. ",
            "created": "Mon, 16 Aug 2021 12:53:15 GMT",
            "flInCalendar": true
        },
        {
            "text": "And <a href=\"https://en.wikipedia.org/wiki/Lyndon_B._Johnson\">LBJ</a>, who did so much for civil rights, also was brought down by <a href=\"https://en.wikipedia.org/wiki/Lyndon_B._Johnson#Vietnam_War\">Vietnam</a>. ",
            "created": "Mon, 16 Aug 2021 12:53:20 GMT",
            "flInCalendar": true
        },
        {
            "text": "Lots of parallels. Another one is that journalism is completely fucking up the story, telling bedtime stories about what the US could do, and how events developed, and getting the story completely wrong. I'm no expert, but I've read enough to know that there was a deal between the US and the Taliban that did not include the Afghan government, where the US committed to leave in 2020, and the Taliban agreed to not attack us as we left. Had we decided to stay, breaking that deal, we would have committed to a full scale war with the Taliban. There was no middle alternative between leaving and war. Whether or not this was wise is something you have to ask former president Trump. He desperately wanted to get out of Afghanistan and was willing to give up everything to get it. But even that much he couldn't pull off. ",
            "created": "Mon, 16 Aug 2021 12:53:30 GMT",
            "flInCalendar": true
        },
        {
            "text": "Fact: once we went in, there was no graceful way out. Give Biden credit for being willing to take the hit to get us out, finally, after Bush, Obama and Trump kicked the can down the road to the next administration. ",
            "created": "Mon, 16 Aug 2021 12:54:34 GMT",
            "flInCalendar": true
        },
        {
            "text": "Of all the things you can read today, I recommend this <a href=\"https://laurajedeed.medium.com/afghanistan-meant-nothing-9e3f099b00e5\">piece</a>, written by an Afghanistan vet. It rings true. ",
            "created": "Mon, 16 Aug 2021 12:54:54 GMT",
            "flInCalendar": true
        },
        {
            "text": "Also Heather Cox Richardson's <a href=\"https://heathercoxrichardson.substack.com/p/august-15-2021\">summary</a> is as usual excellent. ",
            "created": "Mon, 16 Aug 2021 13:05:02 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}