{
    "text": "Judging Trump",
    "created": "Fri, 02 Oct 2020 13:30:19 GMT",
    "type": "outline",
    "description": "The election is our last chance to get rid of Trump, assuming he survives the virus. Do not lose sight of that. ",
    "metaImage": "http://scripting.com/images/2020/10/02/heaven.png",
    "subs": [
        {
            "text": "Some of us, privately, will tell our friends that we're glad that Trump got the virus. He was living far more dangerously than he should have. It was amazing that he stayed uninfected this long. ",
            "created": "Fri, 02 Oct 2020 13:26:20 GMT"
        },
        {
            "text": "I'm ten years younger than him, I exercise every day, and I limit my interactions with other people drastically. Last week I went out to lunch with a small group of friends, outside. I've done that a few times since March, mostly in the last month. I also have serious pre-existing conditions that make me more vulnerable. My life is dramatically altered since we all went into hiding earlier this year. If I consider myself lucky to be virus-free so far, then Trump is blessed beyond belief that he got away with what he was doing for so long.",
            "created": "Fri, 02 Oct 2020 13:30:53 GMT"
        },
        {
            "text": "Meanwhile the virus rages through the United States, and <i>he's responsible</i> for that, and all the misery that comes from it. So yeah, it's good that he got it. If he survives, perhaps he'll do something to help, at least he won't be able to do more harm. If he doesn't survive, may he rest in peace -- and at the same time, good riddance. ",
            "created": "Fri, 02 Oct 2020 13:31:43 GMT"
        },
        {
            "text": "Get over the impulse to cut him slack here. This is not a time for that, especially with the election so close. <i>This is our last chance to get rid of Trump</i>. Stay focused on that. Is this event a positive for that? I'm not certain about many things but I am certain about this. Yes it is.",
            "created": "Fri, 02 Oct 2020 13:32:36 GMT"
        },
        {
            "text": "It's totally okay to judge Trump. That's what elections are all about. We're trained not to do it, esp when someone is sick. This is not the time for that. ",
            "created": "Fri, 02 Oct 2020 13:42:44 GMT"
        }
    ]
}