{
    "created": "2024-04-11T04:00:00.000Z",
    "flInCalendar": true,
    "name": "11",
    "path": "2024/04/11",
    "text": "April 11",
    "type": "calendarDay",
    "subs": [
        {
            "text": "In an email to <a href=\"https://en.wikipedia.org/wiki/Doc_Searls\">Doc</a> this morning: \"The web is such a huge total mess. CSS is a junk pile of reinventing that learned nothing from the ideas it was reinventing. The only reason we put up with this is the freedom we got from it. But that’s been gone for a long time. I have a feeling we’re wasting our golden years overlooking that we’re trying to get creative work done in a corporate crime scene. We won, only to have our victory enshrined by a bunch of corpy wiseasses and nazis.\" Doc is a very literate and quote-worthy writer, and we bring out the best from each other. So next time you see Doc thank him for me, for the creativity. We're making the best of a bad situation. It's even worse than it appears and I'm old enough to know better. \n",
            "created": "Thu, 11 Apr 2024 14:48:42 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2019/08/17/doctorNick.png",
            "flInCalendar": true
        },
        {
            "text": "A <a href=\"http://scripting.com/2022/10/01/133834.html?title=docQuixote\">piece</a> I wrote about Doc in 2022 entitled Doc Quixote. ",
            "created": "Thu, 11 Apr 2024 15:03:14 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "So this <a href=\"https://bsky.app/profile/did:plc:oety7qbfx7x6exn2ytrwikmr/post/3kpsh22d2dx2b\">ticking time bomb</a> was sitting there all the time the journalists were talking about how Biden is too old to win the election with Trump. Biden was never the issue, the issue was the freaking Supreme freaking Court.",
            "created": "Thu, 11 Apr 2024 14:48:05 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The Arizona court decision won’t just have an effect on the politics of Arizona. It will have effect on the politics of the entire freaking United freaking states of freaking America.",
            "created": "Thu, 11 Apr 2024 18:17:08 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I was closing tabs this morning and came across this sweet <a href=\"http://scripting.com/code/testing/tabstest/index.html?tab=cuckoo\">little test app</a> I did when I was working on tabs. I wish there were a practical use for something like this. ",
            "created": "Thu, 11 Apr 2024 14:38:24 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Freakout Day on the internet",
            "created": "Thu, 11 Apr 2024 18:20:25 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I have a suggestion for an internet holiday.",
                    "created": "Thu, 11 Apr 2024 18:20:33 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Call it Freakout Day.",
                    "flInCalendar": true
                },
                {
                    "text": "Works like this.",
                    "flInCalendar": true
                },
                {
                    "text": "When you think of a pronouncement you'd like to make, write it in your favorite \"tiny little text box\", but before you send it, add the word \"freaking\" between every word in the punchline.",
                    "created": "Thu, 11 Apr 2024 18:20:43 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Like so --",
                    "flInCalendar": true
                },
                {
                    "text": "The Arizona court decision won’t just have an effect on the politics of Arizona. It will have effect on the politics of the entire freaking United freaking States of freaking America.",
                    "flInCalendar": true
                },
                {
                    "text": "Really impresses people. 😀",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "My 1988 driver's license",
            "created": "Thu, 11 Apr 2024 22:32:01 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Found this in my desk drawer today. Amazing the things you carry with you over the ages. I lived in an apartment building on top of a hill in the <a href=\"https://www.google.com/maps/place/1100+Sharon+Park+Dr,+Menlo+Park,+CA+94025/@37.424696,-122.2298177,15z/data=!4m6!3m5!1s0x808fa4f7ba716f5d:0x4318060066990628!8m2!3d37.4247727!4d-122.2181447!16s%2Fg%2F11c1343h_f?entry=ttu\">middle of a golf course</a>, smack in the heart of Silicon Valley, if it actually had a heart, and that's debatable. All the Sand Hill Road VCs were on the other side of the hill. And one exit south on 280 was Xerox PARC, and where NeXT had its startup offices. ",
                    "created": "Thu, 11 Apr 2024 22:32:10 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "My 1988 driver's license.",
                    "created": "Thu, 11 Apr 2024 22:33:41 GMT",
                    "inlineImage": "https://imgs.scripting.com/2024/04/11/driverslicensesmall1988.png",
                    "flInCalendar": true
                },
                {
                    "text": "This was the place where I started development of what became \"Frontier\". I always wanted to do a great system level scripting thing, based on what I learned from Unix and what I loved about the graphic user interface. ",
                    "created": "Thu, 11 Apr 2024 22:34:13 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It became a lot bigger than I anticipated. In the beginning it was meant to be a replacement for the Macintosh Finder, with an outliner for a file system browser, and of course a fantastic scripting ability, of the OS and of scriptable apps. I wish Apple had supported this effort but I didn't understand at the time that they couldn't. They weren't set up to let anyone but Bill and Andy make great products, even if their products weren't all that great, imho of course. You have to live with the mythology you create. ",
                    "created": "Thu, 11 Apr 2024 22:47:48 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "A lot of people got their first programming experience with Hypercard. I would have loved if more of them get their first experience with Frontier. Even better would have been if our products worked together, but that wasn't in the cards either. ",
                    "created": "Thu, 11 Apr 2024 22:48:14 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}