{
    "created": "2024-04-16T04:00:00.000Z",
    "flInCalendar": true,
    "name": "16",
    "path": "2024/04/16",
    "text": "April 16",
    "type": "calendarDay",
    "subs": [
        {
            "text": "If Tesla went out of business, would my Model Y stop working??",
            "created": "Tue, 16 Apr 2024 19:42:30 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I've never been to TED or SXSW.",
            "created": "Tue, 16 Apr 2024 13:58:22 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Good morning NBA fans. Today is the official beginning of the post-season, and this Knicks fan is one freaking happy camper. Just thought I'd get that outta the way before getting down to business. ",
            "created": "Tue, 16 Apr 2024 14:29:15 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Working together",
            "created": "Tue, 16 Apr 2024 14:08:10 GMT",
            "type": "outline",
            "description": "We need 'working together' to survive climate change and fascism. ",
            "subs": [
                {
                    "text": "Each form of online discussion has a <i>grain</i> to it. <a href=\"https://en.wikipedia.org/wiki/Doc_Searls\">Doc</a> and I used to <a href=\"https://imgs.scripting.com/2024/04/16/followsthegrain.png\">talk</a> about how something \"follows the grain of the web.\" Twitter has its own grain, formed by its character limit, what information is shared (ie number of followers in both directions). ",
                    "created": "Tue, 16 Apr 2024 14:02:08 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I made a list of some of the social networks I've been on starting in the mid-70s. The list is very long. And each of them had their own limits, rules and features, and each led to a certain kinds of relationships between the participants. Mail lists that gain traction always flame out. It's hard to get people to read your blog. If you make it easier it changes into something else. Instagram, Youtube, TikTok form hierarchies of influencers. I think of those as the networks <a href=\"https://en.wikipedia.org/wiki/Taylor_Lorenz\">Taylor Lorenz</a> covers. ",
                    "created": "Tue, 16 Apr 2024 14:20:25 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "But there isn't a structure that I'm aware of that leads to people working together. It's a puzzle I keep trying to figure out. ",
                    "created": "Tue, 16 Apr 2024 14:21:36 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "We need \"working together\" to survive climate change and fascism. It would be good to crack this nut. ",
                    "created": "Tue, 16 Apr 2024 14:21:44 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "One of the nicest things about ChatGPT is that it's always up for working with you. The critics of AI don't begin to understand this. As an example, I'm going to ask ChatGPT to draw a picture of people working together. <a href=\"https://imgs.scripting.com/2024/04/16/peopleWorkingTogether.png\">Here it is</a>. I didn't have to wait. It didn't look at my follower count, or my bank statement to decide if it was willing to work with me. I pay the $20 a month, and I've got a persistent always-on collaborator. ",
                    "created": "Tue, 16 Apr 2024 14:08:20 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "What got me thinking this way this morning is a bit of collaboration I did <a href=\"https://www.threads.net/@palafo/post/C5zHWbPOJun\">with palafo</a> (a <a href=\"https://www.nytimes.com/by/patrick-laforge\">human</a>) on Threads. It's remarkable. We actually did some work together. No sarcasm. It may be hard to read the <a href=\"https://www.threads.net/@palafo/post/C5zHWbPOJun\">thread</a> but if you're curious about collaborative systems, here's a real example. Serendipitous, unplanned, but we figured something out by combining our experiences. Fantastic.",
                    "created": "Tue, 16 Apr 2024 14:10:07 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Later, <a href=\"https://werd.io/\">Ben Werdmuller</a>, a person who I've gotten to know recently, is intelligent and asks good questions. He asked one <a href=\"https://www.threads.net/@ben.werdmuller/post/C50vyIruTCB\">today</a>, how do they get the live audience on SNL to laugh when they want them to laugh. I had an idea and <a href=\"https://www.threads.net/@davew/post/C50wy5NsYD0\">shared</a> it. (This was <a href=\"https://www.reddit.com/r/LiveFromNewYork/comments/1v5hy6/how_does_the_snl_audience_know_when_to_laugh/\">discussed</a> on Reddit. I also <a href=\"https://chat.openai.com/share/463e08c0-0380-4e65-9e6c-2742ce91f0db\">checked</a> with ChatGPT.) ",
                    "created": "Tue, 16 Apr 2024 14:12:45 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "If you take away one thing from this post it's that we can collaborate with the machines, and maybe that will unlock collaboration between humans. In fact, in a way they are facilitating the collaboration. If you want to be part of the collective human intelligence, you may be thinking about the machines the wrong way. Maybe they're the most human thing we have, because AI is made up of humans, somewhat like <a href=\"https://www.youtube.com/watch?v=4UPDUpjkHg0\">Soylent Green</a>. :smile:",
                    "created": "Tue, 16 Apr 2024 14:16:04 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PS: I asked ChatGPT to draw a picture of <a href=\"https://imgs.scripting.com/2024/04/16/cleaningAMess.png\">humans working together</a> to clean up a mess. ",
                    "created": "Tue, 16 Apr 2024 14:23:53 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PPS: Yesterday I gave <a href=\"https://john.onolan.org/\">John O'Nolan</a> what I think is a <a href=\"https://www.threads.net/@davew/post/C5y7iVoJP4r\">good idea</a> for getting his Ghost blogs federating with Threads, Mastodon et al. I didn't expect thanks or even a response, but I wonder if he even heard it. Most of the time, trying to help other people results in not even an acknowledgment that they saw it. If I were him I'd look for a painless, quick way to get maximum interop. Something like <a href=\"http://ghost.social/\">ghost.social</a>. I'd give the same advice to <a href=\"https://ma.tt/\">Matt</a> at Automattic (in fact I think I did). ",
                    "created": "Tue, 16 Apr 2024 15:56:10 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PPPS: I think acknowledgment is a key part of \"working together\" on the web. Nothing more than \"I wanted you to know I saw it\" is often all that's needed to grease the skids of discourse. I've had a friendly disagreement with Manton at micro.blog about this. ",
                    "created": "Tue, 16 Apr 2024 16:01:08 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}