{
    "created": "2024-04-19T04:00:00.000Z",
    "flInCalendar": true,
    "name": "19",
    "path": "2024/04/19",
    "text": "April 19",
    "type": "calendarDay",
    "subs": [
        {
            "text": "It's totally ridiculous to equate protest with antisemitism, esp with Israel led by a MAGA ally. The two concepts are <a href=\"https://en.wikipedia.org/wiki/Orthogonality\">orthogonal</a>. I do not support the Israeli government any more than I supported the government of my country, the United States, when the MAGAs were in charge. We lost over 1 million Americans who did not have to die imho, because our government was not only immoral and hugely corrupt, but also made no attempt to govern. I am a child of Holocaust survivors and an American born in the USA, and am proud of and grateful to my country. Any American is free to protest the actions of our government or any other government, or really anything. If you don't believe in that then you aren't actually trying to make America great, you're saying something altogether different and incompatible. I am American. I am also deeply offended at other Americans who propose to speak for me. That actually is antisemitic, btw.",
            "created": "Fri, 19 Apr 2024 14:19:46 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2020/11/26/uncleSam.png",
            "flInCalendar": true
        },
        {
            "text": "Quick <a href=\"https://www.youtube.com/watch?v=46eVHcVYPFY\">video demo</a> of <a href=\"https://meta.ai/\">meta.ai</a>. This is a demo of just one feature, its ability to recalc drawings as you edit the prompt that defines the picture. As you can tell from the demo I love it because it's new, creative, super fun to use and to watch the result. And lovely to see this much progress so quickly. You really should watch it <a href=\"https://www.youtube.com/watch?v=46eVHcVYPFY\">on YouTube</a> so you can see how what I type relates to the image in real-time. It's like subtitles inverted, with a very knowledgeable, creative and high bandwidth computer network behind it. Living in the future.  ",
            "created": "Fri, 19 Apr 2024 13:06:14 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=46eVHcVYPFY",
            "flInCalendar": true
        },
        {
            "text": "WordPress For One",
            "created": "Sat, 20 Apr 2024 01:55:41 GMT",
            "type": "outline",
            "description": "You might be writing as part of a larger site, but this is your writing space, a place to make your own.",
            "subs": [
                {
                    "text": "More and more I'm getting used to <a href=\"https://en.wikipedia.org/wiki/WordPress\">WordPress</a> as the platform I develop for. ",
                    "created": "Fri, 19 Apr 2024 16:07:53 GMT",
                    "type": "outline",
                    "image": "https://imgs.scripting.com/2022/03/21/beetle.png",
                    "flInCalendar": true
                },
                {
                    "text": "Imagine if you, as a developer, could add your own data to a WordPress post. Then you could build editors that work at a higher level. For example, you'd keep the <a href=\"http://scripting.com/2022/08/25/210902.html?title=markdownIsJustEnoughHtml\">Markdown</a> source for the page. When it was saved the system would re-render the Markdown, turning it into HTML, but you'd still have the Markdown around for editing. And of course there are other kinds of editors that make sense, knowing that the output is going to the web, but you don't have to <i>write</i> in the technical language of the web. You might want something more suited to wordsmiths -- ie <i>writers, </i>if you are a writer. I have that working here, and have been building on it.",
                    "created": "Sat, 20 Apr 2024 01:56:07 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I've gone back to <a href=\"https://this.how/radio/screenshots.opml?permalink=20240219144035\">Radio UserLand</a> and tried to extrapolate, where would we have gone with that product, 22 years later. And now I'm beginning to see in the pieces that are forming the new product I've been working on, something whole, something that works. ",
                    "created": "Sat, 20 Apr 2024 01:56:33 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I think of it as \"WordPress For One\" -- you might be writing as part of a larger site, but this is <i>your</i> writing space, a place you can mold to fit your style, where it gets more comfortable over the years, more you. That's what I've felt has been wrong with the direction the web has been going in, we're getting <a href=\"http://scripting.com/2024/01/14/031201.html\">boxed</a> into smaller and smaller spaces, but for some of my writing I want a nice stage with good lighting and full freedom to tell a story that I have to tell, not necessarily all at once, but possibly in a series, over time. ",
                    "created": "Sat, 20 Apr 2024 02:01:09 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I also want to be influenced by your story. I want <a href=\"http://scripting.com/2024/04/16/140810.html\">Working Together</a>. ",
                    "created": "Sat, 20 Apr 2024 01:58:29 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Of course I still very much develop for \"FeedLand\", and in the back of my mind I want to loop back around to \"Drummer\" (it's my main writing environment), and then I have another product I call Belter I want to finish. And I wouldn't mind trying to make a CSS thing that makes more sense than the tragedy CSS is, and also would love to see a port of \"Frontier\" to Linux, though I don't see doing that myself, but I would like to guide it (so it runs all the old stuff first). ",
                    "created": "Sat, 20 Apr 2024 01:57:42 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "An imaginary New Orleans street",
            "created": "Sat, 20 Apr 2024 02:25:57 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "A street in New Orleans that Meta.ai invented. I asked for <a href=\"https://www.google.com/maps/@29.9270769,-90.1155323,3a,75y,1.51h,85.05t/data=!3m7!1e1!3m5!1sOKZW5h4GwMu1UYZJix4Bng!2e0!6shttps:%2F%2Fstreetviewpixels-pa.googleapis.com%2Fv1%2Fthumbnail%3Fpanoid%3DOKZW5h4GwMu1UYZJix4Bng%26cb_client%3Dmaps_sv.share%26w%3D900%26h%3D600%26yaw%3D1.509190729513552%26pitch%3D4.947217102494918%26thumbfov%3D90!7i16384!8i8192?coh=205410&entry=ttu\">Joseph St</a> across from the cemetary. Even so an interesting image, makes me think of the city in a nostalgic way.",
                    "created": "Sat, 20 Apr 2024 02:26:06 GMT",
                    "inlineImage": "https://imgs.scripting.com/2024/04/19/newOrleansSt.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}