{
    "text": "My keynote for FediForum",
    "created": "Wed, 04 Jun 2025 16:22:06 GMT",
    "type": "outline",
    "description": "FediForum is a virtual conference that starts tomorrow. If they had asked me to keynote, this is roughly what I would say.",
    "metaImage": "http://scripting.com/images/2025/06/04/keynote.png",
    "subs": [
        {
            "text": "<a href=\"https://fediforum.org/\">FediForum</a> is a virtual conference that starts tomorrow. If they had asked me to keynote, this is roughly what I would say.",
            "created": "Wed, 04 Jun 2025 16:38:30 GMT",
            "flInCalendar": true
        },
        {
            "text": "Imho this stuff is pretty freaking simple, esp since there are well over 20 years of prior art to use, and not that many ways to do what we're trying to do. I'm impatient, so here's a quick set of observations with my opinion, take it for what it's worth, ymmv, etc. ",
            "created": "Wed, 04 Jun 2025 16:23:27 GMT",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "You shouldn't be reinventing so much. Always look around for <a href=\"http://essaysfromexodus.scripting.com/priorArtDesignMethod\">prior art</a>. That will make it possible for you to interop more quickly at both a software level and at a human level. ",
                    "created": "Wed, 04 Jun 2025 16:23:59 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Don't invent stuff you think you may need later. Save that for later. You have no intuition for what's needed and more important nothing to test against. You will get it wrong 100 percent of the time.",
                    "created": "Wed, 04 Jun 2025 16:24:33 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Don't invent stuff you think you may need later that makes what you're doing now more complicated. I see a lot of that in ActivityPub.  ",
                    "created": "Wed, 04 Jun 2025 16:24:49 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The only reason you're doing all this work is for interop. If you've been doing it for years and you don't have much meaningful interop you're doing it wrong.",
                    "created": "Wed, 04 Jun 2025 16:25:56 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Write the software first. Use formats that exist, or if you must invent new stuff, make sure it's simple. Work on its simplicity as you would any other feature. Factor! If there are going to be 100 interoperable products and you make it a little more difficult to implement, that work will be multiplied 100 times. And it be a barrier to entry, so you may not get the most powerful interop possible with the most interesting products. ",
                    "created": "Wed, 04 Jun 2025 16:26:26 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Read and follow the <a href=\"https://this.how/standards/\">Rules for Standards-makers</a>. There aren't that many. But if you're breaking them, you're not going to end up with a standard. If your goal is to appear to be making standards, you should also read RFSM, and don't do anything in it. I've seen people do that btw. ",
                    "created": "Wed, 04 Jun 2025 16:28:09 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Have you looked at the world outside the tech stuff to see how important this all has become? All the time we're wasting is very costly in everything that depends on the social web actually existing as opposed to just being talked about.",
                    "created": "Wed, 04 Jun 2025 16:37:16 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Now, what would I request if I could influence you??",
            "created": "Wed, 04 Jun 2025 16:39:15 GMT",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "Mastodon and Bluesky should support inbound and outbound RSS, and do it really well. Right now they do outbound only, and the implementations are incomplete at covering the functionality they have now, and there needs to be more (see the next item). ",
                    "created": "Wed, 04 Jun 2025 16:39:29 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "They'd support the basic features of the <a href=\"https://textcasting.org/\">textcasting</a> spec, including Markdown because it's a great standard, very much of the same school as RSS. If it had existed when we did RSS 2.0 it would have been part of it. ",
                    "created": "Wed, 04 Jun 2025 16:40:22 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "That's it. Really not much work. ",
            "created": "Wed, 04 Jun 2025 16:41:17 GMT",
            "flInCalendar": true
        },
        {
            "text": "From there we'd have 25 years of interop to explore. ",
            "created": "Wed, 04 Jun 2025 16:51:03 GMT",
            "flInCalendar": true
        },
        {
            "text": "And we could really call this the open social web.",
            "created": "Wed, 04 Jun 2025 16:46:39 GMT",
            "flInCalendar": true
        },
        {
            "text": "I'm ready to do it any time you all are. ",
            "created": "Wed, 04 Jun 2025 16:30:14 GMT",
            "flInCalendar": true
        },
        {
            "text": "Yours in not wasting time.",
            "created": "Wed, 04 Jun 2025 16:37:08 GMT",
            "flInCalendar": true
        },
        {
            "text": "Dave",
            "created": "Wed, 04 Jun 2025 16:38:16 GMT",
            "flInCalendar": true
        },
        {
            "text": "PS: I asked ChatGPT to <a href=\"https://imgs.scripting.com/2025/06/04/talkVisualized.png\">visualize</a> me giving this talk.",
            "created": "Thu, 05 Jun 2025 01:14:42 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}