{
    "text": "Can David Frum hear me?",
    "created": "Wed, 04 Jun 2025 22:01:20 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I've been enjoying the new <a href=\"https://www.theatlantic.com/podcasts/the-david-frum-show/\">David Frum podcast</a>. He's very good at thinking and does a lot of it, and expresses himself very well. I read all his columns and have read two of his books, even though I don't share much of his pre-Trump politics, I find it interesting to hear how he parses things. I also subscribe to The Atlantic. I listen to him. But in this week's episode it's clear that the listening is one-way. ",
            "created": "Wed, 04 Jun 2025 21:55:06 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "In today's <a href=\"https://www.theatlantic.com/podcasts/archive/2025/06/david-frum-showwhy-are-the-media-so-afraid-of-trump/683029/\">episode</a> we heard from the elite journalist David Frum, interviewing elite editor in chief Marty Barrett, formerly of the Washington Post, and they both make what I believe are wildly inaccurate generalizations about the quality of the news reporting by professionals and the ugliness and inadequacy of bloggers and podcasters. ",
            "created": "Wed, 04 Jun 2025 22:02:23 GMT",
            "flInCalendar": true
        },
        {
            "text": "The problem is, they don't read widely enough to know that there are bloggers and podcasters with good intentions, ethics, deep knowledge and experience who are also well educated -- they don't know we exist and therefore can't hear about the huge mistakes they are making with their own self-perception of their role that we can see because we are not in their world. (BTW, I have been in their world, I was a contributing editor at Wired, a research fellow at Harvard and NYU, each for two years, and I have collided with Frum-like elites, the usual response is a hand-wave of dismissal, written off as not worth listening to, I guess.)",
            "created": "Wed, 04 Jun 2025 22:03:48 GMT",
            "flInCalendar": true
        },
        {
            "text": "Frum, at the end of the episode talks about how the press covered Biden's incapacity, that led to the second Trump term. They should have stopped, once we were all informed of what happened, and let the <i>electorate</i> decide, it wasn't up to them, or the celebrities they gave space to in their op-eds. In the United States, the <i>people</i> decide. Instead they put up a roadblock and wouldn't let the issue drop. We all knew, we were all informed, probably long before we read a single article about his debate performance. They should have stopped. That was their malpractice. ",
            "created": "Wed, 04 Jun 2025 22:04:29 GMT",
            "flInCalendar": true
        },
        {
            "text": "Their responsibility was to give us the information, and it was also their responsibility to stop right there. Once informed, they were wrong in continuing to harp on it. ",
            "created": "Wed, 04 Jun 2025 22:15:01 GMT",
            "flInCalendar": true
        },
        {
            "text": "We saw them do it with Governor Cuomo of New York. And Senator Al Franken. And Donald McNeil at the NY Times. And on and on. There's so much reporting that's lazy and incompetent, but they'll never report on that, because of their conflicts. And they never listen to their critics. And as a result they play a role they are not entitled to play.  ",
            "created": "Wed, 04 Jun 2025 22:05:53 GMT",
            "flInCalendar": true
        },
        {
            "text": "They need to wake up to the idea that while reporting from their bubble is still important and is heard, they misuse it regularly, and we are fed up with it. If they want to control the government, do the right thing, and run for office. Don't do it from your byline in the Washington Post or NY Times. ",
            "created": "Wed, 04 Jun 2025 22:06:58 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}