{
    "text": "The open web needs a friend",
    "created": "Wed, 01 Nov 2017 16:45:52 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "A very short conversation on Twitter with <a href=\"https://towcenter.org/academics/emily-bell/\">Emily Bell</a>, director of the Tow Center at Columbia. ",
            "created": "Wed, 01 Nov 2017 16:46:03 GMT",
            "subs": [
                {
                    "text": "<a href=\"https://twitter.com/emilybell/status/925762632828715009\">Bell</a>: There is a govt that doesn’t care to understand tech power, and tech that won’t explain itself, left to academia and journalism to elucidate",
                    "created": "Wed, 01 Nov 2017 16:52:55 GMT",
                    "urltweet": "https://twitter.com/emilybell/status/925762632828715009"
                },
                {
                    "text": "<a href=\"https://twitter.com/davewiner/status/925763352504266752\">Me</a>: Emily explains the problem. Unfortunately journalism and academia aren't in any way up to the challenge. Imho of course. ;-)",
                    "created": "Wed, 01 Nov 2017 16:46:31 GMT",
                    "urltweet": "https://twitter.com/davewiner/status/925763352504266752"
                }
            ]
        },
        {
            "text": "There is no organization repping the interest of the open web. I know people say that the EFF, Mozilla and the W3C do, but any organization that is trying to force HTTPS on the web, using the power of browser vendors to enforce it, is not repping the interests of the open web. So that cuts out EFF and Mozilla. And the W3C has unfortunately been controlled by big tech companies almost since inception. ",
            "created": "Wed, 01 Nov 2017 16:46:47 GMT"
        },
        {
            "text": "A hypothetical open-web-repping organization could come out of journalism or academia. But it would have to be rooted with two things: users and open tech. And that's it. ",
            "created": "Wed, 01 Nov 2017 16:48:35 GMT"
        },
        {
            "text": "I don't care how much money anyone makes. Some things' value come from being open to anyone, and those projects <i>consume</i> money, they don't make it. ",
            "created": "Wed, 01 Nov 2017 16:59:33 GMT"
        },
        {
            "text": "Think of <a href=\"http://scripting.com/liveblog/users/davewiner/2015/12/27/0724.html\">Central Park</a>, for those familiar with New York. Or any public resource that's set aside for everyone to use. That's the web. It's not here so Google and Facebook or the NY Times or Washington Post can have a business model. It's not here for them to mine, exploit and leave a wasteland where once there was promise. ",
            "created": "Wed, 01 Nov 2017 16:49:44 GMT"
        },
        {
            "text": "The big tech companies behave like big companies. Right now there is nothing that balances that power. The journalists and academics have been in awe of them, and have been reluctant to understand the issues. I don't expect much from that combination until they get serious about protecting the resource that we all need. ",
            "created": "Wed, 01 Nov 2017 17:00:46 GMT"
        }
    ]
}