{
    "created": "2023-02-06T05:00:00.000Z",
    "flInCalendar": true,
    "name": "06",
    "path": "2023/02/06",
    "text": "February 06",
    "type": "calendarDay",
    "subs": [
        {
            "text": "A question for <a href=\"https://www.google.com/search?q=site%3Ascripting.com+%22brent+simmons%22\">Brent Simmons</a>. If you are off Twitter, where are we supposed to meet? What's our common ground? Serious question. Maybe it's <a href=\"https://mastodon.social/@brentsimmons@indieweb.social/109815316574037279\">Mastodon</a> for <a href=\"https://mastodon.social/@davew/109818552360089269\">now</a>. Is that the best we can do, feature-wise and from a UI and open formats and protocols standpoint, in 2023? We've been at this for almost 30 years. :boom:",
            "created": "Mon, 06 Feb 2023 15:31:19 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Brent and I both come from UserLand where we had excellent collaborative tools. Far in advance of what we're using on Mastodon. I've been using the <a href=\"http://docserver.scripting.com/drummer/instantOutlines.opml\">instant outlines</a> feature of Drummer lately to organize my work on this complicated corner-turn I have to do because (as Brent points out) Twitter has become unreliable. I'd rather take care of this now than put it off for much longer. I'm asking this question in a lot of places. Why have we let the web stagnate? Why be preoccupied with the machinations of Musk et al. Why don't we take advantage of the new freedom we have in light of their chaos to build new stuff! Taking features out of products seems like giving up to me, or perhaps it's lightening the load. We'll see I guess. ",
            "created": "Mon, 06 Feb 2023 15:43:59 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/10/07/drummer.png",
            "flInCalendar": true
        },
        {
            "text": "I changed my Twitter bio, removing the phrase \"I'm not trying to get rich or famous.\" I felt that was a bit holier-than-thou. And at times I most definitely am thinking about that. So it's a matter of <a href=\"http://scripting.com/davenet/2001/01/08/whatIsIntegrity.html#3\">integrity</a>. My rule is when what you appear to be is different from what you are, you should change one or the other or both. Here's a <a href=\"http://scripting.com/images/2023/02/06/partITookOut.png\">screen shot</a> that highlights the part I took out. I am still dedicated to fixing things that are broken, but there's no unawkward way to say that, so I removed it too for now. ",
            "created": "Mon, 06 Feb 2023 15:28:42 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "A quick story",
            "created": "Mon, 06 Feb 2023 16:51:20 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "A little story I probably have written before. ",
                    "created": "Mon, 06 Feb 2023 16:51:26 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I once made an exciting product called Frontier just for the Mac, and this turned out to be a mistake, because while I was making the product, Apple changed, and they eventually attacked and destroyed my investment, which was considerable, and also set us back a long way, all of us, imho.",
                    "flInCalendar": true
                },
                {
                    "text": "I'm typing this on a Mac because right now this is the best computer for me to use. But what Apple did to us was terrible. ",
                    "flInCalendar": true
                },
                {
                    "text": "This is life. You have to deal with it. ",
                    "created": "Mon, 06 Feb 2023 16:51:29 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}