{
    "created": "2023-02-23T05:00:00.000Z",
    "flInCalendar": true,
    "name": "23",
    "path": "2023/02/23",
    "text": "February 23",
    "type": "calendarDay",
    "subs": [
        {
            "text": "First, it's good that people are working on new features for RSS for podcasts. Why not. But you should choose a modest name for your effort. By calling it Podcasting 2.0 you're basically forcing anyone else who wants to do something here to call theirs 3.0 or 4.0. Just come up with a random name, like <i>The Oslo Project.</i> How did I come up with that name? I asked <a href=\"https://chat.openai.com/chat\">ChatGPT</a> to do it : \"Please give me 10 random names of European cities with less than 4 syllables in their names.\" Here's <a href=\"http://scripting.com/images/2023/02/23/randomCityNames.png\">what</a> it came up with. Or you can ask for <a href=\"http://scripting.com/images/2023/02/23/names.png\">children's names</a>. Or <a href=\"http://scripting.com/images/2023/02/23/colornames.png\">color</a> names. Or <a href=\"http://scripting.com/images/2023/02/23/yiddishwords.png\">Yiddish</a> words. And then please, look at what the other guys are doing and instead of implementing something slightly different with a different name, just do it their way. The only goal here should be upgrading the user experience and interop, so there's no freaking lockin. Keep the bullshit to a minimum. \"Available where you get your podcasts.\"",
            "created": "Thu, 23 Feb 2023 16:52:34 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I'm still trying to figure out how to retrofit Instant Outlining in <a href=\"http://docserver.scripting.com/drummer/electricDrummer.opml\">Electric Drummer</a> without having to implement support for the new email-based identity system. It's especially hard to do that for an Electron app, it took a huge effort to get Twitter identity in there. E/D stores files locally, and combined with <a href=\"https://github.com/scripting/publicfolder\">Public Folder</a>, means it doesn't need any help storing stuff where it's public accessible. The hard part, I'm finding, is to figure out where I need to stop it from overwriting one of the head-level attributes. I wrote all this code, but it's so freaking complicated. Having cleared that up, I'm now ready to take another approach. I'll let you know how it goes. ",
            "created": "Thu, 23 Feb 2023 16:36:21 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "It's only me",
            "created": "Thu, 23 Feb 2023 16:19:45 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I’ve been <a href=\"http://scripting.com/2023/02/16.html#a160316\">searching</a> for this quote from John Lennon, and found it <a href=\"https://thecoleopterawithana.tumblr.com/post/182351610145/one-of-my-great-memories-of-john-is-from-when-we\">via</a> Paul McCartney: “It’s only me.”  Here's the full quote.",
                    "created": "Thu, 23 Feb 2023 16:19:57 GMT",
                    "subs": [
                        {
                            "text": "One of my great memories of John is from when we were having some argument. I was disagreeing and we were calling each other names. We let it settle for a second and then he lowered his glasses and he said: “It’s only me.” And then he put his glasses back on again. To me, that was John. Those were the moments when I actually saw him without the facade, the armour, which I loved as well, like anyone else. It was a beautiful suit of armour. But it was wonderful when he let the visor down and you’d just see the John Lennon that he was frightened to reveal to the world. ",
                            "created": "Thu, 23 Feb 2023 16:20:36 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "When you’ve lost your way in a long friendship, hopefully there’s an <i>only me</i> place you can get back to.",
                    "created": "Thu, 23 Feb 2023 16:27:12 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}