{
    "text": "Google and HTTP status report",
    "created": "Mon, 12 Mar 2018 17:36:53 GMT",
    "type": "outline",
    "isComment": "false",
    "subs": [
        {
            "text": "Happy to report that I'm starting to get more reasonable and thoughtful responses to my <a href=\"http://this.how/googleAndHttp/\">Google and HTTP</a> faq. I have worked on toning it down, remembering that some people came to the belief that HTTP is bad for the web honestly, and therefore may respond to some simply-stated objections. This has led me to a distillation of the moral case against what Google is doing. ",
            "created": "Mon, 12 Mar 2018 17:37:11 GMT"
        },
        {
            "text": "I've been around the tech industry almost as long as anyone. I've yet to see a tech company grow past the \"break things and never look back\" stage to understanding that the people <i>they serve</i> are not who they think they are. I highlighted the word serve in that sentence. It's an unfamiliar concept to the tech industry, but they should learn it. It's more humble, more achievable than the godlike status they feel they deserve. That's a very adolescent way of thinking. ",
            "created": "Mon, 12 Mar 2018 17:38:07 GMT"
        },
        {
            "text": "What Google is planning on doing to the web is unnecessarily damaging to the work of millions of people they don't know. If they could step back and look at their objectives, and let's see if we can compromise, so they can get what they really want and the web can be what it always has been, an open space for experimentation, free thought, and the development of world-changing ideas. It's where Google itself came from. ",
            "created": "Mon, 12 Mar 2018 17:39:28 GMT"
        },
        {
            "text": "Let's see if they gained any maturity and sense of perspective of their place in the world in the 20 years since their founding. When you achieve adulthood all of a sudden you can see the context in which you exist. Blowing things up is the way children approach the world. Adults try to work things out, we hope. :boom:",
            "created": "Mon, 12 Mar 2018 17:41:01 GMT"
        }
    ]
}