{
    "text": "Preparing for 25 years",
    "created": "Tue, 06 Aug 2019 15:59:50 GMT",
    "type": "outline",
    "description": "On October 7, this blog will have existed and been continually updated for 25 years.",
    "subs": [
        {
            "text": "On October 7, this blog will have existed and been continually updated for 25 years.",
            "created": "Tue, 06 Aug 2019 15:59:55 GMT",
            "image": "http://scripting.com/2015/02/07/chuckBerry.png"
        },
        {
            "text": "There were times I took as much as a couple of weeks off, but I usually blogged when I was traveling. I have observations, things I want to write down, basically all the time. I don't see the blog as work, to me it's more like a part of living.",
            "created": "Tue, 06 Aug 2019 16:17:19 GMT"
        },
        {
            "text": "It may be hard to remember this, but in the early days net connections away from home were exceptional. You didn't get internet connectivity in hotels, there were no cell phones. I once went for a two-week massage course without being able to check my email once. Even listening to voicemail required a drive into town! ",
            "created": "Tue, 06 Aug 2019 16:09:30 GMT"
        },
        {
            "text": "A lot of other things happened while this blog was running. Needless to say there were no blogs when it started. There was only email, no instant messaging. No RSS or podcasting, no Twitter, Facebook, Google. Amazon and Netscape were less than a year old. Microsoft tried to take over the web and failed. Steve Jobs came back to Apple and brought us the iPhone. And much more.",
            "created": "Tue, 06 Aug 2019 16:10:33 GMT"
        },
        {
            "text": "Anyway, I'm thinking about how I want to celebrate this. It'll be the first time I put any forethought into such a thing. We went through 5, 10, 15 and 20 years with very little in the way of observation. Not sure why this one is special, but it seems that it is.",
            "created": "Tue, 06 Aug 2019 16:01:15 GMT"
        },
        {
            "text": "One thing I'd like to know, are there any of the original email subscribers from 1994 around still reading the blog or on the net even? Does anyone have any of the original \"Amusing rants from Dave Winer's desktop\" emails? I'd actually like to know the exact time on 10/7/94 that the first email went out. ",
            "created": "Tue, 06 Aug 2019 16:02:20 GMT"
        },
        {
            "text": "I'd also like to hear from people who read this stuff as it was booting up, as it started from a way to promote a friend's event, to a report on the event, to observations on tech products, to gestalts about <i>holy shit this is an incredible medium</i> posts. It didn't take long for it to become clear that something interesting was happening here. I wonder what it looked like from the other side of the net connection. ",
            "created": "Tue, 06 Aug 2019 16:04:18 GMT"
        },
        {
            "text": "Some people said for sure what Dave is doing is preparing to compete with Stewart and Esther, charging $495 per year for a newsletter, and $2000 a year for an industry conference. I was never thinking about that, this blog has never had a business model. I never wanted it to, and I've written about why. I'm sure I could find it if anyone is interested. ",
            "created": "Tue, 06 Aug 2019 16:05:41 GMT"
        },
        {
            "text": "Anyway if you have a story to tell about this, email me at dave.winer@gmail.com. What did it feel like to receive the emails. What did you think was happening? When did it occur to you that you could write like I was or did it? Anything that you want to say I'm interested in hearing as long as it isn't flamey. :boom:",
            "created": "Tue, 06 Aug 2019 16:06:50 GMT"
        }
    ]
}