{
    "text": "Noisy geothermal heating",
    "created": "Wed, 20 Mar 2019 14:21:18 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "This is a <a href=\"https://github.com/scripting/Scripting-News/issues/111\">braintrust query</a>. ",
            "created": "Wed, 20 Mar 2019 14:24:38 GMT"
        },
        {
            "text": "The new country house has <a href=\"https://en.wikipedia.org/wiki/Geothermal_heat_pump\">geothermal heating and cooling</a>, which is something I didn't know existed until I found this house. It's supposed to be a lot less expensive. It uses electricity to move water around to transfer heat from or to a pool of underground water that's at a constant temperature of 55 degrees. In the summer, it's used to cool, in the winter to heat. Genius.",
            "created": "Wed, 20 Mar 2019 14:24:23 GMT"
        },
        {
            "text": "But just before the heat comes on it makes a very loud jarring sound, like a garage door slamming shut. It rocks the whole house. Wakes me up when I'm sleeping. There's no preparation for it, it just happens. It's basically not acceptable. I don't want to get used to it.",
            "created": "Wed, 20 Mar 2019 14:22:36 GMT"
        },
        {
            "text": "I've tried searching on the net for ideas about how noisy these things are supposed to be, and no one talks about this loud sound."
        },
        {
            "text": "I have to find someone to come out and take a look, but I don't know how to search for someone who does maintenance on geothermal heating."
        },
        {
            "text": "I love the idea, but this is not an acceptable situation. I may have to switch to conventional heating and cooling."
        },
        {
            "text": "PS: An AirBnB I rented the week before had the same problem. It was worse because the heat was going on and off all the time. So it was garage door slamming all night nonstop. Needless to say I didn't stay there the full time I had reserved it.",
            "created": "Wed, 20 Mar 2019 14:23:30 GMT"
        }
    ]
}