{
    "text": "It's marketing dummy",
    "created": "Thu, 12 Sep 2024 01:28:27 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "What Harris is doing is marketing. It takes a lot of impressions to get people to believe she can be president. If she wants to win, she has to do a lot of interviews and rallies and say quotable things, and be tweeting all the time, not just in the campaign snark accounts (which are great) but also seriously in her own name. ",
            "created": "Thu, 12 Sep 2024 01:28:32 GMT",
            "image": "https://imgs.scripting.com/2019/12/24/drummer.png",
            "flInCalendar": true
        },
        {
            "text": "People aren't going to care about the policies though they will say that's what they want more of. What they want to feel is that she is present. Biden was invisible that's why they didn't like or trust him, even though he is a good president. Trump is very present, and they like that, trust that, but most of them also know he's a creep. She just has to keep beating the drum. ",
            "created": "Thu, 12 Sep 2024 01:29:08 GMT",
            "flInCalendar": true
        },
        {
            "text": "And the secret is to keep beating the drum, constantly, after she wins. Don't disappear like Obama did. She must not only be president of the United States, but she has to be <a href=\"https://shownotes.scripting.com/scripting/2024/09/10/twitterPresidentKamala.html\">president of Twitter</a> too (and by Twitter I mean all the twitter-like systems). ",
            "created": "Thu, 12 Sep 2024 01:29:45 GMT",
            "flInCalendar": true
        },
        {
            "text": "So don't expect undecided voters to all convert to Harris in one event. But they will if she stays in the news, even dominates the news (please) and help them see Trump as a thing of the past. ",
            "created": "Thu, 12 Sep 2024 01:30:00 GMT",
            "flInCalendar": true
        },
        {
            "text": "That's the way to win, and to win in governing too. ",
            "created": "Thu, 12 Sep 2024 01:30:26 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}