{
    "created": "2024-09-01T04:00:00.000Z",
    "flInCalendar": true,
    "name": "01",
    "path": "2024/09/01",
    "text": "September 01",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Dear NY Times, before we <a href=\"https://www.nytimes.com/2024/09/01/magazine/worthless-pennies-united-states-economy.html\">get rid of the penny</a>, let’s open up your op-ed page to include criticism of the NYT. You can handle a little pushback, you need it desperately.",
            "created": "Sun, 01 Sep 2024 20:48:50 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The networks should put <a href=\"https://www.threads.net/@davew/post/C_YWpfXNZq_\">Trump on time delay</a> and when he says you can legally murder babies in some states, that should be treated as if he said fuck or shit. Put up a screen that explains why he was cut off, then go to commercial, esp during the debate on Sep 10.\n",
            "created": "Sun, 01 Sep 2024 20:50:00 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Paul Graham wrote a very <a href=\"https://www.paulgraham.com/foundermode.html\">useful piece</a> about \"Founder Mode.\" As a founder myself, I think I can tell you why founders have a central role to play as the company grows. They're the only ones who know how the company was built, and what works and what doesn't and how to keep it consistent for customers and partners, and the founder, if the company grew, is tuned into to what makes the company work, and will see opportunities that even well-intentioned managers miss. I remember when a company I was a developer for, early in my career, switched out the founder and replaced him with a professional CEO. The founder had problems managing, and could have used help imho, but -- the founder understood what the company was about, and the professional claimed to be a \"market of one\" and therefore didn't have an opinion about what products the company should make. That would be delegated to people he hired. Almost as if the people running a company were just modules and servers, and if you needed to grow you just bought new modules. In this case. I can write this because I don't have to get approval from anyone else. I'm sure in a company of today someone would take offense at something I wrote here. That my friends is another reason why companies have a hard time scaling. :smile:",
            "created": "Sun, 01 Sep 2024 15:52:12 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2024/09/01/paulMcCartney.png",
            "flInCalendar": true
        },
        {
            "text": "Another rule for whoever runs a tech company, they must themselves be a fanatical user of the company's product. They must love it the way a founder loves it. They must think the users are the smartest people in the world because they love the best product in the world. As a founder, I could not visualize the day I left the company for the last time. In hindsight I felt that was the one factor most responsible for the success of the company. ",
            "created": "Sun, 01 Sep 2024 16:44:02 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Graham uses Steve Jobs as an example. He knew what was and wasn't an Apple product. A hired CEO would have to have that explained to him. Sculley, who Graham cites, is a perfectly nice person in my experience, had no idea how to deal with Windows. Very different from a consumer product like fizzy water. Who but Steve Jobs would have thought that an iPod was a proper product for a company that made PCs. I think he himself wanted it, and that's what made something an Apple product. It's probably why post-Jobs Apple is pretty much stuck selling only the products Jobs created for them. He told <a href=\"https://en.wikipedia.org/wiki/Tim_Cook\">Cook</a> to innovate on his own vision and timetable, probably knowing full-well that nobody would be able to do it. :smile:",
            "created": "Sun, 01 Sep 2024 16:45:43 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "And for some companies, the founder of a company they acquire might make the best CEO when the founder of the original company isn't available. Again Apple is a great example. Steve Jobs ultimately replaced Gil Amelio, after Apple bought NeXT.",
            "created": "Sun, 01 Sep 2024 16:57:19 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "August is <a href=\"https://github.com/scripting/Scripting-News/blob/master/blog/opml/2024/08.opml\">archived</a>. Let's start September.",
            "created": "Sun, 01 Sep 2024 12:46:05 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Cushy Kitty",
            "created": "Sun, 01 Sep 2024 16:51:53 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Wordle Kitty is watching TV along with 80 other convicted house pets serving life sentences at Attica high security prison. They’re watching a mushy political psycho drama starring Wordle Kitty herself, the cutest most adorable kitten known to mankind. The NYT headline reads “Cushy kitty crushes mushy melodrama in prison laugh riot.”",
                    "created": "Sun, 01 Sep 2024 16:52:12 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Cushy kitty crushes mushy melodrama in prison laugh riot.",
                    "created": "Sun, 01 Sep 2024 16:52:59 GMT",
                    "inlineImage": "https://imgs.scripting.com/2024/09/01/kittyCrushes.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}