{
    "created": "2024-09-04T04:00:00.000Z",
    "flInCalendar": true,
    "name": "04",
    "path": "2024/09/04",
    "text": "September 04",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I'm watching the HBO series <a href=\"https://en.wikipedia.org/wiki/The_Newsroom_(American_TV_series)\">The Newsroom</a> from 2012, it's an <a href=\"https://en.wikipedia.org/wiki/Aaron_Sorkin\">Aaron Sorkin</a> show. It's fairly insipid, but for some reason I keep watching. They have a multi-episode <a href=\"https://en.wikipedia.org/wiki/List_of_The_Newsroom_episodes#Season_2_(2013)\">controversy</a> as they go crazy trying to source a rumor they've heard that the US bombed a town in the Middle East with sarin gas, and killed a lot of people. In other words they committed a war crime. Turns out they were set up by multiple people, and they went through all kinds of angst over who should resign and who should be fired, and how they would ever regain the trust of the viewers. It is a Sorkin thing so it is by definition overdone, but in the context of today's NYT and CNN and all the other schlock \"news\" that reports Trump's ever-more-egrious lies not only without fact checking, but knowing for sure the lies are coming. That this has happened to American \"journalism\" is worse than a war crime. It's what everyone told us is an essential part of an authoritarian state, we expect everything in the news to be lies. We have now gotten there. It's good to acknowledge that, imho and stop asking why it is, rather think about <i>what you can do</i> about it. ",
            "created": "Wed, 04 Sep 2024 15:32:37 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Aaron Sorkin is like <a href=\"http://scripting.com/stories/2011/01/01/theWorldIsSocialist.html\">Ayn Rand</a>. Reviewing his stories after you've grown up makes you wonder why you liked it in the first place. :smile: ",
            "created": "Wed, 04 Sep 2024 15:37:56 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I don't understand using an email to send a code to verify the email address, that you then have to enter into a dialog. Why not just send a URL that the user can click on? What's the design rationale for making the user do the extra steps in remembering the number, switching back to your app, and entering the number by hand, when it could all be done with a single click?",
            "created": "Wed, 04 Sep 2024 13:20:38 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2023/02/13/bozoApproved.png",
            "flInCalendar": true
        },
        {
            "text": "Funny story",
            "created": "Wed, 04 Sep 2024 15:53:55 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I asked ChatGPT to \"colorize\" the first picture. The second picture is what it produced. Note I didn't say \"editorialize.\" I don't know what you think but I think it's art! (I'm serious, I'll write more about that. I love that it's making us define art.)",
                    "created": "Wed, 04 Sep 2024 15:54:04 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The first picture.",
                    "created": "Wed, 04 Sep 2024 15:54:12 GMT",
                    "inlineImage": "https://imgs.scripting.com/2024/09/04/blackAndWhite.png",
                    "flInCalendar": true
                },
                {
                    "text": "The second picture.",
                    "created": "Wed, 04 Sep 2024 15:54:28 GMT",
                    "inlineImage": "https://imgs.scripting.com/2024/09/04/colorized.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}