{
    "created": "2024-09-05T04:00:00.000Z",
    "flInCalendar": true,
    "name": "05",
    "path": "2024/09/05",
    "text": "September 05",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I got a bit of pushback on what I wrote about The Newsroom <a href=\"http://scripting.com/2024/09/04.html#a153237\">yesterday</a>. If you think it was great, you should watch it again. They got everything wrong, imho -- and the storytelling is as simple as <a href=\"http://scripting.com/stories/2011/01/01/theWorldIsSocialist.html\">Atlas Shrugged</a>. If you loved it in 2012, okay -- but we've all been through hell since then. And we know how the news orgs The Newsroom was trying to model dealt with the challenge. They folded. They gave up. It's all bullshit. It's like watching the story of a great war, that we lost. I don't mean bloggers, I mean all of it. If democracy depends on journalism, then it's gone. It can't come back from what they're doing now. Think of the hair-splitting they did in The Newsroom, even the slightest appearance of impropriety. Now they invite politicians on when they know they're going to tell hugely damaging lies about very important things. They're doing the opposite of what journalism is supposed to do. They sure as hell don't care what we think of them. Go watch it again. It's a time capsule that will show you how much you've learned since those horribly naive days. Maybe I'll write more about this tomorrow. ",
            "created": "Thu, 05 Sep 2024 15:40:56 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2022/12/01/santa.png",
            "flInCalendar": true
        },
        {
            "text": "I've never written a review on Amazon even though I shop there regularly. I was about to write a negative review for a product they can't seem to support, that I depend on, but got <a href=\"https://imgs.scripting.com/2024/09/05/amazonReviewPage.png\">this message</a>. Weird. I bought the product from the page I wanted to review it on. How else would they determine if I actually purchased the product? They don't say. They do offer to tell me a joke if I rate products I've bought. I've heard the company isn't doing that well now that Bezos has stepped aside. Hopefully this is just a bad set of coincidences. ",
            "created": "Thu, 05 Sep 2024 16:24:59 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Adaptations",
            "created": "Thu, 05 Sep 2024 19:11:14 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I asked ChatGPT to adapt two images.",
                    "created": "Thu, 05 Sep 2024 19:11:19 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Grandpa from The Munsters and Ted Cruz, US senator from Texas. ",
                    "created": "Thu, 05 Sep 2024 19:11:28 GMT",
                    "inlineImage": "https://imgs.scripting.com/2024/09/05/grandpaAndTedCruz.png",
                    "flInCalendar": true
                },
                {
                    "text": "The adaptation is pretty nice. ",
                    "created": "Thu, 05 Sep 2024 19:12:42 GMT",
                    "inlineImage": "https://imgs.scripting.com/2024/09/05/adaptationOfTedCruzAndGrandpa.png",
                    "flInCalendar": true
                },
                {
                    "text": "Another pair, the logo of Los Pollos Hermanos from Breaking Bad. ",
                    "created": "Thu, 05 Sep 2024 19:13:44 GMT",
                    "inlineImage": "https://imgs.scripting.com/2024/09/05/losPollosHermanos.png",
                    "flInCalendar": true
                },
                {
                    "text": "The adaptation is thoughtful.",
                    "created": "Thu, 05 Sep 2024 19:13:58 GMT",
                    "inlineImage": "https://imgs.scripting.com/2024/09/05/losPollosAdaptation.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}