{
    "created": "2024-09-06T04:00:00.000Z",
    "flInCalendar": true,
    "name": "06",
    "path": "2024/09/06",
    "text": "September 06",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Journalism doesn't come back from the election of 2024, any more than the Republican Party does. ",
            "created": "Fri, 06 Sep 2024 15:40:37 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I got a beautiful new <a href=\"https://store.google.com/us/product/pixel_9_pro\">Pixel 9 Pro</a> yesterday. It was amazingly easy to move the data from the old phone to the new one. Just turn both on near each other, and click a couple of dialogs. Haven't used it for anything yet. Will report. ",
            "created": "Fri, 06 Sep 2024 13:10:22 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Why journalism doesn't come back",
            "created": "Fri, 06 Sep 2024 16:50:18 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "There's a difference betw journalism in 2023 and 2024, it really is changing that quickly. They are a mechanism for delivering some really tragic lies now, without correction, and a lot of people will believe them. Esp the two Trump is pushing now about <a href=\"https://www.poynter.org/fact-checking/2024/trump-abortion-roe-wade-overturned/\">Roe v Wade</a> and <a href=\"https://www.yahoo.com/news/trump-keeps-saying-some-states-allow-the-execution-of-babies-after-birth-they-dont-heres-how-that-falsehood-got-started-201129756.html\">Democratic states killing live babies</a>. This isn't a fumbling Trump, the words were written for him, he's rehearsed it, and they're powerful lies, and journalism is carrying it. When they comment, it's far away from the lie, a CYA move, because they'll let him on again and again to lie. ",
                    "created": "Fri, 06 Sep 2024 16:50:30 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The first time they carried his lies we could excuse it, but not the 50th. They invited him to speak on their air to transmit lies. Transmitting lies is the <i>opposite</i> of what news does. ",
                    "created": "Fri, 06 Sep 2024 16:58:43 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "That means all the idealism we see in <a href=\"http://scripting.com/2024/09/04.html#a153237\">The Newsroom</a> was for nothing, we now know how it ended. I don't think this has caught up with most people yet, and it's not something the journalists are going to report on, so realization may come slowly -- but it happened nonetheless. ",
                    "created": "Fri, 06 Sep 2024 16:52:55 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "We'd be fools if we believe anything that comes from channels that broadcast lies. ",
                    "created": "Fri, 06 Sep 2024 16:59:44 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "That's what's so sad about The Newsroom. Their thesis was that an always-striving-to-be-true journalism that goes to jail to protect sources, the Woodward Bernstein, Edward R Murrow, amazing American news, what we were told we grew up with, probably wasn't even remotely true in 2011 when it was broadcast, and any pretense of it covering the truth in 2024, is gone. ",
                    "created": "Fri, 06 Sep 2024 16:53:40 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "A program like The Newsroom has a new context, it's no longer a light feel-good comedy, today it's a tragedy. ",
                    "created": "Fri, 06 Sep 2024 18:48:18 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}