{
    "created": "2024-09-09T04:00:00.000Z",
    "flInCalendar": true,
    "name": "09",
    "path": "2024/09/09",
    "text": "September 09",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Could Kamala Harris look into the camera tomorrow night and say \"To Fox News viewers, they've been feeding you a load crap. Just thought you should know. And I wouldn't trust the others so much either.\"  ",
            "created": "Mon, 09 Sep 2024 15:10:44 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "30th anniversary in a month",
            "created": "Mon, 09 Sep 2024 16:44:54 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2024/09/09/zelig.png",
            "subs": [
                {
                    "text": "Are the Apple announcements like great reunions for people who have been going to these things regularly for 20+ years? If so, I can see the value in it. ",
                    "created": "Mon, 09 Sep 2024 16:45:04 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I went to a reunion at Berkman, <a href=\"http://scripting.com/2023/09/08/222335.html\">after 20 years</a>, and it was great, made me wonder why we didn't do it every year for the last 20. When you get a group of people together who do great things in a special moment, you should see them from time to time. ",
                    "created": "Mon, 09 Sep 2024 16:45:18 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "But I have a feeling there's a lot of turnover at the Apple events. In any case, I stopped going to them somewhere in the mid-90s, or more accurately they stopped inviting me. Yeah I was disruptive, but only in comparison to how well-behaved the other journos were (at that time I was writing for Wired). ",
                    "created": "Mon, 09 Sep 2024 16:45:34 GMT",
                    "image": "https://imgs.scripting.com/2020/03/22/accordionPlayer.png",
                    "flInCalendar": true
                },
                {
                    "text": "The press was in awe of Apple and other Valley companies. I enjoyed that for a very brief period when my company went public after I had a hit Mac product. Then I became something of a pariah, because I <a href=\"http://scripting.com/davenet/\">started blogging</a> and believe me the icons of the Valley for the most part <i>did not like it.</i> They were accustomed to fawning attention and rewritten press releases. But because I was an insider, I had an idea where the bodies might be buried, and I wrote about it. <a href=\"https://en.wikipedia.org/wiki/Steve_Wozniak\">Woz</a> liked it. I was popular at the parties, I guess. ",
                    "created": "Mon, 09 Sep 2024 16:45:49 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "BTW, <a href=\"https://en.wikipedia.org/wiki/Heidi_Roizen\">Heidi Roizen</a> once observed that I took a date to an Apple announcement (the one where Steve came back). There weren't many people there, maybe 20 or 25. ",
                    "created": "Mon, 09 Sep 2024 16:48:49 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Jeff Jarvis wrote in the foreword to his <a href=\"https://www.amazon.com/Web-We-Weave-Internet-Misanthropes/dp/1541604121\">upcoming book</a> that I'm like the <a href=\"https://en.wikipedia.org/wiki/Zelig\">Zelig</a> of tech. This is what he meant, imho. :smile:",
                    "created": "Mon, 09 Sep 2024 16:53:08 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "We're coming up on the 30th anniversary of my blog, one month from tomorrow. You won't hear anyone from tech applauding, and you probably won't hear anything from the old bloggers. But I have something special in mind myself. Hopefully it'll come together in the next month, or sooner. :-)",
                    "created": "Mon, 09 Sep 2024 16:47:01 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Let's go back to 1994, by looking to the future. You won't need an invite, btw. It'll open to everyone.",
                    "created": "Mon, 09 Sep 2024 16:47:18 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}