{
    "created": "2024-09-11T04:00:00.000Z",
    "flInCalendar": true,
    "name": "11",
    "path": "2024/09/11",
    "text": "September 11",
    "type": "calendarDay",
    "subs": [
        {
            "text": "The most encouraging thing about last night's debate was that the moderators were journalists. When Trump repeated his most egregious lie about murdering babies being legal in certain states, moderator Muir confidently, almost derisively, said that there is no such thing. And when Trump said he didn't admit he lost the election, and then when challenged said in a snotty way he was being sarcastic, Muir plainly that wasn't true either. It was like the Monty Python <a href=\"https://www.youtube.com/watch?v=4vuW6tQ0218\">dead parrot</a> <a href=\"https://en.wikipedia.org/wiki/Dead_Parrot_sketch\">sketch</a>. ABC News was the last place you'd expect real journalism to surface, maybe the NYT et al will follow their lead.  ",
            "created": "Wed, 11 Sep 2024 15:52:02 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2020/07/16/parrot.png",
            "flInCalendar": true
        },
        {
            "text": "I wouldn't have traded places with Harris for anything in the world, she did fantastic. The pressure on her was enormous. I don't think Trump said one thing that was true. And Harris made the point that the division is coming from that guy over there, and if we don't want it all we have to do is turn the freaking page. For once the power is with the people. The Repubs in the Senate wouldn't vote to convict, the Supreme Court just gave him immunity, but the American people, in a few weeks, can tell them all to fuck off. ",
            "created": "Wed, 11 Sep 2024 15:55:18 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Idea for TV series. Law and Order style crime drama where all the crimes are against humanity.",
            "created": "Wed, 11 Sep 2024 21:26:00 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Even if his supporters don't see it, Trump is a pathetic broken has-been. When he's gone we'll dance in good riddance. ",
            "created": "Wed, 11 Sep 2024 16:05:20 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "A slip of the tongue?",
            "created": "Thu, 12 Sep 2024 01:59:41 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "It would have been cool if Harris had said \"He's going to have you for dinner\" instead of \"He's going to eat you for lunch,\" which is what she said Putin would do to Trump. ",
                    "created": "Thu, 12 Sep 2024 01:59:51 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Makes you wonder if that was a slip of the tongue or if it was a little Easter Egg she dropped for our later amusement. ",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "It's marketing dummy",
            "created": "Thu, 12 Sep 2024 01:28:27 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "What Harris is doing is marketing. It takes a lot of impressions to get people to believe she can be president. If she wants to win, she has to do a lot of interviews and rallies and say quotable things, and be tweeting all the time, not just in the campaign snark accounts (which are great) but also seriously in her own name. ",
                    "created": "Thu, 12 Sep 2024 01:28:32 GMT",
                    "image": "https://imgs.scripting.com/2019/12/24/drummer.png",
                    "flInCalendar": true
                },
                {
                    "text": "People aren't going to care about the policies though they will say that's what they want more of. What they want to feel is that she is present. Biden was invisible that's why they didn't like or trust him, even though he is a good president. Trump is very present, and they like that, trust that, but most of them also know he's a creep. She just has to keep beating the drum. ",
                    "created": "Thu, 12 Sep 2024 01:29:08 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "And the secret is to keep beating the drum, constantly, after she wins. Don't disappear like Obama did. She must not only be president of the United States, but she has to be <a href=\"https://shownotes.scripting.com/scripting/2024/09/10/twitterPresidentKamala.html\">president of Twitter</a> too (and by Twitter I mean all the twitter-like systems). ",
                    "created": "Thu, 12 Sep 2024 01:29:45 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "So don't expect undecided voters to all convert to Harris in one event. But they will if she stays in the news, even dominates the news (please) and help them see Trump as a thing of the past. ",
                    "created": "Thu, 12 Sep 2024 01:30:00 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "That's the way to win, and to win in governing too. ",
                    "created": "Thu, 12 Sep 2024 01:30:26 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}