{
    "created": "2024-09-15T04:00:00.000Z",
    "flInCalendar": true,
    "name": "15",
    "path": "2024/09/15",
    "text": "September 15",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I used to think of <a href=\"http://scripting.com/stories/2007/04/28/twitterAsCoralReef.html\">Twitter as a coral reef</a>, but its role as a world wide notification system is fading, and we haven't replaced it with anything. I wrote <a href=\"http://scripting.com/stories/2007/04/28/twitterAsCoralReef.html\">this</a> in 2007 when the utility of Twitter was just becoming apparent.",
            "created": "Sun, 15 Sep 2024 19:02:09 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I was recruited to speak at a <a href=\"https://en.wikipedia.org/wiki/RIA_Novosti\">Ria Novosti</a> conference in Moscow in June 2011, but decided not to go. This was back when we thought naively that Russia was a democracy, and working with Russian journalists, when American journalists wouldn't, seemed like a fair deal. Something about it didn't smell right though, so I stayed home. ",
            "created": "Sun, 15 Sep 2024 19:03:34 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Something has changed in the twitterverse, it's grown new centers. For me, Bluesky, Mastodon, Threads and Twitter is still here, but I use it a lot less than I used to. Each of them acts as if they are alone, except for ActivityPub but that's more complicated than it may seem. As often is the case, the tech industry is depending on confusion. This may be a strategic mistake. I could cite a few examples where this didn't work, when an open ecosystem whose benefits were by then obvious to users, completely erased the ecosystem that came before, often with remarkable speed. Each of them is playing for all of it, wanting to control their users, make it so they only post to one system. And some people do. I think it's better if we, as users, remain diversified.",
            "created": "Sun, 15 Sep 2024 15:57:34 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2022/02/16/gaslight.png",
            "flInCalendar": true
        },
        {
            "text": "I find that a lot of my posts on my blog are just like the tweets I post on Bluesky, Mastodon, Threads and Twitter. I used to have an icon in my outliner that tweeted the text of the bar cursor headline. ",
            "created": "Sun, 15 Sep 2024 14:11:48 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "If ChatGPT had a simple, non-AI scrapbook, like the old Mac OS had, where you could just throw something over your shoulder so you can find it later with a text search, that would make it a lot more useful for retaining practices that work. It's a shame to work something out, come up with the answer that worked, and then to have to do it all over again 23 months later when you encounter the same problem.",
            "created": "Sun, 15 Sep 2024 14:09:52 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Ignore polls",
            "created": "Sun, 15 Sep 2024 15:51:21 GMT",
            "type": "outline",
            "description": "You'll never see an article in the NYT saying how wrong polls have been in every presidential election because then they'd have to fire half their political reporters. ",
            "subs": [
                {
                    "text": "You'll never see an article in the NYT saying how wrong polls have been in every presidential election because then they'd have to fire half their political reporters. ",
                    "created": "Sun, 15 Sep 2024 15:51:27 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "If you want a better idea of how it's going, look at where the ad dollars are going, and where the candidates are campaigning. ",
                    "created": "Sun, 15 Sep 2024 15:51:44 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "And make sure all your friends know that you're voting and who you're voting for. I think that makes a difference. ",
                    "created": "Sun, 15 Sep 2024 15:51:51 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I'm voting straight Democratic party line.",
                    "created": "Sun, 15 Sep 2024 15:51:57 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}