{
    "created": "2024-09-27T04:00:00.000Z",
    "flInCalendar": true,
    "name": "27",
    "path": "2024/09/27",
    "text": "September 27",
    "type": "calendarDay",
    "subs": [
        {
            "text": "When markets have dominant products, evolution freezes. Google search, for example. I should have great search for my blog by now, powered by Google. It has been here for 26 years. They should have been doing R&D on how they can be part of a better reading environment on the web. But reading on the web has just gotten worse over the years. It's why we don't like clicking on links, usually what we find at the other end of the link is obnoxious. To get some peace and quiet we had to go to Twitter of all places, but now that's gotten ridiculous too. The only corner of the web where there's real exciting innovation is ChatGPT. And what's tragic about that is we've never made search work on the web, and search is valuable too, not just the digested version of what was said that ChatGPT produces. But I'd like some of my writing to survive the Great Ingestion. Writing matters, how humans express themselves matters. In other words we still have work to do in search, AI does not fill that need, at least not yet. ",
            "created": "Fri, 27 Sep 2024 13:55:58 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2020/11/23/simonBarSinister.png",
            "flInCalendar": true
        },
        {
            "text": "Guy Kawasaki sent a <a href=\"https://imgs.scripting.com/2024/09/27/kawasakiGPT.png?nodialog=true\">summary of my career</a> created by his new chatbot. Very flattering. :-) ",
            "created": "Fri, 27 Sep 2024 21:42:05 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "An idea for a news org. I want a for-pay site where I can ask a question about the news and get the most up-to-date answer. I'd like to link to that page from a blog post, and have it either be frozen, to document where we were on that day, or dynamic, so that it changes over time. I'm sure this product will be here soon, so obvious. ",
            "created": "Fri, 27 Sep 2024 13:24:04 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Harris <i>could</i> win, but..",
            "created": "Fri, 27 Sep 2024 17:00:29 GMT",
            "type": "outline",
            "description": " She had my vote at Hello.",
            "subs": [
                {
                    "text": "I've had the same thought as <a href=\"https://presswatchers.org/2024/09/what-if-the-media-has-the-election-all-wrong/\">Dan Froomkin</a>, of course -- esp given how much voodoo is in weighting various things, the polls are junk. ",
                    "created": "Fri, 27 Sep 2024 17:00:37 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "But, she <i>could</i> be winning much bigger than the polls say. And wouldn't that be nice. :heart: ",
                    "created": "Fri, 27 Sep 2024 17:13:29 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "But do you remember part of the 2016 postmortem was that yeah it was a problem for the racists among us that we elected a black president, and now they want a woman president. Many of us thought this is the price we're paying for the euphoria we felt in 2008.",
                    "created": "Fri, 27 Sep 2024 17:02:07 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "All he says about Harris is true. She's a dream candidate, she had my vote at \"Hello.\" How could anyone <i>not</i> see what's so obvious, here's someone who organized her party's support in the blink of an eye, and she was ready to run, all the pieces were in place in record time. Such competence, drive, humor, did I say drive? :-)",
                    "created": "Fri, 27 Sep 2024 17:02:18 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I worry that maybe all that was enough to get her even with Trump because now we're pressing the race and gender button again, and they still don't buy the idea of a non-white-male, Christian president.",
                    "created": "Fri, 27 Sep 2024 17:02:48 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Oh and btw her husband is Jewish, and... all the childless bullshit. ",
                    "created": "Fri, 27 Sep 2024 17:04:16 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "So I worry that we may be borderline fucked again. Pray. Pray, even if you don't believe.",
                    "created": "Fri, 27 Sep 2024 17:03:03 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}