{
    "created": "2023-06-06T04:00:00.000Z",
    "flInCalendar": true,
    "name": "06",
    "path": "2023/06/06",
    "text": "June 06",
    "type": "calendarDay",
    "subs": [
        {
            "text": "A friend asked if I was going to get \"one of these headsets\"? My answer, for the record: \"Not even slightly interested, but I suppose that could change.\" One of the reasons I'm skeptical is that I have imperfect vision. I seriously doubt if a headset would work for me, given that my left eye is pretty bad, and my right eye is normal. Pretty sure they're for people with good balanced vision. I haven't heard that question asked or answered, for any of the headsets. Another concern is how heavy it is. As you get older you learn that stress on your body accumulates over time. For example, I can't use a full-size iPad. I used one for years, but it wore out my left arm so now it's too painful, but I can use an iPad Mini, without problems, so far. If you're putting some kind of new weight on a human head, what will that do to your neck over time? Your back? These kinds of problems tend to cascade. And I can't help but wonder if there isn't another way to achieve what they're doing without putting extra stress on our necks? And honestly I'd prefer to have a new Mac that ran \"Frontier\", <i>that</i> would really excite me. :smile:",
            "created": "Tue, 06 Jun 2023 12:49:08 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/09/27/todd.png",
            "flInCalendar": true
        },
        {
            "text": "Another <a href=\"https://www.google.com/search?q=site%3Ascripting.com+succession\">Succession</a> post, maybe the last, for a while. At some point I'm going to re-watch the whole series, and then might have more observations. Anyway -- people who think that Roman and Kendall have no hope, well I think the writers gave them some cause for hope -- because when they controlled the company for a short period, each showed they were competent, not at running the enterprise, but a small part of it. Kendall was able to sell a complicated and kind of ridiculous idea. And Roman, when he had a clear goal, was able to manage it, and pulled it off. Neither were the kind of person who could run a sprawling enterprise like Waystar, for that you probably had to be Logan. If the two guys team up and manage something much smaller and more focused, they could possibly pull it off, once they get over not being their father. They <i>didn't</i> revert to where they were at the beginning of the show, as some people say, when Kendall was a drug addict and Roman was a pure <a href=\"https://en.wikipedia.org/wiki/Schmuck_(pejorative)\">schmuck</a> blowing up a <a href=\"https://youtu.be/sVB_BcbLlUs?t=35\">rocket</a> to try to impress the father. They both get a fresh start now that dad is dead. That is a big difference for men, when your father dies you get a chance to come into your own in a new way, I speak from experience. ",
            "created": "Tue, 06 Jun 2023 15:49:52 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "When I was little, maybe first or second grade, my <a href=\"http://scripting.com/images/2023/06/06/grandpaAndLittleDave.jpeg\">grandfather</a> bought me a handheld <a href=\"https://en.wikipedia.org/wiki/Transistor_radio\">transistor radio</a>. It was the 1960s. I listened to <a href=\"https://en.wikipedia.org/wiki/Bruce_Morrow#Radio_work\">WABC</a>, the Beatles and all the great new rock and roll. My grandpa said I’d see so many amazing things in my life. To him the radio was a futuristic miracle, like AI today. Anyway I just asked <a href=\"https://en.wikipedia.org/wiki/Amazon_Alexa\">Alexa</a> to play <a href=\"https://www.youtube.com/watch?v=fQ7uXX9K7Sk\">You Can’t Hurry Love</a> by the Supremes, one of the songs I listened to on the radio he gave me 60 years ago. I realized just now he was so right, I have indeed seen many amazing things in my life.",
            "created": "Tue, 06 Jun 2023 11:04:28 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The Supremes.",
            "created": "Tue, 06 Jun 2023 19:13:54 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2023/06/06/supremes.png",
            "flInCalendar": true
        }
    ]
}