{
    "created": "2023-06-07T04:00:00.000Z",
    "flInCalendar": true,
    "name": "07",
    "path": "2023/06/07",
    "text": "June 07",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Someday a reporter will claim that they gave \"textcasting\" its name.  ",
            "created": "Wed, 07 Jun 2023 12:30:48 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "\"textcasting\" will be what interop means in social media. Help me make it happen. I know it <a href=\"https://trends.google.com/trends/explore?date=today%201-m&geo=US&q=textcasting&hl=en\">sounds ridiculous</a> to think we could change the net so it's a writer's paradise, but I think the time is right. What makes these things work is when enough people want to see the change that it achieves an aura of inevitability. That was the arc of podcasting. It applies to big companies too, Apple won't get anywhere with their new headset until it achieves that aura. I think the social media of textcasting will be amazing. And it's sooo low tech. There's nothing to it other than demanding that the techies stop imposing stupid rules on what we can write. ",
            "created": "Wed, 07 Jun 2023 12:34:21 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/08/31/thisIsNextYear.png",
            "flInCalendar": true
        },
        {
            "text": "Journalism is pretty bad",
            "created": "Wed, 07 Jun 2023 12:14:13 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "How bad is journalism? Let me tell you.",
                    "created": "Wed, 07 Jun 2023 12:14:17 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "A journalist claimed to have given podcasting its name. ",
                    "created": "Wed, 07 Jun 2023 12:31:43 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "He didn't. It's a lie. ",
                    "flInCalendar": true
                },
                {
                    "text": "But he somehow got it on the Wikipedia page for podcasting.",
                    "flInCalendar": true
                },
                {
                    "text": "And there it stayed. And every reporter writing a story about podcasting, saw it, and liked it, and copied it. ",
                    "created": "Wed, 07 Jun 2023 12:14:31 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "As a journalist himself he knew how it works. They don't actually check anything, they just copy and paste. And get paid by the word.",
                    "flInCalendar": true
                },
                {
                    "text": "So all the bullshit you hear about how ChatGPT has <a href=\"https://www.google.com/search?rlz=1C5CHFA_enUS743US747&sxsrf=APwXEdd1lEnOFoALc-jJ66NhNLR6wk5Xuw:1686140931210&q=ChatGPT+hallucinations&tbm=nws&sa=X&ved=2ahUKEwi-zPu5lLH_AhXrkYkEHc0wA9wQ0pQJegQICRAB&biw=1358&bih=1058&dpr=2\">hallucinations</a>, from journalists, covers up the fact that most of what journalists write is complete bullshit. They aren't factual or verified, they just copied something from another journalist, who copied it from a different journalist. They're full of shit, so much so that the journalist knew his lie would never be outed. Even if it were true, it wouldn't be news, but usually what the write contains little or no truth. ",
                    "created": "Wed, 07 Jun 2023 12:15:07 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "These same journalists will never say anything bad about Apple btw, even when they offer up a completely ridiculous product for a market that doesn't exist. Everyone gushes, oh it's so great, when no one even the CEO of the company would be caught with the thing on their head. They do this because they won't get invited back if they don't. ",
                    "created": "Wed, 07 Jun 2023 12:16:07 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Best advice, if you have a question, ask ChatGPT, far more likely it's correct than some random journalist.",
                    "created": "Wed, 07 Jun 2023 12:19:55 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PS: This is how <a href=\"http://scripting.com/2013/04/07/howPodcastingGotItsName.html\">podcasting actually got its name</a>. ",
                    "created": "Wed, 07 Jun 2023 12:19:56 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PPS: <a href=\"https://internationalpodcastday.com/podcasting-history\">International Podcast Day</a>, which is cited as an authority by Google, says there is a dispute about who did what re podcasting between Adam and myself. We have our differences, that's for sure, but I'm not aware of any dispute about how podcasting was created and productized and promoted to turn the idea into a medium. I've always been clear that Adam came to me with the idea, at first I didn't listen, then I got it, and set about implementing it in software. And then creating podcasts, and promoting. We both did a lot of each of those things, but the software was my job, and the development of the standard format. I've never heard Adam dispute any of that. I think they should take that bit about disputes off their description esp since it's being quoted as an authority. And please take Hammersley off the credits. That makes the whole thing stink. ",
                    "created": "Wed, 07 Jun 2023 12:20:24 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PPPS: There are journalists I trust. For example <a href=\"https://en.wikipedia.org/wiki/Monica_McNutt\">Monica McNutt</a>. I'm sure she wants to rise, and she deseves to, but I'm pretty sure she says what she thinks and doesn't worry about access. <a href=\"https://en.wikipedia.org/wiki/Donald_G._McNeil_Jr.\">Donald McNeil</a> is another, which was why I was so disappointed when he was a victim of NYT internal politics. A real journalist should be forgiven for failing to pander adequately, we <i>like</i> our journalists like that, not that the NYT culture cares what their customers want. There are actually many more and everyone has to do a little pandering, and the lines aren't always totally clear. But as the podcast naming fiasco indicates, most journalists don't care about the truth enough to check their \"facts.\" ",
                    "created": "Wed, 07 Jun 2023 15:07:20 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}