{
    "created": "2023-06-09T04:00:00.000Z",
    "flInCalendar": true,
    "name": "09",
    "path": "2023/06/09",
    "text": "June 09",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I can't stop watching this <a href=\"https://www.youtube.com/watch?v=tJdljxrvPqo&list=RDMMtJdljxrvPqo\">video</a>. It's <i>sooo</i> good. ",
            "created": "Sat, 10 Jun 2023 03:52:45 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=tJdljxrvPqo",
            "flInCalendar": true
        },
        {
            "text": "I asked ChatGPT to <a href=\"http://ai.scripting.com/2023/06/09/cheese.html\">write a song</a> in the style of Paul Simon about eating cheese on a nice day. Mr Simon should not be concerned. ",
            "created": "Fri, 09 Jun 2023 16:34:51 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Who is privileged?",
            "created": "Fri, 09 Jun 2023 13:57:38 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "The last time I took a trip by airplane was right after I moved to the mountains in <a href=\"http://scripting.com/2019/04/\">April 2019</a>. I went from Albany to Austin to speak at a <a href=\"https://isoj.org/\">journalism conference</a> at the University of Texas. I resisted the invite, telling the <a href=\"https://isoj.org/rosental-alves/\">genial professor</a> who organized the conference that the audience would hate me, but he didn't accept that. He wanted me to come because it was the 25th anniversary of my blog, and by some counts the 25th anniversary of blogging. He wanted to celebrate, and after a while I couldn't resist, so I went. ",
                    "created": "Fri, 09 Jun 2023 13:57:46 GMT",
                    "image": "http://scripting.com/images/2023/03/20/mrSmith.png",
                    "flInCalendar": true
                },
                {
                    "text": "This was in the last days of #metoo when being a white male was something to be ashamed of, but I am not a person who takes that on. I am confident and sure of myself, that's the way I am. I asked my friend <a href=\"https://en.wikipedia.org/wiki/Rebecca_MacKinnon\">Rebecca MacKinnon</a>, an ex-reporter at CNN and former colleague at Harvard to interview me, figuring that she knew me well and it would be a good interview, and by showing we had a good relationship maybe the criticism would be somewhat restrained.  ",
                    "created": "Fri, 09 Jun 2023 14:06:38 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "As I expected a few people in the audience tried to invalidate everything I said as if I was boasting -- saying basically of course you accomplished some good stuff because you had all the advantages. What I wanted to tell them and didn't manage to get across is that all the advantages couldn't make what I did easy, because when you do something outside of a big company, the people who work in big companies and other institutions resent it, and try to stop you, and they usually do stop it. But every once in a while, if you persist and think and listen and learn you can sneak one in, as we did with the new media (blogs, feeds, podcasting, social media) that came from our work. I felt it would be good if they heard the story because people should know how new things actually happen, rather than the <a href=\"http://scripting.com/2023/06/07/121413.html\">bullshit stories</a> reporters tell. But this room of reporters wasn't having it.",
                    "created": "Fri, 09 Jun 2023 14:10:46 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "If I had it to do over, I would have asked that we have a breakout session later where we could talk about all our privilege. Every person in that room slept in a comfortable clean bedroom the night before, was nicely dressed and clean. The vast majority had excellent educations and made good salaries with benefits, far above the standard of living of most people around the world. In other words before you point the finger, make sure you're not deflecting. And anyway, what's the point. You can learn from anyone, even people with much <a href=\"http://scripting.com/davenet/1996/10/24/QueSeraSera.html\">more power</a> than you have and even if you don't like them. ",
                    "created": "Fri, 09 Jun 2023 14:03:15 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "But you don't get do-overs, except in your imagination. Here we are over four years later and I'm still wishing I had thought it through better before-hand, because I expected what I got, and was left without much to say that convinced anyone. ",
                    "created": "Fri, 09 Jun 2023 14:05:14 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Live and learn. ;-)",
                    "created": "Fri, 09 Jun 2023 14:09:56 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Blaming Mr Fubar",
            "created": "Fri, 09 Jun 2023 13:39:06 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "A follow-up on <a href=\"http://scripting.com/2023/06/08.html\">yesterday's posts</a>, I wasn't really as depressed as it might have seemed because I have a way of dealing with everything seeming to be totally <a href=\"http://ai.scripting.com/2023/06/09/fubar.html\">fubar</a>. I have at least three approaches. ",
                    "created": "Fri, 09 Jun 2023 13:31:36 GMT",
                    "type": "outline",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "First, if there's nothing I can do about something I give myself the choice of not worrying about it. I'm just one person in a world of billions, and I basically have no power over any of the messes I was writing about yesterday. ",
                            "created": "Fri, 09 Jun 2023 13:39:35 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Second, I remind myself that it always feels like everything is about to unravel. I was born in 1955, ten years after the <a href=\"https://en.wikipedia.org/wiki/Little_Boy\">first nuclear weapon</a> was used in war. When I was a draft-age teen, the Vietnam War threatened to become the first world wide nuclear war. We're still here, proving that maybe it wasn't as bad as it appeared at the time. (If you think that was bad, my parents' generation had to run for their lives from the Nazis and their Holocaust.)",
                            "created": "Fri, 09 Jun 2023 13:39:41 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "And a third reason -- the young folk blame my generation, which is stupid, there are all kinds of boomers, people who marched for peace and to save the earth (I was one of them) and people who thought abortion was evil and there is no climate change, and we're all in it for ourselves so let it be. Blaming something as abstract as a generation is a way of shifting responsibility from yourself. Young people of today -- you're the ones who have to live with the world we're <i>all</i> creating now, why aren't you doing something about it? When you find the answer, you'll then understand why we didn't either. The human species appears to have been willfully driving off a cliff for my whole life, and as far as I can tell nothing will stop it. If you know what we can do, speak up and let's do it. ",
                            "created": "Fri, 09 Jun 2023 13:40:18 GMT",
                            "image": "http://scripting.com/images/2017/12/20/shrek.png",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "So with all that in mind, today I'm going to drink some coffee, roll up my sleeves and write some software that helps dig us out of a hole I do understand and feel I might have some impact on. ",
                    "created": "Fri, 09 Jun 2023 13:42:13 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Namaste y'all! :heart:",
                    "created": "Fri, 09 Jun 2023 13:46:18 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "\"curly\"",
                    "created": "Sat, 10 Jun 2023 03:28:49 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}