{
    "created": "2023-06-15T04:00:00.000Z",
    "flInCalendar": true,
    "name": "15",
    "path": "2023/06/15",
    "text": "June 15",
    "type": "calendarDay",
    "subs": [
        {
            "text": "<a href=\"http://scripting.com/2023/06/13/041750.html?title=smallIsBeautiful\">Small is beautiful</a>. I believe it's possible to create a single, simple, easy to understand API that covers the core of all social media APIs. Analogous to what TCP/IP did to flatten the differences between network protocols forming the internet in the 1970s. ",
            "created": "Thu, 15 Jun 2023 16:11:20 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "If the non-Twitter networks want to compete, get rid of character limits. Here's a <a href=\"http://scripting.com/images/2023/06/15/fattweetscreen.png\">screen shot</a> of a <a href=\"https://twitter.com/davewiner/status/1669314484488290304\">post</a> to Twitter earlier today. 613 characters. I could not post that to Mastodon or Bluesky, their character limits are too restrictive. ",
            "created": "Thu, 15 Jun 2023 16:14:44 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1669314484488290304",
            "flInCalendar": true
        },
        {
            "text": "It’s time for the <a href=\"https://www.nytimes.com/2023/06/15/briefing/trump.html\">NY Times</a> to kill itself, put itself out of its misery, or fire all the reporters and get some serious people in there, because in what demented, insane, addled, psychotic, empty brain is Trump remotely <i>fun.</i>",
            "created": "Thu, 15 Jun 2023 12:23:16 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2023/02/28/presidentCarter.png",
            "flInCalendar": true
        },
        {
            "text": "Did you wonder why there were no Jan 6 crowds at either of Trump’s arraignments? Isn’t it obvious? Any would-be insurrectionists saw the Jan 6 folks get tried, convicted and put in jail. That makes the whole thing real. Americans of 2023 are soft. We’re the ones who got tax cuts from Bush while we were at war. We had no draft, no price controls. War was okay as long as we could ignore it. We’d rather have others make the sacrifices for us. We like to own guns to support our fantasy that we’re badasses, but truthfully we’d rather watch the revolution on TV than go to jail, esp for a crybaby snob like Trump.",
            "created": "Thu, 15 Jun 2023 12:21:00 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Users bored with Fediverse? ",
            "created": "Thu, 15 Jun 2023 22:33:44 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Source: <a href=\"https://fedidb.org/\">fedidb.org</a>.",
                    "created": "Thu, 15 Jun 2023 22:33:56 GMT",
                    "inlineImage": "http://scripting.com/images/2023/06/15/mauFediverse.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "You won! Now be a mensch..",
            "created": "Thu, 15 Jun 2023 13:23:01 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "We ought to change the rules for wealth to something like this. When you achieve a certain amount of wealth, you are declared a winner. A champion. There's a ceremony where you get a medal and a special kind of credit card that allows you entry to the VIP room wherever you go. In that room you have free drinks, the most comfortable chairs, fantastic snacks, for you and a guest. Everywhere you go people are required to salute you. All the benefits. You eat the best food, sit in first class, and you live in a very nice house or apartment where all your neighbors are also champs. ",
                    "created": "Thu, 15 Jun 2023 13:23:06 GMT",
                    "image": "http://scripting.com/images/2022/12/01/santa.png",
                    "flInCalendar": true
                },
                {
                    "text": "All that, sounds great right, but what do you give up? You can't make any more money. That's it. Your earning days are over. You won. Now find something else to do. You can't have more than one house, one car -- no private jets, you can't own sports teams or CNN. You have to live like a human being, not consume more than double what a non-champ consumes. ",
                    "created": "Thu, 15 Jun 2023 13:25:24 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "If this sounds like socialism or communism, deal with it. Because when you own 12 homes and fly around in your private jet, and consume hundreds of times more than you can possibly use, you're putting the continued existence, of all of us, in jeopardy. ",
                    "created": "Thu, 15 Jun 2023 13:23:20 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PS: You get free guitar lessons too, and a nice guitar. :guitar:",
                    "created": "Thu, 15 Jun 2023 13:28:04 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}