{
    "created": "2023-06-23T04:00:00.000Z",
    "flInCalendar": true,
    "name": "23",
    "path": "2023/06/23",
    "text": "June 23",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Journalists are trying to discredit AI the same way they discredited Facebook. The same way they tried to kill the Mac in the early-mid 90s. They don't report on anything other than their own dreams.",
            "created": "Sat, 24 Jun 2023 02:29:47 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1672416096652066816",
            "flInCalendar": true
        },
        {
            "text": "There's a whole new season of <a href=\"https://www.metacritic.com/tv/the-bear\">The Bear</a> on Hulu. My. Next. Binge.",
            "created": "Sat, 24 Jun 2023 02:06:31 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "\"RSS\" is a starting point. What you add to it is what makes it interesting. We've used RSS to convey news articles, and we love that, and will always support it, but there are breakthroughs to come.",
            "created": "Fri, 23 Jun 2023 22:04:14 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "What people love about <a href=\"https://www.google.com/search?q=site%3Ascripting.com+bluesky\">Bluesky</a> has nothing to do with the software or federation, or Jack Dorsey. <i>It's the people, stupid. </i>What a lovely group of people. For whatever reason the people who are there now are creative, interested, and stimulated because they sense the presence of similar people. Kind of like Clubhouse was a few summers ago. This tells me something I've suspected, that small-size social networks have a place. They shouldn't just be an accidental thing that disappears because growth attracts less interesting, <a href=\"https://en.wiktionary.org/wiki/destructive\">anti-creative</a> people. ",
            "created": "Fri, 23 Jun 2023 22:00:54 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2023/04/01/siliconValley.png",
            "flInCalendar": true
        },
        {
            "text": "I've been taking it relatively easy on the blogging the last few days. Must be thinking. I'll be back when I'm back in the writing groove. ",
            "created": "Fri, 23 Jun 2023 21:46:36 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}