{
    "created": "2023-06-28T04:00:00.000Z",
    "flInCalendar": true,
    "name": "28",
    "path": "2023/06/28",
    "text": "June 28",
    "type": "calendarDay",
    "subs": [
        {
            "text": "If you write an editorial saying AI could drive the human species to extinction, please explain: 1. How this would happen. 2. Why this is worse than the human species driving itself to extinction. Lost jobs is not a good answer to #1, imho.",
            "created": "Wed, 28 Jun 2023 18:17:27 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "AppleTV is running the whole of the first episode of Silo <a href=\"https://twitter.com/AppleTV/status/1673730750095712256\">as a tweet</a>. This is new, never seen this done before. I imagine that Apple is paying Twitter to do this, or maybe not. Maybe Twitter wants to establish itself as a medium for watching, not just participating, and Apple is helping. I think we'll see more and more of that. A diminution of individuals communicating and more corporations and political parties. People who think Musk is going to regret buying Twitter are imho probably wrong. They were just barely treading water, sitting on one of the most amazing communication systems ever built. A restructuring is for sure going to cause a dip, but once straightened out, it could turn into a strong business. It's not smart to bet against a company that's as installed as Twitter is.",
            "created": "Wed, 28 Jun 2023 13:18:53 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/AppleTV/status/1673730750095712256",
            "image": "http://scripting.com/images/2022/03/21/beetle.png",
            "flInCalendar": true
        },
        {
            "text": "When you hear journalists talk about use of ChatGPT in education they talk about ways students can use it to cheat. They never mention the support functions it can play, like a perfectly tireless and free-of-charge tutor. That's how I often use it. If I'm not sure I've remembered something correctly, I just ask ChatGPT to remind me. It's a kind of drill that was never available before unless you were a rich kid with parents who spoil them. ",
            "created": "Wed, 28 Jun 2023 13:07:32 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "After a good night's sleep and some reflection, I bet the reason the Harvard blogs project is <a href=\"http://blogs.harvard.edu/blog/2023/03/02/blogs-harvard-edu-shutting-down/\">shutting down</a> is the same issue that's haunting all online service providers in 2023, moderation. Not exactly a business for a research center at Harvard to be involved in. Just a guess. ",
            "created": "Wed, 28 Jun 2023 10:52:32 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://blogs.harvard.edu/doc/\">Doc's Harvard blog</a>, a mainstay of the post-blog-boom blogosphere, is about to go away. I started the service that hosted Doc's blog. You know how they say in startups, will the last person to leave please turn the lights out? Well we both lived to see the end of the dream, Doc and I. Our blogging service was the first such service at an American university, possibly in the world. Of course the ideas seem obvious in hindsight, but they weren't obvious then. I went to Harvard hoping to bring intellectuals to blogging and vice versa, and as a bonus we got podcasting. It worked. Anyway, Doc wrote a <a href=\"https://blogs.harvard.edu/doc/2023/06/27/moving-on/\">final post</a> today, have a read, it's a typically beautiful Doc memoire. And here's the <a href=\"https://web.archive.org/web/20071001000000*/https://blogs.law.harvard.edu/doc/\">archive.org listing</a> for the original location of his blog, part of the original group of Harvard blogs, started in 2003. ",
            "created": "Wed, 28 Jun 2023 04:51:38 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2022/02/09/allThingsMustPass.png",
            "flInCalendar": true
        },
        {
            "text": "Here's the <a href=\"http://scripting.com/2003/03/28.html\">announcement</a> of the new Harvard blog server on March 23, 2003. You can see how we got there by reading the archive for the <a href=\"http://scripting.com/2003/03.html\">whole month</a> of March. I started out in Woodside, CA, having just sold my house and packed the car and drove cross-country. I got to work real quickly. By the end of the month I had given talks at the Kennedy School and to the user's group of system managers at Harvard. It was a real rollout. We had weekly meetups at Berkman, every Thursday. All the history was recorded on the blogs. Luckily I continued to tell the story on this blog too, and that archive will remain.  ",
            "created": "Wed, 28 Jun 2023 05:22:12 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Meanwhile the archive of <a href=\"http://scripting.com/\">scripting.com</a> remains in place, and <a href=\"https://github.com/scripting/Scripting-News/tree/master/blog\">archived in OPML</a> on a GitHub repo. Should last a few more years. ",
            "created": "Wed, 28 Jun 2023 04:58:48 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "May 2003: <a href=\"http://blogs.harvard.edu/whatmakesaweblogaweblog.html\">What makes a weblog a weblog?</a> I believe this link will go 404 too on Friday. ",
            "created": "Wed, 28 Jun 2023 05:03:20 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}