{
    "text": "The human species has been on a drive to growth from the beginning. The way to survive was to have lots of kids to insure that some would survive to reproduce, thereby continuing our own DNA and insuring the survival of the species. Until the advent of <a href=\"https://en.wikipedia.org/wiki/Antibiotic\">medicine</a> and mass production of fossil fuel, and other <a href=\"https://en.wikipedia.org/wiki/Interstate_Highway_System\">forms</a> <a href=\"https://en.wikipedia.org/wiki/Olympic_Games\">of</a> <a href=\"https://en.wikipedia.org/wiki/O%27Hare_International_Airport\">civilization</a>, we were in balance with nature. But some time in the last hundred years the balance flipped, growth skyrocketed, and processes were set in motion that got us to today's climate crisis. Problem is that we, as a species, haven't evolved, our evolution-driven goals haven't changed, we still think having more children is a virtue, and that it's our right, even obligation, to consume more. Reversing that is not a simple matter (that's generous, in my heart I don't think it's even possible), and the problem was not created by one or two generations, as some of the young folk believe. The problem is with the nature of our species, the traits that evolution reinforced are the ones that are leading us off the climate cliff. So when I listen to <a href=\"https://en.wikipedia.org/wiki/Greta_Thunberg\">Greta's</a> speech, she isn't speaking just for her generation, she's speaking for mine too, and for my parents, who are gone. My <a href=\"http://eve.scripting.com/2006/11/01\">mother</a>, who died in 2018, was passionate about consuming less. Greta would have liked her, I think. Yes we knew we were going off a cliff, even people who say they aren't sure, they knew too. But turning the ship around isn't something you decide to do. We each can do it ourselves, but that won't make a difference. I don't have the answers, but I know for certain that blaming today's adults for the future that today's children face is wrong.  Making other people the symbol of our grief for our species is typically human, and pointless.",
    "created": "Tue, 24 Sep 2019 14:51:28 GMT",
    "type": "outline",
    "image": "http://scripting.com/images/2019/09/24/ship.png"
}