{
    "text": "Blind men and elephants",
    "created": "Fri, 06 May 2022 13:47:01 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "This is what the <a href=\"https://twitter.com/mims/status/1522569173645369344\">tech columnist</a> at the <a href=\"https://www.wsj.com/\">WSJ</a> says is the difference between Twitter and Facebook. \"Twitter has always been toxic, having a series of 'cool' CEOs tricked journalists and wonks into using it vs the uncool Facebook, new ownership will highlight that all (currently) social mediums are fundamentally toxic.\"",
            "created": "Fri, 06 May 2022 13:47:19 GMT",
            "image": "http://scripting.com/images/2017/05/30/elephant.png",
            "flInCalendar": true
        },
        {
            "text": "Okay that's what a columnist at the WSJ sees. He's pretty clear it's from the point of view of a journalist.  ",
            "created": "Fri, 06 May 2022 13:48:27 GMT",
            "flInCalendar": true
        },
        {
            "text": "My observations follow. ",
            "created": "Fri, 06 May 2022 13:49:07 GMT",
            "flInCalendar": true
        },
        {
            "text": "Twitter grew out of the blogging world and the people of blogs and the norms of blogging moved here. That's why Twitter is what it is. ",
            "created": "Fri, 06 May 2022 13:49:15 GMT",
            "flInCalendar": true
        },
        {
            "text": "Facebook started with students, then moved to families. That's why it is what it is.",
            "created": "Fri, 06 May 2022 13:49:38 GMT",
            "flInCalendar": true
        },
        {
            "text": "Trolls follow crowds online. To say a place has trolls (Mims uses the word toxic) simply means enough people congregate there to attract trolls. Journalists btw were the ones who decided FB was evil and Twitter was fun. Some of us were shaking our heads and protesting loudly that they're missing the big picture. Journalism was wrong about Facebook, in a lot of ways that they still don't understand. ",
            "created": "Fri, 06 May 2022 13:49:39 GMT",
            "flInCalendar": true
        },
        {
            "text": "For non-journos, both Twitter and Facebook are useful, and if I had to choose I'd say FB is a little more useful. Twitter these days is choked with grievance, from people who aren't very toxic in real life, but choose Twitter as the place to purge their bile. But inbetween ventings, it's a place to be heard, maybe just a little. And if you listen carefully you might find out about something new. I first heard of the leaked Supreme Court opinion on Monday on Twitter, a few minutes before I heard about it on MSNBC (I was watching Chris Hayes at the time). By the time Maddow was on I had fully read the <a href=\"https://www.politico.com/news/2022/05/02/supreme-court-abortion-draft-opinion-00029473\">Politico article</a>. So it has that value too, currency. It's the collective newsroom. ",
            "created": "Fri, 06 May 2022 13:49:48 GMT",
            "flInCalendar": true
        },
        {
            "text": "On Facebook we share pictures of our friends and talk about places you can ski even in May, in North America. And stay in touch with friends we otherwise would not be able to stay connected to. ",
            "created": "Fri, 06 May 2022 13:50:49 GMT",
            "flInCalendar": true
        },
        {
            "text": "That's what this <a href=\"https://en.wikipedia.org/wiki/Blind_men_and_an_elephant\">blind man</a> sees. ",
            "created": "Fri, 06 May 2022 13:51:27 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}