{
    "created": "2025-08-03T04:00:00.000Z",
    "flInCalendar": true,
    "name": "03",
    "path": "2025/08/03",
    "text": "August 03",
    "type": "calendarDay",
    "subs": [
        {
            "text": "A <a href=\"https://shownotes.scripting.com/scripting/2025/08/03/aPodcastUsersApi.html\">podcast</a> about a podcast users' API. ",
            "created": "Sun, 03 Aug 2025 16:38:41 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "It's always a good idea to get a second opinion with AI stuff. ChatGPT may give you a convoluted answer where Claude.ai gives you a concise one.",
            "created": "Sun, 03 Aug 2025 15:22:09 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I've been working on the top level of \"wordland\", and finally got to a place where navigation feels good, like this is the right track. So I took a <a href=\"https://www.youtube.com/watch?v=_9GiWjPgVhM\">snapshot</a> so I can come back and look at this later.",
            "created": "Sun, 03 Aug 2025 14:04:22 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=_9GiWjPgVhM",
            "flInCalendar": true
        },
        {
            "text": "As you get older your memory gets less reliable. It makes programming more of a challenge because as your software gets more features, there's more to remember and at the same time you're getting older. I wonder if there isn't some way to use ChatGPT to augment the aging mind dealing with more software complexity. It's very much in line with the idea I've had for a long time of putting all my writing in an AI database so I could then ask it to edit it down to book length. Or get a table of contents of what I think and then be able to read chapter-length sections on, say platforms, or how important prior art is, or what interop makes possible, and why everyone should give back when they take from open ecosystems. Each one of those topics has lots of associated stories over the years, but I probably couldn't find most of them, but an AI database certainly could. How to set that up? I've not figured that out so far. ",
            "created": "Sun, 03 Aug 2025 13:22:08 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "One of the more depressing things in having so much code that I can easily search, is the number of times I've rewritten the same code without remembering I had written it before. Yesterday I did it knowingly, I wanted a function that could tell me if one of a set of categories applies to a WordLand draft. So I could say \"don't list drafts with 'linkblog' as a category.\" It could have other categories, and there could be more than one category to exclude. I wanted to take the time to write perfect code for this one problem. Not dense, not particularly efficient. No matter how inefficient the code is, on today's hardware such a function couldn't use any time at all. It's fair to say I've solved this problem before, but there was always more to it. Here's the <a href=\"https://gist.github.com/scripting/d61110c1d74eb1162ebc726c09dd22f1\">function</a>. Now you know something about what I think is readable, understandable, respectful of a human more than I am of the computer. I know the computer would come up with much more dense and tricky code, but it doesn't have a mind, and I do. At times it can be relaxing, I magine, to not have a mind. And btw, in a couple of years this layer of code will be obsolete. We already are able to tell the machine how to do this in human language, it understands what we mean. One tiny little but hugely significant breakthrough made possible by ChatGPT and its cousins. ",
            "created": "Sun, 03 Aug 2025 13:26:05 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "A basic question I had about the <a href=\"https://help.openai.com/en/articles/11752874-chatgpt-agent\">ChatGPT agents</a> that I can answer now that I have the feature, is whether or not the code you create can run on a server, where you can give it a URL and make it an endpoint other networked software can call. Or if it could run periodically, say once every five minutes for a function that was creating an RSS feed anyone could subscribe to. The answer is no -- it can't do either of these things. I'm sure they could do it at a technical level, but they don't want to host applications. But now I may understand better why they want to make a web browser, I bet you will be able to call these agents from apps that run in the browser. And in their case, they might not even have to support JavaScript? Heh. A wholly different programming model? Maybe I'm overestimating how much they're biting off? I wonder if anyone at OpenAI reads this blog and might want to get me in a tighter loop, so I can be among the first to try new features like this, rather than, in this case, among the very last.",
            "created": "Sun, 03 Aug 2025 13:40:05 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Let's all be anonymous!",
            "created": "Sun, 03 Aug 2025 22:07:58 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "What if we all wore ICE-style masks as we went around doing our business.",
                    "created": "Sun, 03 Aug 2025 22:08:36 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "If a baseball player's uniform didn't have a number or name.",
                    "flInCalendar": true
                },
                {
                    "text": "Let's all be anonymous. It's very practical, we don't want to get doxxed either!",
                    "created": "Sun, 03 Aug 2025 22:08:42 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "A model illustrating the new baseball uniform style. ",
                    "created": "Sun, 03 Aug 2025 22:16:24 GMT",
                    "inlineImage": "https://imgs.scripting.com/2025/08/03/newBaseballUniform.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}