{
    "created": "2025-08-12T04:00:00.000Z",
    "flInCalendar": true,
    "name": "12",
    "path": "2025/08/12",
    "text": "August 12",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I had an hour to spare this morning so I decided for a third time to try to coax ChatGPT to play a role in a little drama I have in mind. I still want to use AI to power an RSS feed of news, customized to the interests of one person (me). My <a href=\"https://github.com/scripting/Scripting-News/issues/325#issuecomment-3179118706\">query</a> is this: \"Create a summary of the news, top 20 stories with an emphasis on these topics: how people are using AI, especially in education, blogging, US politics, science news, the NBA and MLB, with a slight emphasis on the Knicks and Mets. The results should be in JSON format, with each item including: A brief one sentence summary, publication date and a link to a source where the reader can get more info. My software will then create an RSS feed with this information..\" The response was basically: \"I'm sorry Dave.\" Groan. Here are <a href=\"https://github.com/scripting/Scripting-News/issues/325#issuecomment-3179036482\">the details</a>.",
            "created": "Tue, 12 Aug 2025 12:04:32 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2020/08/20/dave.png",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://daytona.scripting.com/search?q=%22Paul%20Boutin%22\">Paul Boutin</a> who I know from early Wired days offers some <a href=\"https://github.com/scripting/Scripting-News/issues/325#issuecomment-3179622599\">hope</a> that it can be gotten to work, with a bit more guesswork, trial and error and head scratching. I probably will keep coming back to this until I break through. Or maybe hook up with another developer who can back into the <a href=\"https://github.com/scripting/feedlandSocket\">websocket hose</a> coming out of FeedLand. It's a natural thing to hook up to AI systems. ",
            "created": "Tue, 12 Aug 2025 16:17:28 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Flower Power in 2025",
            "created": "Tue, 12 Aug 2025 19:22:38 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "You're going to think this is crazy, but maybe we should do what the hippie kids did in the 60s and 70s, giving flowers to the new cops in DC. Start off saying we don't blame you, we'll give you the benefit of the doubt, let's all be Americans and remember what that means.",
                    "created": "Tue, 12 Aug 2025 19:22:47 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "<a href=\"https://en.wikipedia.org/wiki/Flower_Power_(photograph)\">Flower power</a>.",
                    "created": "Tue, 12 Aug 2025 19:26:07 GMT",
                    "inlineImage": "https://imgs.scripting.com/2025/08/12/flowerPower.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}