{
    "created": "2025-08-19T04:00:00.000Z",
    "flInCalendar": true,
    "name": "19",
    "path": "2025/08/19",
    "text": "August 19",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I've been building around WordPress to create a social network based on RSS. I want to get out of being controlled by billionaire-owned sites. I have a feeling we may need a good <a href=\"https://daytona.scripting.com/search?q=%22billionaire-proof%22\">backup</a> given where we are now. ",
            "created": "Tue, 19 Aug 2025 15:42:45 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The purpose of the National Guard occupation of American cities is to control who votes. It doesn’t take much disruption to turn a blue district red. They just allocated <a href=\"https://www.americanimmigrationcouncil.org/fact-sheet/big-beautiful-bill-immigration-border-security/\">$170 billion</a> to fund ICE. They don't need all that money for border enforcement. It's meant to fund the transformation of the US into a Russian-style oligarchy. That's fear-inducing, but Ukraine has been fighting against becoming a  Russian-style oligarchy for decades, with ups and downs, but so far, considerable success. ",
            "created": "Tue, 19 Aug 2025 15:14:47 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I had an idea that <a href=\"https://globalvoices.org/\">Global Voices</a>, at least in concept, could help us prepare in the US for what's coming. I wrote: I'd love to have is an <b>idea-sharing network</b> where i could drop this idea in a box named \"helping the US stay free\" and have it find it's way to the right people in Ukraine who are saying \"if only I could talk to people in the US trying to figure this out, we know so much about this!\" That's the thing. How to connect know-how with the place that needs to know. To make our resistance more effective use the lessons learned in Ukraine over the last decades. ",
            "created": "Tue, 19 Aug 2025 15:23:57 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Mail-in ballots",
            "created": "Wed, 20 Aug 2025 01:22:30 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Mail-in ballots make it possible to avoid this on your way to vote.",
                    "created": "Wed, 20 Aug 2025 01:22:36 GMT",
                    "inlineImage": "https://imgs.scripting.com/2025/08/19/copWithMask.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}