{
    "created": "2025-08-23T04:00:00.000Z",
    "flInCalendar": true,
    "name": "23",
    "path": "2025/08/23",
    "text": "August 23",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I picked up my Android phone to record a voice memo. I had to dismiss a dialog that said the phone had updated overnight and asked if I wanted to see a list of changes. I thought, clicked No because I had an idea I wanted to record. Opened the voice app, hit record, couldn't remember the idea. Wanted to kill the message, but the UI had changed, so the Delete button that was there before wasn't there now. Great so now I have a 4-second recording in the queue that's nothing but frustration. There ought to be some basic rules of how software evolves. You can't take away a very basic function like this. And find a way not to get in the way of the user getting done what they use your product for. One of the most basic things is recording an idea. If you're lucky enough to be the app the user uses for that, don't screw with it. Same for listening to podcasts, and a few other things. That's about all I do with my phone. ",
            "created": "Sat, 23 Aug 2025 13:17:50 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Discourse as it exists today",
            "created": "Sat, 23 Aug 2025 14:19:03 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Just <a href=\"https://www.facebook.com/dave.winer.12/posts/pfbid0ov3Sh2dQEguUtGMbTDEMGKuWhmEBVJjcaJwuEdD7eJUjdBLU8bPVuqfRFWMC4UM6l?comment_id=1394095081663210\">posted</a> on a Facebook thread I unintentionally started.",
                    "created": "Sat, 23 Aug 2025 14:19:16 GMT",
                    "subs": [
                        {
                            "text": "I don't like public conversations where people judge other people and they feel compelled to explain themselves. I wasn't in any way intending on provoking a conversation like that here. So I'm going to delete the comments that have gone off in that direction, and please don't post any more. I don't mind you having that conversation, but do it somewhere else where I don't have to read it. Thanks. ",
                            "created": "Sat, 23 Aug 2025 14:19:32 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "Everywhere that's the only structure for discourse we've created. ",
                    "created": "Sat, 23 Aug 2025 14:19:39 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "We can do better. I have to create my own system to prove it, so much work, but worth it, I expect. ",
                    "created": "Sat, 23 Aug 2025 14:20:09 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}