{
    "created": "2025-08-25T04:00:00.000Z",
    "flInCalendar": true,
    "name": "25",
    "path": "2025/08/25",
    "text": "August 25",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I asked, yesterday, on various social media sites, for people's opinion on what the term \"on the web\" means. I'm going to compile the answers on a <a href=\"https://this.how/web/what.opml\">this.how page</a>, and then ask some follow-up questions. If you have an opinion, post a comment on <a href=\"https://bsky.app/profile/scripting.com/post/3lx6ww3lqx22q\">Bluesky</a>, <a href=\"https://mastodon.social/@davew/115087015889672419\">Mastodon</a>, <a href=\"https://www.threads.com/@davew/post/DNwtUao3FZL\">Threads</a> or <a href=\"https://x.com/davewiner/status/1959803988733288674\">Twitter</a>. ",
            "created": "Mon, 25 Aug 2025 13:11:13 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I've been exchanging emails and voicemails with <a href=\"https://profiles.wordpress.org/dpknauss/\">Dan Knauss</a>, a longtime WordPress developer and one of the hosts of WordCamp Canada which I am speaking at in October. Learning a lot about the community and culture. I wonder, have I ever been part of a community that's over 20 years old? I can't think of one off the top of my head. I have gotten this far without knowing much about the WordPress community, other than what I've heard via Matt and what I've been able to infer from that. I've known Matt since he was a teenage boy wonder in the tech industry working at CNET and then as an entrepreneur. I think my point of view is a new one, I don't bring much baggage with me. I am generally sympathetic with Matt, having been the leader of the blogging world when it started, and found it a pretty thankless place, a position I was happy to relinquish in 2003 when I went to academia. ",
            "created": "Mon, 25 Aug 2025 13:37:27 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "There's a fresh release of the docs for the <a href=\"https://developer.wordpress.com/docs/api/\">WordPress API</a> we use in WordLand. I actually liked that the docs were old and kind of dusty. It says that the engineering culture is to not mess around with things that developers have already built on. A lot of platforms break developers without much thought. I learned a long time ago that when you do that, you lose the interest of developers, understandably. ",
            "created": "Mon, 25 Aug 2025 13:35:18 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I've been following Mark Cuban's recent posts on Bluesky, coming up with constructive things successful entrepreneurs can do to help. I had a different idea. Apply for a fellowship at a university, away from where you live, maybe in a place you've always wanted to try. In your application say you bring your entrepreneurial experience, but you're leaving your money on the side. You're coming to the university with the idea of creating something collaboratively, bringing the entrepreneurial approach of startups to the mix of people you find among academics. You're there to learn from the teachers and the students, and help them understand what you do. Use your mind, experience, creativity, even your contacts, but leave the money at home. You can live in a nice house, drive a nice car, but eat in the places people in the university eat, go to the lectures, concerts, sporting events, in other words, go back to school with your new perspective, and make a <i>personal</i> contribution. It's much more satisfying than spending money is, I speak from experience. There's a different kind of success in the collaboration. Another way to test yourself and develop new perspectives and experience. I wrote about this a few years back in <a href=\"https://this.how/phoenix/\">Developing Better Developers</a>. ",
            "created": "Mon, 25 Aug 2025 13:49:19 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Trump's secret was comedy",
            "created": "Mon, 25 Aug 2025 21:24:00 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Trump is a comedian. He makes people laugh the way Joan Rivers or Don Rickles did. ",
                    "created": "Mon, 25 Aug 2025 21:37:26 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It's verbal slapstick, which is for some reason I don't understand immensely funny and entertaining.",
                    "created": "Mon, 25 Aug 2025 21:39:46 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Newsom is making us laugh by imitating Trump imitating Joan and Don. It's working. He must keep doing it, and he should evolve the schtick, he should make Trump match <i>him. </i>And where Trump is promoting depraved policies with his comedy, we can count on Newsom to stand up for the Constitution and the rule of law and all the progress we've made. ",
                    "created": "Mon, 25 Aug 2025 21:37:44 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "He can invite famous comedians on his podcast to play opposite him, sometimes the straight man, playing their SNL roles. So much potential. He's got the attention, don't throw it away. ",
                    "created": "Mon, 25 Aug 2025 21:38:37 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Politics was boring, it's not boring anymore. But there's no reason excitement and entertainment can't be good for us too! ;-)",
                    "created": "Mon, 25 Aug 2025 21:40:59 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Trump's secret is comedy and Newsom is stealing his thunder",
                    "created": "Mon, 25 Aug 2025 21:41:49 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}