{
    "created": "2025-08-26T04:00:00.000Z",
    "flInCalendar": true,
    "name": "26",
    "path": "2025/08/26",
    "text": "August 26",
    "type": "calendarDay",
    "subs": [
        {
            "text": "ChatGPT is the Lotus 1-2-3 of search. Google is Visicalc.",
            "created": "Tue, 26 Aug 2025 12:25:51 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The <a href=\"https://this.how/web/what.opml#1756211321000\">consensus</a> among the people who responded to my what does \"on the web\" mean query is this. Something is on the web if it has a URL you can use to view it in a web browser. That means, in 2025, that the URL begins with HTTP or HTTPS. Every \"page\" on a site must have a URL so they can be pointed to independently, otherwise known as deep linking. It's not enough to just have a home page that's on the web. So for example, an iPhone app isn't on the web just because it has an information page that is. ",
            "created": "Tue, 26 Aug 2025 12:26:12 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I'm working my way through Mr Robot, for the third time I think. If you want to know what I do, it's like what Elliot does, for about four hours pretty much every day. I used to work longer hours but I've found this amount of work is optimal. I make more mistakes after about 1PM. Anyway Mr Robot is a very good thing to watch for the times we live in. The technology is already a little outdated, but they thought of that, there are some scenes where they use old PCs from the 80s, with total respect. I like that. And the utilities he uses are pretty much the same ones I use these days. And the context of a world in technological meltdown, I think that's a very realistic scenario. I don't see how our networks can't avoid breaking down. And our health care system, which these days is pretty much the same thing. ",
            "created": "Tue, 26 Aug 2025 16:37:00 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I think perhaps I should have one day every week where I never link to anything. Just to provide a demo of what the web would be like without linking. Which is most of the sites that say they are part of the web. I think that's a lie we should stop tolerating. Or maybe I should just stop offsite linking for one day a week. That would be interesting wouldn't it. Or I could charge extra for the version with the links. (It's very rare that I charge anything to use any of my web work, but I <i>have</i> done that at times.)",
            "created": "Tue, 26 Aug 2025 16:40:59 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}