{
    "created": "2025-08-29T04:00:00.000Z",
    "flInCalendar": true,
    "name": "29",
    "path": "2025/08/29",
    "text": "August 29",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Thanks to <a href=\"https://ma.tt/2025/08/think-different/\">Matt Mullenweg</a> for the boost to <a href=\"http://scripting.com/2025/08/28/140604.html\">yesterday's post</a>. Glad to finally get the whole plan down in one place. Each piece of the puzzle took a while to come together in concept and then in implementation. I'm still working on all levels, last week I added a feature to \"FeedLand\" that makes it fit in better with the (new) timeline and WordPress (20+ years). It takes a while to change your thinking from WordPress being just another blogging CMS, to being an open platform that hosts <a href=\"http://scripting.com/2025/03/13/132830.html\">web writing</a> in a way that's open to competition. We're on the same page. It's still a competitive environment, but there are rules to competing, you don't cash in the interop that took patience and respect to develop and maintain. That's been the pity of the open web, lots of opportunists who are willing to stink up the ecosystem to squeeze a few more bucks for themselves from things <i>they didn't create.</i> Let your competitors in, and the users, if they have their heads screwed on right, will respect you for it. And even if they don't, still do it, because it's the right thing to do. That's why, at my age, just turned 70 earlier this year, I'm in a position to help revive the web, because I've made enough money, now it's time to make sure the gift that I got from the open web is available to future generations, no matter how greedy and selfish the <a href=\"https://daveverse.org/2025/08/29/the-wealthy-and-dominant-giants-of-tech/\">giants of tech</a> are. People may question Matt, and that's cool, as I said <a href=\"http://scripting.com/2025/08/28/140604.html#a142100\">yesterday</a>, but also remember he's stood up for your freedom, and that's also important. ",
            "created": "Fri, 29 Aug 2025 14:13:15 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2025/08/29/matt.png",
            "flInCalendar": true
        },
        {
            "text": "Bronx Science, in retrospect",
            "created": "Fri, 29 Aug 2025 15:13:08 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Story. I'm on a mail list for Berkman, where I spent two years at Harvard. Alumnae of all generations are on this list, and it's interesting.",
                    "created": "Fri, 29 Aug 2025 15:13:19 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Just got an email that someone was proud of having their picture taken with Susan Landau. I didn't know who she was, so I <a href=\"https://en.wikipedia.org/wiki/Susan_Landau\">looked her up</a>.",
                    "created": "Fri, 29 Aug 2025 15:13:32 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "She was born in 1954. And is a highly accomplished math and comp sci wizard, with cred at Harvard, Google, and now teaches at Tufts. ",
                    "created": "Fri, 29 Aug 2025 15:13:46 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Then I get to the place where they say she went to <a href=\"https://daytona.scripting.com/search?q=%22Bronx%20Science%22\">Bronx Science</a>. ",
                    "created": "Fri, 29 Aug 2025 15:14:02 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "That was my class, unless she, like I, skipped a grade. We both would have started in 1969 and graduated in 1972.",
                    "flInCalendar": true
                },
                {
                    "text": "I just wanted to write this up because I've noticed in the last few years, now that I live in the northeast, not far from the Bronx, I tend to come across more Science alums, and when I do, I generally find we have a lot to talk about, and share a New York style nerd sense of humor. ",
                    "created": "Fri, 29 Aug 2025 15:14:45 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "And as a math major myself, I conclude that their test was pretty good, it definitely selected a certain kind of mind, and the people it selected generally went on to do interesting, creative and useful things. ",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}