{
    "created": "2025-08-31T04:00:00.000Z",
    "flInCalendar": true,
    "name": "31",
    "path": "2025/08/31",
    "text": "August 31",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Today's song: <a href=\"https://www.youtube.com/watch?v=xnKOVPXhlnE\">Jambalaya on the Bayou</a>.",
            "created": "Sun, 31 Aug 2025 16:19:07 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "A <a href=\"https://shownotes.scripting.com/scripting/2025/08/31/aPodcastFromPostkatrinaNewOrleans.html\">podcast</a> from post-Katrina New Orleans, Dec 2005.",
            "created": "Sun, 31 Aug 2025 13:36:26 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "There are two quotes that make me laugh in the <a href=\"http://scripting.com/2025/08/28/140604.html\">Think Different</a> piece from last week. One of them is <a href=\"http://scripting.com/2025/08/28/140604.html#:~:text=They%20took%20paradise%20and%20blew%20big%20holes%20in%20it%20that%20users%20couldn't%20find%20a%20way%20out%20of.\">here</a>: \"They took paradise and..\" At first, if you're roughly my age, you read \"They took paradise and...\" and recognize it as the beginning of a famous line from Joni Mitchell's <a href=\"https://genius.com/Joni-mitchell-big-yellow-taxi-lyrics\">Big Yellow Taxi</a>. The other is a subtle touch of sarcasm, that I usually try not to indulge in, but let pass through as I edited this piece. See if you can <a href=\"http://scripting.com/2025/08/28/140604.html\">find</a> it. ",
            "created": "Sun, 31 Aug 2025 14:58:43 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Mea culpa: Unfortunately I misquoted Joni, she said \"paved\" not \"took.\" I'm going to leave the mistake in the piece. ",
            "created": "Sun, 31 Aug 2025 15:06:31 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "If you want to get an idea of how well WordPress has been bridged to ActivityPub, <a href=\"https://mastodon.social/@davew/115123672514675955\">check this out</a>. It's time for Mastodon to adopt these features across the board, so when writing in Masto you can use linking, style, titles, 10K character limit. Raise the bar. Let's bring more of the web into social media. Esp linking. ",
            "created": "Sun, 31 Aug 2025 13:46:20 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "If I were running Bluesky I’d have a quiet project to make a lite Bluesky server that peers with the mother ship, highly factored, in a Node package, open source of course. Get the <a href=\"https://en.wikipedia.org/wiki/Snake_oil\">snake oil</a> phase behind them, where they’re claiming to be decentralized, but aren’t.",
            "created": "Sun, 31 Aug 2025 12:41:05 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I like <a href=\"https://vivaldi.com/blog/keep-exploring/\">what Vivaldi says</a> about the web. It makes me want to do more to re-stock the web with interesting, inspiring <i>human</i> ideas. Maybe we could make our blogging software work better with their browser. All for the web, for humanity.",
            "created": "Sun, 31 Aug 2025 12:31:23 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Everything Trump is doing to steal the next election is proof of why <a href=\"https://en.wikipedia.org/wiki/Trump_v._Anderson\">Colorado</a> was right to deny him a place on the 2024 ballot. The Supremes gave him four years to prepare, to learn from his mistakes, now he'll do it from the top seat. It seems certain to work. ",
            "created": "Sun, 31 Aug 2025 12:30:13 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "One of life's lessons is if someone does something evil to you, and you decide to let it go, they are sure to do it again and again until you stop letting them do it.",
            "created": "Sun, 31 Aug 2025 12:30:00 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=zVadolr8eFs\">Short excerpt</a> of the ICE commercial which aired several times on <a href=\"https://en.wikipedia.org/wiki/WPIX\">WPIX</a> during yesterday's Mets game. There aren't that many drug trafficker, predatory gang members in the US for ICE to deport. And they completely misrepresent what a <a href=\"https://en.wikipedia.org/wiki/Sanctuary_city\">sanctuary city</a> is. The commercial is paid for by the taxpayers of the United States. Shameful. ",
            "created": "Sun, 31 Aug 2025 12:21:11 GMT",
            "type": "outline",
            "urlVideo": "https://www.youtube.com/watch?v=zVadolr8eFs",
            "flInCalendar": true
        },
        {
            "text": "The Mets have arrived",
            "created": "Sun, 31 Aug 2025 12:34:45 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "The great thing about MLB as compared to the NBA is that the teams play a game pretty much every day. And the Mets, my team since 1962, are really exciting right now, after a month of being lost. They have great rookie pitchers who are full of youthful enthusiasm and they kick ass on the mound. They have veterans who understand their job is to lead and they take that responsibility seriously, and they get on base, steal bases, and hit home runs. And they have workaday athletes who get on base when the team needs a hit. And the most expensive player ever in any sport who's finally playing as part of the team and not someone who misses the old team he used to play on. And they still have the most ridiculously dorky mascot, a caricature of a human with a baseball for a head, and his wife who also has a baseball for a head. Where do they come up with these ideas? Doesn't matter it's the M-E-T-S of New York town who we will now step right up to meet, and greet.",
                    "created": "Sun, 31 Aug 2025 12:34:51 GMT",
                    "image": "https://imgs.scripting.com/2023/08/01/mrmet.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}