{
    "text": "Different kinds of networks",
    "created": "Mon, 08 Apr 2024 02:45:05 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Somewhat-related notes about different kinds of networks, ActivityPub and RSS, various twitter-like systems, as the social web spreads out and tries out new ideas.",
            "created": "Mon, 08 Apr 2024 02:45:14 GMT",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "With ActivityPub you know who's following you and in RSS you don't. This may sound like a negative until you think about it from the user's standpoint: no spam, spyware, etc. Which is probably why Google didn't like RSS btw. ",
                    "created": "Sun, 07 Apr 2024 13:56:57 GMT",
                    "type": "outline",
                    "image": "https://imgs.scripting.com/2024/04/07/word.png",
                    "flInCalendar": true
                },
                {
                    "text": "It has been <a href=\"https://mastodon.social/@dusoft@fosstodon.org/112230502776773193\">pointed out</a> that some level of spying happens based on IP address, and I can testify to that, I get podcasts with ads for a local supermarket, kind of spooky but I guess ok. I can't recall ever receiving spam as a result of subscribing to a feed, and I never get messages from them when I unsub begging me to come back. So it isn't a huge problem in a real way at least for me, yet.",
                    "created": "Sun, 07 Apr 2024 15:25:22 GMT",
                    "type": "outline",
                    "flInCalendar": true
                },
                {
                    "text": "I block spammers. In twitter-like systems, like Mastodon, spam means you attached a post to my post that is in no way responsive to it. You're just trying to coast on the flow generated by other posts. I don't abide that. Have a nice day.",
                    "created": "Sun, 07 Apr 2024 13:59:21 GMT",
                    "type": "outline",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}