{
    "text": "How my workday flows",
    "created": "Sun, 07 Apr 2024 14:52:50 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "On Bluesky, Andrew Hickey <a href=\"https://bsky.app/profile/andrewhickey.bsky.social/post/3kpjm37omkj2b\">explains</a> how hard it is for him to focus while construction is going on at his house. I recognize the problem. I had major work done on the roof of my house last summer, and lost focus for a good two months, even though I had rented office space and at times an AirBnb to get away from the chaos. It wasn't until the work was over that I was able to start to get back into my flow. ",
            "created": "Sun, 07 Apr 2024 14:57:31 GMT",
            "flInCalendar": true
        },
        {
            "text": "In my work, I start pretty much at the same time every day, and I get a good five or six hours before it's time to do the next thing.  The first hour is warming up. Then I go to the notes I left the night before about where I'm going next. By hour two, I'm not quite at my highest rate but getting there, by hours 3-5 I get monster stuff done, if I'm in a good groove. Hour six is iffy. All the while I'm taking short breaks to check email, tweets, whatever. All of it asynchronous. Waiting for my attention to be available, for a short period.",
            "created": "Sun, 07 Apr 2024 14:53:05 GMT",
            "flInCalendar": true
        },
        {
            "text": "After 5-6 hours of this, I'm wiped out.",
            "created": "Sun, 07 Apr 2024 14:55:33 GMT",
            "flInCalendar": true
        },
        {
            "text": "I can handle small interruptions, like a package delivery.",
            "flInCalendar": true
        },
        {
            "text": "But if it involves the front of my brain for any real amount of time, if I have to shift my attention elsewhere, boom, it all drops out of my head. It doesn't take much of a shift in attention to lose the whole thing, and basically have to start over the next day.",
            "created": "Sun, 07 Apr 2024 14:55:47 GMT",
            "flInCalendar": true
        },
        {
            "text": "Try to imagine a professional tennis player. Do they talk about anything other than tennis during the game. Not with any focus. I'm sure of it. Their attention is fully on the sport. Same deal with intellectual achievement. If you're doing something that few other people do well, you're not only doing the complex things, and require multiple steps and a lot of detail, and memory, but you're sometimes inventing things that no one has done before. All the levels interact and affect each other. And you're doing a shitload of learning the whole time. Until you're burned out for the day that is. Or your deck gets shuffled. ;-)",
            "created": "Sun, 07 Apr 2024 14:56:27 GMT",
            "flInCalendar": true
        },
        {
            "text": "PS: People sending you emails saying how great your last thing was, they don't interfere at all. ;-)",
            "created": "Sun, 07 Apr 2024 14:59:24 GMT",
            "flInCalendar": true
        },
        {
            "text": "PPS: I wrote this post during one of my breaks. I won't edit it until the evening, when I do lite work that doesn't require much focus for any duration.",
            "created": "Sun, 07 Apr 2024 14:59:25 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}