{
    "text": "Music at The Colony",
    "created": "Tue, 19 Dec 2023 13:16:48 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I went to my first since-pandemic live show, at <a href=\"https://www.colonywoodstock.com/\">The Colony</a> in Woodstock. It's small venue that <a href=\"https://buildingsofnewengland.com/2022/09/11/the-colony-hotel-1927/\">goes way back</a>. It's basically a bar, with a stage and a small seating area which can hold about 50 people, seated at tables. Very comfortable space. Woodstock as you might imagine is a great place for live music, one of the reasons I moved here, the other being that it's a magnet for creative people, like a lot of the other places I've lived (New Orleans, Cambridge, Berkeley, Madison, Seattle, New York). But the pandemic squashed that, now maybe we're starting to come back. ",
            "created": "Tue, 19 Dec 2023 13:05:07 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The Levin Brothers band at The Colony, Sunday night. ",
            "created": "Tue, 19 Dec 2023 13:33:44 GMT",
            "inlineImage": "https://imgs.scripting.com/2023/12/19/levinBrothers.png",
            "flInCalendar": true
        },
        {
            "text": "I decided to risk it because a friend was playing last night, <a href=\"https://en.wikipedia.org/wiki/Tony_Levin\">Tony Levin</a>, who I know through his wife, Andi. When I first met Tony, at a birthday dinner last year, I thought he was a banker. He's tall, an impressive-looking person, like the people who rose to be an executive at companies like IBM in the 80s. Just shows how deceiving appearances can be. He's an accomplished musician, and a very sweet, quiet person. Probably about as far from an IBM exec or banker as you can get. Until Sunday I had never seen him perform.  ",
            "created": "Tue, 19 Dec 2023 13:29:05 GMT",
            "flInCalendar": true
        },
        {
            "text": "The group I was with arrived early, and Tony was at the front door, greeting people as we entered, and immediately he made a very different impression. He seemed soft, hippieish, relaxed, smiling. Later I realized this may have been the first time I'd seen him in his element. And the show, a four-piece jazz band, with his brother <a href=\"https://en.wikipedia.org/wiki/Pete_Levin\">Pete Levin</a> on piano, started off playing (to my uneducated ear) pretty plain improvisational jazz. But as the show went on, I could see that this music had been composed, and had all kinds of themes running through it. It seemed to me the music had been cultivated over many years? ",
            "created": "Tue, 19 Dec 2023 13:09:36 GMT",
            "flInCalendar": true
        },
        {
            "text": "The Levins and friends, are roughly my age. I imagined they had been playing together as long as I have been making software. And I felt certain what I was seeing here were two very talented brothers, who have been performing together their whole lives, and there was something I had been trying to understand about myself, how I feel about my art, almost fifty years after I started. There is an important difference in how I do it at 68 vs how I did it when I was 22. Exactly how it is different, I'm probably too close to it to really understand, but seeing what I imagined to being something similar in two people I kind of know, that was thought-provoking.",
            "created": "Tue, 19 Dec 2023 13:21:14 GMT",
            "flInCalendar": true
        },
        {
            "text": "To me, music is as software probably is to most people who use it. I love it, but I don't have much of an idea of how it's made. The last few years I've been reintroduced to it in a new way, <a href=\"http://scripting.com/2021/12/01/144612.html?title=theBeatlesWereAnInvention\">thanks</a> to <a href=\"http://scripting.com/2022/01/25/144824.html?title=imABeatleshead\">the</a> <a href=\"https://www.disneyplus.com/series/the-beatles-get-back/7DcWEeWVqrkE\">Get Back documentary</a>, which gave us a view into the Beatles' creative process, something I wish I could have seen when I was much younger. The Beatles were the music my generation grew up with, but I never really even understood that there was a difference between a John song and a Paul song. ",
            "created": "Tue, 19 Dec 2023 13:13:46 GMT",
            "flInCalendar": true
        },
        {
            "text": "The second great influence has been Andrew Hickey's <a href=\"https://500songs.com/\">500 songs</a> podcast. Now I have so many more stories to go with the music that my life was formed by. And I have a feeling that attending this event on Sunday will turn out to be a similar influence. ",
            "created": "Tue, 19 Dec 2023 13:31:19 GMT",
            "flInCalendar": true
        },
        {
            "text": "Now, what music should I go see next? :boom:",
            "created": "Tue, 19 Dec 2023 13:26:09 GMT",
            "flInCalendar": true
        },
        {
            "text": "PS: The concert was <a href=\"https://nippertown.com/2023/12/18/concert-review-the-levin-brothers-the-linda-12-16-2023/\">reviewed</a> by a professional.",
            "created": "Tue, 19 Dec 2023 17:37:10 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}