{
    "text": "Facebook offers AI participation a private group",
    "created": "Tue, 19 Dec 2023 17:08:01 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I have a private group on Facebook, and just got <a href=\"https://imgs.scripting.com/2023/12/19/metaAiInvite.png\">this notice</a>.",
            "created": "Tue, 19 Dec 2023 17:08:05 GMT",
            "subs": [
                {
                    "text": "\"Join the waitlist for Meta AI in your group! Meta AI can save you time and spark conversations by answering questions posted in your group, linking people to the posts they find most helpful, and more. Sign up your group to be the first to get access when it becomes available in your region.\"",
                    "created": "Tue, 19 Dec 2023 17:14:49 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "When I clicked on the <i>Learn More</i> button, this is what came back.",
            "created": "Tue, 19 Dec 2023 17:09:35 GMT",
            "subs": [
                {
                    "text": "A new way to get questions answered",
                    "created": "Tue, 19 Dec 2023 17:09:58 GMT",
                    "subs": [
                        {
                            "text": "Meta AI will comment on questions that haven't gotten an answer after one hour",
                            "created": "Tue, 19 Dec 2023 17:10:01 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "Keep members engaged",
                    "subs": [
                        {
                            "text": "Meta AI's answers will summarize earlier group discussions and share past posts from the group, helping to build community and spark discussion",
                            "created": "Tue, 19 Dec 2023 17:10:03 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "Stay in control",
                    "subs": [
                        {
                            "text": "You'll be able to delete any of Meta AI's comments, turn it off anytime, and customize it for your group",
                            "created": "Tue, 19 Dec 2023 17:10:04 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "A thought -- this kind of feature could not have been offered a year ago. The online world and journalism would never have accepted it from Facebook. But now they're called Meta and that seems to matter. ChatGPT has created a new opening. Not sure I'm going to like it, esp since this is mostly a one-way group. It's not for discussions. But it's the only group they offered to, and I love this stuff and want to know more.",
            "created": "Tue, 19 Dec 2023 17:10:11 GMT",
            "flInCalendar": true
        },
        {
            "text": "I haven't told the members of the group that I've requested this. Am I obligated to do that?  ",
            "created": "Tue, 19 Dec 2023 17:11:19 GMT",
            "flInCalendar": true
        },
        {
            "text": "Also in private groups where people reveal personal info (not the purpose of this group) I could see where this would be very controversial.",
            "created": "Tue, 19 Dec 2023 17:12:29 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}