{
    "text": "House of the Dragon spoilers",
    "created": "Fri, 18 Aug 2023 13:08:17 GMT",
    "type": "outline",
    "metaImage": "https://imgs.scripting.com/2023/08/18/houseOfDragon.png",
    "subs": [
        {
            "text": "Warning, spoilers below. You have been warned! :smile:",
            "created": "Fri, 18 Aug 2023 13:08:22 GMT",
            "flInCalendar": true
        },
        {
            "text": "I'm finally watching <a href=\"https://en.wikipedia.org/wiki/House_of_the_Dragon\">House of the Dragon</a> -- the prequel of Game of Thrones. In Succession terms, it's as if they made a show about how Cousin Greg became such an interesting character. Or Better Call Saul and Breaking Bad. ",
            "created": "Fri, 18 Aug 2023 13:08:41 GMT",
            "flInCalendar": true
        },
        {
            "text": "But: House of the Dragon is not well put together. I found it hard to get started, I rebelled against the new characters in the same location, Kings Landing, only 200 years earlier. Incongruous, distrurbing and invasive. Who are these people where's the Mother of Dragons and Cersei Lannister fighting for the throne. ",
            "created": "Fri, 18 Aug 2023 13:08:55 GMT",
            "flInCalendar": true
        },
        {
            "text": "I eventually did plow through all that, and just when I was getting into the characters, boooom, they're 10 years older and they're played by new actors that don't look much like they did earlier, esp the star. It's like switching the <a href=\"https://en.wikipedia.org/wiki/Dick_York\">Darrens</a> on <a href=\"https://en.wikipedia.org/wiki/Dick_Sargent\">Bewitched</a> only with a dozen or more characters all at the same time. Oy!",
            "created": "Fri, 18 Aug 2023 13:09:20 GMT",
            "flInCalendar": true
        },
        {
            "text": "And before you could begin to figure out who was who, they went straight into a Red Wedding type thing, and I have no idea who did what to who or why. ",
            "created": "Fri, 18 Aug 2023 13:09:38 GMT",
            "flInCalendar": true
        },
        {
            "text": "Anyway, I'm now on the second to last episode and back into it. It's finally feeling like Game of Thrones, and I hope they don't blow it. ",
            "created": "Fri, 18 Aug 2023 13:09:52 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}