{
    "text": "January 7",
    "created": "Tue, 07 Jan 2020 15:27:01 GMT",
    "name": "07",
    "subs": [
        {
            "text": "Good morning CSS &lt;span>s! :boom:",
            "created": "Tue, 07 Jan 2020 15:27:02 GMT",
            "type": "outline"
        },
        {
            "text": "In 1996, I <a href=\"http://scripting.com/davenet/1996/01/08/gottabearetha.html\">wrote a story</a> for Upside, a dream really. I dreamt I was the CEO of Apple. Before Steve came back. I would buy a song, and make a new computer and drop the rest, and focus on getting developers to ship new products. Not all that different from what Steve did when he came back, except the part about developers. :boom:",
            "created": "Tue, 07 Jan 2020 22:11:23 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://twitter.com/dsearls/status/1214591964059799552\">Doc Searls overheard</a>: \"The only question that matters in our time is how to have good effects that last longer than a tweet. Or a few seconds, whichever is longer.\" ",
            "created": "Tue, 07 Jan 2020 16:59:23 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/dsearls/status/1214591964059799552"
        },
        {
            "text": "Yesterday when I posted the instructions for <a href=\"http://scripting.com/2020/01/06/153015.html?title=sharingOnFacebook\">how to share</a> one of my blog posts to Facebook, in addition to trying to help a friend, I wanted to see for myself what the instructions would look like, in writing, without too much detail and without any steps omitted. The moral of the story is this. Come on Facebook, re-join the open web. Let's make it easy for people to do their writing outside Facebook for sharing inside. Let's make the wall of your silo so permeable that it ceases to be a silo. On Twitter I was asked why I keep beating this drum when it seems so unlikely that Facebook cares. I do it because I want to create a historic record, this has always been a big part of my blogging. I want to remember what sharing across silo walls was like in 2020. Maybe we'll look back and marvel that it was once this convoluted. Or maybe we'll marvel that it could be done at all. No one knows. But part of the reason I blog is to create a record. That's why I care so much about <a href=\"http://this.how/googleAndHttp/\">bigco's</a> trying to erase that record for selfish reasons. ",
            "created": "Tue, 07 Jan 2020 15:27:38 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/01/07/silo.png"
        },
        {
            "text": "I appreciate the shout out yesterday from <a href=\"https://evhead.com/autocompletely-5a29de03581b\">Evan Williams</a>, a former competitor who has gone on to make billions as co-founder of Twitter. It's nice that he still reads my blog, even though I have said some critical things about Medium, but all in the spirit of trying to make the web work better. Hope they have been received that way. I learned from reading his post that he has moved to New York. I think that's a good move, from San Francisco, which as a born-and-bred NYer has always seemed really small to me. Of course I've now moved to a much much smaller place. Anyway Ev if you're reading this, thanks for the kind words. :rocket:",
            "created": "Tue, 07 Jan 2020 15:32:06 GMT",
            "type": "outline"
        },
        {
            "text": "A lot of people I knew years ago who have gone on to great success are keeping their distance. I wish they wouldn't. I have had my own experience with success, having been part of a tech IPO in the 80s, and creating a bunch of the tech in the 90s and 00s that we take for granted today. Some people may think I'm poor. I am not. The stock and real estate markets have made it pretty easy to build on a modest nest egg. But our humanity is so much more important than the ways we measure success and influence. Ultimately, no matter how rich any of us are, we don't really attain the influence we feel we deserve. I've learned that from burying two parents, both of whom had very strong opinions. Today, years after they are gone, well, no one really cares about what they thought. I care about them as my parents, the people who raised and cared for me, and I care about their struggles and accomplishments insofar as it was central to who they were. But their influence now is nil, and sadly, it was probably pretty close to that when they were alive. That's reality. So if we enjoyed each others' company before, if we learned from each other in the past, your great success shouldn't matter, it shouldn't be a barrier to more fun. ",
            "created": "Tue, 07 Jan 2020 15:34:49 GMT",
            "type": "outline"
        },
        {
            "text": "The three stories",
            "created": "Tue, 07 Jan 2020 21:12:02 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Journalism knows three stories:",
                    "created": "Tue, 07 Jan 2020 21:12:14 GMT",
                    "flNumberedSubs": "true",
                    "subs": [
                        {
                            "text": "Both sides do it. ",
                            "created": "Tue, 07 Jan 2020 21:12:23 GMT"
                        },
                        {
                            "text": "It's a horse race.",
                            "created": "Tue, 07 Jan 2020 21:12:28 GMT"
                        },
                        {
                            "text": "Watergate 2.0.",
                            "created": "Tue, 07 Jan 2020 21:12:32 GMT"
                        }
                    ]
                }
            ]
        },
        {
            "text": "Imaginary press conference",
            "created": "Tue, 07 Jan 2020 18:07:04 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "REPORTER: What was the name of the contractor who was killed?",
                    "created": "Tue, 07 Jan 2020 18:07:21 GMT"
                },
                {
                    "text": "POMPEO: Schumann. I believe his friends called him <a href=\"https://youtu.be/1v4ZLwevXAI\">Old Shoe</a>. ",
                    "created": "Tue, 07 Jan 2020 18:07:34 GMT"
                }
            ]
        },
        {
            "text": "Charley Hustle and the Hall of Fame",
            "created": "Tue, 07 Jan 2020 15:57:14 GMT",
            "type": "outline",
            "description": "I refuse to give up the last bastion of intolerant assholery and political incorrectness -- sports. ",
            "subs": [
                {
                    "text": "<a href=\"https://www.nytimes.com/2020/01/04/sports/basketball/nets-kyrie-irving-shoulder-injury-surgery.html?emc=rss&partner=rss\">Kyrie Irving says</a> he may need shoulder surgery. As you may know I am <a href=\"http://scripting.com/2019/10/26/172803.html\">not a huge fan</a> of his. NY didn't need him. And it's obvious he didn't really want to play for the Nets or in NY, he wanted to play with <a href=\"https://en.wikipedia.org/wiki/Kevin_Durant\">KD</a>. And until KD his healed, Kyrie would prefer to sit on the sideline.",
                    "created": "Tue, 07 Jan 2020 15:55:51 GMT"
                },
                {
                    "text": "Reminds me that the other day I saw a comment about Pete Rose and how he belongs in the Hall of Fame, and I couldn't agree more. For so many reasons.",
                    "created": "Tue, 07 Jan 2020 16:22:21 GMT"
                },
                {
                    "text": " <a href=\"https://twitter.com/davewiner/status/1213879234185302017\">Statistically</a> it's a no-brainer. He has more hits, more singles, more at-bats, more games played, more outs than any other player in MLB history. He was <a href=\"https://en.wikipedia.org/wiki/Moneyball\">Moneyball</a> before there was Moneyball. ",
                    "created": "Tue, 07 Jan 2020 15:57:36 GMT"
                },
                {
                    "text": "And then there's <a href=\"https://www.todayifoundout.com/index.php/2011/11/whitey-ford-gave-pete-rose-his-charlie-hustle-nickname/\">Charlie Hustle</a>. Who else would dive <a href=\"http://scripting.com/images/2020/01/07/charlieHustle.png\">head-first</a> into second with no helmet? Is he even wearing gloves? Hard to tell. He should be in the Hall of Fame for this alone.",
                    "created": "Tue, 07 Jan 2020 16:37:54 GMT"
                },
                {
                    "text": "Charley Hustle. ",
                    "created": "Tue, 07 Jan 2020 15:58:41 GMT",
                    "inlineImage": "http://scripting.com/images/2020/01/07/charlieHustle.png"
                },
                {
                    "text": "So I said all that. And Alan Cooper who I know to otherwise be a reasonable person, <a href=\"https://twitter.com/MrAlanCooper/status/1213879931416936449\">asked</a> if I would pardon Jeffrey Epstein (enslaver and sexual violator of children) or Nixon (defiler of the Constitution) because I would forgive Pete Rose for betting on his own team. I responded to Cooper that there is an obvious difference between Pete Rose and the others, <a href=\"https://twitter.com/davewiner/status/1213926736641044485\">sports</a>. In sports we get to be judgmental assholes. You may hate Pete Rose, I love him. I loved him as a kid, because he taught me what passion was. It makes total sense to me that a man like that, too old to play the game himself, would indulge in gambling on the game, even when it was against the rules. ",
                    "created": "Tue, 07 Jan 2020 15:59:29 GMT"
                },
                {
                    "text": "We are too intolerant of different points of view on social networks. But I refuse to give up the last bastion of intolerant assholery and political incorrectness -- sports. So I'll keep on loving Pete Rose and you can keep hating him, and life goes on. No one is the worse for it. ",
                    "created": "Tue, 07 Jan 2020 16:02:07 GMT"
                },
                {
                    "text": "BTW -- in tech, where both Alan and I come from, we bet on our own teams all the time. It's the norm. We give people the means to bet themselves, hoping it'll motivate them. Even in sports there are performance incentives. Players are given bonuses if they achieve a specific stat, or their team makes the playoffs. I could see being pissed if a manager bet <i>against</i> their team, but betting in favor the team? I don't know, but I just don't see the problem. In any case, he's going to be in the HoF when he's dead. Let him enjoy the acceptance and love now. Inside that old body is Charlie Hustle, let him in, if not for him, for the kids he inspired.  ",
                    "created": "Tue, 07 Jan 2020 16:03:04 GMT"
                }
            ]
        }
    ]
}