{
    "text": "January 9",
    "created": "Thu, 09 Jan 2020 14:44:53 GMT",
    "name": "09",
    "subs": [
        {
            "text": "Followup on recent <a href=\"http://scripting.com/2020/01/08.html#a210946\">threads</a> re Facebook and journalism. Too much attention has been paid to Facebook the company, it's time to learn about the hundreds of millions of people who use Facebook, and what they're doing with it. ",
            "created": "Thu, 09 Jan 2020 14:44:54 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/01/09/subwaySeries.png"
        },
        {
            "text": "Let me tell you a little story. When I was 14, I went to high school in the Bronx and lived in Queens. It was a 1.5 hour trip each way. I had a few choices but they all magically took the same amount of time. One of the routes was to take the <a href=\"https://www.google.com/maps/dir/29-31+170th+St,+Flushing,+NY+11358/Main+St+%26+Roosevelt+Avenue,+Queens,+Queens+County,+NY/@40.7655943,-73.8268099,14z/data=!3m1!4b1!4m14!4m13!1m5!1m1!1s0x89c28a80780e9c3b:0xa8668e9b256999a4!2m2!1d-73.794882!2d40.769637!1m5!1m1!1s0x89c26011d8a8638d:0x3a7a296f0fbc67fc!2m2!1d-73.8301324!2d40.7595662!3e3\">Q16 bus to Main Street</a>, then the <a href=\"https://www.google.com/maps/dir/Main+St+%26+Roosevelt+Avenue,+Queens,+Queens+County,+NY/Grand+Central+Terminal,+East+42nd+Street,+New+York,+NY/@40.7522944,-73.9738374,12z/data=!3m1!4b1!4m14!4m13!1m5!1m1!1s0x89c26011d8a8638d:0x3a7a296f0fbc67fc!2m2!1d-73.8301324!2d40.7595662!1m5!1m1!1s0x89c25a21fb011c85:0x37513b7f1821408b!2m2!1d-73.9772294!2d40.7527262!3e3\">7 train to Grand Central</a>, and switch to the <a href=\"https://www.google.com/maps/dir/Grand+Central+Terminal,+East+42nd+Street,+New+York,+NY/The+Bronx+High+School+of+Science,+West+205th+Street,+The+Bronx,+NY/@40.8192919,-73.9978298,12z/data=!3m1!4b1!4m14!4m13!1m5!1m1!1s0x89c25a21fb011c85:0x37513b7f1821408b!2m2!1d-73.9772294!2d40.7527262!1m5!1m1!1s0x89c2f39fba19f047:0x456fa7ab9f9bae18!2m2!1d-73.890843!2d40.8783054!3e3\">4 train uptown</a>. The <a href=\"https://en.wikipedia.org/wiki/Bedford_Park_Boulevard%E2%80%93Lehman_College_station\">Bedford Park Blvd station</a> is two blocks from the school. One day on the train, I remember this really clearly, I was watching all the houses and apartment buildings we passed, first in Queens, then in the Bronx. Inside every window, I guessed, was a family, like my own, possibly. With their dramas and struggles, stories, victories, history, abuse, happiness, fear. I tried to imagine how each of them might live and realized in an overwhelming way that I could never begin to understand who they were. NYC, even then, was an ethnically and economically diverse place. Of course as we traveled through the city, the people on the train changed too. Very few of them were Bronx Science students. There were all kinds of people. Who knew what any of them were thinking. The point is this. The world is huge. To keep our sanity we have to simplify it, and to do that we have to ignore differences. The stories we tell ourselves little connection to reality. And so any general statement about a community as huge and diverse as Facebook is certain to miss the mark, widely. And most of what we read only focuses on the company, not the users. To have that appear as journalism is just wrong because journalism has a higher calling, to find out what's real, what's true, and then say that. ",
            "created": "Thu, 09 Jan 2020 14:48:35 GMT",
            "type": "outline"
        },
        {
            "text": "Candidate Bloomberg",
            "created": "Thu, 09 Jan 2020 16:03:06 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "A couple of pieces just floated through my river. ",
                    "created": "Thu, 09 Jan 2020 16:03:12 GMT",
                    "flNumberedSubs": "true",
                    "subs": [
                        {
                            "text": "Maybe <a href=\"http://nymag.com/intelligencer/2020/01/michael-bloomberg-president-democrats-beat-trump.html\">Nominating Bloomberg</a> for President Isn’t a Crazy Idea ",
                            "created": "Thu, 09 Jan 2020 16:05:19 GMT"
                        },
                        {
                            "text": "<a href=\"https://twitter.com/JoeTrippi/status/1215301568972632070\">Biden, Bloomberg</a> have largest leads against Trump in Michigan poll",
                            "created": "Thu, 09 Jan 2020 16:04:20 GMT"
                        }
                    ]
                },
                {
                    "text": "Amazing. And Bloomberg is just getting started.",
                    "created": "Thu, 09 Jan 2020 16:04:47 GMT"
                },
                {
                    "text": "What people (mostly journos) overlook with Bloomberg is that he has mastered two very important things for a presidential candidate:",
                    "created": "Thu, 09 Jan 2020 16:05:45 GMT",
                    "flNumberedSubs": "true",
                    "subs": [
                        {
                            "text": "Media",
                            "created": "Thu, 09 Jan 2020 16:06:01 GMT"
                        },
                        {
                            "text": "Tech",
                            "created": "Thu, 09 Jan 2020 16:06:05 GMT"
                        }
                    ]
                },
                {
                    "text": "Think about who he is and how he thinks and how he made his fortune. A presidential campaign is not that different from his news org. In a way it's as if Steve Jobs didn't die, left Apple again, was mayor of NYC for 12 years, took some time off, made some more money and then decided to run for president. Bloomberg has mastered media and tech as much as Jobs ever did. Very different styles, but similar levels of accomplishment. Do not underestimate Bloomberg. ",
                    "created": "Thu, 09 Jan 2020 16:06:07 GMT"
                },
                {
                    "text": "Nominating Bloomberg is not a crazy idea. He's a good fit for the country. A nice rebound from Trump.",
                    "created": "Thu, 09 Jan 2020 16:11:37 GMT"
                }
            ]
        }
    ]
}