{
    "text": "January 13",
    "created": "Mon, 13 Jan 2020 15:09:30 GMT",
    "name": "13",
    "subs": [
        {
            "text": "<a href=\"http://scripting.com/2020/01/13/docToDave.m4a\">DocCast 2.0</a>. This is an interesting medium because unlike other podcasts I've listened to Doc on, in this mode he gets to talk as long as he wants and can pause, and say whatever you want. Anyway I've decided I'm going to build a basketball court so when you visit we can meditate over shooting hoops. Anyway. Focus is the thing. Creating a groove. And making each other more powerful. That's going to be my next chapter. I do want to hear about your experience with Medium. We all have our own stories. I also want to tell you a story about Dave Bunnell. And why walking is the best.",
            "created": "Mon, 13 Jan 2020 21:29:35 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2020/01/13/docToDave.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "35128976",
            "image": "http://scripting.com/images/2020/01/13/jujyFruits.png"
        },
        {
            "text": "<a href=\"https://twitter.com/howroute/status/1215533606157852672\">Something</a> you believe the president has done well?”",
            "created": "Mon, 13 Jan 2020 22:26:04 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/howroute/status/1215533606157852672"
        },
        {
            "text": "A <a href=\"https://theweek.com/speedreads/889104/bernie-sanders-zero-apps-phone\">presidential candidate</a> who has no apps on his phone is not qualified to be president in 2021 and beyond. Apps are a frontier we crossed ten years ago.  Some people, including a <a href=\"https://twitter.com/davewiner/status/1216759643080359936\">columnist</a> at the NYT are impressed. That tells you something about who writes editorials at the Times too.",
            "created": "Mon, 13 Jan 2020 18:00:53 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/01/13/whitehouse.png"
        },
        {
            "text": "The next president should be creating a new social net for governance that involves all the voters who want to be involved. American citizens of voting age only. Doing real things to make America work better in every way, especially politically. I wrote this idea up in <a href=\"http://scripting.com/stories/2009/01/21/theWhiteHouseWebsite.html\">2009</a> as Obama took office and didn't follow through on the promise (imho) of his campaign. Sanders is a nice guy for sure, but he can't do the organizing we need to do (see <a href=\"#a180053\">above</a>). It's not something you can delegate. I think Bloomberg may get this, but I'm not sure. The politicians running for office are still very old school, and Sanders is the oldest of them.",
            "created": "Mon, 13 Jan 2020 18:06:24 GMT",
            "type": "outline"
        },
        {
            "text": "This was a <a href=\"https://www.nytimes.com/1992/02/05/us/bush-encounters-the-supermarket-amazed.html\">famous story</a> in 1992, that then President Bush didn't understand checkout scanners in supermarkets. The story was eventually <a href=\"https://apnews.com/61f29d10e27140b0b108d8e12b64b839\">debunked</a>, but the question was raised. How can someone govern if they don't understand how the people live. ",
            "created": "Mon, 13 Jan 2020 18:22:19 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/01/13/bushAndTheScanner.png"
        },
        {
            "text": "I tuned in a bit of CNN and NBC yesterday, they were obsessing about the president's offhand claim/lie that he thought there were four embassies being targeted by the assassinated Iranian general. By now they should know Trump-speak. When he says he \"thinks\" something that means he made it up. What's the point in wasting so much time on it, when everyone with a mind understands exactly what he was saying. ",
            "created": "Mon, 13 Jan 2020 16:23:02 GMT",
            "type": "outline"
        },
        {
            "text": "BTW, of course they didn't brief the <a href=\"https://en.wikipedia.org/wiki/Gang_of_Eight_(intelligence)\">Gang of Eight</a> on the <a href=\"https://talkingpointsmemo.com/news/imminent-threat-pompeo-soleimani-strike\">imminent threat</a> for the simple reason that there was nothing to brief them on. ",
            "created": "Mon, 13 Jan 2020 16:24:58 GMT",
            "type": "outline"
        },
        {
            "text": "I'm having the best time writing my blog these days. What makes the difference? You. I play my blog the way a musician plays the piano or guitar. I can hear what I play, but I'm most interested in what you hear. I'm not running <a href=\"https://www.facebook.com/\">McDonalds</a> or <a href=\"https://twitter.com/\">Starbucks</a>, I've got a little <a href=\"https://www.yelp.com/biz/the-mud-club-woodstock-2\">coffee shop</a> in town. I serve the drinks, tell stories, decorate the place, choose the <a href=\"http://scripting.com/davenet/1996/01/08/gottabearetha.html\">music</a> and lighting, bring in guests, all to pass the time in the most Dave-friendly way I can. I look for others doing their own things, so we can perform together. Our ideas influence, are tested and improved on. I'm back in the 90s and all of a sudden there's <a href=\"http://scripting.com/davenet/1995/01/13/ahugechunkofbluesky.html\">blue sky</a> in every direction. All because, imho, in <a href=\"http://scripting.com/2017/05/05/iWantMyOldBlogBack.html\">2017</a>, I decided to be myself again. :boom:",
            "created": "Mon, 13 Jan 2020 15:09:31 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/01/13/davesCoffee.png"
        }
    ]
}