{
    "text": "January 14",
    "created": "Tue, 14 Jan 2020 14:17:19 GMT",
    "name": "14",
    "subs": [
        {
            "text": "My <a href=\"http://scripting.com/2020/01/13/daveToDoc.m4a\">voicemailcast response</a> to Doc's last. Doc, stay with the Voice Memo app on your iPhone. It's like using the iPhone as your default camera. It fits in your pocket. It's probably there when you have an idea. Here's the link to <a href=\"http://scripting.com/2015/10/02/whatWouldAFatTweetLookLike.html\">fat tweets</a>. A pitch for Fargo the TV show. Doug Engelbart and the tech he carried with him. Shedding projects. David Bunnell's story. My grandmother. Creating a groove. ",
            "created": "Tue, 14 Jan 2020 16:34:43 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2020/01/13/daveToDoc.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "12049695",
            "image": "http://scripting.com/images/2020/01/14/skittles.png"
        },
        {
            "text": "There are 649 references today on Google for <a href=\"https://www.google.com/search?q=voicemailcast&rlz=1C5CHFA_enUS743US747&oq=voicemailcast&aqs=chrome..69i57j0l5j69i60l2.2384j0j3&sourceid=chrome&ie=UTF-8\">voicemailcast</a>. ",
            "created": "Tue, 14 Jan 2020 17:05:00 GMT",
            "type": "outline"
        },
        {
            "text": "The <a href=\"https://twitter.com/SaraMeagher1/status/1216461177288634370\">cutest video</a> ever. I love you are you stupid man?",
            "created": "Tue, 14 Jan 2020 20:33:43 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/SaraMeagher1/status/1216461177288634370"
        },
        {
            "text": "On Twitter all partisanship is fake, until further notice.",
            "created": "Tue, 14 Jan 2020 22:10:37 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1217208382781870081\">Poll</a>: How much will Trump's presidency cost us?",
            "created": "Tue, 14 Jan 2020 22:15:24 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1217208382781870081"
        },
        {
            "text": "With all the <a href=\"http://nymag.com/intelligencer/2020/01/sexist-myth-sanders-warren-female-president-spat.html\">michegas</a> <a href=\"https://www.thecut.com/2020/01/elizabeth-warren-bernie-sanders-sexism.html\">about</a> Bernie and Warren, here's what I think. My friends, they're both perfectly awful choices for president. Bernie is still living in the 60s. He has no ideas about the world as it exists today. <a href=\"https://twitter.com/davewiner/status/1217116064158560256\">Ask him</a>. Second, Warren is a Harvard professor. She's not of the people. She's more comfortable in the faculty lunchroom, making snide jokes about the little people. They're both incredibly terrible choices to run the country starting in 2021. Neither will get done what they say they will, that will require team-building skills which neither have, and compromise, which means you have to listen. Even Obama, a relatively young person, was totally unprepared to deal with foreign hacking of our election. There's a reason Bernie doesn't have any apps on his phone. I bet he doesn't know what an app is or what the capabilities of mobile devices are. If he did, I think he'd be screaming about it in the special way Bernie screams. :rocket:",
            "created": "Tue, 14 Jan 2020 15:39:23 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/06/21/ourDemocracyHasBeenHacked.png"
        },
        {
            "text": "If you look at it as if you were hiring someone to put the country back together after the Trump combination heart attack, stroke, colon cancer, head-on car crash, you'd want someone who has gotten shit done. Who would see the problems we have now as interesting challenges. Would know who wants what in exchange for the things we need to do. Someone with a rolodex of effective people. Neither Warren or Sanders have the ability to do any of that. Elect them and at best you get a Jimmy Carter. I don't mean weak, the way the Repubs do, I mean having no idea how to get things done in Washington, and therefore proceeding to get nothing done.",
            "created": "Tue, 14 Jan 2020 15:43:10 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://www.thechronicleherald.ca/opinion/editorial-cartoons/bruce-mackinnon-cartoon-jan-11-2020-396659/\">Bruce MacKinnon</a>, Chronicle Herald. ",
            "created": "Tue, 14 Jan 2020 16:29:58 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/01/14/canadianCorpse.png"
        },
        {
            "text": "On Sunday I wrote a <a href=\"http://scripting.com/2020/01/12/155518.html?title=theImpentetrableShorenstein\">piece</a> about the walls journalism puts up to keep the rest of us only speaking in the aggregate, to all our detriment imho. There are experts all over the place, who can provide fresh perspectives on the news, to engage people's minds, and set examples for creative approaches. I lamented that even though there is a former outstanding blogger running <a href=\"https://shorensteincenter.org/\">Shorenstein</a>, one of the leading university think tanks for journalism, the walls remain, and we're no closer to fulfilling the opportunities created in the early web. <a href=\"https://www.hks.harvard.edu/faculty/nicco-mele\">Nicco Mele</a>, the blogger I was referring to, is no longer in charge of Shorenstein. I was so-advised by two former colleagues. I'm <i>really</i> out of the loop, that's for sure. Anyway, the new director is <a href=\"https://www.hks.harvard.edu/faculty/nancy-gibbs?_ga=2.187920296.1420702108.1579015693-1352129629.1577806700\">Nancy Gibbs</a>. Best of luck and please let me know if there's any way I can help. :boom:",
            "created": "Tue, 14 Jan 2020 15:24:42 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/12/24/drummer.png"
        },
        {
            "text": "If you're working in Node.js and need to generate an RSS feed, you're welcome to use <a href=\"https://www.npmjs.com/package/daverss\">the package</a> I wrote for use in all my apps. Follow the new <a href=\"https://github.com/scripting/rss/blob/master/examples/app/test.js\">example app</a> to get an idea how it works. Just create two simple JavaScript objects, and call rss.buildRssFeed, and it creates a valid RSS 2.0 feed. It's really solid, burned in and tested in a wide variety of readers and aggregators. Variants of this code have been generating RSS feeds since (oy) 1999.  ",
            "created": "Tue, 14 Jan 2020 15:12:03 GMT",
            "type": "outline"
        },
        {
            "text": "I wonder if the <a href=\"https://help.github.com/en/github/managing-files-in-a-repository/navigating-code-on-github#jumping-to-the-definition-of-a-function-or-method\">new features</a> being added to GitHub allow you to point to a specific function, and have the link continue to work through new versions of the code? Something that I've always missed in GitHub. ",
            "created": "Tue, 14 Jan 2020 15:15:19 GMT",
            "type": "outline"
        },
        {
            "text": "I’ve known <a href=\"https://www.lessig.org/\">Lessig</a> for decades and always found him to be a thoughtful, kind, generous person. I read his <a href=\"https://twitter.com/lessig/status/1216746210226135041\">latest piece</a>, and look forward to a similarly thoughtful response from the NY Times.",
            "created": "Tue, 14 Jan 2020 14:17:20 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=IW1BFtWPbX4&feature=emb_logo\">Eric Clapton</a>, Carl Perkins and Johnny Cash in 1970. ",
            "created": "Tue, 14 Jan 2020 14:38:50 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/01/14/carlEricJohnny.png",
            "urlvideo": "https://www.youtube.com/watch?v=IW1BFtWPbX4"
        }
    ]
}