{
    "text": "January 15",
    "created": "Wed, 15 Jan 2020 15:42:37 GMT",
    "name": "15",
    "subs": [
        {
            "text": "<a href=\"http://scripting.com/2020/01/15/docSaysThis.m4a\">Doc's next cast</a>. The <a href=\"https://www.quora.com/What-is-the-meaning-of-the-quote-Live-as-if-you-were-to-die-tomorrow-Learn-as-if-you-were-to-live-forever\">quote</a> he was looking for is \"Live as if you were to die tomorrow. Learn as if you were to live forever.\" Maybe I don't get what you're trying to do Doc. But I actually think we're talking about the same thing. So glad Doc is using <a href=\"http://littleoutliner.com/\">LO2</a>. <a href=\"https://duckduckgo.com/?q=Esquire%27s+Dubious+Achievement+Awards&t=h_&ia=web\">Esquire's Doubious Achievement Awards</a>. Yes! Doc is going to watch Fargo. If this were in Iowa it would be a state park. (His house in Santa Barbara.) You can see 25 million people from the top of Mt Wilson. ",
            "created": "Wed, 15 Jan 2020 15:42:38 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2020/01/15/docSaysThis.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "13858758"
        },
        {
            "text": "One more thing for Doc re \"LO2\". If your outline is something you want to share with me and the other people listening to your podcasts, it's pretty easy. In the File menu choose <i>Get public link. </i>It will <a href=\"http://scripting.com/images/2020/01/15/confirmDialog.png\">confirm</a> that you want to make the outline public. Then a dialog will appear with a link to a page on instantoutliner.com. Copy that link, view it in the browser, send it to whoever you want to share it with. If you send it to me, I'll post it on \"Scripting News\". Now any changes you make in your outline will be reflected immediately for everyone who's watching it. ",
            "created": "Wed, 15 Jan 2020 21:26:57 GMT",
            "type": "outline"
        },
        {
            "text": "I created my own show notes outline and <a href=\"http://instantoutliner.com/f2\">shared it</a>.",
            "created": "Wed, 15 Jan 2020 21:41:42 GMT",
            "type": "outline"
        }
    ]
}