{
    "text": "January 16",
    "created": "Thu, 16 Jan 2020 15:12:53 GMT",
    "name": "16",
    "subs": [
        {
            "text": "Now is the time for me to <a href=\"http://scripting.com/2020/01/15/daveNeverSeemsToGetToThePoint.m4a\">respond via podcast</a> to Doc. 28 minutes which seems to be the default length of one of these voicemailcasts. I don't mind vacuous platitudes. <a href=\"https://en.wikipedia.org/wiki/Wilt_Chamberlain\">Wilt Chamberlain</a>. My first winter in the country. There was no 3-point play when WC was playing. Here's the <a href=\"https://www.youtube.com/watch?v=_HP9nKbzQDE\">epic</a> James Harden 3-pointer. If you shove the microphone into someone's face they don't have time to get nervous. Maps. I loved maps when I was a kid, and miss them terribly because of iPhones. Hillary's Emails and how the know-how of literally millions of people didn't influence journalism. Any one of these people could have helped, but journalism somehow didn't figure it out. Why can't universities do things? University is a 7-by-24 conference center. <a href=\"#a152833\">Fargo</a>. Alex Jones and Shorenstein. The <a href=\"http://scripting.com/stories/2009/10/21/bruceSterlingAtReboot.html\">speaker</a> whose name I couldn't remember was <a href=\"https://en.wikipedia.org/wiki/Bruce_Sterling\">Bruce Sterling</a>. Sorry man. More about creating a groove. First you become a habit, then you become an example, and that's a groove. ",
            "created": "Thu, 16 Jan 2020 18:47:17 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2020/01/15/daveNeverSeemsToGetToThePoint.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "47903472",
            "image": "http://scripting.com/images/2020/01/16/milkDuds.png"
        },
        {
            "text": "BTW no one or anything is going to \"awaken\" the Trump base. That's not how it works. When friends are in a bad marriage, one day you hear they're breaking up, you saw it coming but if you had tried to \"awaken\" them, they would have kicked your ass for butting in.",
            "created": "Thu, 16 Jan 2020 18:38:44 GMT",
            "type": "outline"
        },
        {
            "text": "There ought to be a TV show entitled <i>What's The Scam!? </i>Contestants compete to design a scam that explains mysterious Trump behavior. For example, <a href=\"https://thehill.com/homenews/administration/477465-mnuchin-aims-to-wait-until-end-of-election-to-disclose-secret-service\">Mnuchin gets to loot</a> the Secret Service in return for not disclosing Trump's travel expenses. ",
            "created": "Thu, 16 Jan 2020 17:59:49 GMT",
            "type": "tweet",
            "tweetId": "1217874591676293122",
            "tweetUserName": "davewiner"
        },
        {
            "text": "<a href=\"https://github.com/scripting/Scripting-News/issues/144\">Braintrust query</a>: I thought that if I run an app detached using <a href=\"https://en.wikipedia.org/wiki/Nohup\">nohup</a>, that if I quit the terminal window, or my desktop system powers off, the app would continue to run. It doesn't. ",
            "created": "Thu, 16 Jan 2020 17:43:14 GMT",
            "type": "outline"
        },
        {
            "text": "I should do a <i>this.how</i> piece on how to use my RSS feeds.",
            "created": "Thu, 16 Jan 2020 15:26:29 GMT",
            "type": "outline"
        },
        {
            "text": "I finished watching all three seasons of the <a href=\"https://en.wikipedia.org/wiki/Fargo_(TV_series)\">Fargo TV series</a>. I can't recommend it highly enough. I started to talk about it in the podcast coming out later today, but didn't finish the analogy. The hottest place in the US is always <a href=\"https://www.nps.gov/deva/learn/nature/weather-and-climate.htm\">Death Valley</a>. Every day. So when they report the highest temperature on weather reports, they're telling you the place with the second highest temperature because it would just get boring to always say Death Valley. I think that may be how it works for TV series. Fargo is the best, hands down, nothing compares. It's incredibly funny the way Quentin Taratino movies are, or Itchy and Scratchy, it's filled with Easter eggs, and until you watch it twice (at least) you won't see the connections between the characters. For example, in Season 1, two of the main characters were also in Season 2, but it took place 25 years earlier. And there are echoes of the Fargo movie. So I often say The Wire is the best. What I really mean is it's second best. Fargo is, until further notice, the best thing on TV.",
            "created": "Thu, 16 Jan 2020 15:28:33 GMT",
            "type": "outline"
        },
        {
            "text": "Every once in a while I put out a <a href=\"https://twitter.com/davewiner/status/1217803526564347904\">tweet</a> that gets forwarded a lot. This might be one of them. Trump has always reminded me of famous Jewish comedians. He borrows bits from <a href=\"https://en.wikipedia.org/wiki/Joan_Rivers\">Joan Rivers</a>, <a href=\"https://en.wikipedia.org/wiki/Don_Rickles\">Don Rickles</a> and this <a href=\"https://twitter.com/davewiner/status/1217803526564347904\">clip</a> reminds me of <a href=\"https://en.wikipedia.org/wiki/Rodney_Dangerfield\">Rodney Dangerfield</a>, with his self-deprecating humor. He talks about his hair as being magnificent. Everyone in the room must realize his hair is bizarre and ugly. He'd look a lot better if he just got a normal haircut for a bald 73-year-old guy. What does he see when he looks in the mirror? Does he still see the young Donald, or does he see the old fool the rest of us see. Of course the press helps sell his buffoonery. It's our way of laughing at ourselves. Look what the great USA has been reduced to. We used to see ourselves as <a href=\"https://en.wikipedia.org/wiki/Uncle_Sam\">Uncle Sam</a>, now we look in the mirror and see <a href=\"https://en.wikipedia.org/wiki/Bozo_the_Clown\">Bozo the Clown</a>. ",
            "created": "Thu, 16 Jan 2020 15:12:54 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1217803526564347904",
            "image": "http://scripting.com/images/2020/01/16/rodneyDangerfield.png"
        },
        {
            "text": "Serious weather headed our way.",
            "created": "Thu, 16 Jan 2020 21:49:26 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/01/16/weather.png"
        }
    ]
}