{
    "text": "January 19",
    "created": "Sun, 19 Jan 2020 13:48:43 GMT",
    "name": "19",
    "subs": [
        {
            "text": "We are at a terrible moment. Until Trump was impeached and the articles delivered to the Senate, there was always something more to do. But this is the end. Trump, post-acquittal, will be the monarch, in control of a hugely powerful military, economy and lest we forget it, the people who make up all this power, Americans. With new tricks the Chinese are working on, and no doubt Silicon Valley is as well, quietly, an American monarch will be all-powerful, able to reach into personal relationships in ways the Soviet Union couldn't dream of. If by some miracle the Senate votes to turn back, then we will have just barely dodged a bullet. But it seems more likely we're going straight into the fire without even trying to hit the brakes. ",
            "created": "Sun, 19 Jan 2020 14:48:44 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/01/19/kingTrump.png"
        },
        {
            "text": "A couple of worthwhile podcasts. Brian Lehrer's <a href=\"https://www.npr.org/podcasts/767280204/impeachment-a-daily-podcast\">Impeachment podcast</a> is the adult version of what you hear on cable news. It still focuses on process and horse races but it goes into more detail, Lehrer has a sharp mind, and is a great interviewer, so you learn more. And <a href=\"https://www.npr.org/podcasts/510289/planet-money\">Planet Money</a>, always good, has a <a href=\"https://www.npr.org/2020/01/15/796799769/episode-964-billboards\">piece</a> on privacy and billboards. I kept wanting to show them their own <a href=\"https://www.npr.org/sections/money/2018/10/09/655921710/chinas-social-credit-system\">story</a> about social credit in China. No longer are the concerns about privacy theoretical and narrow. It's definitely coming to the US. ",
            "created": "Sun, 19 Jan 2020 17:58:45 GMT",
            "type": "outline"
        },
        {
            "text": "I was corrected yesterday when I used the word exonerate in a <a href=\"https://twitter.com/davewiner/status/1218629254507876354\">tweet</a>. People felt acquit was the correct term for what happens if Trump is absolved (heh another verb) by the Senate. The <a href=\"http://thesaurus.land/?word=acquit\">thesaurus</a> thinks they're synonyms btw. Another verb would be <a href=\"https://en.wikipedia.org/wiki/Anointing\">annointed</a>, because no doubt a decree will follow from King Trump I (his new title, no sarcasm) requiring everyone to say nice things about him, or their charge cards won't work to buy groceries. See also <a href=\"https://en.wikipedia.org/wiki/Social_Credit_System\">social credit</a> an innovation of the Chinese.  ",
            "created": "Sun, 19 Jan 2020 14:07:51 GMT",
            "type": "outline"
        },
        {
            "text": "They're still arguing on Twitter about which word is correct. This is one of the saddest comments about what Americans were thinking about as our <a href=\"https://en.wikipedia.org/wiki/Reichstag_fire\">Reichstag</a> was burning. Is the correct verb burning? I think enflamed was closer. ",
            "created": "Sun, 19 Jan 2020 14:23:00 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/01/19/canadaDryDietGingerAle.png"
        },
        {
            "text": "How to defend against phishing. Stop and think if you’re granting access to your Google account, for example, and ask yourself how did I get here? If it wasn’t an operation you initiated, if you clicked on a link to get there, you probably don’t want to grant access.",
            "created": "Mon, 20 Jan 2020 00:14:25 GMT",
            "type": "outline"
        },
        {
            "text": "Maybe the solution to the paywall model is daily subscriptions. I pay $1 to read Vanity Fair for today only. Tomorrow it's the New Yorker. Use my browser wallet to pay.",
            "created": "Sun, 19 Jan 2020 18:13:46 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1218935339538055169"
        },
        {
            "text": "You'll know we're totally over the line when congressional Democrats are arrested and tried for impeaching the Trump. ",
            "created": "Sun, 19 Jan 2020 14:24:15 GMT",
            "type": "tweet",
            "tweetId": "1218902191106412544",
            "tweetUserName": "davewiner"
        },
        {
            "text": "Trump nearly started World War III. Clearly his <a href=\"https://slate.com/news-and-politics/2020/01/trump-tells-donors-soleimani-killed-saying-bad-things-about-country.html\">motives</a>, as with Ukraine, were entirely personal. ",
            "created": "Sun, 19 Jan 2020 14:45:06 GMT",
            "type": "tweet",
            "tweetId": "1218907600818966528",
            "tweetUserName": "davewiner"
        },
        {
            "text": "I'm re-thinking RSS now",
            "created": "Sun, 19 Jan 2020 14:58:34 GMT",
            "type": "outline",
            "description": "I wanted journalism and blogging to share a common format. That may not have been a good idea. ",
            "subs": [
                {
                    "text": "I've been having a big change of <a href=\"http://scripting.com/2020/01/18.html#a153502\">thinking</a> re RSS.",
                    "created": "Sun, 19 Jan 2020 14:58:46 GMT",
                    "image": "http://scripting.com/images/2020/01/18/anythingGoes.png"
                },
                {
                    "text": "In 1999, I compromised. I wanted journalism and blogging to share a common format. So I ditched the format I designed and accepted Netscape's adaptation in its place, to create unity. And it worked, it was the level playing field I had hoped for. Blogging and journalism both thrived in RSS. But at a price. ",
                    "created": "Sun, 19 Jan 2020 14:59:06 GMT"
                },
                {
                    "text": "The price was forcing blogs into the same format that news orgs used. Problem is, as we can see clearly with Twitter, that format isn't the only one. As Twitter discovered, its style of writing doesn't fit into the model of RSS. People were disappointed when they stopped publishing tweets via RSS. But this was the right thing to do, in hindsight. It wasn't working.",
                    "created": "Sun, 19 Jan 2020 15:10:49 GMT"
                },
                {
                    "text": "I turned a corner <a href=\"http://scripting.com/2017/05/05/iWantMyOldBlogBack.html\">in 2017</a> with my blog. I realized then, though I wouldn't have put it this way, the price I paid by merging formats with Netscape was too great. It forced blogging into the title-description-body model of journalism. But blog posts are more free-form, they don't all fit into that structure. ",
                    "created": "Sun, 19 Jan 2020 15:00:09 GMT"
                },
                {
                    "text": "So now I'm thinking about what I could have done differently in 1999, if I had evolved my syndication format the way my blog wanted to go, not the way RSS pushed us. ",
                    "created": "Sun, 19 Jan 2020 15:00:42 GMT"
                }
            ]
        }
    ]
}