{
    "text": "January 20",
    "created": "Mon, 20 Jan 2020 14:32:26 GMT",
    "name": "20",
    "subs": [
        {
            "text": "Play it out. The Repubs acquit Trump tomorrow. What then?",
            "created": "Mon, 20 Jan 2020 18:05:19 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://www.axios.com/trump-impeachment-trial-defense-brief-770ed7f5-e989-46b7-ab90-1bdbeaf813fc.html\">The Dershowitz Defense</a> is the only thing between Trump and eviction. Is it enough of a fig leaf for Romney, Collins and the other so-called Republican moderates?",
            "created": "Mon, 20 Jan 2020 18:14:02 GMT",
            "type": "outline"
        },
        {
            "text": "In the voting booth we can be true to ourselves even if we can't speak up in public. You have to be careful about creating resentment in your campaign. You might not be able to hear it until it's too late.",
            "created": "Mon, 20 Jan 2020 18:12:28 GMT",
            "type": "outline"
        },
        {
            "text": "What voters want is incredibly simple. They want to know you hear them. How to show? Say what they say the way they say it. Do that well and you've got the vote. ",
            "created": "Mon, 20 Jan 2020 17:16:46 GMT",
            "type": "tweet",
            "tweetId": "1219312076205805573",
            "tweetUserName": "davewiner"
        },
        {
            "text": "When Republicans say the Democrats have wanted to impeach Trump from the beginning, the truth is that the American voters elected a Democratic Congress specifically so they would impeach Trump. BTW, Trump lost the last election, in 2018, despite having a huge advantage due to gerrymandering. ",
            "created": "Mon, 20 Jan 2020 14:32:27 GMT",
            "type": "outline"
        },
        {
            "text": "There's a <a href=\"http://scripting.com/rssArchive/\">folder</a> on scripting.com called <a href=\"http://scripting.com/misc/rssArchive.zip\">rssArchive</a>. It has a lot of files in it going back to 2000. They all appear to be RSS files. I have no recollection how these files were created. But it might be interesting to have a look to see how my RSS support may have changed at times. ",
            "created": "Mon, 20 Jan 2020 21:38:44 GMT",
            "type": "outline"
        },
        {
            "text": "If you've ever been to dinner with me, you know that I almost always ask What's The Song? Well, I have an <a href=\"https://www.youtube.com/watch?v=3aeQ3DmKU7A\">answer</a> for that. ",
            "created": "Mon, 20 Jan 2020 17:13:34 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=3aeQ3DmKU7A"
        },
        {
            "text": "Imagine if <a href=\"https://twitter.com/andrewkimmel/status/1219243461695737857\">these guys</a> weren't white.",
            "created": "Mon, 20 Jan 2020 15:12:54 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/andrewkimmel/status/1219243461695737857"
        },
        {
            "text": "I still like Klobuchar",
            "created": "Mon, 20 Jan 2020 15:20:47 GMT",
            "type": "outline",
            "description": "She's young, but not too young. A liberal who presents as a moderate. Thoughtful. Doesn't shoot from the hip.",
            "subs": [
                {
                    "text": "I like that the <a href=\"https://www.nytimes.com/interactive/2020/01/19/opinion/amy-klobuchar-elizabeth-warren-nytimes-endorsement.html\">NYT endorsed</a> Amy Klobuchar. I think she is the right choice for president, as I've <a href=\"http://scripting.com/2018/11/23/205133.html\">written</a> here before. \"She's young, but not too young. A liberal who presents as a moderate. Thoughtful. Doesn't shoot from the hip.\"",
                    "created": "Mon, 20 Jan 2020 15:17:03 GMT",
                    "type": "outline"
                },
                {
                    "text": "They also endorsed Elizabeth Warren, who imho can't get in touch with most of America, for a lot of reasons. A video <a href=\"http://scripting.com/2019/11/05/212459.html\">convinced</a> me, she would not be a good president. A good senator, a good Secretary of the Treasury, a Harvard professor? Yes, but she writes off 1/2 the electorate in a snipe that lucky for her didn't get a lot of coverage. Also there's <a href=\"http://scripting.com/liveblog/users/davewiner/2016/02/18/1034.html\">this incident</a>, that proved that she's a Democrat as much as Biden, Clinton or Obama, and in not a good way. ",
                    "created": "Mon, 20 Jan 2020 15:21:06 GMT"
                },
                {
                    "text": "A president must be of all the people, not just women or men. We've seen what happens with a president who doesn't get that. Warren, while smart, and determined, is not a leader. Klobuchar still has a way to go before she's confident enough to lead. But she has a lot of things right, and she's tough and from the center of the country, and that's symbolic and important. ",
                    "created": "Mon, 20 Jan 2020 15:21:47 GMT"
                },
                {
                    "text": "And this is the year we need a woman president, to balance four years of having a very anti-woman president. But not someone who will undo the past by re-doing it in the inverse. We need all hands on deck to recover from the various crises that confront us. ",
                    "created": "Mon, 20 Jan 2020 15:22:15 GMT"
                },
                {
                    "text": "The NYT had a <a href=\"http://scripting.com/images/2020/01/20/nytOnSanders.png\">line about Sanders</a> that I knew but had forgotten. His plan for change is this: Magic! He has such a personality that everyone, once he's elected, will get behind him. It's what teenage boys dream of when they grow up to hit a walk-off home run to win the World Series. The acclaim, the wonder, such a good boy! Well it would never be like that for Bernie. He's got a character only a few people like, and many can't tolerate. I have always disliked him, think he's shallow and just plain wrong. What an awful president he'd make, something we'll never see because a cranky old Jewish socialist could not get elected president of the United States. He would be the <a href=\"https://en.wikipedia.org/wiki/George_McGovern\">McGovern</a> of 2020, but at least McGovern was a nice guy.",
                    "created": "Mon, 20 Jan 2020 15:22:18 GMT"
                }
            ]
        },
        {
            "text": "RSS re-think, day 2",
            "created": "Mon, 20 Jan 2020 14:42:19 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "When I <a href=\"http://scripting.com/2020/01/19/145834.html?title=imRethinkingRssNow\">speak</a> of the limits of RSS, I'm including the limits of reader apps. For many years I've been reluctant to do that. They mostly have conformed to rules set by the now-defunct Google Reader, and by norms set by previous readers, including my own. Unfortunately there's no way to change the behavior of readers. I've tried, in small ways, they just won't budge (or even listen). It's not just mishandling of untitled posts, posts can't be updated and there's more I don't want to go into now. ",
                    "created": "Mon, 20 Jan 2020 14:33:59 GMT",
                    "image": "http://scripting.com/images/2017/12/09/mlk.png"
                },
                {
                    "text": "The net-net is this: even if I could influence what the reader apps do, they would still be the wrong way to read my blog! ",
                    "created": "Mon, 20 Jan 2020 15:10:17 GMT"
                },
                {
                    "text": "If you are just reading my blog through \"RSS\", it would be really hard for you to understand this. Subscribe to the <a href=\"http://scripting.com/email/\">nightly email</a>. Read it from top to bottom once a day, instead of in fragments published through the day. This is the way my blog was always meant to be read. I think I was a bit too willing to compromise, in hindsight. ",
                    "created": "Mon, 20 Jan 2020 14:47:34 GMT"
                },
                {
                    "text": "Some correspondents have said RSS isn't wrong. Of course not. I love RSS. I played a big role in its creation. But it's 20-plus years later now, and the limits shouldn't be permanently insurmountable. A re-think is way past overdue. ",
                    "created": "Mon, 20 Jan 2020 14:43:40 GMT"
                },
                {
                    "text": "Keep using RSS. Bless you. I use it too. Look at my <a href=\"http://scripting.com/river/\">rivers</a>. I check them many times a day. But my blog is fresh and new and works the way I like, and I get to change anything about it I want, and if you read my blog through RSS you aren't getting it. That really bothers me. ",
                    "created": "Mon, 20 Jan 2020 14:44:02 GMT"
                },
                {
                    "text": "No more limits imposed by others or history. That was the <a href=\"http://scripting.com/2017/05/05/iWantMyOldBlogBack.html\">epiphany of 2017</a>, and it continues. ",
                    "created": "Mon, 20 Jan 2020 14:44:26 GMT"
                }
            ]
        }
    ]
}