{
    "text": "January 23",
    "created": "Thu, 23 Jan 2020 15:23:24 GMT",
    "name": "23",
    "subs": [
        {
            "text": "So far people seem to like the <a href=\"http://scripting.com/2020/01/22.html#a223957\">RSS version</a> of the nightly email. I don't like the way it looks in readers, and I want more features, but if that's where some people want to read my stuff, of course I'm happy. The important thing is that you read, listen and watch (and think of course). ",
            "created": "Thu, 23 Jan 2020 20:45:12 GMT",
            "type": "outline"
        },
        {
            "text": "An idea for a recurring sketch on a comedy show. Two actors, one plays a Trump supporter. Someone who speaks like an actual Trumper, who says things that echo what's said on Fox. Vary the gender, where they're from, etc. Each time, they discuss current events with an actor who is not a Trump supporter, serious, plays it straight. Now here's where it gets interesting. The Trump supporter realizes how wrong it was to support Trump. They do something to demonstrate that they see the light. Remember, they're actors. It's scripted. So the outcome is always the same. I would love to watch this, just for the release. Also it would really piss off Trump supporters, which is an extra bonus. Worth trying maybe on SNL or the Daily Show.",
            "created": "Thu, 23 Jan 2020 20:15:04 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/01/06/sayBlockchainAgain.png"
        },
        {
            "text": "I am watching the trial, hoping for a <a href=\"https://www.c-span.org/video/?c4717619/dale-bumpers-clinton-impeachment-part-2&fbclid=IwAR0zFsUIsQrOprfRMHjHBfG6r9RFJ-tI9fz6Gz8lrjrp07ijE_p34p4CwEg\">moment</a> like this. ",
            "created": "Thu, 23 Jan 2020 17:52:10 GMT",
            "type": "outline"
        },
        {
            "text": "A Trump unencumbered by the Constitution could make <a href=\"http://scripting.com/2020/01/22/104158.html?title=howYourIphoneWillEnslaveYou\">this</a> happen very quickly imho.",
            "created": "Thu, 23 Jan 2020 18:33:52 GMT",
            "type": "outline"
        },
        {
            "text": "I keep hearing that the outcome of The Trial of Trump is either acquit or remove, but there's a third possibility that we should prepare for. He might not be removed but is not acquitted either. Say the vote is 55 to convict vs 45 to acquit. He remains president, but a majority of the Senate voted to remove him. That's not a win. It shakes his tree. \"Keep fucking with us and maybe lose some more support in the Senate and maybe next time we have enough votes to put you out.\" Before you say that's not going to happen, it might. The Repubs are at least as savvy as we are (heh, we're babes in the woods compared to <a href=\"http://scripting.com/2019/08/04.html\">McConnell</a>), and know that some of their senators come from purple states like Maine, Colorado and Arizona. And there may be other senators who may want to vote to convict because they're more independent, like <a href=\"https://www.romney.senate.gov/\">Romney</a>, <a href=\"https://www.murkowski.senate.gov/\">Murkowski</a> and <a href=\"https://www.alexander.senate.gov/public/\">Alexander</a>, for example. The Repubs have room to help some of those senators without giving up ten more months of stacking the courts with unqualified Republicans. They might want to send a signal to El Presidenté that the US isn't <i>quite</i> his banana republic yet. It's not an impossible outcome. It's all negotiable in politics. ",
            "created": "Thu, 23 Jan 2020 17:18:46 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/01/23/stalinStamp.png"
        },
        {
            "text": "Hacker News <a href=\"https://news.ycombinator.com/item?id=22123197\">thread</a> on re-thinking RSS. Here's my <a href=\"https://news.ycombinator.com/item?id=22128274\">comment</a>. ",
            "created": "Thu, 23 Jan 2020 15:23:25 GMT",
            "type": "outline"
        },
        {
            "text": "BTW, to Wikipedia's mistaken claim that a columnist gave podcasting its name, look at this <a href=\"https://trends.google.com/trends/explore?date=2004-01-01%202006-01-01&geo=US&q=podcast\">Google Trends graph</a>. See where the graph <a href=\"http://scripting.com/images/2020/01/23/trendgraph.png\">starts to climb</a>? That's Sept 2004, when we gave what we were doing the name podcasting.",
            "created": "Thu, 23 Jan 2020 16:20:48 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://www.c-span.org/video/?c4848409/house-manager-adam-schiff-outlines-case-president-trump\">Opening presentation</a> at Trump's trial by Adam Schiff. ",
            "created": "Thu, 23 Jan 2020 16:28:28 GMT",
            "type": "outline"
        },
        {
            "text": "I just did a <a href=\"http://instantoutliner.com/fc\">transition</a> on instantoutliner.com. Complete rewrite of the server from top to bottom. I want to do a bunch of development work here, so I had to have a clean foundation. The previous version was last updated in 2016, so it was using the old technology. If you published an outline in the last few days, I might have lost the link to it. It shouldn't have happened but it did. And thanks again to Doc Searls for helping be the other side of <i>users and developers party together. </i>It's the formula that works.",
            "created": "Thu, 23 Jan 2020 17:07:16 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/01/23/chips.png"
        },
        {
            "text": "I hear that some Republican senators actually listened to the evidence against the president yesterday. ",
            "created": "Thu, 23 Jan 2020 16:31:45 GMT",
            "type": "outline"
        },
        {
            "text": "A third version of <a href=\"https://www.youtube.com/watch?v=q3oevndA9Sw\">For No One</a>, this time in the studio. ",
            "created": "Thu, 23 Jan 2020 19:01:19 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=q3oevndA9Sw"
        },
        {
            "text": "Dale Bumpers' speech",
            "created": "Thu, 23 Jan 2020 17:59:36 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Have you ever seen the closing argument in the Clinton impeachment by former Senator Dale Bumpers? If not it's a treat, you deserve it, it gives an idea of how trials bring out amazing things in people. ",
                    "created": "Thu, 23 Jan 2020 17:59:45 GMT"
                },
                {
                    "text": "<center><iframe width=512 height=330 src='https://www.c-span.org/video/standalone/?c4717619/dale-bumpers-clinton-impeachment-part-2' allowfullscreen='allowfullscreen' frameborder=0></iframe></center>",
                    "created": "Thu, 23 Jan 2020 18:00:49 GMT"
                },
                {
                    "text": "Having served jury duty twice, once through deliberations to a verdict, I was really impressed at how deep random people from all walks of life can go, given an opportunity to get immersed in understanding other humans. I sense a bit of that starting to happen here. It's not imho in any way a foregone conclusion what will come out of this.",
                    "created": "Thu, 23 Jan 2020 18:00:50 GMT"
                },
                {
                    "text": "It's also interesting, listening to the Bumpers speech, I hadn't listened to it in a a long time, how much this impeachment must hurt for Hillary Clinton. No one gave a shit about her in the Clinton impeachment, yet Bumpers does touch on it. And now she's a subject of controversy again because she dared to say what she actually thinks about Bernie Sanders.",
                    "created": "Thu, 23 Jan 2020 18:01:33 GMT"
                },
                {
                    "text": "A longtime friend Dan Conover isn't watching the impeachment, arguing basically there's no new information, but I think he's making a mistake. You could say the same about going to see a historic play like Hamilton. You know the outcome, so why pay the huge price in money and time to go see it. Because something other than information is transmitted.",
                    "created": "Thu, 23 Jan 2020 18:01:54 GMT"
                }
            ]
        }
    ]
}