{
    "text": "January 26",
    "created": "Sun, 26 Jan 2020 14:10:36 GMT",
    "name": "26",
    "subs": [
        {
            "text": "<a href=\"http://scripting.com/images/2020/01/26/theDevilInventedPodcasting.png\">When SNL said</a> the devil <a href=\"https://www.youtube.com/watch?v=3c5neBXQwf8&feature=emb_logo\">invented</a> podcasting. ",
            "created": "Sun, 26 Jan 2020 16:27:25 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=iLXEkM1cXNk\">Video demo</a> of a new \"LO2\" feature Doc asked for. Put the cursor in the middle of a paragraph. Press cmd-return to split the paragraph at the cursor position, creating two headlines. Simple, I do this manually all the time, with copy-paste which is more tedious and error-prone. Also going to do the inverse, cmd-backspace to merge two headlines.",
            "created": "Sun, 26 Jan 2020 16:17:46 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=iLXEkM1cXNk"
        },
        {
            "text": "Continue to be impressed with Brian Lehrer's Impeachment podcast. Highly recommend <a href=\"https://www.wnycstudios.org/podcasts/impeachment-daily-podcast/episodes/ben-wittes\">this episode</a> with Susan Hennessey and Benjamin Wittes of Lawfare. I was going to ask Lehrer to do a show on what the US will be like after a Trump acquittal. This episode is a good start. Before watching another hour of CNN or MSNBC, listen to this. You'll learn a lot more. ",
            "created": "Sun, 26 Jan 2020 19:15:06 GMT",
            "type": "outline"
        },
        {
            "text": "Amy Klobuchar is like a homemade <a href=\"https://duckduckgo.com/?q=chicken+pot+pie&t=h_&ia=recipes\">chicken pot pie</a> on a cold winter's day. I think after all the rock and roll the flyover folk would like a little peace and quiet. That's what I want. Not to have to worry about the US govt blowing the world up. ",
            "created": "Sun, 26 Jan 2020 17:23:35 GMT",
            "type": "outline"
        },
        {
            "text": "I never saw this <a href=\"https://www.youtube.com/watch?v=O3iBb1gvehI\">SNL parody</a> of a 2016 HRC commercial. ",
            "created": "Sun, 26 Jan 2020 15:35:39 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=O3iBb1gvehI"
        },
        {
            "text": "Journalism is <a href=\"https://twitter.com/lourdesgnavarro/status/1221116177017196546\">partisan</a> now. Can’t help it. Just being ethical and educated is now a partisan position. We weren’t raised to believe that, but it’s the new reality.",
            "created": "Sun, 26 Jan 2020 14:10:37 GMT",
            "type": "outline"
        },
        {
            "text": "The credulous boomer rube demo that backs Donald Trump: \"Donald Trump's the smart one, y'all elitists are dummmmb.\" There's more. This is the <a href=\"https://mobile.twitter.com/GSorensen/status/1221281796702318593\">new mode</a> for CNN. Laugh at the credulous boomer snowflakes that are wrecking the world. ",
            "created": "Sun, 26 Jan 2020 14:33:35 GMT",
            "type": "outline",
            "urltweet": "https://mobile.twitter.com/GSorensen/status/1221281796702318593"
        },
        {
            "text": "2018 mattered",
            "created": "Sun, 26 Jan 2020 14:57:49 GMT",
            "type": "outline",
            "description": "The voters wanted Trump impeached.",
            "subs": [
                {
                    "text": "A debating point I wish the Dems would use.",
                    "created": "Sun, 26 Jan 2020 14:57:52 GMT",
                    "flNumberedSubs": "true",
                    "subs": [
                        {
                            "text": "Repubs say Dems have been trying to impeach Trump since the beginning to overturn the 2016 election. ",
                            "created": "Sun, 26 Jan 2020 14:58:00 GMT"
                        },
                        {
                            "text": "Not quite. Trump lost the 2018 election. The voters wanted Trump impeached.",
                            "created": "Sun, 26 Jan 2020 14:58:07 GMT"
                        }
                    ]
                }
            ]
        },
        {
            "text": "Testing is needed",
            "created": "Sun, 26 Jan 2020 14:15:31 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Andy Sylvester <a href=\"http://scripting.com/2020/01/25/200702.html?title=andysVoicemailcast\">asked</a> yesterday what can he do to help. Here's one thing that really holds back progress. When I ship a new version of a piece of software, test it. If you don't know how to do software testing, <a href=\"https://duckduckgo.com/?q=how+to+test+software&t=h_&ia=web\">learn</a>. This is a real problem.",
                    "created": "Sun, 26 Jan 2020 14:11:03 GMT",
                    "type": "outline",
                    "image": "http://static.scripting.com/larryKing/images/2013/12/08/indianaJones.gif"
                },
                {
                    "text": "I'm going to release a new version of \"LO2\" soon, maybe today or tomorrow. I will have verified it works on my machine, for what I use it for. But there may be deal stoppers for others.",
                    "created": "Sun, 26 Jan 2020 14:16:15 GMT"
                },
                {
                    "text": "These days, even experienced developers write ridiculous bug reports. One guy sent me an email saying he couldn't unsub from the nightly email. No clue as to what he did, or what happened. He just said it didn't work and asked if I knew what the problem was. There's nothing I can do for him.",
                    "created": "Sun, 26 Jan 2020 14:16:27 GMT"
                },
                {
                    "text": "20-plus years ago we had a community that tested the new stuff, and gave us good bug reports. Then we could get some work done. One of them, <a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+terry+teague&t=h_&ia=web\">Terry Teague</a>, was a one-man QA department. He worked for Apple doing testing, but volunteered for community projects like ours, in his spare time, out of the goodness of his heart.",
                    "created": "Sun, 26 Jan 2020 14:17:01 GMT"
                },
                {
                    "text": "When I release the new version of LO2, I will write up the changes, here, on the blog, and provide a thread on GitHub for problem reports. I will be listening. ",
                    "created": "Sun, 26 Jan 2020 14:17:30 GMT"
                },
                {
                    "text": "See also: <a href=\"http://scripting.com/2015/05/01/professionalUsers.html\">Professional users</a>.",
                    "created": "Sun, 26 Jan 2020 14:20:03 GMT"
                }
            ]
        }
    ]
}