{
    "text": "January 28",
    "created": "Tue, 28 Jan 2020 14:16:59 GMT",
    "name": "28",
    "subs": [
        {
            "text": "<a href=\"https://twitter.com/BuzzFeedBen\">Ben Smith</a>, current editor-in-chief at Buzzfeed News is a good choice to be the new <a href=\"https://www.nytimes.com/2020/01/28/business/media/ben-smith-buzzfeed-new-york-times.html\">media columnist</a> at the NYT. He has more of a bloggers perspective imho. I like that when he got his hands on the famous <a href=\"https://en.wikipedia.org/wiki/Steele_dossier\">Steele dossier</a> he shared it with the world. He got in hot water with other professional news people, but why would a reporter feel compelled to keep such a hot news item private? Isn't their job to make important information public? I came to like him listening to this <a href=\"https://www.newyorker.com/podcast/political-scene/david-remnick-and-ben-smith-discuss-how-the-media-should-cover-the-president\">podcast</a> with David Remnick of the New Yorker. ",
            "created": "Tue, 28 Jan 2020 21:52:57 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://scroll.com/\">Scroll</a> is now <a href=\"https://twitter.com/tryscroll/status/1222157508124532737\">open</a> to the public. What do you think? ",
            "created": "Tue, 28 Jan 2020 21:45:23 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://twitter.com/alanhe/status/1221948034004799488\">Joni Ernst</a> has lost her mind. ",
            "created": "Tue, 28 Jan 2020 21:28:33 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/alanhe/status/1221948034004799488"
        },
        {
            "text": "<a href=\"https://github.com/scripting/Scripting-News/issues/147\">Braintrust query</a>: Is there an icon like this:  <img src=\"http://scripting.com/images/2020/01/28/fileIcon.png\"> in the current version of Font-Awesome? I'd like to upgrade to the latest, but without this or something very close to it, I can't. ",
            "created": "Tue, 28 Jan 2020 15:05:48 GMT",
            "type": "outline"
        },
        {
            "text": "In a recent version of <a href=\"https://github.com/electron/electron\">Electron</a>, they grabbed the Cmd-` keystroke to do something in the system. I was using it in an app that I depend on, use all day every day, I'm using it right now as I write this. Now Cmd-` doesn't work. The command is still in a menu, but it's way more work. Every time I have to do that work I project evil thoughts at the person who did this. I understand there's supposed to be a way around it, a way to grab the keystroke back from Electron, but I spent a half-day not getting it to work. I don't have that many half-days to throw away. Now I'm seeing the same thing happen in Chrome. Cmd-` -- they must think there are no <a href=\"https://en.wikipedia.org/wiki/Single-page_application\">SPAs</a> that use it, or they don't care. Now I wonder what the groundrules are. Are all my keystrokes up for grabs by the system vendor? I so vastly preferred the web when the bigco's didn't throw their weight around. When they were trying to coalesce to a standard (which they did) instead of shatter the platform into bits (which seems to be happening now). ",
            "created": "Tue, 28 Jan 2020 14:17:00 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/10/05/goldenGirlActionFigure.png"
        },
        {
            "text": "Loser 1 and Loser 2.",
            "created": "Tue, 28 Jan 2020 22:36:36 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/01/28/trumpAndNetanyahu.png"
        }
    ]
}