{
    "text": "January 31",
    "created": "Fri, 31 Jan 2020 15:19:29 GMT",
    "name": "31",
    "subs": [
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1223392025648738306\">Poll</a>: Who is leaking excerpts of the <a href=\"https://www.amazon.com/Room-Where-Happened-White-Memoir/dp/1982148039\">Bolton book</a>?",
            "created": "Sat, 01 Feb 2020 00:58:09 GMT",
            "type": "outline"
        },
        {
            "text": "Something kinda cool. Every Republican in the Senate cast the deciding vote on whether evidence and testimony would be permitted. Oh the ads will be very tasty. Assuming elections go ahead as planned.  ",
            "created": "Sat, 01 Feb 2020 01:03:45 GMT",
            "type": "outline"
        },
        {
            "text": "Tonight's <a href=\"https://www.youtube.com/watch?v=idzS4-B-hu4&feature=youtu.be\">impeachment fire</a>, maybe the last one.",
            "created": "Sat, 01 Feb 2020 00:55:01 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=idzS4-B-hu4"
        },
        {
            "text": "Epitaph for America",
            "created": "Fri, 31 Jan 2020 15:21:46 GMT",
            "type": "outline",
            "description": "This is just the beginning of the first chapter of what comes after America. ",
            "metaImage": "http://scripting.com/images/2020/01/31/kingTrump.png",
            "subs": [
                {
                    "text": "It looks like the impeachment trial will be over tonight. I've been trying to come to grips with how the Repubs, confronted with such clear evidence of the corruption of the president, could go along with it. ",
                    "created": "Fri, 31 Jan 2020 15:21:56 GMT",
                    "image": "http://scripting.com/images/2020/01/31/kingTrumpSmall.png"
                },
                {
                    "text": "I figured it had to be blackmail or a threat of force. We now have a Russian-style government, and this is a rite of passage. Like the confirmation or bar mitzvah of the new autocracy. ",
                    "created": "Fri, 31 Jan 2020 15:37:59 GMT"
                },
                {
                    "text": "In Russia, the parliament has no power. That seems to be the message bouncing around the twittersphere. Congress isn't going to do anything about this. What comes next? It's new territory for Americans, really for everyone, because the last time a great power went down this path was before the internet. ",
                    "created": "Fri, 31 Jan 2020 15:39:47 GMT"
                },
                {
                    "text": "I've been reading the epitaphs of the thinkers I respect most on Twitter, and there do seem to be some conclusions. <a href=\"https://twitter.com/Occamsreznor/status/1223223229734707201\">One tweet</a> in particular makes a tremendous amount of sense, a perspective that I had not considered. The terror isn't coming from the state or oligarchs, it's coming from the net. ",
                    "created": "Fri, 31 Jan 2020 15:25:02 GMT",
                    "subs": [
                        {
                            "text": "<i>Sadly, I think <a href=\"https://twitter.com/SenAlexander/status/1223093577145864194\">he</a> just wants to go home to TN and retire and not be harassed and doxed by Trump followers.  Profile in courage?  Obviously not, but Alexander has always seemed like a basically decent guy.  He’s just out of his depth in Trump’s America</i>",
                            "created": "Fri, 31 Jan 2020 15:29:28 GMT",
                            "urltweet": "https://twitter.com/Occamsreznor/status/1223223229734707201"
                        }
                    ]
                },
                {
                    "text": "He got some pushback over \"basically decent guy.\" It was deserved. We shouldn't judge people as if we're god. We don't know if he's decent. But the first part sounds right, it has to be the reason they didn't go forward with the trial. ",
                    "created": "Fri, 31 Jan 2020 15:29:56 GMT"
                },
                {
                    "text": "First, <a href=\"https://twitter.com/SenAlexander/status/1223093577145864194\">Alexander</a> went out of his way to say that the Dems made their case. He doesn't want anyone to blame them, though they will certainly get <a href=\"https://en.wikipedia.org/wiki/Doxing\">doxed</a> or worse. The Dems most definitely did make their case, because they were thorough and courageous, and because the president made little effort to cover his tracks. Only some of the people who work for him did. Turns out they didn't need to. Unlike with the Nixon White House, they won't be going on trial or to jail. ",
                    "created": "Fri, 31 Jan 2020 15:32:12 GMT"
                },
                {
                    "text": "If you were writing this as a Game of Thrones type novel, you'd be able tie up the loose-ends by saying that it was technology that did in the US. It wasn't nuclear weapons, or star wars, robots or chemical or biological weapons or even better encryption. No, it was the fact that everyone has the power to publish now, and we have these incredible machines for sharing private information, and we're just beginning to learn how to use them, and we have no idea how to contain them. ",
                    "created": "Fri, 31 Jan 2020 15:32:46 GMT"
                },
                {
                    "text": "This is just the beginning of the first chapter of what comes after America. ",
                    "created": "Fri, 31 Jan 2020 15:34:38 GMT"
                }
            ]
        },
        {
            "text": "Great coffee today",
            "created": "Fri, 31 Jan 2020 15:24:02 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "FWIW, I'm drinking some great coffee today. ",
                    "created": "Fri, 31 Jan 2020 15:24:07 GMT"
                },
                {
                    "text": "What I did differently, I looked carefully at the lines on the carafe. I had been underfilling it. This time I went to the line, exactly."
                },
                {
                    "text": "Also used fresh ground <a href=\"https://www.peets.com/italian-roast\">Peet's Italian Roast</a>. ",
                    "created": "Sat, 01 Feb 2020 01:06:44 GMT"
                },
                {
                    "text": "The water was straight out of the tap, no filters"
                }
            ]
        },
        {
            "text": "Morning coffee notes",
            "created": "Fri, 31 Jan 2020 17:11:04 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "<a href=\"https://github.com/scripting/Scripting-News/issues/149\">Braintrust query</a>: It appears that Electron changed how the core dialog routines work. Breakage galore, or so it seems. ",
                    "created": "Fri, 31 Jan 2020 17:40:35 GMT",
                    "type": "outline"
                },
                {
                    "text": "I was reviewing my blog for <a href=\"http://scripting.com/2016/11/\">November 2016</a>, to see how we dealt with the shock of Trump's election and I came across a video of the unbelievably fantastic DNC 2012 speech of <a href=\"http://scripting.com/2016/11/07/jenniferGranholmIn2012.html\">Jennifer Granholm</a>. We need more of this. ",
                    "created": "Fri, 31 Jan 2020 16:01:06 GMT",
                    "type": "outline"
                },
                {
                    "text": "Here's the <a href=\"http://scripting.com/2016/11/09/whyTrump.html\">piece</a> I wrote on election night in 2016. ",
                    "created": "Fri, 31 Jan 2020 16:23:10 GMT",
                    "type": "outline"
                },
                {
                    "text": "This is one of those days I've written four posts without publishing. They'll all go out at once, in various states of completion. But it's a day of ideas. I am depressed, in the same way I was the day after the 2016 election. But I had a good night's sleep, and the coffee is good. It's cold outside, but warm inside. I have all my material needs taken care of, and I have a powerful publishing platform, and the best tools, so I'm on-balance doing ok I guess. :boom: ",
                    "created": "Fri, 31 Jan 2020 15:26:55 GMT",
                    "type": "outline"
                },
                {
                    "text": "Old habits die hard. I'm using an outliner that has cmd-return implemented. Yet I just split a paragraph using the old select-copy-return-paste ritual. I didn't even have to think about it. It's programmed into my subconscious at the base of my spine. It takes no conscious effort to do the keys. ",
                    "created": "Fri, 31 Jan 2020 15:25:35 GMT",
                    "type": "outline"
                }
            ]
        }
    ]
}