{
    "text": "Rebooting the news",
    "created": "Mon, 04 Nov 2024 13:28:17 GMT",
    "type": "outline",
    "description": "After the election if we still have freedom of speech, we should reboot news.",
    "subs": [
        {
            "text": "My opinion: At this point it doesn’t matter what the NYT says. Either way they jumped the shark for the last time in this election.",
            "created": "Mon, 04 Nov 2024 13:28:28 GMT",
            "flInCalendar": true
        },
        {
            "text": "After the election if we still have freedom of speech, we should reboot news around the simple idea of news written by experts. They must know the basic rules of journalism, imho that's much easier than the know-nothing journalist posing as everyman with a <a href=\"https://pressthink.org/2010/11/the-view-from-nowhere-questions-and-answers/\">view from nowhere</a>, trying to understand what they're writing about. They don't have any basis to judge, we give them far too much power. That system is rooted in a time when publishing was expensive but that hasn't been true for thirty years. the old system has run its course. This election, either way, is a lesson in how that system, if it ever worked, doesn't work today. The next news system will be sources going direct to interested readers. ",
            "created": "Mon, 04 Nov 2024 13:28:43 GMT",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://en.wikipedia.org/wiki/Jay_Rosen\">Jay Rosen</a> and I did a <a href=\"https://rebootnews.wordpress.com/\">series of podcasts</a> in the early teens called Rebooting the News. This was the basic premise. I believe more than ever that this is the best path for news going forward. ",
            "created": "Mon, 04 Nov 2024 13:31:09 GMT",
            "flInCalendar": true
        },
        {
            "text": "They did this at Wired for a while. I was invited to be a columnist when my main qualification was that I was an accomplished software developer. I think that's the way to go. Experts sharing their perspectives on current events. ",
            "created": "Mon, 04 Nov 2024 13:32:15 GMT",
            "flInCalendar": true
        },
        {
            "text": "Before Twitter existed, in 2002, I proposed to the NYT that they offer a blog to anyone who is quoted in a NYT article. If they had done this, the NYT would be what Twitter became, and it wouldn't now be owned by Elon Musk, for the benefit of humanity. I wish they had done it. It would have been a real moneymaker. And good for the flow of knowledge.",
            "created": "Mon, 04 Nov 2024 13:39:30 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}