{
    "text": "August 3",
    "created": "Mon, 03 Aug 2020 13:42:12 GMT",
    "name": "03",
    "subs": [
        {
            "text": "Today's song: <a href=\"https://www.youtube.com/watch?v=vpD70wN6Aag\">Come and go blues</a>. ",
            "created": "Mon, 03 Aug 2020 20:25:27 GMT",
            "type": "outline"
        },
        {
            "text": "I just signed up for <a href=\"https://www.joinclubhouse.com/\">Clubhouse</a>. I'm @davew. ",
            "created": "Mon, 03 Aug 2020 19:18:22 GMT",
            "type": "outline"
        },
        {
            "text": "I’m watching <a href=\"https://en.wikipedia.org/wiki/Schitt%27s_Creek\">Schitt’s Creek</a>. It’s really funny. I was expecting it to be cringe-inducing, like <a href=\"https://en.wikipedia.org/wiki/Curb_Your_Enthusiasm\">Curb Your Enthusiasm</a>, but it's not. Starring <a href=\"https://en.wikipedia.org/wiki/Catherine_O%27Hara\">Catherine O'Hara</a> who was in <a href=\"https://en.wikipedia.org/wiki/Beetlejuice\">Beetlejuice</a>, one of the best movies ever made. And the <a href=\"https://en.wikipedia.org/wiki/Chris_Elliott\">geeky guy</a> from <a href=\"https://en.wikipedia.org/wiki/Groundhog_Day_(film)\">Groundhog Day</a>, the other best movie ever made. Schitt's Creek, like its name, is both profane and wholesome.",
            "created": "Mon, 03 Aug 2020 15:51:26 GMT",
            "type": "outline"
        },
        {
            "text": "John Naughton wrote a thought-provoking piece yesterday in his Memex 1.1 newsletter entitled <a href=\"https://johnnaughton.substack.com/p/sunday-2-august-2020\">Nostalgia isn't what it used to be</a>. (Note to the Substack devs, there should be permalinks on sub-sections of the web versions of newsletters, so I can point directly to the bit I'm talking about. Might as well put them in the email versions too.) Naughton says there was a point in human evolution when we decided we were above nature, and that's when things started to go wrong. It's why we think we can return to some kind of normal once the pandemic is over. But every time we try, we hit a wall resulting in more suffering and death. I've observed something similar. Our troubles with the environment started some time in the last 100 years when, through technology, we were able to make our presence felt on the ecosystem to the point where human activity could melt the polar icecaps. So in a destructive sense, we <i>are</i> above nature, but it's not a good survival strategy. In fact, we live infinitesmally short lifespans on an insignificant speck of dust in space, with <a href=\"http://scripting.com/davenet/1998/05/06/yoQuieroScriptingNews.html#3\">delusions</a> of grandeur, when the best we can achieve, which is pretty good, is friendship, love and to a small extent, self-awareness. We're going to get smart now, and learn to be the humble <a href=\"http://scripting.com/2016/05/31/1296.html\">mortals</a> that we are. Or we're going to cease to exist. In other words, it's time for the human race to grow up. ",
            "created": "Mon, 03 Aug 2020 13:44:27 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/08/15/chihuahua.png",
            "imageLink": "http://scripting.com/davenet/1998/05/06/yoQuieroScriptingNews.html"
        },
        {
            "text": "BTW, a note to Google's search engine. Sometimes I put phrases into my writing that I know don't exist anywhere else on the web, so I can search for them, and enjoy the feeling of being a validated innovator. Yesterday I <a href=\"http://scripting.com/2020/08/02.html#a160614\">used</a> a fictional name, \"Hello HooHaw.\" When I searched for it <a href=\"http://scripting.com/images/2020/08/03/pickyGoogle.png\">Google said</a> \"It looks like there aren't any great matches for your search.\" What!?? The hell you say. There's a <i>perfect</i> match, way more than great. Everyone's a critic. BTW, now there are <a href=\"https://www.google.com/search?q=%22Hello+HooHaw%22\">two instances</a> of the phrase on the web. I wonder if Google will still complain. ",
            "created": "Mon, 03 Aug 2020 14:10:09 GMT",
            "type": "outline"
        },
        {
            "text": "When will it be too much for the American people to bear? We are after all a country that was founded in <a href=\"https://en.wikipedia.org/wiki/American_Revolution\">revolution</a>. Did King George do anything even remotely comparable to what King Trump is doing to us? How long will we wait for someone else to fix it?",
            "created": "Mon, 03 Aug 2020 13:42:13 GMT",
            "type": "outline"
        }
    ]
}