{
    "text": "August 5",
    "created": "Wed, 05 Aug 2020 14:23:28 GMT",
    "name": "05",
    "subs": [
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1291092733822672897\">Poll</a>: How many online publications do you subscribe to? ",
            "created": "Wed, 05 Aug 2020 19:44:57 GMT",
            "type": "outline"
        },
        {
            "text": "With our civilization on the cusp of collapse, insider culture, career building, getting ahead -- the puffery and backslapping, it's so wrong. It's time to be smart. Ruffle feathers if you have to. Mean well. Get it done. ",
            "created": "Wed, 05 Aug 2020 21:19:39 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/08/05/nikeGratefulDeadSneaker.png",
            "imageLink": "https://news.nike.com/footwear/nike-sb-dunk-low-grateful-dead-official-images-and-release-date"
        },
        {
            "text": "Schools should not be open anywhere in the US. Any person with any math, science or medicine background knows this. Step back and think. Politics gets you to the wrong answer if it says to you that schools should open. Save lives. Be a good human.",
            "created": "Wed, 05 Aug 2020 15:58:32 GMT",
            "type": "outline"
        },
        {
            "text": "It doesn't surprise me that <a href=\"https://www.psychologytoday.com/us/blog/freedom-learn/202008/survey-reveals-children-coped-well-school-closure\">kids do well without school</a>. I remember as a kid being really pissed off that so much of my youth was wasted sitting in rooms with my hands foldeed, with my mind anywhere but in school, learning nothing and being bored out of my mind. I thought of school as very lazy, unimaginative, typical of adults. It wasn't really until grad school that school started working for me. ",
            "created": "Wed, 05 Aug 2020 14:23:29 GMT",
            "type": "outline"
        },
        {
            "text": "More about opening schools",
            "created": "Thu, 06 Aug 2020 00:36:14 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "They aren't correctly analyzing the opening school situation on CNN. A couple of points.",
                    "created": "Thu, 06 Aug 2020 00:36:27 GMT",
                    "flNumberedSubs": "true",
                    "subs": [
                        {
                            "text": "We understand very little about the virus. Can't be sure it doesn't affect young kids. It might just manifest itself in different not obvious ways, and it might not manifest immediately.",
                            "created": "Thu, 06 Aug 2020 00:36:36 GMT"
                        },
                        {
                            "text": "Opening schools is like opening a gas station in the middle of a wild fire. Adding more virus-infected people, regardless of their age, in an out of control virus fire is  as stupid as it gets.",
                            "created": "Thu, 06 Aug 2020 00:36:37 GMT"
                        }
                    ]
                },
                {
                    "text": "We have to think in terms of the big picture and not just short-term, and with humility. The president is an idiot, but that doesn't mean we have to be too.",
                    "created": "Thu, 06 Aug 2020 00:36:48 GMT"
                }
            ]
        },
        {
            "text": "Mussolini vs a second chance for America",
            "created": "Wed, 05 Aug 2020 16:20:02 GMT",
            "type": "outline",
            "description": "Anything that takes us off the path to getting rid of Trump decreases the odds that it'll happen.",
            "metaImage": "http://scripting.com/images/2020/08/05/mussolini.png",
            "subs": [
                {
                    "text": "Heard <a href=\"https://en.wikipedia.org/wiki/Jim_Clyburn\">Jim Clyburn</a> on the <a href=\"https://www.wnyc.org/shows/bbc-newshour\">BBC Newshour</a> on WNYC this morning. He correctly said we're desperately trying to get rid of <a href=\"https://www.politico.com/news/2020/08/02/clyburn-trump-mussolini-390500\">Mussolini</a> right now. That really is the only thing. Anything that takes us off the path to getting rid of Trump decreases the odds that it'll happen.",
                    "created": "Wed, 05 Aug 2020 16:21:07 GMT",
                    "image": "http://scripting.com/images/2020/08/05/clyburn.png"
                },
                {
                    "text": "We need the biggest landslide win this time. It needs to include every possible voter of either party. A black man decided that. And he was <i>right.</i>",
                    "created": "Wed, 05 Aug 2020 16:20:37 GMT"
                },
                {
                    "text": "You always have to think about what you're trying to accomplish in the big picture before going into the weeds. Do I really care, right now, whether X is the VP choice. Not if you want to live in a relatively free America, one that responds to the challenges we face, instead of trying to paper them over with <a href=\"https://www.axios.com/full-axios-hbo-interview-donald-trump-cd5a67e1-6ba1-46c8-bb3d-8717ab9f3cc5.html\">lies and bluster</a>.",
                    "created": "Wed, 05 Aug 2020 16:20:13 GMT"
                },
                {
                    "text": "It's <a href=\"https://en.wikipedia.org/wiki/Benito_Mussolini\">Mussolini</a> or a second chance for America. That's what's on the ballot in November. ",
                    "created": "Wed, 05 Aug 2020 21:06:33 GMT"
                }
            ]
        },
        {
            "text": "Clubhouse first impressions",
            "created": "Wed, 05 Aug 2020 14:48:24 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2020/08/05/chairlift.png",
            "description": "It's an audio-only public chatroom that's gaining traction with insider users. ",
            "subs": [
                {
                    "text": "<a href=\"https://www.joinclubhouse.com/\">Clubhouse</a> is a new social <a href=\"https://techcrunch.com/2020/04/18/clubhouse-app-chat-rooms/\">network</a> that seems to be gaining traction. I just got an invite a couple of days ago from <a href=\"https://twitter.com/hardaway\">Francine Hardaway</a>. I had been aware of it before, but wasn't very interested, but I should have been.",
                    "created": "Wed, 05 Aug 2020 14:49:41 GMT"
                },
                {
                    "text": "These are just some first-day newbie impressions.  ",
                    "created": "Wed, 05 Aug 2020 15:02:29 GMT"
                },
                {
                    "text": "I'm @davew on Clubhouse.",
                    "created": "Wed, 05 Aug 2020 15:36:41 GMT"
                },
                {
                    "text": "<b>First, what it is.</b>",
                    "created": "Wed, 05 Aug 2020 14:49:45 GMT",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "It's audio only. No text, no images, no video.",
                            "created": "Wed, 05 Aug 2020 14:49:55 GMT"
                        },
                        {
                            "text": "There are users. You can follow them, they can follow you. As far as I can tell it's very close to Twitter's model.",
                            "created": "Wed, 05 Aug 2020 14:49:59 GMT"
                        },
                        {
                            "text": "Any user can start a room. Other people can join the room. There's a stage. At least one person is on stage, the person who started the room by default is that person. Other people can be added by the founder, by dragging their icon onto the stage. ",
                            "created": "Wed, 05 Aug 2020 14:50:34 GMT"
                        },
                        {
                            "text": "People on stage can speak without permission. People in the audience can raise their hand, and must be granted permission to speak. I imagine that if someone becomes abusive, or veers off-topic, they can be silenced by the moderator.",
                            "created": "Wed, 05 Aug 2020 14:52:04 GMT"
                        },
                        {
                            "text": "When you're a newbie you have a special icon so people can see that you're new. It's a little emoji party hat. I've been told people are nice to newbies, that's part of the developing culture.",
                            "created": "Wed, 05 Aug 2020 14:51:53 GMT"
                        },
                        {
                            "text": "The rooms have a <i>Leave Quietly</i> button at the bottom. I like that. It suggests you don't have to give a big speech before you leave. ",
                            "created": "Wed, 05 Aug 2020 15:34:16 GMT"
                        }
                    ]
                },
                {
                    "text": "<b>What it's good at.</b>",
                    "created": "Wed, 05 Aug 2020 14:53:11 GMT",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "It may evolve into a celebrity performance platform as Instagram has.",
                            "created": "Wed, 05 Aug 2020 14:53:21 GMT"
                        },
                        {
                            "text": "It's a kind of podcast. I like it. I hope they support open feed formats, but I suspect this is a silo, not a publishing platform. Something to beware of. ",
                            "created": "Wed, 05 Aug 2020 14:53:57 GMT"
                        },
                        {
                            "text": "I was also bummed to realize I couldn't incorporate this into my apps. Again, VC-backed means this probably won't change. ",
                            "created": "Wed, 05 Aug 2020 14:54:30 GMT"
                        },
                        {
                            "text": "I tuned into a chat about <a href=\"https://duckduckgo.com/?q=cancel+culture&t=hk&ia=web\">cancel culture</a> at first. Does it exist or doesn't it. Heh. As a meta-thing, it clearly does exist. You're talking about it right now. I didn't say this of course, though I was tempted to. I was pretty sure if I did I would get grief. ",
                            "created": "Wed, 05 Aug 2020 14:54:50 GMT"
                        },
                        {
                            "text": "I saw a comment by longtime friend <a href=\"https://twitter.com/gartenberg\">Michael Gartenberg</a>. He has a good speaking voice. I love radio btw. It's my second favorite medium. I wanted to chime in, to expand on what he said, but I also saw he wasn't the founder of the channel, so I opted not to. He was talking about how these platforms might involve if rich individuals started them as pet projects. Thinking of Benioff and Time, or Omidyar and the Intercept, Bezos and the Washington Post. Also the cautionary tale of Thiel and Gawker. He basically bought Gawker with a lawsuit, then destroyed it. I wanted to add it could be even worse, there are a fair number of super-rich individuals who could buy Twitter. Its stock is cheap. How that would rock our world. ",
                            "created": "Wed, 05 Aug 2020 14:55:42 GMT",
                            "collapse": "true"
                        },
                        {
                            "text": "I had a one-to-one chat with Gartenberg, and it quickly started to feel private, even though it was public. It was liking riding in a chair lift with a friend while skiing. ",
                            "created": "Wed, 05 Aug 2020 15:29:53 GMT"
                        },
                        {
                            "text": "I could see it being used for running commentary on a sports event. Hosting a roundtable discussion about a popular TV show, as they do on Salon and Slate. Anywhere a podcast might include more than one person. Election returns on November 3.",
                            "created": "Wed, 05 Aug 2020 15:00:48 GMT"
                        },
                        {
                            "text": "Also why not use it in place of Zoom. I don't need to see your face while you talk. :-)",
                            "created": "Wed, 05 Aug 2020 15:23:49 GMT"
                        },
                        {
                            "text": "I noted that <a href=\"https://en.wikipedia.org/wiki/Tiffany_Haddish\">Tiffany Haddish</a> is already there. I followed her. There's a schedule of upcoming events. Think of it as a radio station or a venue like an arena or stadium. I'm sure that's what their business plan calls for. And also probably proprietary rights for all of it, i.e. no competition allowed unless you have good lawyers. ",
                            "created": "Wed, 05 Aug 2020 15:00:59 GMT"
                        },
                        {
                            "text": "Back in the 90s my friend Sylvia had a series of Cybersalons, open discussions for random Silicon Valley people. It was funny how every discussion very quickly became How Do Artists Get Paid? It was the only issue that ever got discussed. At \"BloggerCon\", a few years later, the question was How Do Bloggers Make Money? I'm guessing something similar will happen here. But what will the subject be. It'll have something to do with people getting paid, probably. ",
                            "created": "Wed, 05 Aug 2020 15:07:53 GMT"
                        }
                    ]
                },
                {
                    "text": "<b>Thread</b>",
                    "created": "Wed, 05 Aug 2020 15:14:36 GMT",
                    "subs": [
                        {
                            "text": "I started a <a href=\"https://twitter.com/davewiner/status/1291038682103926784\">thread</a> where you can correct any mistakes I've made, or important insights you'd like to share. ",
                            "created": "Wed, 05 Aug 2020 15:14:38 GMT"
                        }
                    ]
                },
                {
                    "text": "<b>Screen shots</b>",
                    "created": "Wed, 05 Aug 2020 15:11:32 GMT",
                    "subs": [
                        {
                            "text": "Event calendar.",
                            "created": "Wed, 05 Aug 2020 15:11:34 GMT",
                            "inlineImage": "http://scripting.com/images/2020/08/05/clubhouseCalendar.png"
                        },
                        {
                            "text": "A room I can join.",
                            "created": "Wed, 05 Aug 2020 15:13:27 GMT",
                            "inlineImage": "http://scripting.com/images/2020/08/05/aRoomICanJoin.png"
                        },
                        {
                            "text": "Inside a big room.",
                            "created": "Wed, 05 Aug 2020 15:12:19 GMT",
                            "inlineImage": "http://scripting.com/images/2020/08/05/aWellAttendedRoom.png"
                        }
                    ]
                }
            ]
        }
    ]
}