{
    "text": "August 6",
    "created": "Thu, 06 Aug 2020 12:41:02 GMT",
    "name": "06",
    "subs": [
        {
            "text": "Today's song: <a href=\"https://www.youtube.com/watch?v=Z9GbGO7CKdQ&t=105\">Putting out fire with gasoline</a>.",
            "created": "Thu, 06 Aug 2020 15:10:33 GMT",
            "type": "outline"
        },
        {
            "text": "They're <a href=\"https://www.buzzfeednews.com/article/mollyhensleyclancy/georgia-school-reopening-photo-paulding-county\">pouring gasoline</a> on the raging virus fire in Georgia. They don't get something simple. The virus is everywhere. You may think for some reason it isn't in that empty school building, but as soon as you fill it with people, it's there. It's the <a href=\"https://en.wikipedia.org/wiki/New_York_Stock_Exchange\">NYSE</a> of virus transmission. It's the <a href=\"https://en.wikipedia.org/wiki/Hartsfield%E2%80%93Jackson_Atlanta_International_Airport\">Atlanta airport</a> of virus transmission. The kids and adults are walking into the fire, doused in gasoline. What do they <i>think</i> will happen?",
            "created": "Thu, 06 Aug 2020 18:57:36 GMT",
            "type": "outline"
        },
        {
            "text": "I think I've finally run out of things to do with the new BingeWorthy. I have a lot of writing and communicating, but programming? Other than moving the prototype to a real server, not much. ",
            "created": "Thu, 06 Aug 2020 14:30:13 GMT",
            "type": "outline"
        },
        {
            "text": "Dead-head friends will want to know that there are now <a href=\"https://stockx.com/nike-sb-dunk-low-grateful-dead-bears-orange\">Dead sneakers</a> from Nike. ",
            "created": "Thu, 06 Aug 2020 12:41:03 GMT",
            "type": "outline"
        },
        {
            "text": "Money for news",
            "created": "Thu, 06 Aug 2020 13:36:17 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2020/08/06/money.png",
            "description": "If journalism is to thrive, the paywalls have to go away.",
            "subs": [
                {
                    "text": "I started a <a href=\"https://twitter.com/davewiner/status/1291061013228421120\">thread</a> on Twitter yesterday, one more time practically begging news orgs to support what I call an <a href=\"http://scripting.com/liveblog/users/davewiner/2016/02/12/1004.html\">EZ-Pass</a> <a href=\"http://scripting.com/2020/06/23/115824.html?title=anEzpassForNews\">for</a> <a href=\"http://scripting.com/2020/05/29.html#a135626\">News</a>. Not much response, but a handful of people did give the usual response, the one The Atlantic and other pubs want to hear -- that they bought a subscription to show support for journalism. I don't think this helps journalism, it just gives them false hope that there is a future for viewing journalism as a cause rather than as a product.",
                    "created": "Thu, 06 Aug 2020 13:36:23 GMT",
                    "image": "http://scripting.com/images/2012/10/01/tenTons.gif"
                },
                {
                    "text": "If journalism is to thrive, the paywalls have to go away. It's the wrong user experience. It forces a question at a time when it's virtually impossible that the user is going to buy your pitch. Much better to get the money incrementally, then when someone is spending too much per month, upsell them a subscription as a way of saving money. ",
                    "created": "Thu, 06 Aug 2020 13:41:02 GMT"
                },
                {
                    "text": "The TV world is about to discover this. All of a sudden there are a dozen different Netflix-alikes. There isn't room for that many, yet more are coming. They're going to have to find a way of doing an EZ-Pass.    ",
                    "created": "Thu, 06 Aug 2020 13:42:31 GMT"
                },
                {
                    "text": "I don't want to repeat all I've written here before. It's really very simple. If I use a freeway here in the eastern US, I don't have to stop to pay a toll. I just drive through what used to be a toll plaza, and an electronic device reads the chip behind my rear-view mirror, and deducts the money from my account, which it replenishes from credit card as-needed. Not that there was ever a whole lot of pain associated with this, but it's nice that the transaction is smoother now.",
                    "created": "Thu, 06 Aug 2020 13:43:16 GMT"
                },
                {
                    "text": "News needs that much more than freeways do. The world has changed, <a href=\"http://scripting.com/2020/06/16/133627.html?title=newsHasBeenUnbundled\">it isn't the 80s</a>, the last time it made sense to buy news via subscription, and even then you could buy a single issue without entering into a long-term relationship with the pub. It's all been unbundled, and like it or not news orgs are competing on a somewhat level playing field. The Atlantic is doing well, I observed, at making me want to read their articles. But not enough to get me to subscribe. As I've <a href=\"http://scripting.com/2020/06/16/133627.html?title=newsHasBeenUnbundled#a134117\">said</a> before, I don't even like subscribing to the pubs I subscribe to now, and I consider them essential, but I consider the deal they offer a ripoff, that some of that money should go to almost-equally deserving pubs. The Atlantic is good enough to serve as an example for why the paywall doesn't work for readers. And they were visionary enough and entrepreneurial enough to join up with <a href=\"http://scripting.com/2020/02/17/150159.html?title=whatIsScroll\">Scroll</a>. So in some part they buy into the paywall-less version of news. ",
                    "created": "Thu, 06 Aug 2020 13:44:55 GMT",
                    "image": "http://scripting.com/images/2019/09/25/blackLab.png"
                }
            ]
        },
        {
            "text": "How many pubs do you sub?",
            "created": "Thu, 06 Aug 2020 19:28:42 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "The result from <a href=\"https://twitter.com/davewiner/status/1291092733822672897\">yesterday's poll</a> matches what I thought it'd be.",
                    "created": "Thu, 06 Aug 2020 19:28:51 GMT"
                },
                {
                    "text": "",
                    "created": "Thu, 06 Aug 2020 19:29:15 GMT",
                    "inlineImage": "http://scripting.com/images/2020/08/06/pollresult.png"
                }
            ]
        }
    ]
}