{
    "text": "August 7",
    "created": "Fri, 07 Aug 2020 14:07:49 GMT",
    "name": "07",
    "subs": [
        {
            "text": "Today's song: <a href=\"https://www.youtube.com/watch?v=zKbmf-nNd58\">You and me and rain on the roof</a>. ",
            "created": "Fri, 07 Aug 2020 14:07:50 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=zKbmf-nNd58"
        },
        {
            "text": "If I were running an American news org, and I saw the CDC being silenced by the government, I'd boot up the equivalent of the CDC as part of my news org. I'd hire former CDC officials and tell them to say what they'd say if they were still at the CDC. Big budget. #savemylife",
            "created": "Fri, 07 Aug 2020 14:11:14 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/02/12/boldItalic.png"
        },
        {
            "text": "What Trump is doing now is worse than dropping an atomic bomb on the US. That's how it should be reported on the news. We need some scientists we trust to say that and to make that the news. Because it is the news.",
            "created": "Fri, 07 Aug 2020 16:01:45 GMT",
            "type": "outline"
        },
        {
            "text": "What can be gleaned from <a href=\"https://www.reuters.com/article/us-thailand-trump/not-thigh-land-thais-amused-at-trumps-slip-idUSKCN2531FW\">Thighland</a> and <a href=\"http://www.ethnictshirts.org/yo-semite/\">Yo Semite</a>. Trump has a reading comprehension level of a child.",
            "created": "Fri, 07 Aug 2020 16:38:09 GMT",
            "type": "outline"
        },
        {
            "text": "In hindsight it seems like this was an especially bad time for the UK to withdraw from the EU.",
            "created": "Fri, 07 Aug 2020 14:15:16 GMT",
            "type": "outline"
        },
        {
            "text": "Schools are like nursing homes",
            "created": "Fri, 07 Aug 2020 15:29:33 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2020/08/07/studentsInSchool.png",
            "description": "We've been so careful to keep kids from congregating, but that's over now. ",
            "subs": [
                {
                    "text": "Schools are like nursing homes only worse. ",
                    "created": "Fri, 07 Aug 2020 15:39:41 GMT"
                },
                {
                    "text": "A virus's success at infecting targets depends on a lot of factors, one of which is what it does to most of the people it infects. ",
                    "created": "Fri, 07 Aug 2020 15:40:01 GMT",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "If it quickly incapacitates or kills most of them, they can't easily pass on the infection, so the virus grows slowly. Ebola is like that. ",
                            "created": "Fri, 07 Aug 2020 15:44:44 GMT"
                        },
                        {
                            "text": "If it kills none of them, and if they don't get symptoms, they just go on as normal, everyone gets infected and the virus dies quickly, running out of targets to infect. ",
                            "created": "Fri, 07 Aug 2020 15:40:24 GMT"
                        },
                        {
                            "text": "The worst case is if the virus, when it infects people, has few symptoms at first, and a relatively long incubation, like Covid-19. The more people the infected people come in contact with, and the more transmissible the virus, the faster it grows. Schools, like nursing homes are excellent distribution centers. Indoors, crowded, proper distancing is impossible. Even worse if they're not wearing masks, as in <a href=\"https://www.cnn.com/2020/08/07/us/georgia-teen-photo-crowded-school-hallway-trnd/\">Georgia</a>.  ",
                            "created": "Fri, 07 Aug 2020 15:40:33 GMT"
                        }
                    ]
                },
                {
                    "text": "In nursing homes most of the targets are old or sick or they wouldn't be in a nursing home. The workers come and go so they distribute the virus out of the home. Just like a school. In a school <i>everyone</i> goes in and out. And a lot of them don't get sick, so they are excellent distributors, unlike the sick and old people in nursing homes who don't move around much. It's basically math at that point. The more infected people there are in the population, moving around, doing stuff, the more people will become infected. Not just their parents and grandparents as they say on CNN. Everyone. ",
                    "created": "Fri, 07 Aug 2020 15:40:58 GMT",
                    "image": "http://scripting.com/images/2020/08/07/tangerineChair.png"
                },
                {
                    "text": "We've been so careful to keep kids from congregating, but that's over now. We might as well open the bars 24 hours a day, because compared to what the schools will do, people should be allowed one final bender before this wall of virus hits us. ",
                    "created": "Fri, 07 Aug 2020 15:41:36 GMT"
                },
                {
                    "text": "People act as if it's only the people in schools and their immediate families that will be hurt by this. Wrong. Everyone will be hurt. Even going to the supermarket with the kind of density we'll be seeing will be chancy. ",
                    "created": "Fri, 07 Aug 2020 15:41:57 GMT"
                }
            ]
        }
    ]
}