{
    "text": "August 8",
    "created": "Sat, 08 Aug 2020 13:42:32 GMT",
    "name": "08",
    "subs": [
        {
            "text": "Today's album: <a href=\"https://en.wikipedia.org/wiki/Eat_a_Peach\">Eat A Peach</a>.",
            "created": "Sat, 08 Aug 2020 15:17:46 GMT",
            "type": "outline"
        },
        {
            "text": "BingeWorthy 2 tease #1: A friend wants to watch something. They ask friends on Twitter or Facebook what to watch. You put together a short list of your favorites, the ones you can think of right now. There's got to be a better way, right?",
            "created": "Sat, 08 Aug 2020 14:56:37 GMT",
            "type": "outline"
        },
        {
            "text": "I bought a <a href=\"https://en.wikipedia.org/wiki/Pixel_4a\">Pixel 4A</a> with Google Fi.",
            "created": "Sat, 08 Aug 2020 15:16:43 GMT",
            "type": "outline"
        },
        {
            "text": "As I work my way through <a href=\"http://scripting.com/2020/08/03.html#a155126\">Schitt's Creek</a>, the characters are so fascinating and <a href=\"https://en.wikipedia.org/wiki/Moira_Rose\">Moira</a> may be the most, since we already knew the actor as <a href=\"https://www.syfy.com/syfywire/in-defense-of-beetlejuices-delia-deetz\">Delia Deetz</a> from <a href=\"https://en.wikipedia.org/wiki/Beetlejuice\">Beetlejuice</a>. It's hard for me to see the connection between the two. In one episode in Season 2 Moira is frantically looking for nude pictures of herself taken when she was younger. For most of the show you think she wants to find them so she can take them down, but no. She wants to be sure they're there. She wants to still be, in some sense, the actress we knew as <a href=\"https://duckduckgo.com/?q=delia+deetz&t=hx&iax=images&ia=images\">Delia Deetz</a> (Moira plays a former actress, btw). Her advice to Stevie, a super cute young supporting character, is to make sure to take lots of pictures of herself now when she's young. No matter how you think you're not very beautiful, when you're older you will see all the beauty you can't see now. I'm about the same age as Catherine O'Hara, the actress, and I want to say I totally concur. I can't believe how beautiful I was when I was younger, but of course I didn't see it then. ",
            "created": "Sat, 08 Aug 2020 17:28:05 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/08/08/deliaDeetz.png",
            "imageLink": "https://en.wikipedia.org/wiki/Catherine_O%27Hara"
        },
        {
            "text": "Briefly discussed WordPress on Twitter last night with Don Park, long-time friend, ex-Automattician. I said I don't think they understand blogging there. Don says \"members of WordPress community and employees of the company behind it use blogs all the time.\" I don't doubt it, <a href=\"https://twitter.com/davewiner/status/1291868787218710528\">yet I could never do</a> what I do with Wordpress. Far too clumsy. Not fluid. Not designed for writers. Really weak product. ",
            "created": "Sat, 08 Aug 2020 15:18:14 GMT",
            "type": "outline"
        },
        {
            "text": "We spend trillions on defense, but it doesn’t protect us against Russia or the virus. Humbly suggest perhaps we‘re spending all that money preparing for the wrong war.",
            "created": "Sat, 08 Aug 2020 13:42:33 GMT",
            "type": "outline"
        },
        {
            "text": "Trump's failure of a \"border wall\" didn't protect the US from the <a href=\"https://www.vox.com/2020/8/8/21352396/coronavirus-texas-rio-grande-valley-starr-hidalgo-cameron\">virus</a> or <a href=\"https://www.theguardian.com/us-news/video/2020/aug/08/border-agents-discover-most-sophisticated-tunnel-in-us-history-in-arizona-video\">tunnels</a>. ",
            "created": "Sat, 08 Aug 2020 14:22:44 GMT",
            "type": "outline"
        },
        {
            "text": "I heard yesterday on <a href=\"http://scripting.com/2020/08/05/144824.html?title=clubhouseFirstImpressions\">Clubhouse</a> that people stopped reading my blog because of RSS. Interesting story. They <a href=\"http://scripting.com/2014/03/12/thingsAreCrystallizing.html\">subscribed</a> in \"Google Reader\". Stopped reading on the web. Then they shut down Google Reader. The people who were reading my blog and others before RSS, lost track of the feeds they were reading in Google Reader. There were other choices, but that doesn't change what happened. We are rebuilding slowly, because blogging is still a useful form of communication. My <a href=\"http://scripting.com/email/\">nightly email</a> is the best way to get it, probably always was, even in the heyday of RSS. I have to admit reading <i>this</i> blog in RSS was never a great deal. I write one day at a time. I'd prefer if you read what was on the home page at midnight. That's how I write it. Since RSS is something I'm well-known for developing, I didn't want to say this too loudly. But RSS should have had a chance to grow, and it didn't. So it got stuck. Not really a surprise.  ",
            "created": "Sat, 08 Aug 2020 14:40:16 GMT",
            "type": "outline",
            "image": "http://static.scripting.com/larryKing/images/2014/03/12/stooges.gif"
        },
        {
            "text": "BTW one of the problems with the name <a href=\"http://scripting.com/2020/08/05/144824.html?title=clubhouseFirstImpressions\">Clubhouse</a> is that it's impossible to remember. At least for me. I never had a problem like that with Twitter, and I was a very early user, as I am with CH. ",
            "created": "Sat, 08 Aug 2020 14:43:28 GMT",
            "type": "outline"
        }
    ]
}