{
    "text": "August 13",
    "created": "Thu, 13 Aug 2020 16:43:05 GMT",
    "name": "13",
    "subs": [
        {
            "text": "Journalism has a simple question to answer. Are we just going to report on what Trump is doing or should we organize the opposition. They're coming for the election. The First Amendment is next. Succinctly, do you fight when you've lost, or when you still have a chance.",
            "created": "Thu, 13 Aug 2020 20:44:19 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://twitter.com/TedMielczarek/status/1293581030947946497\">A fair analysis</a> of the reason Mozilla is adrift. Lots of extra agendas, often personal, no discipline, professional values, or much connection with users. The mean petty behavior has no place at a customer driven venture, which Mozilla never has been. Another takeaway is that the fire hose of money was wasted hiring more than a few employees to maintain Firefox. The rest of the windfall could have been invested in the <a href=\"https://www.google.com/search?q=s%26p+500+chart&rlz=1C5CHFA_enUS743US747&oq=S%26P+500+chart&aqs=chrome.0.0l8.4565j1j9&sourceid=chrome&ie=UTF-8\">S&P 500</a>, held in reserve for the next Firefox, a product developed speculatively by entrepreneurial devs, <i>after</i> it achieves market acceptance. They would have billions in reserve by now. Could have changed the way we develop networks, with emphasis on user choice and no reliance on lock-in. But no one was ever empowered at Mozilla to do that, or no one had the vision or ability to lead.",
            "created": "Thu, 13 Aug 2020 19:01:46 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/08/14/mrIncognito.png"
        },
        {
            "text": "I'm in a funny place with the new BingeWorthy. Started testing it with people who had rated a lot of programs in the previous version, and am getting good feedback. I'm getting ideas other than bug fixes and tweaks, and today I implemented one of them, which leads me to believe I should just make the new version public and start rolling out the new stuff here on the blog in public view. If you want to see what the new feature is, here's a <a href=\"https://www.youtube.com/watch?v=KZKjlklkU6Q\">video</a>. Have a look. And if you think you could contribute to the testing, send me a message on Twitter. ",
            "created": "Thu, 13 Aug 2020 16:43:18 GMT",
            "type": "outline"
        },
        {
            "text": "I got a late start today. Oy. ",
            "created": "Thu, 13 Aug 2020 16:43:06 GMT",
            "type": "outline"
        }
    ]
}