{
    "text": "August 17",
    "created": "Mon, 17 Aug 2020 12:56:13 GMT",
    "name": "17",
    "subs": [
        {
            "text": "Moms, we need your <a href=\"https://www.nytimes.com/2020/08/17/us/politics/democrats-women-voters-anger.html\">rage</a>. ",
            "created": "Mon, 17 Aug 2020 13:09:59 GMT",
            "type": "outline"
        },
        {
            "text": "Then there was <a href=\"https://twitter.com/timjhogan/status/1295350118573641731\">the time</a> the DNC did the Macarena! Wow. ",
            "created": "Mon, 17 Aug 2020 16:04:57 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/timjhogan/status/1295350118573641731"
        },
        {
            "text": "I wonder <s>how many</s> if any people who read my blog are on <a href=\"https://www.joinclubhouse.com/\">Clubhouse</a>? If there are enough, it might be interesting to have an evening session sometime, when I explain what's behind one of the pieces I wrote, and possibly answer questions or (friendly) challenges. ",
            "created": "Mon, 17 Aug 2020 14:18:44 GMT",
            "type": "outline"
        },
        {
            "text": "People who give the TV series <a href=\"http://bingeworthy.io/tv/?id=https%3A%2F%2Fwww.metacritic.com%2Ftv%2Ffargo\">Fargo</a> the highest rating are people who really know a good thing. It is one of a small number of shows in the running for Best Series Ever. The others: <a href=\"http://bingeworthy.io/tv/?id=https%3A%2F%2Fwww.metacritic.com%2Ftv%2Fthe-wire\">The Wire</a> (of course) and a show that a lot of people gave up on too soon: <a href=\"http://bingeworthy.io/tv/?id=https%3A%2F%2Fwww.metacritic.com%2Ftv%2Fmr-robot\">Mr Robot</a>. Its final season was beautiful heart-filling drama. As much a vision as a story. ",
            "created": "Mon, 17 Aug 2020 14:10:24 GMT",
            "type": "outline"
        },
        {
            "text": "Online discourse pro tip. Begin every reply with one of these: 1. Thank you. 2. I'm sorry. 3. You're right. It puts the reader in a receptive mode. You can always find something to be thankful or sorry for, or something the other person said that you agree with. :boom:",
            "created": "Mon, 17 Aug 2020 13:50:52 GMT",
            "type": "outline"
        },
        {
            "text": "Interesting how people see the post office as a business to be killed because it didn’t return a profit, yet we gave $500 billion to private for-profit companies, no strings attached, and got nothing in return, all secret.",
            "created": "Mon, 17 Aug 2020 13:09:14 GMT",
            "type": "outline"
        },
        {
            "text": "I'm going to watch the DNC tonight, but there's great competition in the <a href=\"https://www.sportingnews.com/us/nba/news/nba-playoffs-bracket-2020-standings-projections/15owf3ue8ug1g12k7jgud2b11w\">NBA playoffs</a>, which starts today with games between the Nets and Raptors and then the Sixers and Celtics, two hot matchups. The basketball has been <i>excellent</i> this summer. I'm also super excited that <a href=\"https://sportsnaut.com/2020/08/nba-world-reacts-to-carmelo-anthonys-dagger-to-send-blazers-to-playoffs/\">Melo made</a> the playoffs, finally, with his new team the Portland Trailblazers. I knew all along that he wasn't a team leader, like LeBron or even Damian Lillard who leads the Blazers. He's a Hall of Fame supporting player. Too bad he was miscast all those years as an alpha. Imagine if Melo had been LeBron's sidekick. At least he's found a happy home now, and that's cool.",
            "created": "Mon, 17 Aug 2020 13:12:35 GMT",
            "type": "outline"
        },
        {
            "text": "My friend <a href=\"https://www.instagram.com/p/CD5GjdnjdbS/\">Libbey</a> makes wearing a mask glamorous. :heart:",
            "created": "Mon, 17 Aug 2020 12:56:14 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/08/17/libbeyWearingAMask.png"
        },
        {
            "text": "NYC will rise again",
            "created": "Mon, 17 Aug 2020 15:49:21 GMT",
            "type": "outline",
            "metaImage": "http://static.scripting.com/larryKing/images/2014/03/24/kong.gif",
            "description": "There isn't another city on earth so capable of reinventing itself.",
            "subs": [
                {
                    "text": "When I was first starting out as an entrepreneur in the early 80s, I had an Apple II product, and Apple was in serious trouble, judging by the stories in the press. I asked my lead investor what to make of it. Should we not ship our Apple product and port to the IBM PC? He asked what Apple's sales were. About a billion dollars. He said you can safely continue, companies with a billion dollars in sales don't disappear. He was right, of course. A year later they shipped the first Mac, and we were on board for the boom in 1986. Had we switched in 1983, we would have missed the boom, and been lost in the crowd of second-tier PC companies. On the Mac we had a chance to rise to the top, and we did.",
                    "created": "Mon, 17 Aug 2020 15:49:27 GMT",
                    "image": "http://scripting.com/images/2019/10/31/handbookRecentlyDeceased.png"
                },
                {
                    "text": "The point of this story is that <a href=\"https://en.wikipedia.org/wiki/New_York_City\">NYC</a> has 8 million people. Most of them are staying. Many of the people with the means to leave are leaving. The business environment in NY will change. All that office space will be used for something. Nature abhors a vacuum. And NYC will have a lot of space, to be used creatively, we expect.",
                    "created": "Mon, 17 Aug 2020 15:50:23 GMT"
                },
                {
                    "text": "Also, the virus will weaken, like a hurricane as it moves inland. It won't go away, but the major damage is done as it makes landfall. At least judging from the 1918 pandemic. It was two years of hell, but the worst of it were the first waves, as it circled the world. In all likelihood that will also be the pattern of Covid-19. And remember, they never got a vaccine for the 1918 virus. It seems like we will have one, or more, and they will blunt the damage the virus does.",
                    "created": "Mon, 17 Aug 2020 15:51:17 GMT"
                },
                {
                    "text": "The idea that NYC is dead -- <a href=\"https://jamesaltucher.com/blog/nyc-is-dead-forever-heres-why/\">that's</a> just opportunistic linkbait. That's who the author is. Famous as a promoter of himself. There isn't a whole lot of thought or science behind his theory that NYC is over. As with billion dollar PC manufacturers in 1983, cities of 8 million don't just <a href=\"http://scripting.com/2020/04/16/132137.html?title=horrorFilmPlot\">disappear</a>. ",
                    "created": "Mon, 17 Aug 2020 15:52:29 GMT"
                },
                {
                    "text": "Like the world we left behind in March of this year, however, the old NY <i>is</i> gone. But there will be a new New York. There probably isn't another city on earth so capable of reinventing itself. In the two generations my family has been in NYC, the city has already reinvented itself a few times. My mother, herself an immigrant, lived to have her world disrupted by a new wave of immigration. It's a good thing, even a great thing. ",
                    "created": "Mon, 17 Aug 2020 15:52:57 GMT"
                },
                {
                    "text": "And humans are a resilient species. We get accustomed to new realities very quickly. We'll do fine. And NYC will rise again. ",
                    "created": "Mon, 17 Aug 2020 15:53:57 GMT"
                }
            ]
        }
    ]
}