{
    "text": "August 18",
    "created": "Tue, 18 Aug 2020 11:35:49 GMT",
    "name": "18",
    "subs": [
        {
            "text": "I always learn something when <a href=\"https://en.wikipedia.org/wiki/James_Carville\">James Carville</a> speaks. ",
            "created": "Tue, 18 Aug 2020 22:47:30 GMT",
            "type": "outline"
        },
        {
            "text": "People sometimes ask where I get my news. <a href=\"http://river6.scripting.com/\">This is where</a>. ",
            "created": "Wed, 19 Aug 2020 01:52:49 GMT",
            "type": "outline"
        },
        {
            "text": "I know some are in dismay because the Democrats are appealing to Republicans, but they are doing the right thing. It's so much more important what we agree on than what we disagree about. We agree in the Constitution and government of laws. Right now, in 2020, that's what matters most. Later we can re-divide on issues, but right now, we have to organize for one thing: America.",
            "created": "Tue, 18 Aug 2020 16:16:38 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/09/09/gru.png"
        },
        {
            "text": "America is like Microsoft, I hope. They were <a href=\"https://www.google.com/search?q=site%3Ascripting.com+microsoft\">beasts</a> in the 90s. Trying to destroy everything they didn't create. Later they calmed down, not deliberately, but it happened anyway. Now Microsoft is a big machine without much personality. Which is fine.",
            "created": "Tue, 18 Aug 2020 16:07:59 GMT",
            "type": "outline"
        },
        {
            "text": "Now that we all wear masks, and in NY we do, I am acutely aware of how much I depend on lip reading to understand what people say. I had to take my car in for service because an animal died in there. ",
            "created": "Tue, 18 Aug 2020 15:51:49 GMT",
            "type": "tweet",
            "tweetId": "1295750391762649089",
            "tweetUserName": "davewiner"
        },
        {
            "text": "Who ever thought the <a href=\"https://en.wikipedia.org/wiki/United_States_Postal_Service\">USPS</a> would be a pawn in the 2020 election. Everyone loves the post office. How did Trump miss that, they didn't raise its negatives before attacking. Someone didn’t do their homework.",
            "created": "Tue, 18 Aug 2020 22:48:49 GMT",
            "type": "outline"
        },
        {
            "text": "The postmaster general <a href=\"https://en.wikipedia.org/wiki/Louis_DeJoy\">Louis DeJoy</a> lives in <a href=\"https://www.google.com/maps/place/806+Country+Club+Dr,+Greensboro,+NC+27408/@36.1002412,-79.8019711,143m/data=!3m1!1e3!4m5!3m4!1s0x88531ec676c2f113:0x66ed022d711046de!8m2!3d36.1002412!4d-79.8016975\">Greensboro NC</a>, a <a href=\"http://davetravel.scripting.com/2005/02/11\">nice</a> <a href=\"https://en.wikipedia.org/wiki/Greensboro,_North_Carolina\">small city</a> I've been to <a href=\"https://www.google.com/search?q=site%3Ascripting.com+greensboro\">several times</a>. When Trump outed what they were <a href=\"https://www.inquirer.com/opinion/commentary/trump-mailboxes-sorters-usps-2020-election-louis-dejoy-20200816.html\">doing</a> to the <a href=\"https://en.wikipedia.org/wiki/United_States_Postal_Service\">USPS</a> he decided he didn't want to go to jail for the rest of his life, and become a famous <a href=\"https://en.wikipedia.org/wiki/List_of_people_convicted_of_treason#United_States\">American traitor</a> and lose all his <a href=\"https://www.greensborocc.org/\">nice Greensboro</a> friends.",
            "type": "outline",
            "created": "Tue Aug 18 18:23:44 +0000 2020"
        },
        {
            "text": "If I could get all my friends to work together, we'd take over the world. My friends all have good hearts and big ideas.",
            "created": "Tue, 18 Aug 2020 15:57:52 GMT",
            "type": "outline"
        },
        {
            "text": "I was sure that last night's virtual DNC was going to suck, but quite the opposite, it was riveting, great political TV. I can't wait for tonight's episode. Michelle Obama, the closer, was masterful. I hadn't heard anything from her since her last DNC speech. Imagine what watching Trump has been like for her. She knows how demanding the job is. She was generous with Trump and said he wasn't up for the job. Such an understatement. And she threw his <i>It Is What It Is</i> line back at him. Kind of what you might say giving Trump's eulogy (since that's what he had to say about 150K American deaths he's responsible for). Great speech. Now tonight we get Bill Clinton. He gives great DNC. I've heard him speak in person a few times. Get ready. It's going to be something. But. The most powerful speech of the night was <a href=\"https://www.youtube.com/watch?v=cKrDMEvvNzU\">Kristin Urquiza</a>. In case you haven't seen it, I won't spoil it, because there's one line in it that will stay with you, but you should hear it from her, the way she says it. Her father, a Trump supporter, died of the virus. The speech isn't long. Be sure not to miss it. ",
            "created": "Tue, 18 Aug 2020 11:35:50 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=cKrDMEvvNzU",
            "image": "http://scripting.com/images/2020/08/18/popcorn.png"
        },
        {
            "text": "Adams Farms in Kingston",
            "created": "Tue, 18 Aug 2020 15:34:01 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2020/08/18/blueberries.png",
            "description": "Blueberries are in season in the Hudson Valley. They are so good. They are my BFFs.",
            "subs": [
                {
                    "text": "Two reasons to live in this area. Blueberries and Adams marinara.  ",
                    "created": "Tue, 18 Aug 2020 15:34:14 GMT"
                },
                {
                    "text": "My mother would have turned 88 on Thursday. She was always on my case to eat more blueberries. She would be happy to know that I am. Esp this time of year. ",
                    "created": "Tue, 18 Aug 2020 15:34:23 GMT"
                },
                {
                    "text": "I live in blueberry country. It's peak blueberry season. I bought these at <a href=\"https://adamsfarms.com/locations/kingston/\">Adams in Kingston</a>. ",
                    "created": "Tue, 18 Aug 2020 15:34:43 GMT"
                },
                {
                    "text": "Blueberries in season.",
                    "created": "Tue, 18 Aug 2020 15:34:45 GMT",
                    "inlineImage": "http://scripting.com/images/2020/08/18/blueberries.png"
                },
                {
                    "text": "Every place has one of these groceries. In New Orleans it's <a href=\"https://www.langensteins.com/\">Langenstein's</a>. In Menlo Park, <a href=\"https://www.draegers.com/\">Draeger's</a>. In Woodside, <a href=\"https://www.robertsmarket.com/\">Roberts</a>. In the Hudson Valley -- <a href=\"https://adamsfarms.com/\">Adams</a>. They make a lot of their own stuff. They get the best products. They have a farm where they grow a lot of the produce they sell. ",
                    "created": "Tue, 18 Aug 2020 15:40:51 GMT"
                },
                {
                    "text": "Right now we have peaches and all kinds of berries, local grown, fresh and delicious. In September that's when the apples arrive. Huge boxes of them. It's something to behold. New we have blueberries."
                },
                {
                    "text": "And I'm telling you, their marinara sauce is the best. I know Adams is not an Italian name. But somehow they figured it out. Very fresh and delicious in every way. Previously my favorite marinara was <a href=\"https://www.amazon.com/San-Marzano-Pomodoro-Marinara-Sauce/dp/B00CXA1J14/ref=sr_1_3?dchild=1&gclid=Cj0KCQjw-O35BRDVARIsAJU5mQUhOqC-6Uu6FYC5Tmcpcida0mGpAZxQZKZrdG5feJIzaeQsshg62_0aAp9uEALw_wcB&hvadid=232499064174&hvdev=c&hvlocphy=1023511&hvnetw=g&hvqmt=e&hvrand=7378444453978147064&hvtargid=kwd-383386643679&hydadcr=4846_9629179&keywords=san+marzano+marinara&qid=1597765390&sr=8-3&tag=googhydr-20\">San Marzano</a>. Very good. But Adams is better imho. ",
                    "created": "Tue, 18 Aug 2020 15:34:59 GMT"
                },
                {
                    "text": "Adams marinara.",
                    "created": "Tue, 18 Aug 2020 15:35:00 GMT",
                    "inlineImage": "http://scripting.com/images/2020/08/18/marinara.png"
                }
            ]
        }
    ]
}