{
    "text": "August 19",
    "created": "Wed, 19 Aug 2020 15:40:52 GMT",
    "name": "19",
    "subs": [
        {
            "text": "I'm going to Italy after all this is over.",
            "created": "Wed, 19 Aug 2020 18:22:49 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://twitter.com/_HeatherWalker/status/1296122043772133382\">TV news reporter</a> in Michigan has found a graveyard of USPS sorting machines. Sickening feeling. Must-watch. ",
            "created": "Wed, 19 Aug 2020 18:08:33 GMT",
            "type": "outline"
        },
        {
            "text": "I sent a <a href=\"http://scripting.com/2020/08/19/voicemailToFrancine.m4a\">voicemail</a> to Francine Hardaway, about Clubhouse, the DNC and a lot of other things. Decided it should be a podcast. It is what it is. ",
            "created": "Wed, 19 Aug 2020 17:44:03 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2020/08/19/voicemailToFrancine.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "8008427"
        },
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=671AgW9xSiA\">Today's song</a>: If my words did glow with the gold of sunshine, and my tunes were played on the harp unstrung. Would you hear my voice come through the music? Would you hold it near as it were your own?",
            "created": "Wed, 19 Aug 2020 15:50:35 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=671AgW9xSiA",
            "image": "http://scripting.com/images/2020/08/19/mailman.png"
        },
        {
            "text": "Today's <a href=\"https://www.nytimes.com/2020/08/19/podcasts/the-daily/dejoy-postal-service-trump.html\">Daily podcast</a> is about Trump and the USPS. They present something as theory that I'm pretty sure is fact, that Trump is trying to and quite possibly succeeding at making the postal service incapable of doing its part in the November 3 election. Also, they got an important fact wrong, if this <a href=\"https://www.inquirer.com/opinion/commentary/trump-mailboxes-sorters-usps-2020-election-louis-dejoy-20200816.html\">Philadelphia Inquirer story</a> is to be believed. The author of the NYT story, <a href=\"https://www.nytimes.com/by/luke-broadwater\">Luke Broadwater</a>, said that disabling by-mail voting would not hurt Democrats more than Republicans. On the other hand, according to the <a href=\"http://scripting.com/images/2020/08/19/votingByMailPlans.png\">Inquirer story</a>, Republican voters have been warned by Trump not to vote by mail, and apparently are heeding the advice. <b>Only 18% of Repubs are expected to vote by mail vs 59% of Democrats. </b>So if Trump could disable the post office, it seems that would ensure his re-election. If the Daily got this wrong, the whole of today's podcast requires some kind of correction. ",
            "created": "Wed, 19 Aug 2020 16:27:54 GMT",
            "type": "outline"
        },
        {
            "text": "I finished John Barry's <a href=\"https://www.amazon.com/Great-Influenza-Deadliest-Pandemic-History/dp/0143036491\">book</a> about the <a href=\"https://en.wikipedia.org/wiki/Spanish_flu\">1918 pandemic</a>. I would <i>not</i> recommend it, if your goal is to learn as much as you can about the pandemic itself. In the afterword, Barry explains why the book isn't really about the pandemic, it's about how scientists collaborate. He used the pandemic as an example. I had pretty much already figured that out. So much information about the lives of the individual scientists. It went on and on. I skipped whole chapters. Now, I like a good story as much as anyone, but nothing about his tale made me care about them as people. And that isn't why I picked up the book. I want to learn as much as I can about influenza pandemics, because I'm living in the middle of one. To his credit, the book was published 15 years ago, long before Covid-19. I'm going to keep looking for a book that focuses on the science. ",
            "created": "Wed, 19 Aug 2020 16:03:02 GMT",
            "type": "outline"
        },
        {
            "text": "BTW, then as now the government lied about the disease. <a href=\"https://en.wikipedia.org/wiki/Woodrow_Wilson\">Woodrow Wilson</a> who has since had his reputation somewhat cleaned up, was apparently not a very great president. Certainly not when it came to mobilizing resources to fight a pandemic that was killing hundreds of thousands of Americans, as today. If we elect Biden and he delivers on his promise, and I don't see why he wouldn't, it would be history-making. An aside, Barry, who is a noted <a href=\"https://sph.tulane.edu/cov19-barry-video\">scientist</a>, says it has been proven that Wilson got the 1918 flu. He theorizes that the terrible deal that Germany got was due to Wilson's flu, and if he had not gotten ill, maybe Germany wouldn't have gone fascist? The same story <a href=\"https://www.newyorker.com/news/daily-comment/woodrow-wilsons-case-of-the-flu-and-how-pandemics-change-history\">appeared</a> in the New Yorker earlier this year. He also says the flu resulted in Wilson's stroke and disability. Perhaps a cautionary fact for our current president. Also interesting that there is no mention of \"influenza\" on the <a href=\"https://en.wikipedia.org/wiki/Woodrow_Wilson\">Wikipedia page</a> for Wilson! Amazing. I wonder how Trump's epitaph will read? I expect Covid-19 will be prominent. ",
            "created": "Wed, 19 Aug 2020 16:11:10 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/08/19/wilson.png"
        },
        {
            "text": "I can't stand podcasts with advertising. What's even worse is podcasts with advertising with the proceeds going to charity. WTF goes through their minds. Why do they even bother.",
            "created": "Wed, 19 Aug 2020 15:40:53 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://twitter.com/donpark/status/1296064316630798337\">Don Park</a>, with a <a href=\"http://scripting.com/images/2020/08/19/donParksGraph.png\">graph</a> of new Covid cases in South Korea. There's a spike. He says: \"This is what happened after a rogue pastor holds a rally in the middle of Seoul and 5,000 ultra-conservatives show up without mask. In comparison, there wasn't even a blip after South Korea held a national election with tens of millions voting in-person.\" ",
            "created": "Wed, 19 Aug 2020 15:42:38 GMT",
            "type": "outline"
        },
        {
            "text": "I've had a report that commenting on Scripting News doesn't work. I just signed off and then signed back on, and commented and <a href=\"https://twitter.com/davewiner/status/1296139456307695618\">it worked</a>. If you're experiencing a problem please write it up in <a href=\"https://github.com/scripting/Scripting-News/issues/185\">this thread</a>. Include as much detail as you can so I can try to reproduce the problem. As I said, I just went through the basic operation and it worked. ",
            "created": "Wed, 19 Aug 2020 17:33:14 GMT",
            "type": "outline"
        },
        {
            "text": "Yesterday I started to write a new post at the end of <a href=\"http://scripting.com/2020/08/18.html#a155149\">another</a>, and I forgot to complete it, and missed it in the final edit before shutting down for the night. It went like this. \"I had to take my car in for service because an animal died in there.\" As far as I know only Randy Green caught it. I told her it was there to see if she was paying attention. I lied. It was there because I'm a space cadet. :rocket:",
            "created": "Wed, 19 Aug 2020 15:52:26 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/09/07/vwBug.png"
        },
        {
            "text": "Mouse invasion",
            "created": "Wed, 19 Aug 2020 17:28:40 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Over the last year, I've had two of mouse invasions in my car. One where a mouse chewed through a vent in my air conditioner, and the latest where a family of mice made a nest in the air conditioner and then proceeded to die! ",
                    "created": "Wed, 19 Aug 2020 17:28:56 GMT"
                },
                {
                    "text": "Ay ayay.",
                    "created": "Wed, 19 Aug 2020 17:29:18 GMT"
                },
                {
                    "text": "I had the mouse family cleaned out by the local Subaru dealer, but the smell lingers, and now I have to figure out what to do. It's not a nice problem to have! ",
                    "created": "Wed, 19 Aug 2020 17:29:33 GMT"
                },
                {
                    "text": "Oy.",
                    "created": "Wed, 19 Aug 2020 17:29:42 GMT"
                }
            ]
        }
    ]
}