{
    "text": "August 20",
    "created": "Thu, 20 Aug 2020 13:49:16 GMT",
    "name": "20",
    "subs": [
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1296495392150949888\">Poll</a>: Is it what it is?",
            "created": "Thu, 20 Aug 2020 17:21:40 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1296495392150949888"
        },
        {
            "text": "Today's song: <a href=\"https://www.youtube.com/watch?v=_5yJZUyr_cM\">Life During Wartime</a>. ",
            "created": "Thu, 20 Aug 2020 21:58:23 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1296513479852122112\">Suppose</a> you're a writer at The Atlantic. Do you pay to read Mother Jones? Or do your pubs exchange free subscriptions for their writers and editors?",
            "created": "Thu, 20 Aug 2020 18:23:00 GMT",
            "type": "outline"
        },
        {
            "text": "I'm sorry Faceboo, I don't come To Faceboo to learn how to use Faceboo, I go there to see what my friends are posting. I'm getting annoyed. ",
            "created": "Thu, 20 Aug 2020 21:16:11 GMT",
            "type": "tweet",
            "tweetId": "1296556774066135041",
            "tweetUserName": "davewiner"
        },
        {
            "text": "My niece <a href=\"http://scripting.com/2020/08/20/emmaImitatingEveSayingHello.m4a\">Emma imitating</a> my <a href=\"http://scripting.com/2018/02/26/024939.html\">mother</a>, her grandmother, saying Hello when she answers the phone. Mom was born 88 years ago today.  ",
            "created": "Thu, 20 Aug 2020 21:34:28 GMT",
            "type": "outline"
        },
        {
            "text": "A question re #BLM. What do black police say? I can't say I've ever heard a black cop speak about it.",
            "type": "outline",
            "created": "Thu Aug 20 12:36:09 +0000 2020",
            "image": "http://scripting.com/images/2020/08/20/obama.png"
        },
        {
            "text": "I wonder why the DNC didn't create an actual crowd for one or two speeches. It can be done safely. Look at the <a href=\"https://www.youtube.com/watch?v=8P3X9AiN8E4\">eulogy</a> Barack Obama gave for John Lewis. The audience was very much part of the event. I think last night's keynote by Kamala Harris would have been more effective in front of an enthusiastic crowd. Maybe they'll create such an event tonight for the presidential nominee. I went to Obama's acceptance speech in Denver in 2008 in a football stadium. Quite an event. ",
            "created": "Thu, 20 Aug 2020 18:10:58 GMT",
            "type": "outline"
        },
        {
            "text": "Occam’s News. This just in. Breaking news. We live in Vichy America, controlled by Russia. They have been dismantling our communication infrastructure. While we weren’t paying attention. 3.5 years going on forever.",
            "type": "outline",
            "created": "Thu Aug 20 12:33:05 +0000 2020"
        },
        {
            "text": "Nancy Pelosi: \"I'm a mother of 5, a grandmother of 9. I know a temper tantrum when I see one.\" ",
            "created": "Thu, 20 Aug 2020 13:49:17 GMT",
            "type": "outline"
        },
        {
            "text": "The president of <a href=\"https://www.washingtonpost.com/opinions/the-virus-isnt-going-away-thats-why-campuses-need-to-reopen/2020/08/18/28810dd0-e17d-11ea-8181-606e603bb1c4_story.html\">Northeastern University</a> says they should re-open campuses because the virus will be with us indefinitely (it will) so we're going to have to re-open campuses at some point, so we should do it now. I'm sure they've thought it through, but next year we'll know a lot more about living with the virus than we do now. Look at how much we've learned in the last six months. Net-net, we'll do better in terms of human lives, if we give it more time. Work up to it slowly. Maybe have conferences on campus but do everything else online. Create projects for people to do collaboratively. I know the economics are dismal. But I think it's better if universities die to keep students alive rather than the other way. ",
            "created": "Thu, 20 Aug 2020 14:35:47 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/08/20/dave.png"
        },
        {
            "text": "I did some work on the mobile version of \"BingeWorthy\" this morning, and it should work now, whereas before it did not. It's still not totally the way I want it. Below is a screen shot. ",
            "created": "Thu, 20 Aug 2020 16:47:32 GMT",
            "type": "outline"
        },
        {
            "text": "BingeWorthy 2 on an iPhone. ",
            "created": "Thu, 20 Aug 2020 16:49:47 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/08/20/bingeWorthyOnIphone.png"
        },
        {
            "text": "Won't get fooled again.",
            "created": "Thu, 20 Aug 2020 15:39:44 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/08/20/wontGetFooledAgain.png"
        },
        {
            "text": "New bio",
            "created": "Thu, 20 Aug 2020 17:23:10 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I never do interviews on podcasts about podcasting, but I just did one, a few weeks ago, and they're getting ready to publish, and wanted a 75-word bio. So I wrote a new one. This one is exactly 75 words according to my script. I did not verify it by counting by hand.",
                    "created": "Thu, 20 Aug 2020 17:23:14 GMT",
                    "subs": [
                        {
                            "text": "Dave Winer is an inventor of new media types, software developer and blogger in Woodstock NY. Started two Silicon Valley software companies, former contributing editor at Wired, with research fellowships at Harvard and NYU. Developed podcasting, RSS, blogging, outlining and web content management software. He has an MS in Computer Science from the University of Wisconsin, and a BS in Math from Tulane. Winer has the first and longest-running blog on the internet, Scripting News, scripting.com.",
                            "created": "Thu, 20 Aug 2020 17:24:07 GMT"
                        }
                    ]
                }
            ]
        }
    ]
}