{
    "text": "August 21",
    "created": "Fri, 21 Aug 2020 13:16:24 GMT",
    "name": "21",
    "subs": [
        {
            "text": "A <a href=\"https://youtu.be/a-5UO4IFWCw\">bug fix</a> for \"BingeWorthy\". When you change the rating of a program, the list of people who rated it now changes to reflects your rating.",
            "created": "Fri, 21 Aug 2020 17:31:37 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=a-5UO4IFWCw"
        },
        {
            "text": "In all media I want to pay for what I use. Instead everything is priced flat rate, it’s all pretty much a ripoff. I have Hulu, Disney+, YouTube TV, Netflix, AppleTV+, Amazon. I mostly just watch news and sports. I pay a lot of money for nothing. It's as ridiculous as with new websites. As a user I want an <a href=\"http://scripting.com/2020/08/06/133617.html?title=moneyForNews\">EZ-Pass</a>.",
            "created": "Fri, 21 Aug 2020 22:21:55 GMT",
            "type": "outline"
        },
        {
            "text": "Wouldn't it be great if people from the cities migrated to places like <a href=\"https://www.zillow.com/homes/wyoming_rb/\">Wyoming</a> and <a href=\"https://www.zillow.com/homes/idaho_rb/\">Idaho</a>, where very few people vote, yet they have two senators and extra <a href=\"https://en.wikipedia.org/wiki/United_States_Electoral_College\">Electoral College</a> oomph. Might not even be too late for the November election in some states. And btw, Zoom works in Wyoming too. It's almost like a bug fix for the Constitution. :boom:",
            "created": "Fri, 21 Aug 2020 17:41:24 GMT",
            "type": "outline"
        },
        {
            "text": "Today's <a href=\"https://www.nytimes.com/2020/08/21/podcasts/the-daily/nba-coronavirus-basketball.html\">Daily podcast</a> explains what it's like for a reporter inside the NBA bubble. Totally worth listening to. But as with the <a href=\"http://scripting.com/2020/08/19.html#a162754\">last Daily</a> I listened to, it has a significant error. At the end they say that what the NBA has done is too expensive to replicate elsewhere, but -- it's not true. The NBA is doing what China, South Korea, Hong Kong, Taiwan, Iceland, Singapore, Vietnam did. How did I learn about this? From the Daily podcast, in repeated interviews with <a href=\"https://www.google.com/search?q=site%3Ascripting.com+Donald+McNeil\">Donald McNeil</a>. An NBA-style bubble can be as large as the US.",
            "created": "Fri, 21 Aug 2020 20:03:33 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/04/19/coronavirus.png"
        },
        {
            "text": "<a href=\"http://scripting.com/2020/08/21/aPodcastToProgressives.m4a\">A podcast to progressives</a>. This was the convention for all Americans who want to fight the virus and keep the Constitution. We know for a fact that progressives want this. We have to appeal to people who may be on the fence. <i>The DNC was a commercial. </i>Marketing. It wasn't there to make you feel heard. Personally I think to fight the virus we'll need to have single payer soon after Biden takes office. There may never be a moment where you hear from everyone that you were right. You'll have to find the glory within yourself. ",
            "created": "Fri, 21 Aug 2020 15:20:35 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2020/08/21/aPodcastToProgressives.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "11529639"
        },
        {
            "text": "<a href=\"https://en.wikipedia.org/wiki/Louis_DeJoy\">DeJoy</a> should be called DeStroy because he’s doing that to our postal service.",
            "created": "Fri, 21 Aug 2020 15:24:43 GMT",
            "type": "outline"
        },
        {
            "text": "Such a shame to see \"RSS\" <a href=\"https://lifehacker.com/the-best-rss-readers-and-news-aggregation-apps-1839030732\">readers</a> nuzzle up to Feedly the way they did with <a href=\"http://scripting.com/2019/12/21/170042.html\">Google Reader</a>. This will not end well. Don't centralize technology whose main power is decentralization. But there's no law against it. Maybe it's a business model. And no I don't care if users want it.",
            "created": "Fri, 21 Aug 2020 14:01:56 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/12/21/fox.png"
        },
        {
            "text": "Sometimes you have something to say but it's a general thing, not about one specific instance. For example, someone could come up with yet another exhausting attempt to <a href=\"https://wiki.c2.com/?NotInventedHere\">re-invent</a> RSS without saying that's what it is. The tech world is littered with them. Each one is a bad idea. But I'm not going to call out any specific one, that's not practical. I'd be saying it all the time. ",
            "created": "Fri, 21 Aug 2020 14:09:26 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://en.wikipedia.org/wiki/Leonard_Nimoy#Star_Trek\">Leonard Nimoy</a>. A perfectly <a href=\"https://www.emmys.com/bios/leonard-nimoy\">good</a> actor, capable of playing lots of roles, but because he was Mr Spock on Star Trek, you'd always think wtf is <a href=\"https://www.youtube.com/watch?v=9lWBbDGYC3o\">Mr Spock</a> doing on <a href=\"https://www.youtube.com/watch?v=kg76TOodagI\">Mission Impossible</a>. <a href=\"https://en.wikipedia.org/wiki/Typecasting\">Typecasting</a>. Another example. <a href=\"https://en.wikipedia.org/wiki/Bill_Buckner#1986_World_Series\">Bill Buckner</a>, a good first baseman with a long career. He misjudged a ball once. That becomes his whole <a href=\"https://www.youtube.com/watch?v=rpyJjecJnuI\">life story</a>. As they say, it <a href=\"https://twitter.com/davewiner/status/1296495392150949888\">is</a> what it is. ",
            "created": "Fri, 21 Aug 2020 14:16:16 GMT",
            "type": "outline"
        },
        {
            "text": "Cast of Mission Impossible, 1970.",
            "created": "Fri, 21 Aug 2020 14:27:28 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/08/21/missionImpossibleCast.png"
        },
        {
            "text": "Biden nailed it",
            "created": "Fri, 21 Aug 2020 13:25:53 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2020/08/21/biden.png",
            "description": "It would be a relief, on Election Day, to find we had come together and elected Biden and Harris in a landslide.",
            "subs": [
                {
                    "text": "Last night's DNC went by quickly. Julia Louis-Dreyfus was <a href=\"https://twitter.com/nowthisnews/status/1296681978029322241\">funny</a>. The speakers spoke warmly of Joe Biden, including Bernie Sanders. Everything was great until the moment Biden stepped up to speak. His first few sentences were awkward, the words were vague and muffled. I started to get up from the chair, not wanting to listen. I thought I'd clean up and go to bed, but I decided that I have to sit through this, so I did, and I was quickly riveted and glad to hear him touch on all the important points, ones that no one had made through the week. ",
                    "created": "Fri, 21 Aug 2020 13:28:57 GMT"
                },
                {
                    "text": "Until that point I thought Michelle Obama's speech was the best. I thought Barack Obama's was weak. I don't think the Constitution is the strongest appeal, it's the lack of leadership, we're all left to fend for ourselves against a virus that's killing huge numbers of Americans. We could deal with a little authoritarianism, I feel, if it was in the cause of saving our lives. The fear isn't rooted in the 170K Americans who have already died, it's the next 170K and the ones after that. We all want to survive this. With Trump in for four more years, our chances of not being destroyed by the virus are zero. I think that is by far the strongest appeal. And until Biden, amazingly, in four days of the DNC, no one had made it. He didn't quite make it explicitly either, but he came pretty close. ",
                    "created": "Fri, 21 Aug 2020 13:30:24 GMT"
                },
                {
                    "text": "I often feel there's this divide between our leaders and the people. And I don't kid myself, the divide is there between Biden and us too. All the stories about how he gave people his phone number, or sat down and talked for hours with a random person, those are touching for sure, and even if they are real, I know he'll never call me. It was the equivalent of having a beer with Bush or shooting hoops with Obama. I wish one of these politicians had a practical vision -- of a <a href=\"http://scripting.com/2016/05/04/1237.html\">political social network</a> that mobilized us 365 days a year, every year, not just when there's an election. Biden is not that person, nor is Kamala Harris. When they're elected they will govern like Obama did, and will be vulnerable to the same Republican sabotage that he was. But. Biden was not awkward. His speech was more a fireside chat than a DNC acceptance speech. Yes, I am convinced he is on our side, relative to the current president. A low bar for sure, but it grabs me emotionally, also physically, cheering, sobbing. It would be such a relief, on Election Day, to find we had come together and elected Biden and Harris in such large numbers that everyone will see what a fool Trump is, even his most vocal supporters, and we'll tell him to STFU, with one voice, and just retire in disgrace to his bunker in Russia. It's a dream I allow myself to have. And it was supported by Biden's speech last night. That's political speech at its best. It was a good thing I sat my butt back down and listened. ",
                    "created": "Fri, 21 Aug 2020 13:32:13 GMT",
                    "image": "http://scripting.com/images/2020/04/27/bidenActionFigure.png"
                }
            ]
        }
    ]
}