{
    "text": "August 23",
    "created": "Sun, 23 Aug 2020 14:02:00 GMT",
    "name": "23",
    "subs": [
        {
            "text": "Dear journalism people. If you had to subscribe to Starbucks to get a single latte, they wouldn't have a lot of customers. They unbundled. You pay for what you use. That's what journalism should do too.",
            "created": "Sun, 23 Aug 2020 14:56:48 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/08/23/peeweeHerman.png"
        },
        {
            "text": "I'm working through the <a href=\"https://www.nytimes.com/2020/07/23/podcasts/nice-white-parents-serial.html\">Nice White Parents</a> podcast from the NYT. In <a href=\"https://www.nytimes.com/2020/07/30/podcasts/nice-white-parents-serial-2.html?action=click&module=audio-series-bar&region=header&pgtype=Article\">episode 2</a> they're talking about efforts to integrate schools in NYC. They say it never happened. But, I remember, my family was <a href=\"https://www.google.com/search?q=ps+149+qieems+ps+92+pairing\">part</a> of a <a href=\"https://timesmachine.nytimes.com/timesmachine/1964/03/19/106947848.pdf?pdf_redirect=true&ip=0\">pairing</a> of <a href=\"https://www.ps149q.org/\">two</a> <a href=\"https://www.ps92q.org/\">schools</a> in white <a href=\"https://en.wikipedia.org/wiki/Jackson_Heights,_Queens\">Jackson Heights</a> and in black <a href=\"https://en.wikipedia.org/wiki/Corona,_Queens\">Corona</a>. My brother went to the Corona school, and I stayed in the Jackson Heights school. Of course I was a kid, so I wasn't really aware of what was going on beyond there were more black kids in our class. It also occurs to me that we moved not long after this happened, further east, to an <a href=\"https://en.wikipedia.org/wiki/Auburndale,_Queens\">area</a> where there were no black neighborhoods to pair with. I don't know what motivated my parents to move, and it's too late to ask them. ",
            "created": "Sun, 23 Aug 2020 19:37:18 GMT",
            "type": "outline"
        },
        {
            "text": "Heard a report this morning on NPR, interviewing older Trump voters, and while they say his behavior is awful and he lies, and he's botched the virus response, they're still voting for him. Why? They don't like #BLM. In other words, white supremacy. I don't think the Democrats are going to say this but it needs to be said. <i>White supremacy is on the ballot this year. </i>It may be the single decisive issue. Not the virus, not the Constitution. But the right of whites to dominate. I wrote about it <a href=\"http://scripting.com/2020/08/22/135804.html?title=whiteSupremacyIsOnTheBallot\">yesterday</a>. The idea is hard to explain, but imho important. I'm going to work on better ways to explain, but for now you have to read slowly, carefully.",
            "created": "Sun, 23 Aug 2020 14:56:57 GMT",
            "type": "outline"
        },
        {
            "text": "This morning I changed <i>racism</i> in the title of yesterday's post to <i>white supremacy. </i>I think that’s what we’re going through now in the US. Totally unanticipated that the joy of <a href=\"http://scripting.com/2008/11.html\">2008</a> would be followed by such upheaval. The US wants to shed racism, or does it? I didn’t realize we were still having this argument until recently.",
            "created": "Sun, 23 Aug 2020 21:03:47 GMT",
            "type": "outline"
        },
        {
            "text": "Biden is too sweet. When Trump says he's somehow intellectually impaired, Biden could say all that he says, and  add a bit of morality. \"People in glass houses, Mr President.\"",
            "created": "Sun, 23 Aug 2020 14:57:37 GMT",
            "type": "outline"
        },
        {
            "text": "Listening to the <a href=\"https://podcasts.apple.com/us/podcast/bidens-acceptance-speech-election-interference-steve/id1514968525?i=1000488856251\">Lincoln Project podcast</a>. Steve Schmidt let slip that DC insiders knew Manafort was a Russian spy in 2016. So, why didn’t they say so? Did the journalists know too?",
            "created": "Sun, 23 Aug 2020 14:58:05 GMT",
            "type": "outline"
        },
        {
            "text": "Pictures taken with my newly acquired Pixel 4a. Two <a href=\"http://scripting.com/publicfolder/images/pixelPics/lake.jpg?x=1\">taken</a> on yesterday's <a href=\"http://scripting.com/publicfolder/images/pixelPics/countryRoad.jpg?x=1\">bike</a> ride, and the third of a local fresh <a href=\"http://scripting.com/publicfolder/images/pixelPics/peach.jpg?x=1\">peach</a> roughly the size of a melon. ",
            "created": "Sun, 23 Aug 2020 14:59:19 GMT",
            "type": "outline"
        }
    ]
}