{
    "text": "August 24",
    "created": "Mon, 24 Aug 2020 12:04:00 GMT",
    "name": "24",
    "subs": [
        {
            "text": "Michael Cohen's incredible <a href=\"https://twitter.com/Breaking911/status/1298032187569254400\">RNC-week ad</a>. Very powerful. ",
            "created": "Tue, 25 Aug 2020 01:09:50 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/Breaking911/status/1298032187569254400"
        },
        {
            "text": "\"BingeWorthy\" continues its march to perfection. There's now an <a href=\"http://bingeworthy.io/rss.xml\">RSS feed</a> that lists all the recent ratings and program additions. It supports <a href=\"http://home.rsscloud.co/\">rssCloud</a> so you can get instant notification of updates. I expect to plug this into other stuff I'm working on. Comments or questions <a href=\"https://github.com/scripting/Scripting-News/issues/184#issuecomment-678798955\">here</a>. ",
            "created": "Mon, 24 Aug 2020 16:21:34 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/09/21/tree.png"
        },
        {
            "text": "I replaced the picture in the Facebook and Twitter metadata, so when you paste a link to bingeworthy.io, you'll get a more meaningful <a href=\"http://scripting.com/images/2020/08/24/bingeworthyScreenShot.png\">image</a>. The place holder in the first version was a picture of <a href=\"http://scripting.com/images/2017/12/11/breakingBad.png\">Mr White</a> from Breaking Bad and in version 2, the <a href=\"http://scripting.com/images/2020/08/16/schittsCreekCast.png\">Rose family</a> in Schitt's Creek. ",
            "created": "Mon, 24 Aug 2020 16:27:17 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=gtHI0ipkgEo\">Jack Nicholson</a> accepts the BAFTA for <a href=\"https://en.wikipedia.org/wiki/Chinatown_(1974_film)\">Chinatown</a>, from the set of <a href=\"https://en.wikipedia.org/wiki/One_Flew_Over_the_Cuckoo%27s_Nest_(film)\">One Flew Over the Cuckoo's Nest</a>. ",
            "created": "Mon, 24 Aug 2020 12:04:01 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=gtHI0ipkgEo"
        },
        {
            "text": "<a href=\"https://twitter.com/annamasera/status/1297898913798721540\">Anna Masera, journalist</a>: \"The problem that needs fixing is that journalists have always had 'the privilege' of separating their work from its marketing, which has always been exclusively managed by their publisher with a different, separate team. We cannot/never could meddle and change is too slow.\"",
            "created": "Mon, 24 Aug 2020 18:13:28 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/annamasera/status/1297898913798721540"
        },
        {
            "text": "At times <a href=\"https://www.nytimes.com/2020/08/24/opinion/jerry-seinfeld-new-york-coronavirus.html\">like this</a> I like to say: NYC is not dead because it was never alive. Words like <i>dead</i> should not be thrown around casually. Death is a <a href=\"https://en.wikipedia.org/wiki/Death_(personification)\">heavy</a> <a href=\"http://thesaurus.land/?word=death\">word</a>, and should be reserved for real death, not an imaginary stupid metaphoric death.",
            "created": "Mon, 24 Aug 2020 18:07:13 GMT",
            "type": "outline"
        },
        {
            "text": "More on Friday's <a href=\"https://podcasts.apple.com/us/podcast/bidens-acceptance-speech-election-interference-steve/id1514968525?i=1000488856251\">Lincoln Project podcast</a> where <a href=\"https://en.wikipedia.org/wiki/Steve_Schmidt\">Steve Schmidt</a> said everyone in 2016 in DC knew Manafort was a Russian agent. This reminded me of when when <a href=\"https://en.wikipedia.org/wiki/Steele_dossier#Publication_by_BuzzFeed_News\">Buzzfeed published</a> the Steele Dossier, and the rage of other journalists that they had disclosed unverified information to the public, even though the dossier was being widely circulated in DC at the time. I was glad <a href=\"https://en.wikipedia.org/wiki/Ben_Smith_(journalist)\">Ben Smith</a> took the side of the people. There should be little difference between what insiders know and what the public knows. Some things are so important, people should take risks, esp if they want the rep of being a patriot as Schmidt clearly does. Anyway it turns out \"collusion\" was too polite. The Trump campaign in 2016 was actually run by Russia. This is now an established fact. This should get huge headlines. ",
            "created": "Mon, 24 Aug 2020 15:06:59 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/08/24/borisBadenov.png"
        },
        {
            "text": "I took my car to a special place that has techniques for cleaning awful smells out of cars. My car, a little over a year old with less than 10K miles may be a total loss because of the family of mice that colonized and then died in its air conditioning system. So I had to rent a car. When I got it, it was clear that it had been smoked in. So I asked for another car. Waited a half hour in the hot sun. The next car also had been smoked in. Impatient, I didn't ask for a new one this time. So I traded in a car that smelled of dead mice for one that smells of (to me) sickness. I haven't smoked since June 14, 2002. It's not a nice smell for me. There must be a lesson in this, but I'm not sure what it is.",
            "created": "Mon, 24 Aug 2020 15:10:13 GMT",
            "type": "outline"
        },
        {
            "text": "If Trump is re-elected, I think the country has to split in two. I don't think we, in the so-called blue states, can handle another four years of Trump. We'll have to find a way to opt out. I feel for all the people of color, immigrants and Jews in the red states. We have to provide for their migration. Either that or we rebel. But the Constitution, if it allows a man like Trump to be elected and then re-elected, is not worth preserving imho.",
            "created": "Mon, 24 Aug 2020 15:13:25 GMT",
            "type": "outline"
        },
        {
            "text": "Current BingeWorthy screen shot. ",
            "created": "Mon, 24 Aug 2020 16:58:33 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/08/24/bingeworthyScreenShot.png"
        },
        {
            "text": "Haven't learned yet how to smile in selfie. :smile:",
            "created": "Tue, 25 Aug 2020 00:40:29 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/08/24/selfie.png"
        },
        {
            "text": "A sign of the times. ",
            "created": "Mon, 24 Aug 2020 15:20:07 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/08/24/personManWomanVoteBiden.png"
        }
    ]
}