{
    "text": "August 28",
    "created": "Fri, 28 Aug 2020 14:29:13 GMT",
    "name": "28",
    "subs": [
        {
            "text": "Everything falls into place if you think of the Repubs as the white supremacy party. It isn't racism. Everyone has racism, but we check it, control it, if we behave badly we feel badly. A white supremacist feels should they be in control. Natural order. Master race. ",
            "created": "Fri, 28 Aug 2020 14:32:30 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/04/23/saulGoodman.png"
        },
        {
            "text": "Why are there no reports of black cops attacking white people with unnecessary deadly force?",
            "created": "Fri, 28 Aug 2020 14:30:30 GMT",
            "type": "outline"
        },
        {
            "text": "News orgs should never let the truth be a partisan issue.",
            "created": "Fri, 28 Aug 2020 14:30:41 GMT",
            "type": "outline"
        },
        {
            "text": "I am so frustrated with news. Why don’t they take the bull by the horns and fill the vacuum left by the government in disease control. They are in the info business, supposedly. This should be easy, biggest opportunity ever. Why are they so paralyzed. Get angry, act.",
            "created": "Fri, 28 Aug 2020 14:29:29 GMT",
            "type": "outline"
        },
        {
            "text": "We love the same country. Black men should not stand alone. When Doc RIvers gives a <a href=\"https://www.youtube.com/watch?v=RpYMVPIdHt0\">speech like this</a>, there should be five white men standing behind him.",
            "created": "Fri, 28 Aug 2020 14:31:45 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=RpYMVPIdHt0"
        },
        {
            "text": "<a href=\"https://twitter.com/trbrtc/status/1298842326853472258\">Most amazing video</a>. Murderer, armed and white, tries to surrender. Cops ask for directions, drive by. ",
            "created": "Fri, 28 Aug 2020 14:31:00 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/trbrtc/status/1298842326853472258"
        },
        {
            "text": "Suppose the Democrats win. Will they have their convention on the White House lawn too. Can you imagine that the next Republican administration won’t do exactly what Trump is doing? ",
            "created": "Sat, 29 Aug 2020 00:58:47 GMT",
            "type": "outline"
        },
        {
            "text": "I bought a compact Nissan pickup truck in 1991. 4-cylinder, drove like a golf cart or lawn mower, excellent mileage, great for trips to hardware or garden supply store. They don’t seem to make them anymore. Pickups are monster size and up.",
            "created": "Fri, 28 Aug 2020 14:29:53 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/08/28/pickup.png"
        },
        {
            "text": "“America greatness” that Trump talks about is white supremacy.",
            "created": "Fri, 28 Aug 2020 14:29:35 GMT",
            "type": "outline"
        },
        {
            "text": "The planet isn't at risk.",
            "created": "Fri, 28 Aug 2020 16:06:54 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/08/28/thePlanetIsntAtRisk.png"
        }
    ]
}