{
    "text": "I think I understand Trump",
    "created": "Fri, 25 Aug 2017 15:48:15 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "There's a recurring character you see in Silicon Valley, not the <a href=\"https://en.wikipedia.org/wiki/Silicon_Valley_(TV_series)\">TV show</a> but <a href=\"https://en.wikipedia.org/wiki/Silicon_Valley\">real life</a>. The man-baby. Fully grown, middle-aged, but not wanting to take responsibility. I'm sure there are girl-babies too, but I keep running into the male kind. ",
            "created": "Fri, 25 Aug 2017 15:48:20 GMT",
            "image": "http:///scripting.com/images/2017/08/25/babyHuey.png"
        },
        {
            "text": "He keeps getting into deeper and deeper shit, very deliberately, so a father figure can bail him out. He always has a father figure around. They may not know they've been cast in this role. Sometimes the father figure is actually a woman. ",
            "created": "Fri, 25 Aug 2017 15:49:21 GMT"
        },
        {
            "text": "I have been cast in this role myself a few times. It's not a good feeling when you see the pattern repeating. Sooner or later this person is going to have to evolve into an adult, and realize that no one else can really bail him out. ",
            "created": "Fri, 25 Aug 2017 15:50:04 GMT"
        },
        {
            "text": "Trump is one of those peoples, and the really interesting thing is he plays the father-figure role, too, for <a href=\"https://georgelakoff.com/2016/03/02/why-trump/\">voters</a>. He puts on a show. This is how a father talks to children he loves. You can hear it in his speech, not in the words, but in how he relates. If you ignore the words he's a pretty nice guy. The kind of dad who'd throw around a football with you on a Saturday. Maybe more like a fun uncle. But in real life, he's <a href=\"https://en.wikipedia.org/wiki/Baby_Huey\">Baby Huey</a>. Actually an evil Baby Huey. Not a good thing.",
            "created": "Fri, 25 Aug 2017 15:51:09 GMT"
        }
    ]
}