{
    "text": "We need to change the subject",
    "created": "Thu, 20 Jan 2022 13:41:46 GMT",
    "type": "outline",
    "description": "Four more Senators and hold the House, and you can have it all.",
    "metaImage": "http://scripting.com/images/2022/01/20/horseRace.png",
    "subs": [
        {
            "text": "The press is stuck in a rut. Everything is about Biden and the various horse races. But that isn't what matters. What matters is that we don't become a fascist country with slavery for Blacks, ovens for Jews and women turned into baby-producing handmaidens. Also a human-habitable planet would be nice. Focus on these things. This is what matters, not that random journalists earn a salary for flushing America down the toilet. ",
            "created": "Thu, 20 Jan 2022 13:41:55 GMT",
            "flInCalendar": true
        },
        {
            "text": "I was watching <a href=\"https://en.wikipedia.org/wiki/Ari_Melber\">Ari Melber</a> last night. The only reason I didn't turn it off is because he had <a href=\"https://en.wikipedia.org/wiki/James_Carville\">James Carville</a> on. Melber is entertaining and sometimes interesting, but usually just repeats the same bullshit night after night all the while claiming to be a journalist. He's an entertainer. But Carville, while also very entertaining, actually has ideas that you don't hear all the time on cable and in the NYT etc. More Carville please. ",
            "created": "Thu, 20 Jan 2022 13:43:57 GMT",
            "flInCalendar": true
        },
        {
            "text": "Here's what Carville says. ",
            "created": "Thu, 20 Jan 2022 13:45:17 GMT",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "The Dems are actually doing okay. ",
                    "created": "Thu, 20 Jan 2022 13:45:23 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "They would do better if there were a few more Dems in the Senate, and also in the House. ",
                    "created": "Thu, 20 Jan 2022 13:45:34 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "So the campaign, he says, should be about what they can do for us, workers, families. And they have quite a few things they want to do for us, s<i>o sell those things!</i> Man, sometimes it's so simple when you get a clear thinker who doesn't have anything in particular to sell and doesn't give a shit if you like him (and we do like him, he's a <a href=\"https://en.wikipedia.org/wiki/Coonass\">coonass</a> after all). ",
                    "created": "Thu, 20 Jan 2022 13:45:49 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Four more Senators and hold the House, and you can have it all. So we can do some very specific things <i>for you.</i>",
                    "created": "Thu, 20 Jan 2022 14:08:20 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "It's so logical. Get actors, great ones, who look like Democratic voters, and run ads that say what Carville says they should say, and let's have the slogan be something like this. You have the power, for real. Just vote, and we all win. Yeah it could be shorter. Use the last three words. We All Win. Come on, that's what it's about. I would give the max to fund such a campaign and so would a lot of people. The ads sell more ads. And the call to action is: Make a difference and vote. ",
            "created": "Thu, 20 Jan 2022 13:47:15 GMT",
            "flInCalendar": true
        },
        {
            "text": "Run the same ad with different faces. Surprise us, have one with Stacey Abrams or Val Demings. Run it over and over. We all win. We all win. Over and over. Buttons, bumper stickers, flags, lawn signs. We all win everywhere all the time. Basketball games. Hockey games. Football, baseball. County fairs. ",
            "created": "Thu, 20 Jan 2022 13:55:34 GMT",
            "flInCalendar": true
        },
        {
            "text": "Because we all want to feel we can do good. Maybe not all of us, but I suspect a lot of Trump voters while they may be racist (face it, we're a racist country, so you have to work really hard to <i>not</i> be racist) what they really want is this: To make a difference. Trump filled a vacuum, the Democrats while they care about us in the aggregate, never get that we are individuals and we want to make a difference. We all want to know there's something we can do to help us all win. If you want to win, Mr or Ms Democrat, you have to bring the people into your marketing. And then, if you want to keep governing and not be completely obstructed, you have to bring us into governing too. The mistake that Obama made was not bringing the people into his administration. McConnell and his fascist Federalists wouldn't have been able to stand up to him if he had us behind him. No Democrat should ever try to do that again (though Biden is doing it too). ",
            "created": "Thu, 20 Jan 2022 13:48:58 GMT",
            "flInCalendar": true
        },
        {
            "text": "We all win. Tatoo that on your forehead.",
            "created": "Thu, 20 Jan 2022 13:58:31 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}