{
    "text": "Tomorrow is the NBA Draft and the deals are flying. It should be amazing. After yet another Knickless playoff season, it's interesting to see them back in the conversation somewhat. There were a lot of stupid dreams about the Knicks buying a contending team with their cap space. That's off the table because even Kawhi couldn't turn this team into a contender. The Knicks are in a rebuild, have been for many seasons, and no amount of dealing is going to make them a contender. Even the 76ers and Celtics who played it smart aren't contending yet. But at least they give their fans something to root for. The Celtics should be glad to be rid of Kyrie. Last year's team was much more interesting. Re-sign Horford and trade <a href=\"https://en.wikipedia.org/wiki/Gordon_Hayward\">Hayward</a> for draft picks. The most intriguing idea I heard for the Knicks is to pick up <a href=\"https://www.nydailynews.com/sports/basketball/knicks/ny-knicks-chris-paul-kevin-durant-dennis-smith-jr-20190618-bwla5ckvffe5zehjyrmse3iqfq-story.html\">Chris Paul</a> on waivers (haha not going to happen) or take on his awful 3-year deal, and get them to throw in <a href=\"https://en.wikipedia.org/wiki/Clint_Capela\">Capela</a>, say. In return they get a few mediocre young players that didn't work out (pretty much anyone on the current roster). And then what the hell, sign <a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+%22carmelo+anthony%22&t=hj&ia=web\">Melo</a> and let him play out his career in the Garden. It's not like anything else is going to happen here for the forseeable future. Sign <a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+%22jeremy+lin%22&t=hj&ia=web\">Jeremy Lin</a> (he can bring his new trophy) and <a href=\"http://scripting.com/2019/06/16.html#a155755\">D'Angelo Russell</a>, and we might even make the postseason. It'll certainly be entertaining basketball. :basketball:",
    "created": "Wed, 19 Jun 2019 14:53:47 GMT",
    "type": "outline",
    "image": "http://scripting.com/images/2017/11/15/kristaps.png"
}