{
    "text": "Worldle and Wordle",
    "created": "Fri, 11 Mar 2022 16:07:26 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I play both these games it seems every day. ",
            "created": "Fri, 11 Mar 2022 16:07:32 GMT",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://worldle.teuteuf.fr/\">Worldle</a> is the less famous of the two. It displays a map of a country at the top of the screen. As with Wordle you guess what the country is in a stack of six boxes. It tells you how close you are for each guess, what direction the correct country is in and a percentage representing how close you got, 100 percent is perfect, the furthest you can be is 50 (I assume). ",
            "created": "Fri, 11 Mar 2022 16:07:50 GMT",
            "flInCalendar": true
        },
        {
            "text": "The correct answer is 5398km from Bermuda, due east.",
            "created": "Fri, 11 Mar 2022 16:32:52 GMT",
            "inlineImage": "http://scripting.com/images/2022/03/11/worldleLineScreen.png",
            "flInCalendar": true
        },
        {
            "text": "There's a lot of info you don't get, most important is the scale of the map. It could be 1000 miles or 3 miles wide. There are a lot of countries that are islands in the Pacific, Carribbean or Indian oceans. They have unique shapes just like the bigger countries. Although I think I have a good grasp of geography from having loved maps as a kid, there a lot more countries than I ever realized. For example, get out a <a href=\"https://geology.com/world/cia-africa-map.shtml\">map of Africa</a> sometime and ponder. The names may be familiar, but I had little sense of relative position or the shape of most of them. It's also fun to try to figure out where the ocean is based on the shape of the borders. There are no straight edge shorelines as far as I know. Some of the puzzles are easy, like Indonesia or Poland, and some are surprisingly difficult, like Greece. Did you know there's an island country in the English Channel? I didn't. ",
            "created": "Fri, 11 Mar 2022 16:32:50 GMT",
            "image": "http://scripting.com/images/2022/03/11/todaysCountry.png",
            "flInCalendar": true
        },
        {
            "text": "Spoiler! Here's a <a href=\"http://scripting.com/images/2022/03/11/worldlerSolution.png\">screen shot</a> of today's puzzle, I just guessed wildly in the last slot, knowing Spain was wrong. I basically gave up.",
            "created": "Fri, 11 Mar 2022 16:28:43 GMT",
            "flInCalendar": true
        },
        {
            "text": "Today's <a href=\"https://www.nytimes.com/games/wordle/index.html\">Wordle</a> puzzle really screwed with a lot of people's heads, mine too. I was lucky, my strategy made it possible to solve this puzzle, though in general I get lower scores overall because of the way I do it. For the first two or three guesses, I'm not trying to solve the puzzle, just trying to find out which vowels are in the answer, and to eliminate most of the popular consonants. So in today's puzzle when I had two slots left, I had the last four letters right (as did most people) but unlike the others, I only had two possible choices left for the first letter. I guessed incorrectly first, and then got the correct answer in the sixth slot. Wordle's comment was <i>whew.</i> Indeed.",
            "created": "Fri, 11 Mar 2022 16:12:59 GMT",
            "image": "http://scripting.com/images/2022/03/11/wordleSolution.png",
            "flInCalendar": true
        },
        {
            "text": "BTW, my standard first word these days is <span style=\"font-size: 0.8em\">PENIS</span>. I like it because it's got two vowels and three popular consonants.",
            "created": "Fri, 11 Mar 2022 16:15:18 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}