{
    "text": "Morning Coffee Tweets",
    "created": "Mon, 01 Jun 2020 14:26:21 GMT",
    "type": "outline",
    "metaImage": "http://scripting.com/images/2020/06/01/whiteHouseWithNoLightsLastNight.png",
    "description": "Today feels like 9.11.2001.",
    "subs": [
        {
            "text": "I make a point of RTing people who are:  ",
            "created": "Mon, 01 Jun 2020 14:26:35 GMT",
            "flNumberedSubs": "true",
            "subs": [
                {
                    "text": "Smart.",
                    "created": "Mon, 01 Jun 2020 14:26:43 GMT"
                },
                {
                    "text": "Creative.",
                    "created": "Mon, 01 Jun 2020 14:26:51 GMT"
                },
                {
                    "text": "Have no stake in returning to how things were before Trump, Barr, Covid-19. ",
                    "created": "Mon, 01 Jun 2020 14:26:44 GMT"
                }
            ]
        },
        {
            "text": "Most people who do have a stake fill the pipe with punditry that confirms their desire to return to the G.O.D's. *",
            "created": "Mon, 01 Jun 2020 14:27:30 GMT"
        },
        {
            "text": "People who are unemployed and either insolvent, approaching insolvency, or who have \"essential\" jobs, have every right to tear down the system because it has written them off as expendable. If the system had no use for me, and I had the strength to tear it down, I would too.",
            "created": "Mon, 01 Jun 2020 14:27:55 GMT"
        },
        {
            "text": "That's why this struggle is no longer just about race. Which is good for blacks, in a perverse way, because now a lot more people are in the same boat, with lives that don't matter. And given the Repubs' unwillingness to fund local government, that includes cops too, btw.",
            "created": "Mon, 01 Jun 2020 14:28:10 GMT"
        },
        {
            "text": "Another thing -- for a long time I've felt we needed to have a constant citizen's presence on the streets in DC. I had given up on the idea once Covid-19 came along. ",
            "created": "Mon, 01 Jun 2020 14:40:29 GMT"
        },
        {
            "text": "But guess what -- <i>it happened anyway.</i> :boom:",
            "created": "Mon, 01 Jun 2020 14:40:36 GMT"
        },
        {
            "text": "They turned the lights off in the White House and Trump went to the bunker. He's just Captain Queeg, Old Yellow Stain himself, scared of the people he was elected to (in his mind) rule.",
            "created": "Mon, 01 Jun 2020 14:41:02 GMT"
        },
        {
            "text": "Last night. The White House with the lights turned off.",
            "created": "Mon, 01 Jun 2020 14:50:25 GMT",
            "inlineImage": "http://scripting.com/images/2020/06/01/lightsOffWhiteHouse.png"
        },
        {
            "text": "I wonder how well Mitch McConnell slept last night. ",
            "created": "Mon, 01 Jun 2020 14:41:11 GMT"
        },
        {
            "text": "During Vietnam we used to chant \"Bring the war home.\""
        },
        {
            "text": "Well it's happening again. When the people of government feel the fear we feel, then you've set up inevitable change, right now, in June 2020.",
            "created": "Mon, 01 Jun 2020 15:03:46 GMT"
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1267483078018109447\">Poll</a>: Will Trump resign today, tomorrow or next week?",
            "created": "Mon, 01 Jun 2020 15:03:47 GMT"
        },
        {
            "text": "If he had a <i>tiny</i> bit more imagination he could have seen CV-19 as the biggest opportunity any president ever had. He wouldn't have had to have developed any empathy, just pure greed. Imagine how dependent we would be if he had saved our lives. He'd win in a landslide.",
            "created": "Mon, 01 Jun 2020 15:07:49 GMT"
        },
        {
            "text": "A police car burns last night in NY.",
            "created": "Mon, 01 Jun 2020 15:05:33 GMT",
            "inlineImage": "http://scripting.com/images/2020/06/01/nypdBurns.png"
        },
        {
            "text": "*good old days",
            "created": "Mon, 01 Jun 2020 14:27:28 GMT"
        }
    ]
}