{
    "text": "Thanksgiving",
    "created": "Thu, 25 Nov 2021 13:26:38 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "<a href=\"http://scripting.com/2020/11/26.html\">Last year on Thanksgiving</a> we were in the midst of the worst of the pandemic, and the best we could do is stay home and hope we don't get infected. This year it's very different -- thanks to the vaccine. I got my first dose of Moderna on January 20, the day we inaugurated the first post-insurrection president. What a relief, in two ways. The Orange Tyrant who tried to overthrow the US government was gone, and I was on my way to being protected from the virus he let run rampant through the country we all have been told is the greatest on earth, but did the worst job of protecting its citizens. I hope that was the low point, but who knows!",
            "created": "Thu, 25 Nov 2021 13:26:41 GMT",
            "flInCalendar": true
        },
        {
            "text": "I also was thankful for my car. It's funny that I thought about <a href=\"http://scripting.com/2020/11/26.html#a201945\">that post</a> just the other day driving my new Tesla around the neighborhood, marveling at its intelligence, muscle, and how much it is like the computers I use, the exercise bike I just bought, and the phone I carry everywhere with me. The Silicon Valley design ethos, which I am schooled in and in a small way helped develop, is eating the world, as venture capitalist Marc Andreessen <a href=\"https://techcrunch.com/2016/06/07/software-is-eating-the-world-5-years-later/\">said</a> so well. The <a href=\"http://scripting.com/2020/11/26.html#a201945\">Subaru</a> I drove last year is a fine machine, and in some ways it's more comfortable than the Tesla, and it'll probably do better if we get a blizzard in the mountains. But its software is a jumble of poorly designed components that don't work well with each other from a UI standpoint. In that area the Tesla is perfect. It's a system designed to be understood by a modern user. The pre-Tesla car manufacturers have a long way to go to catch up to Tesla. ",
            "created": "Thu, 25 Nov 2021 13:30:20 GMT",
            "flInCalendar": true
        },
        {
            "text": "I am thankful for the first users of Drummer. We have reached a critical mass where I can add features, and get feedback from users, and that gives us the ability to move forward. I think this happened because I decided to put my head down on Drummer and work until it was really ready. There still are problems with the software, it is far from perfect, and I'm thankful for the users' patience, but mostly I'm thankful that there are users to be patient. ",
            "created": "Thu, 25 Nov 2021 13:38:02 GMT",
            "flInCalendar": true
        },
        {
            "text": "At 66, health is no longer something I can take for granted. it takes work to keep going, and I've had my troubles this year, but basically I'm still here, and most of my body is working fine. I'm thankful for that. ",
            "created": "Thu, 25 Nov 2021 13:40:09 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}