{
    "text": "Paradox in social custom",
    "created": "Thu, 25 Nov 2021 14:41:41 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "An example of a social custom from two points of view.",
            "created": "Thu, 25 Nov 2021 14:41:50 GMT",
            "subs": [
                {
                    "text": "It's wrong to bring sex into a work relationship. ",
                    "created": "Thu, 25 Nov 2021 14:42:18 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I think it's equally wrong to bring business into a sexual relationship.",
                    "created": "Thu, 25 Nov 2021 14:42:47 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "It has happened, esp in Silicon Valley or New York, when a woman I was dating, or interested in dating, revealed that she was really there for the business. I want to understand up front. If it's business, fine -- I'll evaluate it one way, if it's sexual, another. It's a really awkward situation where someone I was attracted to sexually, wants to do business -- and wouldn't have gotten a meeting if it were clearly about business. ",
            "created": "Thu, 25 Nov 2021 14:43:11 GMT",
            "flInCalendar": true
        },
        {
            "text": "Honestly I think the two sides are the same thing, but we view one as wrong, and don't have explicit rules for the second. ",
            "created": "Thu, 25 Nov 2021 14:51:01 GMT",
            "flInCalendar": true
        },
        {
            "text": "Another example.",
            "created": "Thu, 25 Nov 2021 14:44:33 GMT",
            "subs": [
                {
                    "text": "If you work for me, or we're equals in a business relationship, either way -- no one is accountable to the other for what they do with personal time. Your boss can't call you up on the weekend and expect you to tell them what you're doing. You don't have to tell them anything, unless it impacts your ability to do the work.  ",
                    "created": "Thu, 25 Nov 2021 14:44:44 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I think it's equally wrong when a person who reports to me, or is an equal, reports to me on what they're doing in their personal time. It creates a conflict, am I expected to reciprocate, because I won't. I draw a solid line between work and personal time. If I share personal things in a work context, they are no longer personal.",
                    "created": "Thu, 25 Nov 2021 14:45:47 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "These concerns are spelled out more carefully in professions like medicine, academics, law. A therapist isn't allowed to date a patient. A lawyer can't represent both sides in a legal battle. When the lines cross, there's trouble ahead. ",
            "created": "Thu, 25 Nov 2021 14:47:09 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}