{
    "text": "My immunity",
    "created": "Fri, 12 Feb 2021 16:40:54 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Next week I'm getting the second dose of the Moderna vaccine. ",
            "created": "Fri, 12 Feb 2021 16:40:58 GMT",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "I had mild side-effects with the first shot, which I got on January 20, also Inauguration Day. I expect it to be worse this time, but I'm excited and a little disoriented by the new reality. ",
                    "created": "Fri, 12 Feb 2021 16:42:18 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "A couple of weeks later, say by March 3, according to the science, I will be at 95% immunity. This means the probability of me getting infected, everything else constant, is only 5% of what it was before January 20.",
                    "created": "Fri, 12 Feb 2021 16:41:36 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "A bit of info I don't have -- if I were to get infected would it be less likely to be severe or deadly?",
                    "flInCalendar": true
                },
                {
                    "text": "Of course I'm going to continue to be masked. I ordered some new Docker brand masks for the event. ",
                    "created": "Fri, 12 Feb 2021 16:45:43 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "What should I risk after immunity? Go to the movies? Drive down to the city, just to get some bagels perhaps or ride a CitiBike in Central Park? These would seem very exotic now. ",
                    "created": "Fri, 12 Feb 2021 16:44:15 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It's been 1.5 years since I've been to a city larger than Kingston, NY. I'm actually quite happy about that. I like life in the mountains.  ",
                    "created": "Fri, 12 Feb 2021 16:44:26 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Suggestion to movie theater owners. Offer 1/2 price to anyone who is fully vaccinated. Or Olive Garden, or Applebee's.",
                    "created": "Fri, 12 Feb 2021 17:12:01 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "And yes this is yet another boomer privilege. It's fair to hate me but only for this. :rocket:",
                    "created": "Fri, 12 Feb 2021 16:44:49 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}