{
    "created": "2022-09-11T04:00:00.000Z",
    "flInCalendar": true,
    "name": "11",
    "path": "2022/09/11",
    "text": "September 11",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Today we commemorate a horrific event <a href=\"http://scripting.com/2001/09.html\">21 years ago</a>. The pandemic is orders of magnitude more devastating than that event. And it's ongoing. It's still killing massive numbers of people and destroying lives.",
            "created": "Sun, 11 Sep 2022 14:37:35 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Trump is responsible for over a million American deaths. He knew how deadly the virus is, and did nothing to protect the country. Yes, he must be punished for trying to overthrow the government, but don't forget all the American death and suffering he's responsible for. ",
            "created": "Sun, 11 Sep 2022 13:03:51 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "New strategy for feed text",
            "created": "Sun, 11 Sep 2022 14:55:50 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "In the new feed management system, instead of stripping all HTML from the descriptions of feed items, we're now allowing &lt;p>s to get through. I want to have full text in my rivers, with a MORE icon that lets you see all the text. So the flow isn't dominated by long posts, but the text is there if you want to read it.",
                    "created": "Sun, 11 Sep 2022 14:59:25 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "But I don't want all the quasi-malware that comes with feeds these days. My plan was to strip all the markup, but it really wasn't workable without the &lt;p> elements. ",
                    "created": "Sun, 11 Sep 2022 15:13:42 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I put out my <a href=\"https://github.com/scripting/Scripting-News/issues/215#issuecomment-1242749537\">braintrust query</a> yesterday and got two good answers. Use regex or the the <a href=\"https://github.com/apostrophecms/sanitize-html\">sanitize-html</a> Node package. I went with the Node package. It builds on a full HTML parser, so it's legit technology, not a hack (though I was happy to use a hack, have been for years). ",
                    "created": "Sun, 11 Sep 2022 15:01:43 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Here's the <a href=\"http://scripting.com/images/2022/09/11/before.png\">before</a> and <a href=\"http://scripting.com/images/2022/09/11/after.png\">after</a> in screen shots. ",
                    "created": "Sun, 11 Sep 2022 15:02:52 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It was a good call. I thought about enabling other HTML elements, but decided to stop here for now. ",
                    "created": "Sun, 11 Sep 2022 15:12:20 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PS: Recall we already have <a href=\"http://scripting.com/2022/07/19/152235.html?title=devNotesForMarkdownInRss\">support for Markdown</a> in the feed system. So there's an even better way for friendly feed writers to do this, rather than trying to gum things up so badly that all we can do is nuke <s>all</s> most of the markup. :boom:",
                    "created": "Sun, 11 Sep 2022 15:15:42 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "A testbed for HTML in feeds",
            "created": "Sun, 11 Sep 2022 15:35:21 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Here's a <a href=\"http://drummer.scripting.com/?url=http://scripting.com/publicfolder/misc/stripMarkupInFeedItems/source.opml\">link that opens in Drummer</a>. It contains the package.json, a template file and the JS code that reads an RSS feed and produces an HTML rendering of the items in the feed after running the description text through sanitize-html with the p's removed. Once written it made it easy for me to try out a lot of different combinations for the options, but I settled on the simplest.",
                    "created": "Sun, 11 Sep 2022 15:35:46 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It uses the <a href=\"https://github.com/scripting/reallysimple\">reallySimple package</a> to read the feed, and is thus a good demonstration of how easy that is.",
                    "created": "Sun, 11 Sep 2022 15:37:14 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I usually would have done the work to put it into a GitHub repo, but this is a lot easier for me, because this is how I work on my code.",
                    "flInCalendar": true
                },
                {
                    "text": "If people can read the code in the outliner (you can!), that will make it possible for me to share a lot more code. :-)",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}