{
    "created": "2022-09-22T04:00:00.000Z",
    "flInCalendar": true,
    "name": "22",
    "path": "2022/09/22",
    "text": "September 22",
    "type": "calendarDay",
    "subs": [
        {
            "text": "A short <a href=\"http://scripting.com/2022/09/22/thatsJustWhatMyFriendDaveDoes.m4a\">podcast</a> about being your own best friend. ",
            "created": "Thu, 22 Sep 2022 22:03:08 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2022/09/22/thatsJustWhatMyFriendDaveDoes.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "3016806",
            "flInCalendar": true
        },
        {
            "text": "Hope all is well",
            "created": "Thu, 22 Sep 2022 15:42:50 GMT",
            "type": "outline",
            "description": "\"Hope all is well\" is just a nicety, it doesn't require a response, it isn't competitive",
            "subs": [
                {
                    "text": "I have a friend whose name I won't say, who, if I say, at the end of an email, hope all is well, gives a balance sheet of what's good and not good in their life. ",
                    "created": "Thu, 22 Sep 2022 15:42:54 GMT",
                    "image": "http://scripting.com/images/2022/09/22/ioffeeHead.png",
                    "flInCalendar": true
                },
                {
                    "text": "I find this so disturbing. I always have -- I'm not sure what to do, am I supposed to give them an accounting of my life, here's the good and the bad. If I do that do I have to make my story sound like their story, mostly very good but just a little bad to make it seem real.",
                    "created": "Thu, 22 Sep 2022 15:44:21 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Now that I'm older it's disturbing for other reasons. Who cares whether it's good or bad, nothing is either good or bad, or everything is bad, and everything is good. It's hubris to be in the business of judging good or bad. The universe is billions of years old. Everything you think is good or bad actually is irrelevant. See that's the joke. What you think matters, only matters to you. ",
                    "created": "Thu, 22 Sep 2022 15:45:00 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "\"Hope all is well\" is just a nicety, it doesn't require a response, it isn't competitive -- if you want to expand it -- it means life can be a drag I know but I am thinking good thoughts about you, so at least that is something you don't need to add to your worries. ",
                    "created": "Thu, 22 Sep 2022 15:46:20 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Hope all is well. :smile:",
                    "created": "Thu, 22 Sep 2022 15:46:55 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "It's a sitcom",
            "created": "Thu, 22 Sep 2022 13:46:54 GMT",
            "type": "outline",
            "description": "Didn't need no welfare state. Everybody pulled his weight. Gee our old LaSalle ran great.",
            "metaImage": "http://scripting.com/images/2022/09/22/archieEdith.png",
            "subs": [
                {
                    "text": "Trump says that the FBI was really looking for Hillary's emails when they searched Mar A Lago.",
                    "created": "Thu, 22 Sep 2022 13:48:15 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "That's what they'd say on a sitcom.",
                    "created": "Thu, 22 Sep 2022 13:52:27 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The person who plays the ex-president, deep in dog-doo -- he'd say something like that. ",
                    "created": "Thu, 22 Sep 2022 13:54:54 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "This reaffirms my belief that the Trump voter can't tell the difference between a president and a person playing president in a sitcom.",
                    "flInCalendar": true
                },
                {
                    "text": "Not sure that the anti-Trump voter is all that different, btw -- we seem to like watching the comedy of it. Watch Chris Hayes when he talks about Trump. He's not grim, he's usually laughing, and so are his guests (not all of them, I've never seen <a href=\"https://twitter.com/ElieNYC\">@elieNYC</a> laugh at this kind of stuff). ",
                    "created": "Thu, 22 Sep 2022 14:29:52 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}