{
    "created": "2022-09-23T04:00:00.000Z",
    "flInCalendar": true,
    "name": "23",
    "path": "2022/09/23",
    "text": "September 23",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I saw a reference to <a href=\"https://www.aboutamazon.com/news/tag/project-kuiper\">Project Kuiper</a>, thought it was interesting, looked it up <a href=\"https://www.google.com/search?q=project+kuiper\">on Google</a>, first link was to an Amazon news page. I thought of subscribing to it, but only found a link to an email service. Which led me to another question, I <a href=\"https://twitter.com/davewiner/status/1573362670379716608\">wonder</a> if other tech companies might have \"RSS\" feeds for their corporate announcements. Maybe Apple, Google, Microsoft, Netscape, Spotify. I've become inquisitive about this again. PS: I was able to create a <a href=\"https://www.google.com/alerts/feeds/16275940053249417217/456631927723350186\">feed</a> for this via Google Alerts. :smile:",
            "created": "Fri, 23 Sep 2022 17:21:29 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2022/09/23/baratunde.png",
            "flInCalendar": true
        },
        {
            "text": "Despite what Tim Snyder <a href=\"https://twitter.com/TimothyDSnyder/status/1572988432212963329\">wrote</a> about the obscenity of what Russia is doing with \"referendums\" -- on NPR today they reported it straight. You can get them to say anything you want. Russia doesn't even control the territory they're claiming as part of Russia! BTW, I finished the <a href=\"http://scripting.com/2022/09/21.html#a152255\">Ken Burns</a> special on the Holocaust and the US. The Nazis did something similar with the press. If the US did something to help Jews, they'd run press releases saying \"See, the Jews really do run the world, just like we said!\" So the US didn't help Jews. And apparently that's not the whole story. There were Nazis in the <a href=\"https://en.wikipedia.org/wiki/Breckinridge_Long#FDR_administration_and_World_War_II\">State Department</a>, at high levels. We also let Nazis emigrate to the US after the war, and turned away Jews -- because the Nazis were anti-Communist. I think we should consider giving back the <a href=\"https://en.wikipedia.org/wiki/Statue_of_Liberty\">Statue of Liberty</a>. ",
            "created": "Fri, 23 Sep 2022 13:29:47 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I don't like it when people I follow, who are smart and funny and make a contribution, RT their abusive replies. Puts me in a tough position, I can't tell them to stop and I don't want to unfollow them. Really the <i>only</i> thing to do with people who sent abusive tweets is to downvote them (a new Twitter feature) and then block them. The <i>last</i> thing you want to do is promote them. That will just get you more abuse and it stinks up everyone else's timeline. ",
            "created": "Fri, 23 Sep 2022 13:15:57 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}