{
    "text": "How to improve Twitter in 2018",
    "created": "Sun, 22 Jul 2018 15:53:44 GMT",
    "type": "outline",
    "description": "Eliminate the char limit, help news orgs evolve, make an irreversible deal with developers.",
    "subs": [
        {
            "text": "So Jack Dorsey is looking for ways to improve Twitter. ",
            "created": "Sun, 22 Jul 2018 15:53:55 GMT"
        },
        {
            "text": "There are three I can think of:",
            "created": "Sun, 22 Jul 2018 15:54:04 GMT",
            "flNumberedSubs": "true",
            "subs": [
                {
                    "text": "Eliminate the character limit, allow for linking, simple styles, titles and enclosures (for podcasting). The move to 280 chars was so successful, that should be a clue. Remove the barriers to expression and let the whole web in via linking. Handle length the way Facebook does with a <a href=\"http://scripting.com/2015/10/02/whatWouldAFatTweetLookLike.html\">see more</a> link. It's good prior art. ",
                    "created": "Sun, 22 Jul 2018 15:54:17 GMT"
                },
                {
                    "text": "Help news orgs create collections of news feeds for people to follow on Twitter and on the open web. I think ultimately that's what news orgs will become. Experts on where to find the people who are saying newsworthy stuff. It's not much of an evolution, it's what they've been doing for as long as I can remember. The web gives us the ability to create new structures for that. Since Twitter is a place people go for news, it's a natural evolution for Twitter. I have a <a href=\"http://scripting.com/2018/07/13/175214.html\">roadmap</a> for how to do this.",
                    "created": "Sun, 22 Jul 2018 15:54:19 GMT"
                },
                {
                    "text": "Make a commitment to developers and make it irreversible. What exactly this means is subject to negotiation. But no one company can do what a medium does. As great a company as Twitter might be, its not something companies were meant to do, imho.",
                    "created": "Sun, 22 Jul 2018 15:54:21 GMT"
                }
            ]
        },
        {
            "text": "Bonus: A new rule. For every original tweet you write you have to RT someone else's.",
            "created": "Sun, 22 Jul 2018 16:06:10 GMT"
        }
    ]
}