{
    "text": "December 2",
    "created": "Mon, 02 Dec 2019 13:55:52 GMT",
    "name": "02",
    "subs": [
        {
            "text": "Tooting my own horn a bit: John Naughton calls me a <a href=\"http://scripting.com/images/2019/12/02/guardianScreen.png\">genius</a> in this <a href=\"https://www.theguardian.com/commentisfree/2019/nov/30/podcasting-fifteenth-years-old-corporate-greed-threat\">Guardian piece</a>. I'll take it, to balance all the other things people have called me. :boom:",
            "created": "Mon, 02 Dec 2019 18:20:26 GMT",
            "type": "outline",
            "urlexpandableimage": "http://scripting.com/images/2019/12/02/guardianScreen.png"
        },
        {
            "text": "When did it become even thinkable that a president would publicly <a href=\"https://www.vice.com/en_us/article/xwen5j/trumps-fake-orgasm-is-what-got-fbi-lawyer-lisa-page-to-break-her-silence\">fake an orgasm</a> to humiliate a woman who works at the FBI, for him. This is the moment for our Republican friends, if we have any left, to wake the fuck up and realize what you're endorsing.",
            "created": "Mon, 02 Dec 2019 18:14:31 GMT",
            "type": "outline"
        },
        {
            "text": "There comes a point where our minds are closed, we're not interested in considering there might be an innocence for people who stand by Trump. We're over that line now. You're dragging the rest of us to hell and we don't want to go there. Republicans this is on you.",
            "created": "Mon, 02 Dec 2019 18:16:58 GMT",
            "type": "outline"
        },
        {
            "text": "I live in a Hallmark greeting <a href=\"https://www.youtube.com/watch?v=CdqG44xZXQs\">card</a>. ",
            "created": "Tue, 03 Dec 2019 01:28:31 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=CdqG44xZXQs"
        },
        {
            "text": "<a href=\"https://en.wikipedia.org/wiki/Subornation_of_perjury#In_legal_practice\">Suborning perjury</a> is not just an issue for lawyers, Reporters have an obligation, if they know a subject is going to lie, to not put them on the air. ",
            "created": "Tue, 03 Dec 2019 01:50:01 GMT",
            "type": "outline"
        },
        {
            "text": "I’d like to see a courageous journalist tackle <a href=\"https://twitter.com/JRubinBlogger/status/1201503802735693825\">this</a> story. Why do Repub politicians sound like Russians? I’d like to know. Note I use the word <i>courageous</i> sarcastically. There's nothing courageous about investigating an obvious question. It's ridiculous that not one reporter has done this story. It's a scandal happening out in the open. But it doesn't fit a model that reporters know: it's not a horse race, and it's not a replay of Watergate.",
            "created": "Mon, 02 Dec 2019 14:05:41 GMT",
            "type": "outline"
        },
        {
            "text": "BTW there is precedent for turning off Repubs on CNN and MSNBC. They went through this in Ukraine. They thought they could be fair and balanced, that just let trolls keep an attack vector. Ultimately you have to close it. Journalism will do some growing up before that. ",
            "created": "Mon, 02 Dec 2019 18:35:10 GMT",
            "type": "outline"
        },
        {
            "text": "When I was a kid I participated in several <a href=\"https://en.wikipedia.org/wiki/List_of_rallies_and_protest_marches_in_Washington,_D.C.#1950%E2%80%931999\">marches</a> on Washington. We took buses from NYC. On one of them, I was part of the organizing committee, I was the political guy on the trip, even though I was just 16. One of the passengers, the mother of a high school friend, said I should get up and give a peptalk and lead a discussion on behalf of the organizers. I gave the talk, it wasn't very good, but I remembered the idea. Any good protest needs organizers. When I turn on MSNBC in the evening I keep hoping they'll cross the line, and start helping us, instead of being with us in desperation waiting for someone to help us. They have the pulput. Putin has Trump. Who does Putin's American opposition have? Someone with courage, a spine, and a sense that it is his or her destiny to lead us out of the wilderness.",
            "created": "Mon, 02 Dec 2019 15:14:29 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/12/02/moses.png"
        },
        {
            "text": "<a href=\"https://en.wikipedia.org/wiki/John_Gall_(author)#Gall's_law\">Gall's Law</a>: \"A complex system that works is invariably found to have evolved from a simple system that worked. A complex system designed from scratch never works and cannot be patched up to make it work. You have to start over with a working simple system.\"",
            "created": "Mon, 02 Dec 2019 13:55:53 GMT",
            "type": "outline"
        }
    ]
}