{
    "text": "December 3",
    "created": "Tue, 03 Dec 2019 15:00:21 GMT",
    "name": "03",
    "subs": [
        {
            "text": "An <a href=\"http://scripting.com/2019/12/03/toJackDorsey.m4a\">open podcast</a> to Jack Dorsey, CEO of Twitter. It's way too long and rambles too much, but the idea is imho worth 16 minutes. ",
            "created": "Tue, 03 Dec 2019 15:16:21 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2019/12/03/toJackDorsey.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "8455712"
        },
        {
            "text": "Chrome keeps coming up with new things to complain about my sites. I ignore them. I wonder how many web devs pay attention to Google's complaints?",
            "created": "Tue, 03 Dec 2019 20:55:18 GMT",
            "type": "outline"
        },
        {
            "text": "I had a little health scare a few weeks ago. As you may know, I broke a rib in a <a href=\"http://scripting.com/2019/10/17.html#a125931\">bike accident</a> in September. Mostly healed now. I had to go in for an X-ray and my doctor said there was a shadow that she didn't like. I should go for a CT-scan she said, let's find out what's going on. If it's lung cancer, that's good news, she said, we found it early and it's probably treatable. If we wait for symptoms then it's often not treatable. I smoked for 31 years, she reminded me, in case I was feeling sorry for myself. Heh. So I scheduled the test, had a couple of weeks to think about it. I was obsessed. Maybe she knows and isn't saying until she's absolutely sure. I was convinced that was it, and my life was about to change to the life of a cancer patient. I know a little about it because like pretty much everyone I know people who have cancer. My father died from it. Anyway, no cancer. Knock wood. But I had the benefit of <i>thinking</i> I had it. So I got that experience, without the awful chemo and radiation and possible dying. I feel very lucky. I decided to tell this story now to give you an idea why I don't care that Chrome hates my websites. I do what my doctor says, mostly -- I don't give a shit what Google wants me to do. As Logan Roy <a href=\"https://uproxx.com/tv/succession-hbo-f-ck-off-breakdown/\">says</a>, have a nice day. ;-)",
            "created": "Tue, 03 Dec 2019 20:55:38 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/12/03/doctor.png"
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1201955373277745155\">Poll</a>: How many phones do you carry?",
            "created": "Tue, 03 Dec 2019 20:51:21 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1201955373277745155"
        },
        {
            "text": "You may not like Bloomberg, but <a href=\"https://www.youtube.com/watch?v=j_1T_xPpAwo\">his new ad</a> is the perfect Democratic candidate ad for winning in a landslide.",
            "created": "Wed, 04 Dec 2019 01:47:36 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=j_1T_xPpAwo"
        },
        {
            "text": "<a href=\"https://github.com/scripting/Scripting-News/issues/139\">Interesting point</a>. Brian Kelly thinks Scripting News should not remember the tab you were at from visit to visit.",
            "created": "Tue, 03 Dec 2019 15:37:51 GMT",
            "type": "outline"
        },
        {
            "text": "I encourage readers to see <a href=\"http://scripting.com/\">this blog</a> as a piece of software. If you get an idea on how to improve it, I'm interested in knowing about it. I wrote all the code for it, so I can relatively easily add or tweak features. ",
            "created": "Tue, 03 Dec 2019 15:39:01 GMT",
            "type": "outline"
        },
        {
            "text": "Vulture has a list of lists of <a href=\"https://www.vulture.com/article/best-tv-shows-2019.html\">best TV shows of 2019</a>. I find some of their choices hard to fathom. Deadwood Movie was awful, imho -- and it wasn't a TV show, yet it's on a list. Anyway I'd love to have a list of all the shows so I could pick my own top 10. Amazon, Netflix, HBO, Showtime, Hulu and a few others. I'm sure I only watched about a dozen shows total, no more, so while the list of possible shows is huge, the actual top ten lists wouldn't be that hard to come up with. ",
            "created": "Tue, 03 Dec 2019 15:26:51 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2019/12/03/toJackDorsey.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "8455712"
        },
        {
            "text": "We had a good size winter storm at my country house in the last couple of days. It's the kind of storm that's mostly wet in NYC, where I lived previously, but up here it was first heavy snow, then it got lighter. So the first time I shoveled the walkway to the car it was heavy lifting and the second time, light and easy. Perhaps 1.5 feet of snow. I drove down the road before it was plowed, having an AWD is great, and noted that someone had been cross country skiing on my road, I was envious. I took note of where the tracks came from, and went. The air is cold and clear, it feels like one of those mornings in Utah, it's the best first moment of a day anywhere. Later we'll be on top of the mountain looking down at the village, and thinking man this is as good as it gets. I have to figure out how to either ski or ride my bike in this weather. Probably both. I live about <a href=\"https://www.google.com/maps/dir/Woodstock,+New+York/Belleayre+Mountain+Ski+Center,+181+Galli+Curci+Rd,+Highmount,+NY+12441/@42.0837899,-74.4553503,11z/data=!3m1!4b1!4m14!4m13!1m5!1m1!1s0x89dd0733c0cf4c2b:0xb85cbeef880771fc!2m2!1d-74.1181971!2d42.0409247!1m5!1m1!1s0x89dc5f4e10a1ac2d:0x611c1580c29f8a96!2m2!1d-74.505312!2d42.1322453!3e0\">1/2 hour</a> from a ski area. It isn't Utah, or the Alps, but it is mine. :ski:",
            "created": "Tue, 03 Dec 2019 15:00:22 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/12/03/skier.png"
        },
        {
            "text": "The name of podcasting, part N",
            "created": "Tue, 03 Dec 2019 18:52:06 GMT",
            "type": "outline",
            "description": "This story illustrates how hard it can be to correct a mistake in the public record. ",
            "metaImage": "http://scripting.com/images/2019/12/03/ipod.png",
            "subs": [
                {
                    "text": "I've created commercial products, and no one ever said they named my product ThinkTank, Ready, MORE, Frontier, Manila, Radio UserLand, even if they thought of the name before I did. Because people respect commercial development.  ",
                    "created": "Tue, 03 Dec 2019 18:52:18 GMT",
                    "image": "http://scripting.com/images/2019/12/03/banana.png"
                },
                {
                    "text": "The process for podcasting was no different, except we did it in the open and no one claimed ownership of the resulting product. This is the way new web standards were developed in the late 90s and early 00s. ",
                    "created": "Tue, 03 Dec 2019 18:55:29 GMT"
                },
                {
                    "text": "Hammersley could have helped, but didn't. He made a lucky guess, and for that he deserves credit, but not for naming the product. It's possible that Dannie Gregoire, the person who does deserve the credit, got the idea from Hammersley, but I've never heard him say that. And he put in time and effort to help make podcasting real. So many people who poured their hearts into this work got little or no credit.",
                    "created": "Tue, 03 Dec 2019 19:03:31 GMT"
                },
                {
                    "text": "It has become established that Hammersley named our product, even though <a href=\"https://web.archive.org/web/20130410020053/http://threads2.scripting.com/2013/april/howPodcastingGotItsName\">this is not true</a>. That's the only reason I object. I think the truth matters. ",
                    "created": "Tue, 03 Dec 2019 18:53:01 GMT"
                },
                {
                    "text": "Hopefully this makes it into the Wikipedia piece on the history of podcasting, if not, know that our system of fact checking and truth vetting is about as bad as can be. When <a href=\"https://www.theguardian.com/technology/2019/nov/22/sacha-baron-cohen-facebook-propaganda\">people</a> naively say that Facebook should be able to vet everything for truth, here's something that's easily <a href=\"https://web.archive.org/web/20130410020053/http://threads2.scripting.com/2013/april/howPodcastingGotItsName\">shown</a> to be false, has been contested for years, however the record never gets altered, and reputable reporters still <a href=\"http://scripting.com/2019/11/30.html#a164916\">cite</a> the lie as fact. Probably will continue to for a long time, maybe always. ",
                    "created": "Tue, 03 Dec 2019 18:53:10 GMT"
                }
            ]
        }
    ]
}