{
    "text": "December 5",
    "created": "Thu, 05 Dec 2019 15:04:45 GMT",
    "name": "05",
    "subs": [
        {
            "text": "My friend Yvonne was storing a bunch of boxes for me in Berkeley, and now that I have a house again, she shipped eleven boxes to me via Fedex (see below). I started going through them today and I'm so glad we did this. I had no idea what was in the boxes. I had a vague idea that it was junk, but it was not junk. First I found three quilts my mom made for me. Two of them in really good shape. The third had been chewed by my dog, Bon Bon, back when I lived in Woodside, CA in the early 90s. There were tons of pictures, the old kind, made with film cameras. Friends and relatives long gone, or now much older. Memories. Love and regrets, happy times and sadness, stored in boxes on paper. It all comes flooding back. And notebooks from when I was in grade school. Here's a <a href=\"http://scripting.com/images/2019/12/05/iAmABoy.png\">page</a> from one of them, in 1962, where I'm practicing the most basic writing. Funny thing I remember what this felt like as a seven year old. I loved learning then. We're programmed that way I guess. ",
            "created": "Thu, 05 Dec 2019 21:36:47 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/12/05/movingbox.png"
        },
        {
            "text": "I appreciate people pointing to me when quoting something from my blog, but I prefer you point to the blog and not my Twitter account. My home on the web is my blog, <a href=\"http://scripting.com/\">scripting.com</a>, my Twitter account is a place to record random ideas before they appear on the blog.",
            "created": "Thu, 05 Dec 2019 15:30:38 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://twitter.com/vegan/status/1202621703857278976\">Vegan.com</a>: \"RSS is a crucial technology every activist ought to know about and use.\"",
            "created": "Thu, 05 Dec 2019 16:51:49 GMT",
            "type": "outline"
        },
        {
            "text": "Every so often I get tagged in someone's lament about how no one uses \"RSS\". It's not true. It's one of those things you can't use alone, because it depends on your news sources supporting it. I get most of my news via my rivers, which of course are just aggregations of RSS feeds. I imagine the rivers will survive me. At some point it may not be a fire hose, it may be the way the <a href=\"https://blog.nationalgeographic.org/2014/05/19/a-sacred-reunion-the-colorado-river-returns-to-the-sea/\">Colorado River</a> flows into the ocean, but I think I will never see the day that RSS is gone. It does its work quietly, unlike Twitter or Facebook. It doesn't steal your personal info. Or support Russian hackers. It's quiet. That's okay with me. :boom:",
            "created": "Thu, 05 Dec 2019 15:13:07 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/07/01/loveRss.png"
        },
        {
            "text": "BTW before Russians hacked our meme ecosystem, Google was doing it, and before them Sun, Microsoft, Apple and IBM. Google always felt threatened by \"RSS\". They encircled it and then cut it off. They quietly got their shills in the tech press to talk about its demise. To slam me personally. It's an insidious thing. They still do it. Usually through cutouts, journalists and consultants, and sometimes Google employees. Big tech companies hate open formats and protocols, because they evolve independently of them. They feel they must control everything. It's not smart, wise or even realisitic, but after decades of existing in the <a href=\"https://www.dictionary.com/browse/in--the--wake--of\">wake</a> of <a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+bigco&t=h_&ia=web\">bigco's</a> I know it's as inevitable as the sunset and sunrise cycle. Eventually the lack of flexibility marginalizes the big company, but they don't die, they just keep polluting, they buy politicians and we have to live with the result. ",
            "created": "Thu, 05 Dec 2019 15:19:02 GMT",
            "type": "outline"
        },
        {
            "text": "Speaker Pelosi kicks ass",
            "created": "Thu, 05 Dec 2019 21:53:43 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "“I think the President is a coward when it comes to helping our kids who are afraid of gun violence. I think he is cruel when he doesn’t deal with helping our dreamers of which we are very proud. I think he is in denial about the climate crisis.",
                    "created": "Thu, 05 Dec 2019 21:54:06 GMT"
                },
                {
                    "text": "However, that is about the election. Take it up in the election."
                },
                {
                    "text": "This is about Constitution of the United States and the facts that lead to the President’s violation of his oath of office.”"
                }
            ]
        },
        {
            "text": "Fedex impresses",
            "created": "Thu, 05 Dec 2019 15:04:46 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "As you know I've had <a href=\"http://scripting.com/2019/11/23/125415.html\">trouble with UPS</a>, so I figured when Fedex was set to do a big delivery to my house just after a 1.5 foot snow in the area, that they would never get one of their big delivery trucks down the road to my house, and I'd end up driving somewhere to pick up the packages. But yesterday afternoon there was a knock on the door, and there was the Fedex guy with my packages. Smiling. I couldn't believe it. ",
                    "created": "Thu, 05 Dec 2019 15:04:52 GMT",
                    "image": "http://scripting.com/images/2019/12/05/fedex.png"
                },
                {
                    "text": "The truck said Hertz, not Fedex. It was a small AWD vehicle. He said when they came to deliver the stuff a day before they realized their big truck wouldn't make it down the orad, so they rented a smaller truck and drove that to my house with my package. He said we like to go the extra mile. Yes, they surely do! Compared to UPS, which has basically the same policy, trust the driver, but the ethos of this driver compared to whoever made the call at UPS (basically the customer can fuck off) was night and day. ",
                    "created": "Thu, 05 Dec 2019 15:06:45 GMT"
                },
                {
                    "text": "Hat's off to Fedex. You win this contest, hands down. ",
                    "created": "Thu, 05 Dec 2019 15:08:39 GMT"
                }
            ]
        }
    ]
}