{
    "text": "December 6",
    "created": "Fri, 06 Dec 2019 14:47:40 GMT",
    "name": "06",
    "subs": [
        {
            "text": "The next president has to be boring.",
            "created": "Fri, 06 Dec 2019 22:42:59 GMT",
            "type": "outline"
        },
        {
            "text": "If something truly goes without saying you don’t have to say it.",
            "created": "Fri, 06 Dec 2019 14:49:58 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://github.com/scripting/Scripting-News/issues/140\">Braintrust query</a>: I'm writing docs that include an example of an HTTP request, in Markdown. Can't figure out to do it in MD.",
            "created": "Fri, 06 Dec 2019 18:17:31 GMT",
            "type": "outline"
        },
        {
            "text": "I'm doing a reboot of the <a href=\"http://xmlrpc.scripting.com/spec.html\">XML-RPC</a> website and readying a new JavaScript implementation. I was <a href=\"http://scripting.com/images/2019/12/06/frontierPointer.png\">reminded</a> that the original reference implementation, in 1998, was in UserLand Frontier. The <a href=\"http://frontier.userland.com/reference/xml/xmlRpc/\">docs</a> are still there. 21 years. Not bad.  ",
            "created": "Fri, 06 Dec 2019 17:01:05 GMT",
            "type": "outline"
        },
        {
            "text": "Nancy Pelosi (not a boomer, she was born in 1940) was great yesterday, both in her press conference where she said what is sure to be a famous <a href=\"https://www.theguardian.com/us-news/video/2019/dec/05/dont-mess-with-me-nancy-pelosi-responds-to-reporter-asking-if-she-hates-trump-video\">historic line</a>: \"Don't mess with me\" all the way to the CNN town hall, which I watched, where she asked not to have to look at things through the prism of the White House, which as long as Trump is there is crazy town. She's the leader we didn't know we had. What I admire most about her is her clarity and her ability to think on her feet. Either that or she really prepared for this moment. No matter, she's just what we need right now. A strong woman to stand up to Trump. That's his Kryptonite. ",
            "created": "Fri, 06 Dec 2019 15:13:07 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/12/06/dorothy.png"
        },
        {
            "text": "McKinsey is a management consulting company. Hiring <a href=\"https://www.nytimes.com/2019/12/05/us/politics/pete-buttigieg-mckinsey.html\">someone</a> with experience there means they understand how that part of the world works. I don't think it means their soul is dark, as some people seem to assume.",
            "created": "Fri, 06 Dec 2019 16:59:40 GMT",
            "type": "outline"
        },
        {
            "text": "Important to note the role journalism was ready to play in the Trump plot to throw the 2020 election. <a href=\"https://www.axios.com/fareed-zakaria-zelensky-vlodymyr-cnn-trump-probe-aff098a1-963f-466b-9572-14f767ebb4e7.html\">Fareed Zakaria</a> of CNN would interview Ukraine president Zelensky, where he would say they were investigating \"The Bidens\" for corruption. From there, Trump would ask repeatedly, as with <a href=\"https://duckduckgo.com/?q=%22hillary%27s+emails%22+site%3Ascripting.com&t=hz&ia=web\">Hillary's emails</a> what's the deal, or they're under investigation or his favorite \"I don't know but people are saying.\" That's all that would be needed to keep the \"story\" alive in American journalism. Biden's rep is already tainted. In software we'd consider this a serious vulnerability, and we'd close it asap before our servers were infected again, but journalism just lumbers along oblivious, happy to be used this way. Fake stories don't just enter through the web, Facebook and Twitter, sometimes they enter through the thought-to-be-pure methods of American journalism. ",
            "created": "Fri, 06 Dec 2019 15:34:04 GMT",
            "type": "outline"
        },
        {
            "text": "BTW, <a href=\"https://en.wikipedia.org/wiki/Fareed_Zakaria\">Fareed Zakaria</a>, born in 1964, is a boomer. Joe Biden born in 1942 is not. His son Hunter was born in 1970, not a boomer.  ",
            "created": "Fri, 06 Dec 2019 15:48:26 GMT",
            "type": "outline"
        },
        {
            "text": "Had a brief talk with <a href=\"http://blogs.harvard.edu/doc/2019/12/03/ageism/\">Doc</a> yesterday. He and I of course are <a href=\"https://en.wikipedia.org/wiki/Baby_boomers\">boomers</a>. So is Trump and Rudy G. They were both born a decade before me. Their experience and values are vastly different from mine. There aren't many things you can say about boomers that's true of all boomers except for the period in which we were born (1946-1964) and our parents had sex and a few months later we were born (just like you btw). We come in all sizes and shapes. Some have penises, others have vaginas. Some are black others are white, others are Native American, some are children of Holocaust survivors, and others are Nazis. So many things to say about this, but most importantly the only way we get out of this mess is if we <i>work together. </i>The rest of it is stuff your parents should have taught you. If they're boomers, go ahead and blame them, but don't blame me. I'm not your father. :boom:",
            "created": "Fri, 06 Dec 2019 14:50:24 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/12/06/boom.png"
        },
        {
            "text": "All of a sudden Alexa says Goodbye when I say \"Alexa stop.\" I wish it wouldn't.",
            "created": "Fri, 06 Dec 2019 14:47:41 GMT",
            "type": "outline"
        },
        {
            "text": "Wouldn't it be cool if one of the candidates who have so much criticism for Facebook discovered that there is an open news distribution system, widely supported, ready to work for the people? None of the problems of FB. We're natural allies.",
            "created": "Fri, 06 Dec 2019 14:49:20 GMT",
            "type": "outline"
        }
    ]
}