{
    "text": "December 7",
    "created": "Sat, 07 Dec 2019 13:23:14 GMT",
    "name": "07",
    "subs": [
        {
            "text": "Trump happens to be right about <a href=\"https://www.vox.com/policy-and-politics/2019/12/7/21000314/trump-toilet-10-15-times-epa-rules\">toilets</a>. I bought a house recently and plan to rip out the toilets and replace them with ones that can handle the load so to speak. But I get to think about this stuff because I'm not president of the United States.",
            "created": "Sat, 07 Dec 2019 21:28:10 GMT",
            "type": "outline"
        },
        {
            "text": "Something really weird. I watch MSNBC at least one hour every night. The first ads for a presidential candidate I’ve seen are in the last few days and they’re all from Bloomberg. Why didn’t any of the other candidates advertise to me? They advertise to me on the net, mostly to get me to give them money. A TV ad for a Democratic presidential candidate in 2020 is still a novelty and if the ad is good, it can do more than motivate donations. People want to be inspired. TV advertising done well can do that. Bloomberg's ads check all the boxes. They're winning ads. ",
            "created": "Sat, 07 Dec 2019 19:49:11 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/12/07/mike.png"
        },
        {
            "text": "I can't stop watching <a href=\"https://twitter.com/VancityReynolds/status/1203118775815622664\">this ad</a> for <a href=\"http://www.aviationgin.com/\">Aviation Gin</a>. Three hot and emotive women at a bar, facing the camera. There's a plot, character development, non-verbal communication, lots to watch. The music is kind of funny. Something happened before this meetup and something will happen after. But this moment is very lovely, and that's why I find it so hard to move on. ",
            "created": "Sat, 07 Dec 2019 13:23:15 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/VancityReynolds/status/1203118775815622664",
            "image": "http://scripting.com/images/2019/12/07/aviationGin.png"
        },
        {
            "text": "The XML-RPC spec looks really good, ported to GitHub and Markdown. A lot of people still use XML-RPC, even though REST was supposed to be so much better. With a JavaScript reference implementation and new debugging tools, we may find there's new life in the community. Or at the very least, it'll be ready for the next 21 years.  :boom:",
            "created": "Sat, 07 Dec 2019 13:25:21 GMT",
            "type": "outline"
        }
    ]
}