{
    "text": "December 8",
    "created": "Sun, 08 Dec 2019 14:28:52 GMT",
    "name": "08",
    "subs": [
        {
            "text": "\"He was caught trying to steal the 2020 election.\" That's what I want the Articles of Impeachment to say. That sends the message through the ages that at least the Democrats thought this was a problem. If the republic survives, of course that's the end of the Republican Party. I don't see how the stakes, for the world (Ukraine isn't part of the US) could be larger. BTW, I highly recommend listening to the <a href=\"https://www.npr.org/2019/12/05/785134051/what-ukraines-president-thinks-of-trump-putin-the-impeachment-hearings\">Fresh Air hour</a> about the Ukrainian president, Volodymyr Zelensky. Very interesting story told by an American reporter who has had access. One thing came out in the Fresh Air story -- in Ukraine, the Trump impeachment of isn't big news. Due to their location at the front between the constitutional US govt and the Russian-dominated one, they couldn't be more a part of the US if they were Hawaii.",
            "created": "Sun, 08 Dec 2019 15:18:41 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/12/08/globe.png"
        },
        {
            "text": "One of life's lessons, if you've loved and lost, or taken risks in business or just had friends. If someone does something nasty and you think aw hell I'll just give them another chance, they'll do it again, and again, until you stop giving them the chance. ",
            "created": "Sun, 08 Dec 2019 15:44:24 GMT",
            "type": "outline"
        },
        {
            "text": "One of the boxes I received the other day from Berkeley contains backups going back to Madison in 1979. All different kinds of media. I'm optimistic that I'll be able to find a CD drive that works with my Mac and (at least) reads the backups I took in the 90s. For the others I might have to visit the <a href=\"https://computerhistory.org/\">Computer History Museum</a>, or possibly an equivalent setup in NYC or Boston.",
            "created": "Sun, 08 Dec 2019 14:32:27 GMT",
            "type": "outline"
        },
        {
            "text": "You know your heating system works when it's <a href=\"http://scripting.com/images/2019/12/08/morningTemperature.png\">9 degrees F</a> when you wake up and the house is nice and warm. ",
            "created": "Sun, 08 Dec 2019 14:28:53 GMT",
            "type": "outline",
            "urlexpandableimage": "http://scripting.com/images/2019/12/08/morningTemperature.png"
        },
        {
            "text": "I can't get <a href=\"https://www.youtube.com/watch?v=2hY-EPyFeTE\">this song</a> out of my head. ",
            "created": "Sun, 08 Dec 2019 14:37:42 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=2hY-EPyFeTE"
        },
        {
            "text": "Finding MailToTheFuture",
            "created": "Mon, 09 Dec 2019 00:52:15 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I got an email from a longtime reader who wanted to know what became of <a href=\"https://duckduckgo.com/?q=%22mail+to+the+future%22+site%3Ascripting.com&t=h_&ia=web\">Mail To The Future</a>. He said he sent an email to himself twenty years ago and would like to read it. ",
                    "created": "Sun, 08 Dec 2019 14:34:03 GMT",
                    "type": "outline",
                    "image": "http://scripting.com/images/2019/12/08/mailtothefuture.png"
                },
                {
                    "text": "I feel so irresponsible, when you create a site like that you're pretty much obligated to keep it running. But the contents of the database, if I was any good at backups, is on one of those CDs. I will put the time in at some point to try to restore the app. It should be relatively easy to port to Node. And I can easily export the data out of a root file. I still have \"Frontier\" running on my modern iMac. I use it all the time. ;-)",
                    "created": "Mon, 09 Dec 2019 01:16:35 GMT"
                },
                {
                    "text": "BTW, I still have <a href=\"http://mailtothefuture.com/\">the domain</a>, and put a placeholder page there. And the source code. It's backed up, a little, on <a href=\"https://web.archive.org/web/19991003043305/http://www.mailtothefuture.com:80/public/logon\">archive.org</a>. What I haven't found yet is the all-important data. ",
                    "created": "Sun, 08 Dec 2019 14:40:56 GMT",
                    "type": "outline"
                }
            ]
        }
    ]
}