{
    "text": "December 19",
    "created": "Thu, 19 Dec 2019 06:13:20 GMT",
    "name": "19",
    "subs": [
        {
            "text": "",
            "created": "Thu, 19 Dec 2019 06:13:21 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/12/19/trumpImpeached.png"
        },
        {
            "text": "Is today's <a href=\"http://scripting.com/images/2019/12/19/trumpImpeached.png\">NYT cover</a> meant to conjure <a href=\"http://scripting.com/images/2019/12/19/nixonFarewellHelicopter.png\">Nixon's</a> farewell? ",
            "created": "Thu, 19 Dec 2019 15:55:50 GMT",
            "type": "outline"
        },
        {
            "text": "The Repubs blame the Democrats in the House for their troubles. Mistake. We are the source of their troubles, the people who elected them to impeach the president. As they say, elections have consequences.",
            "created": "Thu, 19 Dec 2019 17:06:25 GMT",
            "type": "outline"
        },
        {
            "text": "One of the Republican talking points yesterday during the impeachment debate is that the Dems lost the election and want to undo it. This is incorrect. <i>The Democrats <a href=\"https://en.wikipedia.org/wiki/2018_United_States_elections\">won</a> the last election</i> and that's why Trump is impeached. As they say, elections have consequences. ",
            "created": "Thu, 19 Dec 2019 15:07:48 GMT",
            "type": "outline"
        },
        {
            "text": "My prediction for 2020: Everything you care about is dead. Everything I care about rules.",
            "created": "Thu, 19 Dec 2019 16:02:57 GMT",
            "type": "tweet",
            "tweetId": "1207694008677478401",
            "tweetUserName": "davewiner"
        },
        {
            "text": "I think now more than ever that <a href=\"https://twitter.com/amyklobuchar\">Amy Klobuchar</a> is the right candidate to run against Trump. She's from the midwest, and can relate to people in Wisconsin and Michigan, two crucial Electoral College states. She's a woman, young, smart, moderate and common sense <a href=\"http://scripting.com/2019/01/28.html#a221631\">says</a> the president after Trump will be a woman. She's also calm and reasonable, has worked in Congress, stared down Kavanaugh, and after Trump gets through gutting our government and military, we will want an administrator who is not quite so loud. I've said this before, we need a <a href=\"http://scripting.com/2019/10/24.html#a143005\">landslide</a> in 2020, not just control of Congress and the presidency. We need a candidate who can soak up as many votes as possible. McConnell has to go. But we can't start putting things back together if there is a McConnell 2.0 to replace him. We also need to pass some constitutional amendments. Otherwise whatever gains we make will be short-lived. Our constitution is getting a stress test now. We will need to start fixing bugs immediately. Voting Rights Act is added to constitution. Gerrymandering is unconstitutional. Impeachment is automatic and begins on Day One. That said, my point of view is switching. If the trial in the Senate leaves Trump in the White House, unconstrained by Congress and knowing it, we're going to need a real campaigner to fight our way out of that hole. We will come to think of this campaign as nothing less than a revolution.  ",
            "created": "Thu, 19 Dec 2019 15:21:14 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/12/19/crush.png"
        },
        {
            "text": "An idea for a reforming the government. North and South Dakota remain separate states, but only have two senators between them. Probably should dilute the power of other very low <a href=\"https://en.wikipedia.org/wiki/List_of_states_and_territories_of_the_United_States_by_population\">population</a> states. And that of course will have a corresponding effect on the Electoral College. The voters of these states have been terrorizing the rest of the country because of quirks in how the country grew. The cleanest fix is to undo some of the messes those compromises made. ",
            "created": "Thu, 19 Dec 2019 17:16:14 GMT",
            "type": "outline"
        },
        {
            "text": "Today's song: <a href=\"https://www.youtube.com/watch?v=8-bgiiTxhzM\">Der Kommissar</a>. ",
            "created": "Thu, 19 Dec 2019 15:33:53 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=8-bgiiTxhzM"
        }
    ]
}