{
    "text": "December 31",
    "created": "Tue, 31 Dec 2019 13:59:50 GMT",
    "name": "31",
    "subs": [
        {
            "text": "Happy New Year everybody! :boom:",
            "created": "Tue, 31 Dec 2019 15:19:21 GMT",
            "type": "outline"
        },
        {
            "text": "The picture, to the right, of <a href=\"https://pulpfiction.fandom.com/wiki/Jules_Winnfield\">Jules</a> in <a href=\"https://en.wikipedia.org/wiki/Pulp_Fiction\">Pulp Fiction</a> is from (I think) the first <a href=\"https://www.youtube.com/watch?v=pRE23YfSvc8\">scene</a> of the movie. Here's the actual quote. \"Say 'what' again. Say 'what' again, I dare you, I double dare you motherfucker, say what one more goddamn time!\" As Will Campbell says <a href=\"https://www.quora.com/What-are-the-best-Samuel-L-Jackson-quotes-from-Pulp-Fiction\">on Quora</a>: \"This entire movie is basically one bag of brilliant quotes.\" True. As I slog my way through the end of the last season of The Newsroom, I realize that some script writing is basically one big bag of terrible quotes. Inserted into actual conversations. And the director makes the characters scream the awful quotes as if they're being tortured. It gets so bad at times I turn the volume off. I dream of the characters killing each other in a <a href=\"https://www.youtube.com/watch?v=AVQ8byG2mY8\">Scarface-like</a> ending. I think I have to go back into therapy to find out why I need to see the very end of this terrible show. (BTW one in five scenes is actually pretty good, like every <a href=\"https://www.youtube.com/watch?v=BDw8EXjusrU\">scene</a> with the Assistant Deputy EPA Administrator. And every scene with <a href=\"https://en.wikipedia.org/wiki/Olivia_Munn\">Olivia Munn</a> is amazing. She's magnetic.)",
            "created": "Tue, 31 Dec 2019 15:20:24 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/12/31/sayBlockchainAgain.png",
            "urlvideo": "https://www.youtube.com/watch?v=pRE23YfSvc8"
        },
        {
            "text": "Here's a fun end-of-year game. 1. Think of the ending of Scarface. 2. Now think of movies you wish had the same ending. Examples: Forrest Gump. 2001: A Space Odyssey. Any movie starring Tom Hanks.",
            "created": "Tue, 31 Dec 2019 16:15:13 GMT",
            "type": "outline"
        },
        {
            "text": "We must compromise to keep our republic",
            "created": "Tue, 31 Dec 2019 14:16:45 GMT",
            "type": "outline",
            "description": "We no longer have elections that work. Without that, without confidence that the person holding an office was actually elected to that office, we have a monarchy.",
            "subs": [
                {
                    "text": "The other day candidate <a href=\"https://www.cnn.com/2019/12/30/politics/joe-biden-running-mate-republican/index.html\">Joe Biden said</a> he's open to choosing a Republican running mate. I <a href=\"https://twitter.com/davewiner/status/1211775820546621441\">said</a> I thought this was a good idea. Now to be clear, he won't choose a Republican running mate. That would be crazy, wrong, too risky by a lot. ",
                    "created": "Tue, 31 Dec 2019 14:17:07 GMT",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "I'm sure Biden would want a close relationship with his VP, and you just can't have that close a relationship with a member of the other party. ",
                            "created": "Tue, 31 Dec 2019 14:36:33 GMT"
                        },
                        {
                            "text": "Biden is old, and his running mate is important because they are more likely to become president. A Republican in the White House, no matter how inspired a choice, just won't work. ",
                            "created": "Tue, 31 Dec 2019 14:36:44 GMT"
                        }
                    ]
                },
                {
                    "text": "Despite all that, it was a good idea, to say it, not to do it. We're at a pivotal point for the future of our republic. The current president has been caught violating the Constitution in the most egregious ways, not just in his dealings with Ukraine. It's clear that Trump doesn't understand the Constitution and has no interest in learning, or being limited by it. He's going to do what he wants to do, the same way a monarch would. This is what the Constitution protects against in a myriad of ways. ",
                    "created": "Tue, 31 Dec 2019 14:21:04 GMT"
                },
                {
                    "text": "We need a two-party system where both parties agree in the rule of law and the Constitution. Where we're Americans first, and partisans a distant second. Not just voters, but the people who lead the parties. Right now we barely have a two-party system because the Repubs are working on behalf of a foreign enemy, and against the Constitution.  ",
                    "created": "Tue, 31 Dec 2019 14:37:52 GMT"
                },
                {
                    "text": "At this point we barely have a two-party system. To get back on solid ground, we need to split along respect for the rule of law. One party supports the rule of law, the other party doesn't. That means Democrats, tahe name of the rule-of-law party, must welcome people who believe in conservative policies that the Repubs used to stand for, but also believe in our system of government. A huge tent. Then, a landslide election, so that the Democrats have control of Congress and the White House and 3/4 of the state legislatures, overcoming Russian/Republican hacking, and so we can pass new amendments to the Constitution to close the loopholes that they have taken advantage of. To codify what previously were just norms.",
                    "created": "Tue, 31 Dec 2019 14:23:29 GMT"
                },
                {
                    "text": "I hear you saying, cynically, that'll never happen. Then my answer to you is this -- we've already lost the republic. There may be elections in the future, but only Republicans will win, the same way only Putin wins elections in Russia. I said in an earlier piece, that some friends took issue with, that the Democratic Party would be annihilated if that happened, and this is what I meant. There might still be an organization called the Democratic Party, but if they can't win elections because of corruption, well it's not really a political party is it?",
                    "created": "Tue, 31 Dec 2019 14:42:04 GMT"
                },
                {
                    "text": "To win such a landslide, the Democrats will need a lot of votes from people who voted for Trump in 2016. That means compromise. Which is fine because <i>our form of government requires compromise, </i>when it's working. So Biden saying he would consider a Republican running mate is signalling to people who voted Republican that they are welcome in the new Democratic Party. And in order to work, not only will the Republican Party have to be annihilated once and for all, so will the Democratic Party, and further, journalism will have to be annihilated too. What journalism has morphed into, where they only know about horse races, both-sides-do-it and Watergate, has led us to this place. If they continue to rule our discourse, as they have, we can't get out of the hole we're in.",
                    "created": "Tue, 31 Dec 2019 14:26:23 GMT"
                },
                {
                    "text": "Once all this change has happened, then we can go back to a two-party system. We can decide what \"conservative\" and \"liberal\" mean all over again, because today I feel totally like a conservative even though my beliefs and policies are what we used to think of as liberal. I want to turn the clock back to Eisenhower and JFK, Carter, Reagan, Bush I and Clinton, where the US was fucked up for sure, but we respected ourselves and each other, at least somewhat, enough to accept the result of elections we lose. ",
                    "created": "Tue, 31 Dec 2019 14:43:34 GMT"
                },
                {
                    "text": "Almost everyone has buried their heads in the sand and think oh well nothing has changed, when in fact everything has changed. We no longer have elections that work. Without that, without confidence that the person holding an office was actually elected to that office, we have a monarchy, and autocracy not anything like the system of government the founders designed. ",
                    "created": "Tue, 31 Dec 2019 14:29:27 GMT"
                }
            ]
        },
        {
            "text": "'Silent data loss'",
            "created": "Tue, 31 Dec 2019 13:59:51 GMT",
            "type": "outline",
            "description": "The Repubs use a trolling technique that was pioneered as far as I know by the proponents of a certain format that was intending to replace RSS.",
            "subs": [
                {
                    "text": "<i>I wrote <a href=\"https://www.facebook.com/dave.winer.12/posts/666805586860183\">this</a> on Facebook in 2017, never published on my blog.</i>",
                    "created": "Tue, 31 Dec 2019 14:00:01 GMT"
                },
                {
                    "text": "The Repubs use a trolling technique that was pioneered as far as I know by the proponents of a certain format that was intending to replace RSS.",
                    "created": "Tue, 31 Dec 2019 14:02:03 GMT"
                },
                {
                    "text": "They would say: RSS has \"silent data loss.\""
                },
                {
                    "text": "This sounds terrible. Right? Well, it's just like Shariah Law or \"chain-immigration.\" It sounds like a technical thing, but in reality it's a problem they made up. In practice nothing really is lost. XML sometimes garbles stuff if it isn't properly encoded. The solution is to properly encode it. ",
                    "created": "Tue, 31 Dec 2019 14:04:18 GMT"
                },
                {
                    "text": "By pointing at this and saying Oooooh silent data loss. Oooh RSS is bad, people who didn't understand would think, oh I need to change to use this new thing. Or so the proponents hope.",
                    "created": "Tue, 31 Dec 2019 14:04:22 GMT"
                },
                {
                    "text": "Just like Shariah Law is not a problem in America, and chain-immigration simply means letting families come to the US (a good thing, most people would think, so why not say it that way, hah), the tech trolls were saying basically that \"RSS is XML,\" which their format was too. If everything is done right (a big assumption) you could possibly avoid \"data loss\" by using their format, or you could stick with RSS and properly encode the text. The latter approach is <i>much</i> cheaper.",
                    "created": "Tue, 31 Dec 2019 14:03:16 GMT"
                },
                {
                    "text": "Anyway, by the time you explained it the people listening were tuning out because it truly is boring, and thinking you're being pretty defensive, there must be something here."
                }
            ]
        }
    ]
}