{
    "text": "Thinking about my ISOJ keynote",
    "created": "Tue, 02 Apr 2019 13:29:22 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "A week from this coming Saturday I'll give a keynote talk at the <a href=\"http://isoj.org/\">ISOJ</a> conference in Austin. The way it works is I talk for 20 minutes or so, then I answer questions from the host, Rebecca MacKinnon and from the audience. Here's my current thoughts on how to approach it. ",
            "created": "Tue, 02 Apr 2019 13:29:37 GMT"
        },
        {
            "text": "I'll start by showing the <a href=\"http://images.scripting.com/archiveScriptingCom/2005/02/10/cartoon.gif\">cartoon</a> done by a Pulitzer-prize winning editorial <a href=\"https://en.wikipedia.org/wiki/Doug_Marlette\">cartoonist</a> about the bloggers who were invited to the DNC in Boston in 2004. I was one of them. The cartoon betrays a point of view. His was that bloggers only had a PC, where reporters covering the DNC had a wealth of experience. It's a bold, condescending, arrogant statement and it's nonsense. I was 49 years old that year. My credentials at the time were as impressive as his. I had a good education from a <a href=\"https://www.cs.wisc.edu/\">good school</a>. At the time I was a research fellow at Harvard. I had spent decades proving myself in my field and had risen to the top. I had invented a bunch of technology that were in very wide use, and would form the foundation for all computer networking to come. I had been writing my blog for nine years at that point, and if I do say so myself, was a good writer. We were in the process of starting podcasting at the time. And I was just one of the DNC bloggers. The others were just as accomplished. You had to be someone special to be at the DNC in 2004. If he had bothered to find out who he was dissing, if he had any humility at all, he would have been embarrassed to be so wrong. Yet this is so much of what bloggers heard from professional news people. I don't mention this because my feelings were hurt, rather because it's a blind spot that has kept journalism from rising to the opportunity that is the two-way web. It's why Facebook is growing like a weed, and journalism is collapsing.",
            "created": "Tue, 02 Apr 2019 13:33:16 GMT",
            "collapse": "true",
            "subs": [
                {
                    "text": "<img src=\"http://scripting.com/images/2019/04/02/cartoon.png\" style=\"width: 90%; padding: 5px; border: 1px solid gray\">",
                    "created": "Tue, 02 Apr 2019 14:22:53 GMT"
                }
            ]
        },
        {
            "text": "So dear ISOJ people. I come to you from tech. I have tried to work with journalism, many times. I've even succeeded a few times, in spectacular ways. Most of the time, I'm brushed aside as irrelevant, even when I'm an expert in the fields I am offering insight into. Areas that are all of a sudden very important to journalists. And I have some of the answers they seek. But they can't hear me, because they don't understand what I am. What am I? To you, I am a source. ",
            "created": "Tue, 02 Apr 2019 13:37:13 GMT",
            "collapse": "true",
            "subs": [
                {
                    "text": "Successful collaboration with journalism",
                    "created": "Tue, 02 Apr 2019 14:29:24 GMT",
                    "type": "outline",
                    "subs": [
                        {
                            "text": "SF Newspaper strike, 1994",
                            "created": "Tue, 02 Apr 2019 14:29:34 GMT"
                        },
                        {
                            "text": "RSS with the NY Times, 2002",
                            "created": "Tue, 02 Apr 2019 14:29:39 GMT"
                        },
                        {
                            "text": "Podcasting with WGBH, 2004",
                            "created": "Tue, 02 Apr 2019 14:29:44 GMT"
                        }
                    ]
                }
            ]
        },
        {
            "text": "Back in the 80s when I was rising through the ranks of the software industry, one of the basic skills of being a tech CEO was to get journalists to write about you often and favorably. This, along with thoughtful product designs, were my big strengths. I wasn't a great manager, or money-raiser. But I could get good coverage, and my products were interesting, and one of them was a hit. (I didn't make Craig Newmark level money, but I did well.)",
            "created": "Tue, 02 Apr 2019 13:38:50 GMT"
        },
        {
            "text": "In the 80s journalists were an important part of our distribution system, as was advertising, which was 1/4 of our budget, along with product development, support, sales, cost of goods, administration. If we stopped getting coverage and stopped advertising our sales would also stop. ",
            "created": "Tue, 02 Apr 2019 13:42:49 GMT"
        },
        {
            "text": "We didn't have the web in the 80s, so talking on the phone with journalists was the way we traded information with others in the industry. I was a frequent source for the columns, Spencer F Katt, the Talking Moose et al and when new products came out from the big vendors, I was a reliable quote. When my copy of PC Week or MacWEEK came in, I closed the door and read the whole issue cover to cover. It was our pulse. We put news and gossip in and got the same out. ",
            "created": "Tue, 02 Apr 2019 13:45:06 GMT"
        },
        {
            "text": "How different that is from the way news works today, and at the same time how similar! ",
            "created": "Tue, 02 Apr 2019 13:47:00 GMT"
        },
        {
            "text": "How did this transition happen? I actually know, because in 1994 the journalism system I described above had collapsed, as had the software distribution system. I was a Mac developer, but the consensus among journalists was that the Mac is dead, there is no new software for the Mac, and no reason to create more, because it's dead. Dead. Basically when reporters wrote about the Mac they just said it's dead and Windows is booming. Which was weird because they all used Macs. And there <i>was</i> new software, esp for the web. In fact the web was happening on the Mac. But the reporters were stuck in their groove about Windows' dominance the same way they are stuck on Facebook today.",
            "created": "Tue, 02 Apr 2019 13:50:04 GMT"
        },
        {
            "text": "So while I had an excellent product, there was no way to get it past this barrier in the minds of the press. When Apple came out with a product that was positioned against ours, but really wasn't competitive, that was the end of public comment about us. And of course the company never recovered. So I was lucky, in a way, in 1994 when the web started taking off, I had the free time to see it, study it, and launch new ideas into it. ",
            "created": "Tue, 02 Apr 2019 13:52:40 GMT"
        },
        {
            "text": "By following a formula for product development I've used my whole career, I tried an idea out to see if it worked, if it did, I'd build on it, see if that worked, etc. If you're chasing something good, it'll just keep building, each step will give you ideas of where to go next.  I had a glimmer of an idea that using the Internet, I could do for myself what journalism had been doing for me. I had a good rolodex, in it were the email addresses of all the people I hoped to communicate with using the journalists as I did in the 80s. Instead of going through the middleman, the journalists (they thought I was dead) I went direct. And boy did it work. Right from the start it was a phenomenon. So I fed the flames with more ideas and a little dirt too. I did projects with the local Bay Area news orgs. I wrote about how I thought IBM and Apple should get together. And that PDAs were going to be tethered to desktops. And then I wrote a letter about Bill Gates and how the Internet spelled doom for his plans of world domination. And then I got an email response from Gates, and I ran it. And in just a couple of months, I had created, out of nothing, a news channel of my own. I was a source, going direct, without a middleman. I called it DaveNet, it was me, just me, as a net. No organization. I was free to say what I wanted to say. I wasn't covering for anyone. It was one of the most incredible periods of my life. ",
            "created": "Tue, 02 Apr 2019 13:53:49 GMT"
        },
        {
            "text": "This process, sources going direct, has been going on ever since. At one point I radically proclaimed that every member of Congress would be a source that goes direct. Turns out I wasn't radical enough. Today the president of the United States got there because he went around journalism and talked directly to his constituents.",
            "created": "Tue, 02 Apr 2019 13:58:33 GMT"
        },
        {
            "text": "This form of communication, sources going direct, is with us for good. It's the reason Facebook makes billions and journalism is collapsing. Had journalism, instead of fighting the sources, or ignoring them, and created systems to organize them, how much better everything would be. This is what we're waiting for, imho, for journalism to realize that the architecture of news has changed, and that they should embrace the change instead of fighting it, and find their new role in this new world. ",
            "created": "Tue, 02 Apr 2019 13:59:50 GMT"
        }
    ]
}