{
    "text": "April 2",
    "created": "Fri, 02 Apr 2021 14:55:48 GMT",
    "type": "calendarDay",
    "name": "02",
    "subs": [
        {
            "text": "I can always watch <a href=\"https://www.metacritic.com/movie/babe\">Babe</a>. Total feel-good movie. ",
            "created": "Fri, 02 Apr 2021 15:31:44 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "A proposal for newsletter tools",
            "created": "Fri, 02 Apr 2021 15:32:08 GMT",
            "type": "outline",
            "description": "Writing tools for the web have been languishing. This is easy to fix, it just requires a little leadership.",
            "subs": [
                {
                    "text": "I wonder if we could help one of the newsletter distribution companies support the <a href=\"http://1998.xmlrpc.com/metaWeblogApi.html\">Metaweblog API</a> or  equivalent.  ",
                    "created": "Fri, 02 Apr 2021 15:32:47 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I'd be happy to help design it, and would implement an editor as open source example code to help seed the market. ",
                    "created": "Fri, 02 Apr 2021 15:32:49 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "This would be an easy upgrade for the web, and good publicity for an innovative platform. Let's create a great new market for writing tools for the web. All it takes is one developer to get this going. It's something I would support with all the influence I have.  ",
                    "created": "Fri, 02 Apr 2021 15:33:04 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Writing tools for the web have been languishing. This is easy to fix, it just requires a little leadership.",
                    "created": "Fri, 02 Apr 2021 15:33:05 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Pleading for Stallman",
            "created": "Fri, 02 Apr 2021 14:55:49 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I feel so sad about what's happening to Stallman.",
                    "created": "Fri, 02 Apr 2021 14:55:53 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "<a href=\"https://en.wikipedia.org/wiki/Richard_Stallman\">He's 68</a>. I know what that's like, I'm 65. ",
                    "created": "Fri, 02 Apr 2021 15:13:56 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "He has fixed his whole existence on a single idea that software should be free. Not free of charge, but free to use and to adapt. It's not that far from the kind of openness I believe in, that I believe is an ethical responsiblity for developers. ",
                    "created": "Fri, 02 Apr 2021 14:56:07 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It's useful to have a person like Stallman around, consistently marking an extreme view. It's like knowing there's a <a href=\"https://www.backpacker.com/survival/how-to-navigate-by-the-stars/\">North Star</a>, you may not be going to it, exactly, but knowing where it is makes it possible to go other places. And some people agree with Stallman in total, and to them he's their leader.",
                    "created": "Fri, 02 Apr 2021 15:25:44 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Now, if you step back and look at what's being said about him, basically people don't like things he says or the questions he asks. I read these things completely factoring out the non-factual stuff, where they tell you what his questions mean in some pure sense, when what they're really saying is what these questions mean to them. To a reasonable person imho they're just questions. Some people don't argue with questions, they just ask them. For the people who attack him, it's the opposite, their questions are accusations. ",
                    "created": "Fri, 02 Apr 2021 14:57:43 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I think Stallman is actually a naive innocent, almost child-like <i>harmless</i> person. That's based on years of observing him, being connected through communities. Maybe he did terrible things I don't know about. But maybe you have too.  Is this how we're going to coexist? All of us worrying about who's going to make a credible case for destroying each others' lives? This isn't about Stallman, it's about your sense of justice and how far it extends, and how unfair that is for the rest of us who fear being judged by you. ",
                    "created": "Fri, 02 Apr 2021 14:59:38 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PS: A quote from a <a href=\"http://scripting.com/davenet/1994/11/05/randombreathlessstuff.html#2\">1994 blog post</a>: \"I try not to get offended on principle.\" I was quoting someone else, but I've remembered that. Just because I should be offended, doesn't mean, if I'm not actually offended, that I have to pretend I was. ",
                    "created": "Fri, 02 Apr 2021 15:18:55 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PPS: If you still think Stallman should be destroyed, go see <a href=\"https://en.wikipedia.org/wiki/The_Lives_of_Others\">Lives of Others</a>, a wonderful film about intellectuals in East Germany during the Cold War. ",
                    "created": "Fri, 02 Apr 2021 15:24:01 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}