{
    "text": "April 10",
    "created": "Sat, 10 Apr 2021 13:31:27 GMT",
    "type": "calendarDay",
    "name": "10",
    "subs": [
        {
            "text": "I find the resurgence of <a href=\"https://github.com/athensresearch/athens\">outliners</a> inspiring, I wonder about all the addons, and I’d like to see them support import and export standards, and most importantly, APIs. ",
            "created": "Sat, 10 Apr 2021 13:31:28 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "BTW, for people who are trying outliners for the first time, may I suggest my own \"Little Outliner\". It's browser-based, easy to use, has lots of features, isn't world-encompassing, just a way to make lists, plan stuff, think into your computer screen. It's free to use, no gotchas, and the outlines are in a standard format, and there's a command to download all your work to your local system, for backup or to use in another outliner. So there's absolutely no lock-in. :rocket:",
            "created": "Sat, 10 Apr 2021 22:39:06 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/06/29/alice.png",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"http://timeshifter.scripting.com/\">TimeShifter</a> for vaccinators has a simple purpose. Instead of writing on someone's tag 30 Minutes or 15 minutes, you write the time at which they can leave if there are no complications from the vaccine. ",
            "created": "Sat, 10 Apr 2021 19:26:41 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I don’t understand why CNN reports on what Fox says. Isn’t there a risk of too many mirrors reflecting only on each other. News about news about news about news, etc.",
            "created": "Sat, 10 Apr 2021 19:25:34 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "A thread re NYT and the tech web",
            "created": "Sat, 10 Apr 2021 16:17:55 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "<i>A <a href=\"https://twitter.com/davewiner/status/1380915375383138311\">thread</a> from my Twitter account..</i>",
                    "created": "Sat, 10 Apr 2021 16:21:03 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I was having a discussion with <a href=\"https://twitter.com/TaylorLorenz\">Taylor Lorenz</a> about the difference between online media brought to us by the tech industry, and the world of the NYT and other journalism orgs. Here's a concise version.",
                    "created": "Sat, 10 Apr 2021 16:18:08 GMT",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "The NYT et al present packaged stories and opinion. The presenters are vetted, conform to standards that are understood, but not well documented. (This is all my opinion btw.)",
                            "created": "Sat, 10 Apr 2021 16:18:36 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "The online tech media presents largely unpackaged stories, with little or no vetting, and the standards are hard to implement because the systems are so vast.",
                            "created": "Sat, 10 Apr 2021 16:18:37 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "They're opposites. Night and day. And in conflict, but imho they need not be. ",
                    "flInCalendar": true
                },
                {
                    "text": "I've long felt we need hybrids. Probably unknown to most people at the NYT, there was a time, between 2002 and 2005, or so -- when I personally worked with them on this stuff. So I had a strong opinion about what they should do. They did half of what I asked, and that was pretty bold, and very successful. ",
                    "created": "Sat, 10 Apr 2021 16:19:04 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The other half they didn't do. It would have brought a lot more voices into the NYT, but they would have been vetted, by the reporters of the NYT, simply by quoting them in a NYT piece. So they couldn't avoid the vetting if their stories had sources. And the thought was that anyone who is a source for the NYT is worth listening to and could use a platform. ",
                    "flInCalendar": true
                },
                {
                    "text": "What would have come out of it is something like what Substack is today. ",
                    "flInCalendar": true
                },
                {
                    "text": "It's hard to know how that experiment would have turned out, but I believed in the idea. Unfortunately it was immediately turned down. ",
                    "flInCalendar": true
                },
                {
                    "text": "My main contact at the NYT at the time was Martin Nisenholtz, so you can confirm this with him if you like. The first half of the deal resulted in the RSS standard for distributing news. Another little-known fact, imho RSS would have failed without the support from the NYT. Their trust in my small company was amazing, and we took good care of their brand and rep in the wild world of the web. This was in 2002. ",
                    "created": "Sat, 10 Apr 2021 16:43:10 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PS: There's also the <a href=\"http://scripting.com/2001/01.html\">story</a> of how we found the cache of NYT syndicated content. That's what led to the deal we made a year later for RSS. ",
                    "created": "Sat, 10 Apr 2021 16:43:11 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Should Netflix have a schedule?",
            "created": "Sat, 10 Apr 2021 14:27:46 GMT",
            "type": "outline",
            "description": "Cable-cutting wasn't the paradise we thought it would be.",
            "metaImage": "http://scripting.com/images/2021/04/10/bonacera.png",
            "subs": [
                {
                    "text": "About a year ago I decided to cut the cord and turn off the TV service from my cable provider, Spectrum. I returned my settop box, which I had never actually installed, because I used their Roku app instead. ",
                    "created": "Sat, 10 Apr 2021 14:28:24 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I subscribed to YouTube TV so I could watch news and some sports. It concerned me that they didn't have MSG or SNY for the Knicks and Mets, but there wasn't much sports last year anyway, with the pandemic and lockdowns. ",
                    "created": "Sat, 10 Apr 2021 15:04:28 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I went without HBO because I was getting that from Spectrum, and I binged on Netflix, Amazon, Hulu, and a few other services from time to time, but those were the main ones. ",
                    "created": "Sat, 10 Apr 2021 14:30:03 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Then the Knicks season started. I could see from the highlights and news that this season they were actually an exciting team, very unusual, I wanted to watch, so I set out on a lengthy search, because the information out there is so poor, only to learn that there is literally no way to get MSG and SNY, the broadcasters of Knicks and Mets games, without Spectrum. The local sports teams are not available to cable-cutters, at least not where I live. ",
                    "created": "Sat, 10 Apr 2021 14:30:54 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "As I wrote about this on my blog, I got lots of emails saying that this service or that would give me what I wanted. I even tried using Spectrum's \"streaming\" service, which you can order online, but none of them had the Knicks. ",
                    "created": "Sat, 10 Apr 2021 14:32:41 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "So I decided to undo the grand cable-cutting experiment, called Spectrum and got back on board with the cable TV service, got a new settop box, which will never be unpacked and will stay in a closet, and happily watched the Knicks during this very interesting, exciting and fun season. ",
                    "created": "Sat, 10 Apr 2021 14:33:28 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "But this piece is about HBO, not the Knicks. ",
                    "created": "Sat, 10 Apr 2021 14:35:02 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Now as a Spectrum user, I can use the HBO Max app. I've paid to access it. And at the same time, HBO appears in the Listings in the Spectrum app. So I added them to my <a href=\"http://scripting.com/images/2021/04/10/spectrumListing.png\">favorites</a>. So now when I have to choose between something to watch, HBO is one of the choices. And the big difference here is that they pick what to offer me, just like the old days. They have a schedule. And guess what, I watch a lot more HBO this way than I did when I have full choice over what to watch through the streaming app. This is the point of the story. ",
                    "created": "Sat, 10 Apr 2021 14:35:20 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "An example. Last night just before Ari Melber comes on at 6PM, I got bored with the usual stuff on CNN and MSNBC, so I looked around, and saw that The Godfather had just started. I switched to it, and there's Don Corleone sitting behind his desk with the cat in his lap, <a href=\"https://www.youtube.com/watch?v=K6LKszIrDzo\">listening to Bonasera</a>, the undertaker, completely blowing his pitch to the Don. It's a riveting scene. So much to watch. The performance of it. Comparing it to the boring plays they act out on CNN, for months, is ridiculous. One is a masterpiece, the other is completely lost, worthless, not even good for passing the time while playing games on my iPad.",
                    "created": "Sat, 10 Apr 2021 14:37:34 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "BTW, I watched The Godfather all the way to the end. I didn't get up once. It was the best couple of hours I had spent on entertainment in years.  ",
                    "created": "Sat, 10 Apr 2021 14:57:49 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Browsing on HBO Max, I would never think to click on The Godfather as I'm bored looking for something to watch. I think other people have observed this too. Most of my time on these apps is spent looking for something to watch, as opposed to watching.",
                    "created": "Sat, 10 Apr 2021 14:39:56 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The idea of scheduled broadcasts is actually very appealing, to my surprise! I thought for sure the revolution was permanent, that we would always be programming our TV-watching experience for ourselves once we had the chance. But there are real problems with that approach. ",
                    "created": "Sat, 10 Apr 2021 14:41:06 GMT",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "How do I know if something is good? I have no idea. And to find out, I have to search for the title on Metacritic, see the total score, and then skim the reviews. A lot of typing and waiting and reading, so I don't do it very often. Much faster just to go on to the next one. ",
                            "created": "Sat, 10 Apr 2021 14:41:32 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "I might have heard of a show or movie I want to watch, but I have no idea if it's playing somewhere I can access. For example, I was looking for <a href=\"https://en.wikipedia.org/wiki/Howards_End_(film)\">Howard's End</a>, because the story was written by the <a href=\"https://en.wikipedia.org/wiki/Kazuo_Ishiguro\">author</a> of a <a href=\"https://www.npr.org/2021/03/03/972841445/klara-and-the-sun-is-a-masterpiece-about-life-love-and-mortality\">book I had just read</a> and loved. Amazon has a big advantage here, you can get almost everything, but mostly they are not included in the video bundle, so you have to <a href=\"https://www.amazon.com/Howards-End-Emma-Thompson/dp/B01N2POC6H/ref=sr_1_2?dchild=1&keywords=howard%27s+end&qid=1618069291&s=instant-video&sr=1-2\">pay extra</a>. I figure I'm already paying enough to all the streaming services, I should watch something that's included, and eventually Howard's End will show up.",
                            "created": "Sat, 10 Apr 2021 14:41:39 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "On the other hand, I guess I'll pretty much always watch The Godfather, Babe or Kill Bill 2 when given a chance to. There are actually a lot of movies like that. And now, unlike the past, there are no commercials, and they leave the sex and violence in. And the Knicks, which I watched instead of Maddow, oy! What a <a href=\"https://nypost.com/2021/04/10/rj-barrett-doesnt-blink-in-clutch-knicks-moment/\">game</a>. The ups and downs, tragedy and heroic play, the back-stories, the history -- all in just an hour. MSNBC, comparitively, is transparently nothing. The best they have is a powerless Congressperson who is ridiculously and obviously corrupt and popular (maybe) on Fox who has been caught. Nothing is at stake. They can't explain why anyone should care. They need a new purpose.",
                    "created": "Sat, 10 Apr 2021 14:44:40 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}