{
    "text": "April 11",
    "created": "Sun, 11 Apr 2021 13:46:16 GMT",
    "type": "calendarDay",
    "name": "11",
    "subs": [
        {
            "text": "We need a coach to get us through the pandemic. Whether or not you like him, Cuomo was doing that. That’s why I say Fauci should have a podcast. The interviews he does with various people isn’t enough. ",
            "created": "Mon, 12 Apr 2021 02:11:49 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I just found a 1991 piece by Steven Levy at MacWorld about Frontier, which was still in development at the time. Really interesting read because now, only 30 years later (heh), I'm doing a smaller version of the same idea, not on the Mac but on the open web, once again using standard protocols to connect apps. It starts on page 51 of <a href=\"https://vintageapple.org/macworld/pdf/MacWorld_9108_August_1991.pdf\">this PDF</a> of the August 1991 MacWorld. Here's a <a href=\"http://scripting.com/images/2021/04/11/page51.png\">screen shot</a> of the first page. ",
            "created": "Sun, 11 Apr 2021 13:46:17 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/12/24/drummer.png",
            "flInCalendar": true
        },
        {
            "text": "What neither Levy or I understood, at the same time in Switzerland, Tim Berners-Lee was working on the world wide web. Frontier's importance in bootstrapping the web as a content management platform, via blogging, RSS and podcasting, was where the real growth would come. It would require a pivot, of course. The Mac <i>was</i> entering middle age, as Levy postulated. But a new shiny thing that worked really well with the Mac was coming along and would soon change everything. The same vacuum that existed on the Mac at the time, now exists on the web. There is no simple-enough scripting language designed for power users to integrate the functionality of many and disparate apps. Why do I like this so much? I guess I'm just a pipes and wires kind of guy. And I think lots of new media will emerge from the ecosystem we'll create here.  ",
            "created": "Sun, 11 Apr 2021 13:53:04 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I know this is just math, but 1980 is to 1940 as 2020 is to 1980.",
            "created": "Sun, 11 Apr 2021 15:07:25 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/447362219597369345\">Tweeted in 2014</a>. \"We are just beginning to come to grips with how over-reliant we've been on the imagined ethics of tech companies.\" ",
            "created": "Sun, 11 Apr 2021 14:10:49 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Embarrassing mistake. Yesterday, in a <a href=\"http://scripting.com/2021/04/10/142746.html?title=shouldNetflixHaveASchedule\">longish piece</a> about bingewatching, I gave Kazuo Ishiguro credit for writing the novel Howard’s End.  He actually wrote <a href=\"https://en.wikipedia.org/wiki/The_Remains_of_the_Day\">Remains of the Day</a>. There is a connection. Both were made into movies starring <a href=\"https://en.wikipedia.org/wiki/Emma_Thompson\">Emma Thompson</a> and <a href=\"https://en.wikipedia.org/wiki/Anthony_Hopkins\">Anthony Hopkins</a>. I corrected the piece, but here's a <a href=\"http://scripting.com/images/2021/04/11/theError.png\">screen shot</a> of the error. BTW, interestingly, I received an <a href=\"http://scripting.com/images/2021/04/11/netflixemail.png\">email from Netflix</a> last night suggesting I watch Howard's End. Is it a coincidence, or does their algorithm read my blog? That would be amazing if it did. (I'm sure it doesn't but it's an incredible source about my interests.)",
            "created": "Sun, 11 Apr 2021 14:22:01 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}