{
    "text": "April 12",
    "created": "Mon, 12 Apr 2021 11:55:22 GMT",
    "type": "calendarDay",
    "name": "12",
    "subs": [
        {
            "text": "Earlier this month I wrote a piece called <a href=\"http://scripting.com/2021/04/04/174604.html?title=theLostAppsOfThe80s\">The Lost Apps of the 80s</a>, wondering where the depth of early PC writing tools went. Also spreadsheets, databases, graphics programs. There were huge numbers of them. The reason imho is Microsoft and not just the <a href=\"https://en.wikipedia.org/wiki/Browser_wars\">Browser Wars</a> which threw all of software into chaos for a number of years. There's another reason, and it might have happened even if the web hadn't come along. <a href=\"https://en.wikipedia.org/wiki/Microsoft_Office\">Microsoft Office</a>. So quickly I forgot. It used to be that a word processor cost $495 as did a database, spreadsheet, and various other software. When you added up the retail prices it could easily come to $2000. Then one day, Microsoft bundled <a href=\"https://en.wikipedia.org/wiki/Microsoft_Word\">Word</a> and <a href=\"https://en.wikipedia.org/wiki/Microsoft_Excel\">Excel</a> and a few other apps, for the price of a single productivity app. And over the years, they added more software to the bundle. This alone might have reduced the productiving software business to one vendor. The competitors couldn't afford to do what Microsoft did, they didn't have the royalties from the OS to support their price-cutting in apps. So that's another theory on where the apps went. Today, that's no excuse. Writing tools would have a different purpose today, writing for the network, rather than for printing. Different requirements. ",
            "created": "Mon, 12 Apr 2021 11:56:31 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/04/12/microsoftOffice.png",
            "flInCalendar": true
        },
        {
            "text": "Why doesn't Georgia get rid of the lines for voters? Isn't this the obvious question. Has anyone asked Gov Kemp? Is that something he can help with?",
            "created": "Mon, 12 Apr 2021 13:06:55 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Someday users of network services, having been burned by lock-in, will only choose a service when they’re sure there’s a way out.",
            "created": "Mon, 12 Apr 2021 11:55:23 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1381546106983682049",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}