{
    "text": "April 22",
    "created": "Thu, 22 Apr 2021 14:15:14 GMT",
    "type": "calendarDay",
    "name": "22",
    "subs": [
        {
            "text": "I think in general, to rise to a position of fame and wealth in our society, you have to strive to never say anything. I was watching the beginning of an academic conference today, about social media, and recognize the way of speaking, having spent some time in academia myself. My mind drifted, because people weren't saying anything other than how great, amazing and wonderful people in their midst are, and wondered what would've happened at the NYT if the managing editor had told the people who wanted [%search: Donald McNeil%] fired for using a <a href=\"https://www.google.com/search?q=site%3Anytimes.com+nigger\">somewhat forbidden word</a> in a discussion about using that word that <i>they</i> could resign, but they would not fire McNeil. Then I wondered why the people wanted McNeil fired in the first place. Maybe because this is the only way they get to have an opinion that isn't nothing. I recognize the pattern. As a man, I know that the only emotion that people are comfortable with from me is anger. Fear, fun, love, generally speaking happiness, all seem to make people uncomfortable, if you have a penis. I don't know why this is. But I reject it. We all should accept each other as we are, especially ourselves. It's this frustration with being nothing that made people want Trump, imho. We should learn to stop punishing people for being individuals. The other option is not good, as we found out. ",
            "created": "Thu, 22 Apr 2021 14:15:15 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/07/06/yourOpinionCounts.png",
            "flInCalendar": true
        },
        {
            "text": "BTW, hat's off to <a href=\"https://en.wikipedia.org/wiki/Elon_Musk\">Elon Musk</a>. One of the rare exceptions of people who don't care enough to not tell you what they think. ",
            "created": "Thu, 22 Apr 2021 14:32:52 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Back in 2015 the Mets were a blessed team, the way the Knicks are this year. You'd tune into a game in the 8th inning, the Mets down by 10, to see how they win. They had a few stars, pitchers and hitters who were all peaking at the same time, feeding off each others' energy, it seemed. Their run went all the way to the World Series, which they lost, unfortunately, but the charm was real. The Knicks are doing the same thing. As the fourth quarter starts to draw to a close in each game in the current run, you say that's it, no way the Knicks win this, but then Derek Rose finds Reggie Bullock, alone in a corner, he zips the ball to him and Bullock sinks a three, and we're off to overtime, which the Knicks dominate. This is sports that is charmed, not bought, like the Nets, Clippers or Lakers. Sure they have pedigree stars, they acquired a championship contender, but who cares about that. I love a team of nobodies who shine off each others' light and create an atmosphere of love, and they win because of it. People will soon forget the Nets, when the three stars go their way, to form some other super team in some other long-forgotten franchise. I think next year a few free agents will want to join up with the Knicks, but I hope the team resists. I want to see this team back again next year and the year after that. I want to watch Barrett and Quickley develop, and Rose be their mentors. I want Julius Randle to become the NBA star with a real heart, true to his squad. I feel about them as family, not acquisitions. All the years in the wilderness were worth it. ",
            "created": "Thu, 22 Apr 2021 14:39:44 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/07/02/knicks.png",
            "flInCalendar": true
        },
        {
            "text": "The most common thing that stands between people working together is a dysfunctional kind of pride. People feel they are being put down if another person knows more about something than they do. There's an old management slogan that goes with this. \"A people hire A people, B people hire C people.\" The point is this -- to win, you have to <i>want</i> to work with people who have developed skills, or even basic talent, that you don't have. That's how you form a team. If you have to do everything, you're going to have trouble making something useful.",
            "created": "Thu, 22 Apr 2021 19:58:55 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}