{
    "text": "April 23",
    "created": "Fri, 23 Apr 2021 13:39:08 GMT",
    "type": "calendarDay",
    "name": "23",
    "subs": [
        {
            "text": "The other day I <a href=\"http://scripting.com/2021/04/18.html#a140711\">reported</a> that I had the project I'm working on \"stabilized\" after major brain surgery. In software it's always a good idea to be prepared for the worst possible outcome. In this case, I forgot that I hadn't deployed the new version to a server, and when I did that, nothing worked. <a href=\"https://en.wikipedia.org/wiki/Edge_case\">Edge cases</a>. It is once again \"stabilized.\" But the list of new stuff to do is growing, not shrinking. And who knows what broke in the last round of changes. ",
            "created": "Fri, 23 Apr 2021 16:31:31 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Now that cannabis is legal in New York State, where I live, I've been curious about how much prices vary around the country. I'm not aware of any comparison websites, but I've heard that Oregon is the least expensive, because they have an oversupply. I'm guessing that <a href=\"https://www.leafly.com/dispensaries/massachusetts/\">Massachusetts</a>, the nearest state with retail sales, is still relatively high priced, because the business is so new. 1/8 ounce <a href=\"https://www.theorywellness.org/ma/great-barrington-recreational-cannabis-dispensary/?dtche%5Bcategory%5D=flower\">goes</a> for about $50. I imagine that some of the aggregator sites have a good idea of this. I also wonder what kinds of plans there are for stores in various parts of New York. I imagine that the <a href=\"https://en.wikipedia.org/wiki/Greenwich_Village\">Village</a> in Manhattan will be a place where there are lots of stores. I expect that <a href=\"https://en.wikipedia.org/wiki/Woodstock,_New_York\">Woodstock</a>, the nearest town to where I live, will also be a big spot. If you have any information, please leave a note in <a href=\"https://github.com/scripting/Scripting-News/issues/207\">this thread</a>. ",
            "created": "Fri, 23 Apr 2021 13:39:09 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/04/23/highTimes.png",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}