{
    "text": "April 24",
    "created": "Sat, 24 Apr 2021 19:39:07 GMT",
    "type": "calendarDay",
    "name": "24",
    "subs": [
        {
            "text": "<a href=\"https://en.wikipedia.org/wiki/Dan_Kaminsky\">Dan Kaminsky</a>, a security researcher, died today at 42. I didn't know him, but I followed him on Twitter. One of his <a href=\"https://twitter.com/dakami/status/1214041947406393349\">tweets</a> is getting a lot of circulation now, and it's worth repeating. \"If somebody helped you — always feel free to let them know. They may not.  Really. There is no statute of limitations on being thankful. Years, decades, doesn’t matter. Now is always a good time.\"",
            "created": "Sat, 24 Apr 2021 19:46:46 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "With that in mind, thanks to <a href=\"https://en.wikipedia.org/wiki/John_Naughton\">John Naughton</a>. He wrote a <a href=\"https://johnnaughton.substack.com/p/friday-23-april-2021\">bit</a> the other day about how that reporter at Vox said something totally wrong about the origin of podcasting, I'm sure the reporter knew it was wrong, and his editors knew it was wrong, but they published it anyway. Naughton thought I must've been furious, but I'm not, I'm exhausted. It's the norm. I'm not a billionaire. I let my ideas float around in the world, I don't lock them up. My goal with podcasting was to create a new medium that everyone could use, and that has worked. Reporters don't need to score any points with me, so they give credit for my work to others. I wrote Naughton an email saying \"That's the way journalism works, I'm afraid. They report conventional wisdom, not facts. You're the rare exception.\"",
            "created": "Sat, 24 Apr 2021 20:00:07 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/10/10/maude.png",
            "flInCalendar": true
        },
        {
            "text": "You can't trust Apple to act in your interests, whether you're a developer or a user. After so many years, it's amazing to me that some people who have been around for a while still expect them to be benevolent. And btw, I'm sure I've written this exact post before.",
            "created": "Sat, 24 Apr 2021 19:56:01 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/10/04/goldenGirl.png",
            "flInCalendar": true
        },
        {
            "text": "It's been almost 19 years since I missed a day on the blog, and this isn't going to be one of them. Feeling a little under the weather, might be a cold, or maybe something I ate. Not conducive for having ideas. So that's it for today. Maybe I'll have something for y'all tomorrow. Keep on truckin. :smile:",
            "created": "Sat, 24 Apr 2021 19:39:08 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "PS: It turns out I <i>did</i> have some ideas after all. Sitting down in front of a keyboard I guess pulls some words out of me. Kind of like putting a guitar in <a href=\"https://www.youtube.com/watch?v=r967lcA_rR8\">Prince's</a> hands?",
            "created": "Sat, 24 Apr 2021 20:45:36 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Silos are computer networks that are walled off from everything else. Your ideas can go in there, they make that easy, even enticing, but they can't interact with ideas anywhere else. Ideas that can't interact are fairly useless. ",
            "created": "Sat, 24 Apr 2021 19:57:20 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2021/04/24/silos.png",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}