{
    "text": "April 27",
    "created": "Tue, 27 Apr 2021 15:57:50 GMT",
    "type": "calendarDay",
    "name": "27",
    "subs": [
        {
            "text": "A <a href=\"http://scripting.com/davenet/1996/08/28/BeeSeason.html\">favorite story</a> from 1996 about bees.",
            "created": "Tue, 27 Apr 2021 16:53:18 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I <a href=\"https://twitter.com/davewiner/status/1387115927188221952\">propose</a> that the Democrats publish what they think would be fair districting for every state, including ones that Republicans control. That way we can see how they deviate from fairness. Give journalism a means to compare. Help people understand gerrymandering.  Another possibility -- maybe someone like Nate Silver could put together fair redistricting maps for all the states. It'd be an interesting idea to approach it as a non-partisan thing, using the best information and data tools we have. (<a href=\"https://twitter.com/jasonSaldo/status/1387121440789606401\">Update</a>: They <a href=\"https://projects.fivethirtyeight.com/redistricting-maps/\">did</a> it last time around.)",
            "created": "Tue, 27 Apr 2021 18:46:27 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1387115927188221952",
            "image": "http://scripting.com/images/2020/08/09/gary.png",
            "flInCalendar": true
        },
        {
            "text": "Make the invisible hand visible",
            "created": "Tue, 27 Apr 2021 16:18:58 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2021/04/27/muppets.png",
            "description": "Basecamp and other companies are grappling with a new problem. ",
            "subs": [
                {
                    "text": "The idea of online users trying to get people fired, for me, goes back to the early 90s when UserLand was starting up. I was very active on [%search: Applelink%], which was kind of an early version of Facebook. Everyone who was anyone, even if they weren't an Apple user or developer, was there. Online systems were still a new thing.",
                    "created": "Tue, 27 Apr 2021 15:57:51 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "One day we got a call at the office, back then companies, even mostly virtual ones, still had offices, demanding that they fire Dave Winer. The person who answered the phone tried to explain that Dave is the founder and majority owner of the company, and no one here can fire him, but the caller persisted. Even then I had too many opinions for some. ",
                    "created": "Tue, 27 Apr 2021 16:26:51 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Reading the <a href=\"https://world.hey.com/jason/changes-at-basecamp-7f32afc5\">letter</a> from Jason Fried, the founder of Basecamp, about changes at his company, I was impressed with how far this has gone. It's an incredible document. You can skip the preamble, head to the numbered parts where he describes the changes they're making. The infection of people feeling empowered to get people fired now has made it all the way <i>into</i> companies. Back then, no employee of my company would consider the possibility that I, the founder, could be controlled. But now, that's not true. Clearly. ",
                    "created": "Tue, 27 Apr 2021 16:00:37 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Yesterday I <a href=\"http://scripting.com/2021/04/26.html#a140858\">wrote</a> about how I don't trust the NYT on almost anything these days, because of what happened to Donald McNeil. But I think, from reading tea leaves, that I can see that something like what happened at Basecamp, has happened there. A committee of employees has formed, and they will decide who can stay at the company. A lot of it will have to do with age, gender and race. Someone who is young, a person of color, and not male will be able to express stronger ideas than one who doesn't check those boxes. ",
                    "created": "Tue, 27 Apr 2021 16:01:49 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Did anyone consider what this does to the <a href=\"http://scripting.com/davenet/2001/01/08/whatIsIntegrity.html\">integrity</a> of a news organization? And, what it does to the integrity of a software development company? ",
                    "created": "Tue, 27 Apr 2021 16:29:53 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Our companies, organizations of all kinds, have jobs to do, and fighting for your cause, unless that's what the organization was formed to do, is not what they're about. You may think a company can take on every cause you believe in, knowing that tomorrow they will be different causes. You should start a company to test your belief. A company like Basecamp was formed (I'm guessing) to serve Basecamp users, to make them happier with Basecamp than competitive products, to generate a profit so it can grow, and to make the shareholders rich for being smart enough to bet on the company. And that's pretty much it. Maybe they had other goals, but it seems from the letter they're letting go of those now. ",
                    "created": "Tue, 27 Apr 2021 16:04:27 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I know this has been said by many startup founders, <a href=\"https://qz.com/work/1915278/five-percent-of-coinbase-staff-rejected-its-apolitical-future/\">Coinbase</a> went through something like this. You can shake your head all you want, but in the end your only recourse, as an employee, is to accept what the leadership of your company wants, or leave and find something better elsewhere, if it exists.",
                    "created": "Tue, 27 Apr 2021 16:07:34 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It's especially troubling in a time when there are so many looming crises, that journalism is being subjected to this opaque idiocracy. If this is really how the Times is going to operate going forward, they have an obligation to explain it, until the readers understand that the words of the Times are being controlled by an invisible hand. We need the NYT to have courage, to not flinch at the possibility that something they cover might offend their employees. And the best outcome imho is if the management of the Times fires the would-be controllers and lets them start the publication of their dreams which I predict approximately no one will subscribe to. ",
                    "created": "Tue, 27 Apr 2021 16:08:34 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}