{
    "text": "April 30",
    "created": "Fri, 30 Apr 2021 13:05:19 GMT",
    "type": "calendarDay",
    "name": "30",
    "subs": [
        {
            "text": "People are amazed that Joe Biden has turned into a progressive president, with ambitions comparable to <a href=\"https://en.wikipedia.org/wiki/New_Deal\">FDR</a> and <a href=\"https://en.wikipedia.org/wiki/Great_Society\">LBJ</a>, but he’s exactly the kind who can do that. Just as Richard Nixon, a <a href=\"https://en.wikipedia.org/wiki/Alger_Hiss\">famous</a> communist hater, was able to open relations with <a href=\"https://en.wikipedia.org/wiki/Richard_Nixon%27s_1972_visit_to_China\">China</a> in 1972. Biden has a reputation as a moderate, therefore he has credibility when calling for more radical approaches to recovery.",
            "created": "Fri, 30 Apr 2021 19:22:04 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://www.hollywoodreporter.com/news/youtube-tv-pulled-from-roku\">This</a> is what \"podcasting\" is going to be like once its spotification is complete.",
            "created": "Fri, 30 Apr 2021 16:41:21 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Reporters generally miss why Reagan’s attacks on government were so well-received by Americans. The reason: Nixon, Vietnam and Watergate. Jimmy Carter was the first response to all that. A guy who was so clean he thought that having lust in his heart for women other than his wife was a sin. Then Reagan was the final eradication of Nixon, or so we felt. We had no trust of government, so our votes were all about hobbling government. The error was not realizing the role it played in American power. He went way too far. That became clear, to me, with the response to 9/11. We needed a smart government that used American power with care and respect. Dubya was what we had instead. ",
            "created": "Fri, 30 Apr 2021 15:11:06 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/10/01/dubya.png",
            "flInCalendar": true
        },
        {
            "text": "I've been using <a href=\"https://help.twitter.com/en/using-twitter/spaces\">Twitter Spaces</a>, their new competitor to [%search: Clubhouse%], at the encouragement of [%search: Robert Scoble%], who has taken to it the way he gets involved in everything, head first and way over his head. Completely submerged. Fine. I'm vulnerable to media like this, so I spent a couple of hours there in the last few days. I've been recovering from the <a href=\"http://scripting.com/2021/04/28.html#a164755\">stomach thing</a>, so there's no harm in wasting a bit of time I wasn't going to use productively anyway. One thing Scoble said to me, when we were discussing <a href=\"http://scripting.com/2021/04/28.html#a163250\">Basecamp</a>, is that's fine but you're a white person. To which I said what I've always wanted to say to this. Yeah, but you're not refuting what I said, which has no race, age or gender. How about considering the ideas, where ever they might come from. In my experience, good ideas can come from places you're not expecting them. Sometimes I'm sure I've missed them altogether because of that. Other times I've almost missed them. It has happened enough that I consciously try to turn off that kind of judgement and just listen and consider regardless of who's speaking. This is one of the worst things about the current rage to discount anyone who isn't young, of color and/or female. What made me think about all this is the flack the kids who are upset about inaction among adults re climate change are getting. The <a href=\"https://bigthink.com/politics-current-affairs/youth-climate-strike?rebelltitem=1#rebelltitem1\">adults are attacking</a> them because they're children. They aren't even listening to what they say. ",
            "created": "Fri, 30 Apr 2021 14:03:28 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/12/15/myOrangeJelloBox.png",
            "flInCalendar": true
        },
        {
            "text": "I've said this a million times. One more time won't hurt. Podcasting was created so <i>everyone</i> can make media. It was designed, deliberately, without gatekeepers. To have a podcast, you have to have a public \"RSS\" feed with enclosures. That's why you hear at the end of podcasts, \"You can get this where ever you get podcasts.\" They may name one or two of those places, but you know, because it's a podcast, you can listen to it in any podcast client, or in a pinch just by entering the URL of the feed into a web browser. That's why when Spotify calls what <a href=\"https://twitter.com/davewiner/status/1388053831733362691\">Joe Rogan</a> does a \"podcast\" it's an insult to all the people who worked so hard to make podcasting the huge juggernaut it is today. They should be crucified and burned at the stake for being total corporate assholes. I don't use Spotify. Never have, never will. Luckily I don't give a shit about Joe Rogan. I hear he's mean and stupid. And if you make an exclusive deal with Spotify as he did, you can be sure I'll never hear what you say. There's nothing wrong with Spotify offering proprietary radio shows. Just don't call them podcasts. Same goes for Audible and all the other companies who think open networks don't matter.",
            "created": "Fri, 30 Apr 2021 13:05:20 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/10/06/gunsDontKillPeople.png",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}