{
    "text": "February 1",
    "created": "Thu, 01 Feb 2018 16:25:23 GMT",
    "name": "01",
    "subs": [
        {
            "text": "We need a new kind of domain, perhaps a <i>Historic Domain, </i>like a <a href=\"https://en.wikipedia.org/wiki/Retired_number\">retired number</a> for a sports team. Should there ever be another <a href=\"http://gawker.com/\">gawker.com</a>? I don't think so. The content that's there now should be there for the foreseeable future. I don't know what the criteria should be for preservation but Gawker is clearly a domain that should be around next year and the year after that. See this <a href=\"https://mobile.nytimes.com/2018/02/01/business/media/gawker-archives-press-freedom.html?smid=tw-nytimes&smtyp=cur&referer=http://m.facebook.com\">NYT piece</a> for background.",
            "created": "Fri, 02 Feb 2018 00:29:13 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/02/01/willieMays.png"
        },
        {
            "text": "Could someone other than me please correct the Wikipedia page about podcasting. Ben Hammersley is a great guy, for sure, but he did not name the medium. What he did is like coming up with the name \"iPhone\" before Apple named their phone that. The bootstrap of podcasting took a long time, a lot of work, started years before his Wired column, and it's simply not fair to give him creation credit.",
            "created": "Thu, 01 Feb 2018 17:57:08 GMT",
            "type": "outline"
        },
        {
            "text": "I've been uploading the outlines for Scripting News, as I edit them, basically the source code for the blog, to a <a href=\"https://github.com/scripting/Scripting-News/tree/master/blog/opml\">folder on GitHub</a> since <a href=\"https://github.com/scripting/Scripting-News/blob/master/blog/opml/2017/05.opml\">May</a> of last year, typically at the month turn-over, or whenever I remember to do it. This part of my publishing system is not yet automated, it's a once-a-month ritual that seems just right the way it is. :boom:",
            "created": "Thu, 01 Feb 2018 16:33:09 GMT",
            "type": "outline"
        },
        {
            "text": "This is why I can't live without Twitter, even though it's a silo. I find it's an ideation tool for me. Sometimes just entering a series of connected ideas w/o the ability to go back and edit, forces a certain kind of thinking to come out that might succumb to too much editing. Here's a <a href=\"https://twitter.com/davewiner/status/959094615373729792\">thread</a> that expresses an idea, strongly, that I've been tiptoeing around now for far too long. I may make it a blog post, but for now, it's a Twitter thread. ",
            "created": "Thu, 01 Feb 2018 16:25:24 GMT",
            "type": "outline"
        }
    ]
}