{
    "text": "February 2",
    "created": "Fri, 02 Feb 2018 14:35:51 GMT",
    "name": "02",
    "subs": [
        {
            "text": "Read the Wirecutter <a href=\"https://thewirecutter.com/reviews/what-is-alexa-what-is-the-amazon-echo-and-should-you-get-one/\">review</a> of Amazon Echo. They dismiss the <a href=\"https://thewirecutter.com/reviews/what-is-alexa-what-is-the-amazon-echo-and-should-you-get-one/?utm_source=rss&utm_medium=feed&utm_campaign=RSS%20percent20Feed#is-your-echo-spying-on-you\">privacy concerns</a> based on its current behavior. But things are changing in the US and around the world. Democracy is <a href=\"https://www.axios.com/democracy-in-decline-around-the-world-1517415821-515cccef-2b6f-439d-8738-ed0ccd846d95.html\">on the decline</a>. They say Alexa isn't listening until you say the code word. How do they know? And if it isn't listening today, what about tomorrow? I'd rather not have an always-on networked microphone in my house. ",
            "created": "Fri, 02 Feb 2018 14:35:52 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/02/02/dancer.png"
        },
        {
            "text": "Speaking of Wirecutter, how about a review of online banking systems. I use a very mediocre system, one of the biggest banks. I would happily switch, but I have no idea if any of them are better. My biggest peeve is they throw away records of transactions after six months. Why? Why shouldn't they be able to give me a year-to-year report on what I spend on various things. Isn't money one of the easiest things to improve using computers? The current system is better than it was when we paid bills with handwritten mailed checks, but it hasn't improved in ten years. That's ridiculous. ",
            "created": "Fri, 02 Feb 2018 14:38:12 GMT",
            "type": "outline"
        },
        {
            "text": "That said, I love <a href=\"https://thewirecutter.com/about/\">Wirecutter</a>. I buy so many things they recommend and they're all good. Next time I move I'm going to buy a new TV based on their recommendation. I also love it because a few years ago if you told the NYT that they could support journalism by making money off the things they write about that you buy they would have said <i>Tut tut you don't understand our ethics would not permit it.</i> Now they <a href=\"https://www.nytimes.com/2016/10/25/business/media/new-york-times-company-buys-the-wirecutter.html\">own Wirecutter</a>. Haha. It's a clear signal that creative thinking is all that stands in the way of news making a good living. (Wirecutter's business model is <a href=\"https://affiliate-program.amazon.com/\">affiliate links</a> to the products they recommend.)",
            "created": "Fri, 02 Feb 2018 14:41:01 GMT",
            "type": "outline"
        }
    ]
}