{
    "text": "February 12",
    "created": "Mon, 12 Feb 2018 14:29:14 GMT",
    "name": "12",
    "subs": [
        {
            "text": "The point of an open platform is to have choice. You believe in one way forward, I believe in another. We can both use the same web. Along comes Google and slashes it down the middle like a Berlin Wall. All of a sudden only they matter.",
            "created": "Mon, 12 Feb 2018 20:09:36 GMT",
            "type": "outline"
        },
        {
            "text": "Back in the day (a phrase I seem to write a lot) I would encourage people to send real mail to their politicians instead of email, because email requires no effort, therefore doesn't carry much weight. These days that's the difference between posting something on Twitter or Facebook, or your blog. If you put it on your blog, you know fewer people will likely see it, but they are people who care enough that they either came to your site or subscribed to it in a feed reader. It's why I didn't post the <a href=\"http://scripting.com/2018/02/11/152545.html\">piece</a> about my mom on Facebook, or link to it from Twitter. I don't want to mass-communicate something like that, I want to share it with people to want to know. ",
            "created": "Mon, 12 Feb 2018 18:06:09 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/02/12/twittergram.png"
        },
        {
            "text": "Beating hearts",
            "created": "Mon, 12 Feb 2018 14:29:15 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "<i>I wrote this <a href=\"https://www.facebook.com/dave.winer.12/posts/206873102853436\">on this day</a> in 2014 on Facebook. </i>",
                    "created": "Mon, 12 Feb 2018 14:29:20 GMT"
                },
                {
                    "text": "There's a chain of beating hearts connecting back in time from you to a fish that crawled onto land, one of your many ancestors (assuming you believe in evolution, I guess).",
                    "created": "Mon, 12 Feb 2018 14:29:42 GMT"
                },
                {
                    "text": "Actually, even if you don't believe. :-)",
                    "created": "Mon, 12 Feb 2018 14:29:52 GMT"
                },
                {
                    "text": "Except for you, maybe, they were all women.",
                    "created": "Mon, 12 Feb 2018 14:30:00 GMT"
                }
            ]
        }
    ]
}