{
    "text": "February 13",
    "created": "Tue, 13 Feb 2018 15:01:57 GMT",
    "name": "13",
    "subs": [
        {
            "text": "I sat next to someone on the subway today who was reading a paper NY Times. I glanced over it and couldn't stop reading. The smell of the paper evoked memories. A nostalgic experience.",
            "created": "Wed, 14 Feb 2018 04:16:39 GMT",
            "type": "outline"
        },
        {
            "text": "We should have a list of the features Chrome is deleting from the web. Kind of like the list @Amy_Siskind keeps for the norms Trump is destroying.",
            "created": "Tue, 13 Feb 2018 16:04:02 GMT",
            "type": "outline"
        },
        {
            "text": "It's not good enough to invent something great and have it be adopted in the culture. You have to conserve it against a big company squeezing the life out of it for a few quarters of PE growth.",
            "created": "Tue, 13 Feb 2018 15:35:16 GMT",
            "type": "outline"
        },
        {
            "text": "Steve Kerr's breakthrough idea",
            "created": "Tue, 13 Feb 2018 16:22:56 GMT",
            "type": "outline",
            "description": "Steve Kerr may be to the NBA what Bill Walsh was to the NFL. ",
            "subs": [
                {
                    "text": "I wrote off the Warriors, too boring, what are they going to do, win <i>another</i> title? Seen that show. But Steve Kerr <a href=\"https://www.inc.com/justin-bariso/golden-state-warriors-coach-steve-kerr-unorthodox-move-brilliant-lesson-leadership-emotional-intelligence.html\">found a way</a> to turn in a different direction, and it is brilliant, and makes me want to watch the Warriors again. Remarkable.",
                    "created": "Tue, 13 Feb 2018 16:57:04 GMT",
                    "image": "http://scripting.com/images/2018/02/13/curry.png"
                },
                {
                    "text": "It's the same theory I have for conferences. When I tried out what Kerr is doing the result was \"BloggerCon\". It was amazing what happens when you turn the audience into speakers. But it only works with certain people. When they imported me into a conference in Nashville to do a session, it blew up. A bunch of Limbaughs showed up. Eventually I sat down and let the room go crazy. ",
                    "created": "Tue, 13 Feb 2018 16:25:09 GMT"
                },
                {
                    "text": "You need a strong respected central guy like Kerr to make it work. So it probably won't work for teams like the Pelicans or Kings, for example, and certainly not the Knicks! :boom:",
                    "created": "Tue, 13 Feb 2018 16:25:44 GMT"
                },
                {
                    "text": "And you need players like Andre Iguodala and David West and Draymond Green and on and on. Look at the intellectual talent they have. Unparalleled. And their minds will just get better as their bodies age.",
                    "created": "Tue, 13 Feb 2018 16:25:51 GMT"
                },
                {
                    "text": "They're really onto something.",
                    "created": "Tue, 13 Feb 2018 16:29:24 GMT"
                }
            ]
        },
        {
            "text": "Thread links",
            "created": "Tue, 13 Feb 2018 15:01:58 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I got on a roll this morning on Twitter. Sorry. I should put all my best thinking on the blog. In the meantime here are links to the threads with summaries. ",
                    "created": "Tue, 13 Feb 2018 15:02:47 GMT"
                },
                {
                    "text": "About the art of <a href=\"https://twitter.com/davewiner/status/963422924605706241\">linking</a> and how we're letting it go. It's not good enough to invent something, and drive adoption, you have to conserve it against monetization by private companies. ",
                    "created": "Tue, 13 Feb 2018 15:02:48 GMT",
                    "subs": [
                        {
                            "text": "Sidebar: <a href=\"http://bloggercon.scripting.com/ruleoflinks.html\">The Rule of Links</a> from BloggerCon.",
                            "created": "Tue, 13 Feb 2018 15:03:54 GMT"
                        }
                    ]
                },
                {
                    "text": "Steven Sinofski wrote a <a href=\"https://twitter.com/stevesi/status/963142502604779520\">thread</a> about Apple, and the realities of supersize tech companies. He has experience as product lead at Microsoft through the 90s. I <a href=\"https://twitter.com/davewiner/status/963421412735225862\">observed</a> that it might be nice if a leading web pub, with permission of course, adapted such threads to a more readable format, and added links. ",
                    "created": "Tue, 13 Feb 2018 15:06:51 GMT"
                },
                {
                    "text": "<a href=\"https://twitter.com/davewiner/status/963423711721291776\">Also</a> while Steven was leading Microsoft, the web was booming and they were cross-purposes. MS denied it then, but they lost an antitrust case about it, so I think we know they were. Thing is we need both open and proprietary, or we'd all still be using Unix command lines (I do, but wouldn't want to force it on anyone). We also need rules to keep the behemoths from trying to ingest the commons.",
                    "created": "Tue, 13 Feb 2018 15:08:49 GMT"
                }
            ]
        }
    ]
}