{
    "text": "February 20",
    "created": "Tue, 20 Feb 2018 05:23:54 GMT",
    "name": "20",
    "subs": [
        {
            "text": "I don't drive often. Today I was driving in the Bay Area, noticed when near a school, the speed limit goes down to 25. Speed bumps. Lights flash if you're going too fast. We protect children from licensed drivers. I don't feel my liberties have been infringed. Common sense.",
            "created": "Wed, 21 Feb 2018 02:26:37 GMT",
            "type": "outline"
        },
        {
            "text": "People act as if \"liberty\" is an absolute. It isn't. We're prohibited from behavior that unnecessarily risks other people's well-being. Gun users know this. The gun industry spreads lies.",
            "created": "Wed, 21 Feb 2018 02:28:40 GMT",
            "type": "outline"
        },
        {
            "text": "I am pleased to report that Berkeley has not changed. A baseball discussion at Starbucks  reveals that I hate the Yankees. I am wearing a Mets hat of course. A patron says Ah ah don't hate. <i>How Berkeley. </i>Baseball is about strong opinion. We hate the Yankees, I say. He says I guess you're right, we hate the Red Sox, right? I say no. Mets fans <i>like</i> the Red Sox. All you have to do is smile. Since <a href=\"https://www.youtube.com/watch?v=Vv7LwhLKlCY\">then</a>, and for the foreseeable future, the Mets really like the Red Sox. ",
            "created": "Tue, 20 Feb 2018 23:52:41 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/embed/Vv7LwhLKlCY",
            "image": "http://scripting.com/2015/10/26/mrmet.png"
        },
        {
            "text": "We did something bad in TechLand. We knew all about trolls 15 years ago. And we didn't carry forward that knowledge in subsequent generations of our systems. It's as if smallpox were allowed to return because a new generation of biologists didn't study the work of prior generations.",
            "created": "Wed, 21 Feb 2018 00:06:47 GMT",
            "type": "outline"
        },
        {
            "text": "I'm visiting California, and it's good to be back. But it's freaking cold. Can't you guys turn on the heat or something??",
            "created": "Tue, 20 Feb 2018 05:23:55 GMT",
            "type": "outline"
        }
    ]
}