{
    "text": "The Podcast Wars",
    "created": "Wed, 08 Mar 2023 15:25:13 GMT",
    "type": "outline",
    "description": "In the end, podcasting will stay what it is. It always has. ",
    "metaImage": "http://scripting.com/images/2022/07/01/pearlHarbor.png",
    "subs": [
        {
            "text": "Re the supposed re-invention of podcasting, coming to a tech tabloid soon... ",
            "created": "Wed, 08 Mar 2023 15:03:35 GMT",
            "image": "http://scripting.com/images/2019/08/15/chihuahua.png",
            "flInCalendar": true
        },
        {
            "text": "I probably should have explained <a href=\"http://scripting.com/2023/03/07.html#a182022\">yesterday</a> why having two or more groups claiming to be the future of something that currently no one is fighting over might damage the thing they say they’re trying to help (assuming they are saying that). We've been to this place before. How long before the press starts calling it The Podcast Wars. Some of us will try to douse the flames, to no avail. ",
            "created": "Wed, 08 Mar 2023 15:25:27 GMT",
            "flInCalendar": true
        },
        {
            "text": "People choose <a href=\"http://scripting.com/publicfolder/chatgpt/2023/03/08/bombastic-meaning-4-words.html\">bombastic</a> names because they want more for themselves than they want for podcasting. I have a lot of experience with this. People are always looking for a way to make a billion dollars. It never occurs to them that if it all has to be for them, there will be nothing. Now a whole new generation has to learn that again, and as usual the thing that pays for it is podcasting. ",
            "created": "Wed, 08 Mar 2023 15:25:39 GMT",
            "flInCalendar": true
        },
        {
            "text": "I don't know all the people, or what they're planning to do, but the names they chose for their efforts tells me they don't want work with anyone, they may say they do, but they've reserved for themselves the authority over -- \"podcasting,\" if you can believe that bullshit. They're all little people trying to sound like big people. If you want to do some good for podcasting, throw your ideas out there in the middle, and fight for <a href=\"https://www.google.com/search?q=site%3Ascripting.com+interop\">interop</a>. When the other guy does something that you do, do it their way. That's how you build.",
            "created": "Wed, 08 Mar 2023 15:26:08 GMT",
            "flInCalendar": true
        },
        {
            "text": "My sense is it's too late to fuck over podcasting, that it's mostly for the people involved that I ask them to lower expectations, and don't try to make this a business model. But if they want to do it, they'll do it and the press will have a <a href=\"https://www.google.com/search?q=%22podcast+wars%22\">new war</a> to write about, and in the end <a href=\"http://scripting.com/publicfolder/chatgpt/2023/03/08/podcasting-definition.html\">podcasting</a> will stay what it is. ",
            "created": "Wed, 08 Mar 2023 15:26:29 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}