{
    "text": "Why the US is so rich",
    "created": "Thu, 26 Jan 2023 14:50:52 GMT",
    "type": "outline",
    "description": "People would rather be paid in dollars because it's safer. ",
    "metaImage": "http://scripting.com/images/2023/01/26/dollar.png",
    "subs": [
        {
            "text": "Judging from the news, no one has figured out how to explain what defaulting on our debt means in human terms.",
            "created": "Thu, 26 Jan 2023 14:50:56 GMT",
            "flInCalendar": true
        },
        {
            "text": "To do it, you'd have to explain why the United States is richer than any other country in the world.",
            "flInCalendar": true
        },
        {
            "text": "It's not because we're smarter, or make better products, or have more natural resources. It's because the dollar is the <a href=\"https://en.wikipedia.org/wiki/Reserve_currency\">reserve currency</a> of the world. It's the safest place to store value. That means when we create a new dollar someone accept it as repayment of a loan. That's how our wealth is created and sustained.  ",
            "created": "Thu, 26 Jan 2023 14:51:19 GMT",
            "flInCalendar": true
        },
        {
            "text": "In other words, people are happy to be paid in dollars. They want to be paid in dollars. They like dollars because they remain valuable, because they trust the United States to repay the loan because <i>the US never has and never will default.</i> That's the assumption. ",
            "created": "Thu, 26 Jan 2023 15:07:35 GMT",
            "flInCalendar": true
        },
        {
            "text": "We got a good thing! We should want to keep it! (I don't often use exclams on this blog, btw.)",
            "created": "Thu, 26 Jan 2023 23:14:42 GMT",
            "flInCalendar": true
        },
        {
            "text": "If we don't pay back our loans, the safety thing blows up. It'll be gone. Then when we print a dollar to pay back a loan, they'll say no thanks, give us Euros. It's actually pretty simple. If you understand the rules of football, driving or poker you can definitely understand this.  ",
            "created": "Thu, 26 Jan 2023 14:52:22 GMT",
            "flInCalendar": true
        },
        {
            "text": "People ought to learn what it means to be a reserve currency. And how it makes the US much richer.",
            "flInCalendar": true
        },
        {
            "text": "It means we can piss away huge amounts of money on the military, and let the super-rich get off with paying no taxes. That's where the difference goes. It's why we can still live in a Western way, with big cars and mortgages, and have the hugest miltary and fuel the growth of the super-rich all around the world all at the same time. It's not because we're a great country, it's because everyone thinks the dollar is safe.  ",
            "created": "Thu, 26 Jan 2023 14:55:11 GMT",
            "flInCalendar": true
        },
        {
            "text": "I don't the military is going to suffer much when our unfair economic advantage is blown up by a default, I think the poor will. I think health care and education will disappear. I think the rivers and air will be polluted. We'll be sicker and more ignorant. Everything will work much worse. More shortages so prices will go up. ",
            "created": "Thu, 26 Jan 2023 14:55:51 GMT",
            "flInCalendar": true
        },
        {
            "text": "To understand this all you have to understand is what a reserve currency is. Please news people, explain that. Help the people understand how this works. ",
            "created": "Thu, 26 Jan 2023 15:03:42 GMT",
            "flInCalendar": true
        },
        {
            "text": "Thanks.",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}