{
    "text": "Thanks to <a href=\"https://ma.tt/2025/08/think-different/\">Matt Mullenweg</a> for the boost to <a href=\"http://scripting.com/2025/08/28/140604.html\">yesterday's post</a>. Glad to finally get the whole plan down in one place. Each piece of the puzzle took a while to come together in concept and then in implementation. I'm still working on all levels, last week I added a feature to \"FeedLand\" that makes it fit in better with the (new) timeline and WordPress (20+ years). It takes a while to change your thinking from WordPress being just another blogging CMS, to being an open platform that hosts <a href=\"http://scripting.com/2025/03/13/132830.html\">web writing</a> in a way that's open to competition. We're on the same page. It's still a competitive environment, but there are rules to competing, you don't cash in the interop that took patience and respect to develop and maintain. That's been the pity of the open web, lots of opportunists who are willing to stink up the ecosystem to squeeze a few more bucks for themselves from things <i>they didn't create.</i> Let your competitors in, and the users, if they have their heads screwed on right, will respect you for it. And even if they don't, still do it, because it's the right thing to do. That's why, at my age, just turned 70 earlier this year, I'm in a position to help revive the web, because I've made enough money, now it's time to make sure the gift that I got from the open web is available to future generations, no matter how greedy and selfish the <a href=\"https://daveverse.org/2025/08/29/the-wealthy-and-dominant-giants-of-tech/\">giants of tech</a> are. People may question Matt, and that's cool, as I said <a href=\"http://scripting.com/2025/08/28/140604.html#a142100\">yesterday</a>, but also remember he's stood up for your freedom, and that's also important. ",
    "created": "Fri, 29 Aug 2025 14:13:15 GMT",
    "type": "outline",
    "image": "https://imgs.scripting.com/2025/08/29/matt.png",
    "flInCalendar": true
}