{
    "text": "Bronx Science, in retrospect",
    "created": "Fri, 29 Aug 2025 15:13:08 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Story. I'm on a mail list for Berkman, where I spent two years at Harvard. Alumnae of all generations are on this list, and it's interesting.",
            "created": "Fri, 29 Aug 2025 15:13:19 GMT",
            "flInCalendar": true
        },
        {
            "text": "Just got an email that someone was proud of having their picture taken with Susan Landau. I didn't know who she was, so I <a href=\"https://en.wikipedia.org/wiki/Susan_Landau\">looked her up</a>.",
            "created": "Fri, 29 Aug 2025 15:13:32 GMT",
            "flInCalendar": true
        },
        {
            "text": "She was born in 1954. And is a highly accomplished math and comp sci wizard, with cred at Harvard, Google, and now teaches at Tufts. ",
            "created": "Fri, 29 Aug 2025 15:13:46 GMT",
            "flInCalendar": true
        },
        {
            "text": "Then I get to the place where they say she went to <a href=\"https://daytona.scripting.com/search?q=%22Bronx%20Science%22\">Bronx Science</a>. ",
            "created": "Fri, 29 Aug 2025 15:14:02 GMT",
            "flInCalendar": true
        },
        {
            "text": "That was my class, unless she, like I, skipped a grade. We both would have started in 1969 and graduated in 1972.",
            "flInCalendar": true
        },
        {
            "text": "I just wanted to write this up because I've noticed in the last few years, now that I live in the northeast, not far from the Bronx, I tend to come across more Science alums, and when I do, I generally find we have a lot to talk about, and share a New York style nerd sense of humor. ",
            "created": "Fri, 29 Aug 2025 15:14:45 GMT",
            "flInCalendar": true
        },
        {
            "text": "And as a math major myself, I conclude that their test was pretty good, it definitely selected a certain kind of mind, and the people it selected generally went on to do interesting, creative and useful things. ",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}