{
    "text": "We need what Mike Arrington did",
    "created": "Mon, 10 Jul 2017 22:49:14 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "How TechCrunch started in a paragraph. I met <a href=\"https://en.wikipedia.org/wiki/Michael_Arrington\">Mike Arrington</a> at a meeting at a VC in NYC in 2005. I was living in Florida, and came up for the day. <a href=\"https://en.wikipedia.org/wiki/Keith_Teare\">Keith Teare</a>, who I knew from when I lived in the Valley, came out to NY and brought Mike, his partner in a startup called <a href=\"https://www.crunchbase.com/organization/edgeio#/entity\">Edgeio</a>. Mike was a lawyer. It was either at this meeting or some time soon after that I blurted out to Mike the thing that I said to pretty much everyone: \"You should start a blog.\" Mike, being an \"NBB\" got right to it. ",
            "created": "Mon, 10 Jul 2017 22:49:30 GMT",
            "image": "http://scripting.com/images/2017/07/10/juliaChild.png",
            "permalink": "http://scripting.com/2017/07/10.html#a064930"
        },
        {
            "text": "His blog, TechCrunch, consisted of writeups of products Mike had tried or companies he visited. There was a lot of activity in the Valley then, but it was hard to see. Mike made it visible. That's how powerful one person can be in the new age of publishing. (We're still in that age btw, you can do all that he did then, even more easily.)",
            "created": "Mon, 10 Jul 2017 22:49:59 GMT",
            "permalink": "http://scripting.com/2017/07/10.html#a064959"
        },
        {
            "text": "Okay now here we are in 2017, and we're there again. I'm sure there's lots of stuff going on but we can't see it. For example, I shipped a simple product called \"pngWriter\" last week. It takes about five minutes to explore. If you want to fully grok it, and you know a little CSS, maybe it takes a half hour. Yet there is no writeup of the product outside of my blog. No place everyone can turn to to find some new stuff to try out. ",
            "created": "Mon, 10 Jul 2017 22:51:24 GMT",
            "permalink": "http://scripting.com/2017/07/10.html#a065124"
        },
        {
            "text": "No, I don't mean <a href=\"https://www.producthunt.com/\">ProductHunt</a>. It's nice. But it's so hyped up. I just want to know about products from a person like Mike who I get to know. Everyone was trying to shoot to the top of the list. I just want to know about new products. Not every new product. And I want opinion. I know he or she might not be right. And save the hype. Just tell me what's going on. ",
            "created": "Mon, 10 Jul 2017 22:53:01 GMT",
            "permalink": "http://scripting.com/2017/07/10.html#a065301"
        },
        {
            "text": "I don't know who's going to do it. But someone please, if you have the time and a natural inclination to blog, and love the open web, give it a try. Let me know where to send readers and links to interesting products I discover. ",
            "created": "Mon, 10 Jul 2017 22:53:46 GMT",
            "permalink": "http://scripting.com/2017/07/10.html#a065346"
        },
        {
            "text": "PS: If you decide to do this, there will be assholes who try to get you down. That happened to Mike, and I wrote <a href=\"http://scripting.com/2005/10/31.html#When:7:42:05PM\">this post</a> to encourage him. It even had a <a href=\"http://static2.podcatch.com/blogs/gems/snedit/EthanLiptonYouWereRight.mp3\">song</a> linked to it. The song is corny, but it hits the mark squarely. ",
            "created": "Mon, 10 Jul 2017 22:59:48 GMT",
            "permalink": "http://scripting.com/2017/07/10.html#a065948"
        }
    ],
    "permalink": "http://scripting.com/2017/07/10.html#a064914"
}