{
    "text": "All those windows on the 4 train",
    "created": "Wed, 13 Oct 2021 14:26:26 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "An asshole NYT columnist once asked if I was too old to understand the latest technology. I was so offended, I didn't think to just answer the question.",
            "created": "Wed, 13 Oct 2021 14:26:38 GMT",
            "flInCalendar": true
        },
        {
            "text": "The answer is unknowable. I think I understand a lot about tech, because I've spent my entire professional life trying to. I also have created some of the technology that young people feel so proud of understanding better than older people. I think I understand podcasting, for example, as well as any young-un.",
            "created": "Wed, 13 Oct 2021 14:27:02 GMT",
            "flInCalendar": true
        },
        {
            "text": "Once when I was a kid, <a href=\"https://www.google.com/maps/dir/29-31+170th+Street,+Queens,+NY/The+Bronx+High+School+of+Science,+75+W+205th+St,+Bronx,+NY+10468/@40.8102893,-73.9598169,12z/data=!4m17!4m16!1m5!1m1!1s0x89c28a8078136589:0xcdf1c8651455269a!2m2!1d-73.7949205!2d40.7696434!1m5!1m1!1s0x89c2f39fba19f047:0x456fa7ab9f9bae18!2m2!1d-73.8914555!2d40.8779882!2m1!5e1!3e3!5i1\">commuting</a> to high school in the Bronx from Queens, I was struck by all the apartment houses whose windows faced <a href=\"https://en.wikipedia.org/wiki/4_(New_York_City_Subway_service)\">the 4 train</a>. Mile after mile. Countless windows facing the train. And behind them more buildings and more windows. ",
            "created": "Wed, 13 Oct 2021 14:27:09 GMT",
            "flInCalendar": true
        },
        {
            "text": "Behind every window was a family, with all their challenges, accomplishments, pride, love, beliefs, bad habits, histories, everything. It gave me an idea, how could you possibly think you understand all that's going on. ",
            "created": "Wed, 13 Oct 2021 14:27:43 GMT",
            "flInCalendar": true
        },
        {
            "text": "Now, 50 years later, I think the thing is to be open to learning from other people's experiences, and don't presume you understand anything better than anyone else, because when you do that, you close yourself off to learning from them.",
            "created": "Wed, 13 Oct 2021 14:28:17 GMT",
            "flInCalendar": true
        },
        {
            "text": "I would say to that NYT asshole that it's the disease of your profession to think you don't have to listen anymore. It's also the disease of programmers, doctors, professors, everyone who gets somewhere in life, to think they've arrived at the top and they have a full understanding of everything they need to understand. That asshole could learn a lot from an asshole like me. All those years, he didn't. And that's not just his problem, because so many people listen to him, it's our problem too. Because he's not as informed imho as he could be. .",
            "created": "Wed, 13 Oct 2021 14:28:40 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}