{
    "text": "How do you know?",
    "created": "Tue, 21 Feb 2023 17:12:28 GMT",
    "type": "outline",
    "description": "I wanted my life to have meaning. I wanted to make a difference. ",
    "subs": [
        {
            "text": "I went through my midlife crisis in the 90s. Till then, my life was directed toward success. Something I wanted ever since I was a small child. I wanted to do something great and creative. Maybe invent something. I wanted my life to have meaning. I wanted to make a difference. And I wanted to be recognized for my accomplishments.",
            "created": "Tue, 21 Feb 2023 17:12:31 GMT",
            "image": "http://scripting.com/images/2019/08/18/bigLittleLies.png",
            "flInCalendar": true
        },
        {
            "text": "I arrived in the 90s with most of the boxes checked. Then I waited for the feeling of satisfaction. I waited for everyone whose approval I yearned for to approve of me. Nothing. Emptyness. All the approval felt conditional, hollow, not based on any understanding of who I am. ",
            "created": "Tue, 21 Feb 2023 17:14:19 GMT",
            "flInCalendar": true
        },
        {
            "text": "So, did I approve of myself? No, not in any way. I was living a lie. Trying to design myself to fit into everyone else's idea of a worthwhile man. I wasn't listening to myself. I was letting other people define me. ",
            "created": "Tue, 21 Feb 2023 17:16:26 GMT",
            "flInCalendar": true
        },
        {
            "text": "I still had another hill to climb, to learn how to listen to the internal chatter always going on inside me. All the voices, who were they and what did they want? Which were the powerful ones, and which were just nagging critics. ",
            "created": "Wed, 22 Feb 2023 02:18:36 GMT",
            "flInCalendar": true
        },
        {
            "text": "I started writing publicly frequently, and then every day. I took risks, and told stories that didn't used to make it to journalism. I was offered a writing job at Wired. And I developed software to support this new activity, and in the process created something new, and this time wasn't aimed at fame and fortune, checking the boxes. It was simply something I wanted to have. Not saying the software I did before was just for checking boxes, that was never the case. Just that this was the first software I made that had nothing to do with checking the boxes. ",
            "created": "Tue, 21 Feb 2023 17:18:05 GMT",
            "flInCalendar": true
        },
        {
            "text": "Another thing I did was start therapy in 1994. Eight years on the couch. Talking about myself. Being heard by someone whose job it was to listen. ",
            "created": "Tue, 21 Feb 2023 17:20:26 GMT",
            "flInCalendar": true
        },
        {
            "text": "The first big discovery came a couple of years in. ",
            "created": "Tue, 21 Feb 2023 17:21:09 GMT",
            "flInCalendar": true
        },
        {
            "text": "I was frustrated with something a relative did. I said \"I know what he's doing right now.\" I was sure of it. ",
            "created": "Tue, 21 Feb 2023 17:21:47 GMT",
            "flInCalendar": true
        },
        {
            "text": "The therapist asked: \"How do you know?\"",
            "flInCalendar": true
        },
        {
            "text": "That stopped me. I said: \"I don't know.\"",
            "created": "Tue, 21 Feb 2023 17:21:58 GMT",
            "flInCalendar": true
        },
        {
            "text": "Then I asked: \"Why didn't you ask that before?\"",
            "created": "Tue, 21 Feb 2023 17:22:04 GMT",
            "flInCalendar": true
        },
        {
            "text": "Therapist: \"I've been asking all along, this is the first time you responded.\"",
            "created": "Tue, 21 Feb 2023 17:22:18 GMT",
            "flInCalendar": true
        },
        {
            "text": "The big lesson was, as you dream your way through life, before you make a decision, check with your senses to see if the perception was right. ",
            "created": "Tue, 21 Feb 2023 17:24:32 GMT",
            "flInCalendar": true
        },
        {
            "text": "Always ask yourself how you know what the other person is doing.  ",
            "created": "Tue, 21 Feb 2023 17:38:14 GMT",
            "flInCalendar": true
        },
        {
            "text": "PS: Here's a <a href=\"http://scripting.com/davenet/1997/05/07/Programmers.html\">post</a> from 1997 that goes into much more detail on this idea. \"I know this sounds geekish, but it pays to use the scientific method in relationships with other people.\" ",
            "created": "Tue, 21 Feb 2023 20:55:42 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}