{
    "text": "If Biden <i>doesn't</i> choose Harris",
    "created": "Mon, 10 Aug 2020 14:51:53 GMT",
    "type": "outline",
    "metaImage": "http://scripting.com/images/2020/08/10/harrisBiden.png",
    "description": "It would be a sign of weakness and ignorance, even naiveté for Biden to choose her.",
    "subs": [
        {
            "text": "From a <a href=\"https://www.facebook.com/dave.winer.12/posts/1300841583456577?comment_id=1300853373455398&reply_comment_id=1301136613427074\">thread</a> on Facebook.",
            "created": "Mon, 10 Aug 2020 14:52:03 GMT",
            "subs": [
                {
                    "text": "My two cents on Kamala Harris and baggage.",
                    "created": "Mon, 10 Aug 2020 14:54:29 GMT"
                },
                {
                    "text": "She has the worst kind of baggage. She's already tried to humiliate Biden, unfairly, in public. It didn't work. My experience in life is if you let something like that go, they do it again and again. The relationship is over. She took a calculated risk and it didn't work. That's the way business and politics work. You don't often get do-overs. ",
                    "created": "Mon, 10 Aug 2020 14:52:00 GMT"
                },
                {
                    "text": "She can run for president again, maybe she'll win, but it would be a sign of weakness and ignorance, even naiveté for Biden to choose her. There are so many other possibilities. ",
                    "created": "Mon, 10 Aug 2020 14:52:48 GMT"
                },
                {
                    "text": "He may just have to weather the nonsense from Harris supporters, and there are many and they are vocal, and pushy (not her, her supporters, some of whom I consider friends), and then we can tell the people who are trying to raise hell that they're playing with our lives and their own lives, and they should just let it rest. ",
                    "created": "Mon, 10 Aug 2020 14:53:04 GMT"
                },
                {
                    "text": "That said, she's also from California, which won't get you a lot of votes in Iowa or Wisconsin.",
                    "created": "Mon, 10 Aug 2020 14:53:41 GMT"
                }
            ]
        }
    ]
}