{
    "text": "My life has a musical track",
    "created": "Tue, 02 Sep 2025 20:41:24 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "How you know you’re <i>reallllly</i> old. You tell Alexa to play songs by Elton John and you find yourself singing along with <a href=\"https://youtu.be/75r0nQu-hMs?si=eB17vFtdknnE8lbJ\">Crocodile Rock</a> with tears streaming down your face. Then they play <a href=\"https://www.youtube.com/watch?v=gM4Xm2MGLNQ\">Philadelphia Freedom</a>. Mama mia.",
            "created": "Tue, 02 Sep 2025 20:39:15 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The thing about Crocodile Rock is that it's twice-nostalgic. He's singing about a generation-older than mine. Yet it planted in my memory connected to a period in my own life. I was a freshman at Lehman College in the Bronx, recovering from a raucous high school experience where I dropped out and moved into an apartment in the Bronx at 16 and came pretty close to losing my middle-class education-valuing upbringing. At Lehman, I was investing in myself and found out I was good at the things I thought I was no good at because the teachers were so awful. I got a good math teacher, Dr Isaacs, who treated me special because I had a good mind for math, it turns out. And thus I became a programmer when I thought I would likely go into politics before that. I still had the taste for politics, and as it turns out, writing, so I combined all of them into one, and out comes blogging and podcasting, and complicated algorithms that do simple easy to understand things. ",
            "created": "Tue, 02 Sep 2025 20:42:26 GMT",
            "image": "https://imgs.scripting.com/2025/09/02/captainFantastic.png",
            "flInCalendar": true
        },
        {
            "text": "And now <a href=\"https://en.wikipedia.org/wiki/Scott_Knaster\">Scott Knaster</a> who has had an exciting <a href=\"https://tidbits.com/2025/03/18/check-out-scott-knasters-adjacent-to-greatness-substack-newsletter/\">Adjacent to Greatness</a> career <a href=\"https://www.facebook.com/dave.winer.12/posts/pfbid0nDyfb6C6UQg8vFxWDM4Z1NZPNg5r2mVXGaDSKNMgwsqSCp8kotQ786aPZ49T5h5nl?comment_id=643762492104935\">says</a> that Philadelphia Freedom is <a href=\"https://www.eltonjohn.com/stories/billie-jean-king-talks-about-philadelphia-freedom\">about</a> <a href=\"https://en.wikipedia.org/wiki/Billie_Jean_King\">Billie Jean King</a>. I did not know that!",
            "created": "Tue, 02 Sep 2025 20:44:17 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}