{
    "text": "Trolls on Twitter",
    "created": "Mon, 25 Sep 2017 13:15:19 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Yesterday Joan Walsh posted a screed on Facebook (sorry <a href=\"http://scripting.com/2017/05/31.html#a110526\">no pointer</a>, just a <a href=\"http:///scripting.com/images/2017/09/25/walshOnFacebook.png\">screen shot</a>) about trolls on Twitter, and how Twitter needs to do something about it.",
            "created": "Mon, 25 Sep 2017 13:15:27 GMT"
        },
        {
            "text": "I asked a straight/naive question -- Isn't blocking him enough?",
            "created": "Mon, 25 Sep 2017 13:16:02 GMT"
        },
        {
            "text": "She replied: \"I've blocked him at least 11 times. I'm done. He's totally recognizable, he uses the same screen name, just adds a number! He's ugly and abusive, and why can't they figure it out? And it always takes about a dozen of us to get his new ID blocked.\"",
            "created": "Mon, 25 Sep 2017 13:16:22 GMT"
        },
        {
            "text": "And then Hue Ha said: \"Joan it's not personal. Twitter is losing $100 million every three months; unfortunately protecting their users is not a priority. And these tech companies are full of servers; there's very few people in them.\"",
            "created": "Mon, 25 Sep 2017 13:18:31 GMT"
        },
        {
            "text": "She went on to tell how she was a driver for Uber. \"Uber only communicated with drivers by canned emails, people think it's like American Airlines with a lost luggage department.\"",
            "created": "Mon, 25 Sep 2017 13:19:05 GMT"
        },
        {
            "text": "So the problem is and isn't solvable. If Twitter had the personnel to do it, they could recognize the pattern and shut him down when he pops up. Or at least be more responsive to claims of abuse. But they don't have the people, or the money to hire them. Twitter is bleeding cash. They <i>can't</i> throw money at it. ",
            "created": "Mon, 25 Sep 2017 13:26:04 GMT"
        },
        {
            "text": "More and more I'm realizing that Twitter and Facebook are just new instances of something we're really familiar with -- mail lists and discussion groups, without the human qualities. We found the answer, many years ago -- blogs. There's a physics to online discourse. Twitter/Facebook solve some of the problems of discussion groups, with blocking and following, but underneath it all it's still the same problem, everyone's voice is equal, so one troll can shut the whole thing down.  ",
            "created": "Mon, 25 Sep 2017 13:19:41 GMT"
        },
        {
            "text": "There are things I like about Facebook, still -- for example it allows me to interact with a TV personality like Walsh. I don't get angry with her for posting regurgitated MSNBC talking points, because she is a source of them. But when I want to speak and have a chance at being heard, nothing beats my blog.",
            "created": "Mon, 25 Sep 2017 13:23:09 GMT"
        }
    ]
}