{
    "created": "2022-12-22T05:00:00.000Z",
    "flInCalendar": true,
    "name": "22",
    "path": "2022/12/22",
    "text": "December 22",
    "type": "calendarDay",
    "subs": [
        {
            "text": "<a href=\"http://scripting.com/2014/09/18/ridingSouthOnTheHudsonPath.html\">Video</a>: I miss my daily rides on the Hudson River bike path. ",
            "created": "Thu, 22 Dec 2022 14:12:45 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=xRPeChYMV04",
            "flInCalendar": true
        },
        {
            "text": "Advice for Elon Musk",
            "created": "Thu, 22 Dec 2022 14:54:20 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2022/12/22/oneMoreThing.png",
            "description": "You have to be less accessible. You can't just be one of the gang, that's something you gave up when you became the icon that you are. ",
            "subs": [
                {
                    "text": "A bit of advice to Elon Musk, assuming this isn't all an elaborate act. I've been through what you're going through on a smaller scale, but no less intense.",
                    "created": "Thu, 22 Dec 2022 14:54:26 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Usually CEOs of companies or leaders of movements aren't very accessible online. Think of Steve Jobs for example. There was always a lot of distance between him and users. Think of a guy on a stage whose presence is 100 times life size on a projection screen. Not someone you could walk up to and throw a pie at. ",
                    "flInCalendar": true
                },
                {
                    "text": "But you want to be in the mix, you get something from it. I understand, I do too. But then you have to be prepared for the pies in the face. And instead of calling the pie thrower a jackass, which he is for sure, just turn around and leave. \"Gotta go.\" Poof you're out of there.",
                    "created": "Thu, 22 Dec 2022 14:55:04 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "You can't try to engage with them, show them that you're smart and well-intentioned, it doesn't work. You have to be less accessible. You can't just be one of the gang, that's something you gave up when you became the icon that you are. ",
                    "created": "Thu, 22 Dec 2022 15:00:46 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "If you want some prior art on how to do it, look at how Jack Dorsey does it. I think he's basically a quiet person, so it's easy for him. You are not, you're an extrovert. But being quiet works for Jack. You command a very large enterprise. Your actions will have far more impact than your words. Interacting with the world as if you can make everyone love you, honestly none of them love you, or ever will. They just want to touch you. And some of them want to hurt you. Better to speak through what you do. None of them will ever come to their senses and realize what you want them to realize, whatever that is. ",
                    "created": "Thu, 22 Dec 2022 15:02:05 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "And btw, you need to clean up your act a bit, it's insincere to complain about people endangering your life when you do it to others. You may be super-rich but you're just a person. I think in some sense that's what you're trying to say. But you have to live within some of the constraints the rest of us live with. Using your huge following to create real problems for real people, that's just going to come back to you with just as much force. Better to not use your power that way. ",
                    "created": "Thu, 22 Dec 2022 14:55:40 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Happy holidays!",
            "created": "Thu, 22 Dec 2022 14:15:26 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Have a great holiday season! :smile:",
                    "created": "Thu, 22 Dec 2022 14:15:31 GMT",
                    "inlineImage": "http://scripting.com/images/2022/12/22/happyHolidays.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}