{
    "text": "Do you feel you're better than me?",
    "created": "Thu, 21 Jul 2022 16:35:18 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1550156845976879104\">A poll on Twitter</a>. ",
            "created": "Thu, 21 Jul 2022 16:35:25 GMT",
            "urltweet": "https://twitter.com/davewiner/status/1550156845976879104",
            "flInCalendar": true
        },
        {
            "text": "The reason I ask is that I'm often surprised when people act as if they are better than me.",
            "created": "Thu, 21 Jul 2022 16:35:38 GMT",
            "flInCalendar": true
        },
        {
            "text": "Like a person I knew before he was super rich, when I suggested we might work on something together, responds as if I was a lunatic to think he would bend that low. I'd love to ask why he responded so negatively, but I can't do that, because I don't want to go there, to really hear the nasty bits or intonations inside this person. But I wouldn't mind knowing if I didn't have to be present when he gave his answer. It's kind of like what Woody Allen <a href=\"https://www.azquotes.com/author/291-Woody_Allen/tag/death\">says</a> about death. \"I am not afraid of death. I just don't want to be there when it happens.\"",
            "created": "Thu, 21 Jul 2022 16:35:48 GMT",
            "flInCalendar": true
        },
        {
            "text": "I have friends from another country, a country that in general feels superior to America. The friends have always acted as if they were better. It sometimes comes out as a joke, but the behavior is there too, indicating that like most jokes, they are also truths. Anyway I think <i>I'm</i> better because my country is a lot bigger and richer than theirs, we have more nukes, and we create more kickass tech and culture. But then I remember my own country is net-net such a jackass internationally, and I remember that we also had <a href=\"https://en.wikipedia.org/wiki/Slavery_in_the_United_States\">slavery</a> for 250 years, and we still haven't turned the corner on that. But you have a queen and I know you think that's a positive, but I think it's quaint and more than a bit sad. A family of fat boring people who supposedly have a special connection to god? Please spare me. We have people like that here too, and we're trying to put them in jail. :smile:",
            "created": "Thu, 21 Jul 2022 16:36:46 GMT",
            "flInCalendar": true
        },
        {
            "text": "Basically the lesson is this -- we all suck. Judge us on what we've done, our actions. Inside we all have ugly thoughts, the question is how much do you act on them. If you think I've created something interesting, consider that perhaps I could do it again. If I've been generous maybe I am generous. Maybe you have prejudices. I can't tell you how many times I've been dismissed as too old to do what I actually did. Like the time, at a conference, a young person asked if I knew what a podcast was, with a doubtful look on her face as if oh god I can't believe I'm actually talking to someone this ignorant. ",
            "created": "Thu, 21 Jul 2022 16:38:35 GMT",
            "flInCalendar": true
        },
        {
            "text": "I find I do it too, and I've tried to consciously overrule my prejudices, and consider the possibility that someone who doesn't look like they could know anything actually does. ",
            "created": "Thu, 21 Jul 2022 16:40:07 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}