{
    "text": "August 12",
    "created": "Sat, 12 Aug 2017 14:19:24 GMT",
    "name": "12",
    "subs": [
        {
            "text": "NYDN front <a href=\"https://twitter.com/NYDailyNews/status/896553158142545921\">page</a>.",
            "created": "Sun, 13 Aug 2017 02:50:54 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/NYDailyNews/status/896553158142545921"
        },
        {
            "text": "How to oppose white supremacists safely and effectively.",
            "created": "Sat, 12 Aug 2017 14:19:25 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/bradengirl/status/896361666757132288"
        },
        {
            "text": "I believe a \"fractional horsepower\" Twitter has a place. Twitter itself is like a major news organization. FHPT is a blog.",
            "created": "Sat, 12 Aug 2017 14:35:13 GMT",
            "type": "outline"
        },
        {
            "text": "Mr Kim's bar mitzvah",
            "created": "Sat, 12 Aug 2017 14:27:09 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "What to do about North Korea. I've thought about this, as has everyone else, for a long time. Read a bunch of stuff. Listened. Discussed. And I have two takeaways.",
                    "created": "Sat, 12 Aug 2017 14:27:32 GMT",
                    "flNumberedSubs": "true",
                    "image": "http:///scripting.com/images/2017/08/12/kim.png",
                    "subs": [
                        {
                            "text": "Accept it. North Korea has nuclear weapons. and can deliver them anywhere in the world at any time. It's time for the world to transition. Accept North Korea as a nuclear power. Have a bar mitzvah for Kim Jong Un. Say a prayer. Wish Kim Jong Un well. He's a man. Welcome North Korea to the league of nations.",
                            "created": "Sat, 12 Aug 2017 14:27:44 GMT"
                        },
                        {
                            "text": "Embrace the people of North Korea as citizens of the world, our equals. To survive they have to trust us, and like it or not we have to trust them. In the meantime, send them all our programming. Starbucks. Amazon. HBO. JavaScript. YouTube. Eventually they will exert power over their leadership. Hope they have better judgement than the voters of the United States.",
                            "created": "Sat, 12 Aug 2017 14:28:40 GMT"
                        }
                    ]
                }
            ]
        }
    ]
}