{
    "text": "August 14",
    "created": "Mon, 14 Aug 2017 13:49:49 GMT",
    "name": "14",
    "subs": [
        {
            "text": "Here's the third in a <a href=\"http://scripting.com/2017/08/07.html#a093801\">series</a> of new NPM packages I've produced in the last few months. This one is called <a href=\"https://github.com/scripting/githubpub\">githubpub</a>. It's close to the <a href=\"http://scripting.com/2017/08/13.html#a094412\">ideal</a> for the #indieweb storage system. You put your web content in GitHub repositories, and they are served directly from there from the public API, with a domain name associated with each site. It's not as easy as Dropbox, and requires a bunch of setup, probably not something for end users, but a bunch of the pieces are there and work. ",
            "created": "Mon, 14 Aug 2017 14:37:43 GMT",
            "type": "outline",
            "image": "http:///scripting.com/images/2017/08/14/funky.png"
        },
        {
            "text": "We are right now at peak peach. If you love a peach as I do now's the time.",
            "created": "Mon, 14 Aug 2017 20:56:15 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/897098004536197121\">Poll</a>: Do you have a relative who Trump reminds you of?",
            "created": "Mon, 14 Aug 2017 14:11:31 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/897098004536197121"
        },
        {
            "text": "Protestors in Durham NC <a href=\"https://twitter.com/DerrickQLewis/status/897235297485901825\">topple</a> confederate monument.",
            "created": "Mon, 14 Aug 2017 23:23:31 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/DerrickQLewis/status/897235297485901825"
        },
        {
            "text": "Just a place where I can fart around testing out the new stuff.",
            "created": "Mon, 14 Aug 2017 23:25:45 GMT",
            "type": "outline"
        },
        {
            "text": "Venture capitalist Bijan Sabet <a href=\"http://bijansabet.com/post/164177979693/catastrophically-bad-judgment\">says</a> \"people in the workplace should not face any form of discrimination for their own personal politics and preferences.\" I agree, strongly. But then he struggles with what it means when Peter Thiel, a board member of Facebook supports Trump. I felt that Facebook should fire Thiel as a board member because his views about free speech are in <a href=\"https://www.vanityfair.com/news/2016/11/nick-denton-peter-thiel-plot-to-murder-gawker\">conflict</a> with Facebook's mission. But I also objected strenuously when Brendan Eich was <a href=\"http://www.bbc.com/news/technology-26868536\">forced out</a> at Mozilla because he gave money to an org that opposed gay marriage in California, before the Supreme Court ruled on it. I could see how Thiel's actions re Gawker presented a problem for Facebook, but I felt that Mozilla and the tech industry blew the Eich call.",
            "created": "Mon, 14 Aug 2017 15:42:35 GMT",
            "type": "outline",
            "image": "http:///scripting.com/images/2017/08/14/firefox.png"
        },
        {
            "text": "I've always loved the <a href=\"https://en.wikipedia.org/wiki/Pueblo_Revival_architecture\">style</a> of New Mexico homes. Here's a great <a href=\"https://www.zillow.com/homedetails/561-Camino-Tierra-Alta-Santa-Fe-NM-87501/6822774_zpid/?utm_campaign=tid-2a5bc2cf-bff8-4a5a-8cee-eb119d81c5b9&utm_source=facebook&utm_medium=social-paid\">example</a>. I have Zillow send me listings like this one, think of it as <i>real estate porn,</i> so I can dream about the kind of life one would have in such a place. It was easier to dream when I was younger. Now I'm too wise. I know that the picture a house paints has little to do with the lives that are led inside it. Sometimes the most beautiful surroundings are home to the most miserable people. And there can be much happiness and love in humble even ugly surroundings. The beauty of a house is a symbol for us, a symbol of beauty inside the people living there. ",
            "created": "Mon, 14 Aug 2017 13:49:50 GMT",
            "type": "outline",
            "image": "http:///scripting.com/images/2017/08/14/mrIncognito.png"
        }
    ]
}