{
    "text": "August 15",
    "created": "Tue, 15 Aug 2017 14:14:31 GMT",
    "name": "15",
    "subs": [
        {
            "text": "A simple <a href=\"http://scripting.com/2016/12/30/theMlkButtonsArrived.html\">way</a> to show solidarity. Wear a MLK button for America. ",
            "created": "Wed, 16 Aug 2017 02:31:07 GMT",
            "type": "outline"
        },
        {
            "text": "Maddow asked a question tonight, wondering if <a href=\"http://www.nytimes.com/2017/08/15/us/politics/trump-charlottesville-white-nationalists.html\">what</a> <a href=\"http://www.slate.com/blogs/the_slatest/2017/08/15/trump_defends_charlottesville_marchers_in_press_conference.html\">Trump said</a> <a href=\"http://www.memeorandum.com/170815/p141#a170815p141\">today</a> helps the Nazis grow their movement. The answer is yes. The same way Al Qaeda and ISIS crave publicity for their atrocities, American terrorists use publicity to drive recruitment, to grow, so the next march and uprising is bigger. More campus invasions. A clash between the First and Second Amendments. Liberal college towns: Austin, Berkeley, Madison, Ann Arbor, Boulder, Cambridge, Portland, Raleigh. Every time POTUS does a press conference and whistles loudly saying he's behind the movement, expect more deplorables to step up. The people at the marches looked like people who last year at this time were going to Trump campaign rallies. ",
            "created": "Wed, 16 Aug 2017 02:16:15 GMT",
            "type": "outline",
            "image": "http:///scripting.com/images/2017/08/15/uncleSam.png"
        },
        {
            "text": "When the journos talk about Trump \"appealing to his base\" they are being too generous. He is a narcissist. There is no base. Just people who like him and those who hate him. If you like him you're cool (like the Nazis and KKK). If you criticize him, he's being treated unfairly.",
            "created": "Tue, 15 Aug 2017 18:02:46 GMT",
            "type": "outline"
        },
        {
            "text": "People puzzle over Trump. Really? Two things to remember. 1. This is a replay of his <a href=\"http://time.com/4240268/donald-trump-kkk-david-duke/\">refusing</a> to disavow the support of the KKK during the election. 2. The president is a narcissist. There is no one else in his mind. His thoughts involve only himself. He likes the Nazis because they like him. That's all there is. If they were ever to criticize him he would flip on them in an instant.",
            "created": "Tue, 15 Aug 2017 14:17:07 GMT",
            "type": "outline",
            "image": "http:///scripting.com/images/2017/08/15/trumpHead.png"
        },
        {
            "text": "Fairness only matters when it's Trump",
            "created": "Tue, 15 Aug 2017 14:27:39 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Trump says he was treated unfairly. ",
                    "created": "Tue, 15 Aug 2017 14:28:01 GMT"
                },
                {
                    "text": "What about Heather Heyer, the young woman who was <a href=\"https://en.wikipedia.org/wiki/2017_Unite_the_Right_rally#Vehicular_attack\">killed</a>?",
                    "created": "Tue, 15 Aug 2017 14:14:32 GMT"
                },
                {
                    "text": "What about Deandre Harris. Was he treated unfairly?",
                    "created": "Tue, 15 Aug 2017 14:26:13 GMT",
                    "urltweet": "https://twitter.com/mattmfm/status/897450990193958912"
                }
            ]
        }
    ]
}