{
    "text": "August 16",
    "created": "Wed, 16 Aug 2017 12:34:51 GMT",
    "name": "16",
    "subs": [
        {
            "text": "Problem with the <a href=\"http://www.politico.com/story/2017/08/16/trump-charlottesville-temper-chaos-241721\">president</a> is that he and the country he's supposed to lead have very different values. ",
            "created": "Thu, 17 Aug 2017 03:04:41 GMT",
            "type": "outline"
        },
        {
            "text": "Sorry friends, I am doing test posts again.      ",
            "created": "Wed, 16 Aug 2017 20:44:34 GMT",
            "type": "outline"
        },
        {
            "text": "Another good day of programming. Still working on <a href=\"http://instantdave.com/\">Instant Dave</a>.  Lots more functionality in the second iteration. One thing I must have is the ability to update. If an item on my blog updates, it must also update in the Instant Dave interface. I often edit after I post initially. Correct spelling, tighten up the wording. Add links. These should all flow through to the people who are reading my stuff in Instant Dave. ",
            "created": "Wed, 16 Aug 2017 18:05:26 GMT",
            "type": "outline"
        },
        {
            "text": "Another day of look-away",
            "created": "Wed, 16 Aug 2017 12:37:13 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I was having a  good day yesterday until I started seeing tweets about the press conference. With dread I turned on MSNBC at 6PM and watched. When they started airing his full press conference I switched to a <a href=\"https://en.wikipedia.org/wiki/Law_%26_Order\">Law & Order</a> rerun. By the time Maddow was over it was just one more thing. She did run a clip of Fox, when first processing the press conference. It was cause for hope. But of course by the morning I'm sure they've reconnected with their bosses, found their spin, and are ready for another day of look-away.",
                    "created": "Wed, 16 Aug 2017 12:37:24 GMT",
                    "image": "http://scripting.com/images/2017/08/15/uncleSam.png"
                },
                {
                    "text": "How does this end?",
                    "created": "Wed, 16 Aug 2017 12:52:17 GMT"
                }
            ]
        }
    ]
}