{
    "text": "August 18",
    "created": "Fri, 18 Aug 2017 12:56:49 GMT",
    "name": "18",
    "subs": [
        {
            "text": "For some crazy reason I'm tempted to go down to <a href=\"https://en.wikipedia.org/wiki/Washington_Square_Park\">Washington Square Park</a> tomorrow to observe the Nazis. I'm guessing most of them come from Staten Island and New Jersey, maybe some from out on the Island. Tomorrow also is the final <a href=\"http://www.nyc.gov/html/dot/summerstreets/html/home/home.shtml\">Summer Streets</a> bike ride from 7AM to 1PM starting at Park Ave and 72nd St, through 4th Ave and onto Lafayette St, to the Brooklyn Bridge. Nazis coming by car should be aware that there will be limited cross-town access. Anyway, Summer Streets riders end up pretty close to Washington Square Park which tomorrow is Nazi-Land in NYC.",
            "created": "Fri, 18 Aug 2017 19:26:40 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/08/08/dany.png"
        },
        {
            "text": "Doc is going on an <a href=\"https://twitter.com/dsearls/status/898643314798346242\">Eclipse Safari</a> in Wyoming. ",
            "created": "Fri, 18 Aug 2017 20:54:46 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/dsearls/status/898643314798346242"
        },
        {
            "text": "<a href=\"http://nymag.com/daily/intelligencer/2017/08/trumps-cville-response-should-change-everythingit-wont.html?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed:+nymag/intelligencer+(Daily+Intelligencer+-+New+York+Magazine\">Andrew Sullivan says</a> that Charlottesville is even worse than it might appear at first because it has shown that Trump can blow through another level of normalcy, and not pay a price in support from Repubs. Until this weekend, Nazis and the KKK were unimportant fringe groups. This is no longer true. This is the United States, our world leadership is <i>based on</i> our defeating the Nazis in World War II. ",
            "created": "Fri, 18 Aug 2017 15:54:15 GMT",
            "type": "outline",
            "image": "http:///scripting.com/images/2017/08/18/uncleSam.png"
        },
        {
            "text": "Tina Fey on sheet caking",
            "created": "Fri, 18 Aug 2017 15:27:52 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/5eBWUgT-FlQ\" frameborder=\"0\" allowfullscreen></iframe>",
                    "created": "Fri, 18 Aug 2017 15:28:02 GMT"
                }
            ]
        },
        {
            "text": "Google says this blog is insecure",
            "created": "Fri, 18 Aug 2017 12:56:50 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I got an <a href=\"https://twitter.com/davewiner/status/898338171586400256\">awful email</a> from Google last night <a href=\"http:///scripting.com/images/2017/08/18/googleEmail.png\">saying</a> that <a href=\"http://scripting.com/\">my blog</a> has a security issue and Chrome would start warning people about it in October. Right off the bat you know it's bullshit, because if it were a real security issue, how could they justify waiting until October?",
                    "created": "Fri, 18 Aug 2017 12:57:00 GMT",
                    "image": "http://static.scripting.com/larryKing/images/2013/10/20/laughNow.gif"
                },
                {
                    "text": "Here's the story. At one time I had my own search engine because Google wasn't yet doing a great job of indexing blogs. There was a small search form on every page. The archive pages from the blog in this period, in 2006, eleven years ago, are still there. Here are <a href=\"http://scripting.com/2006/10.html\">the</a> <a href=\"http://scripting.com/2006/09.html\">examples</a> <a href=\"http://scripting.com/2006/07/18.html\">they</a> <a href=\"http://scripting.com/2006/11.html\">cited</a>. The forms don't work, the search engine is long-gone. They're afraid someone will type their SSN in that form and it will be observed and recorded by an intermediary. On a decade-old archive page.",
                    "created": "Fri, 18 Aug 2017 12:57:51 GMT"
                },
                {
                    "text": "Don't worry. The pages aren't going anywhere and I'm not modifying them. I try to keep the archive of this blog intact and unmodified. It serves not only as record of the events on the blog, but also the technology of the blog. If you've read this site at all you'd know it was central to the development of blogging and other technologies. The blog's HTML and scripts are part of the record. ",
                    "created": "Fri, 18 Aug 2017 13:15:55 GMT"
                },
                {
                    "text": "I have an uncountable number of domains I have used over the years. I try to keep the sites running to the best of my ability. I've been doing this since 1994. Converting them all to HTTPS isn't going to happen unless HTTPS becomes much more manageable. And as I've explained <a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+https+google+mozilla+eff&t=hy&ia=web\">many times</a> here, I like storing my blog content on Amazon S3, and HTTPS and S3 are not happy partners, if you want to use your own domain name, which of course I do.",
                    "created": "Fri, 18 Aug 2017 13:00:05 GMT"
                },
                {
                    "text": "Google will lie <i>about security</i> to accomplish a strategic objective. And a lot of people will believe them when they say \"Scripting News\" is a bad site. But over time, if they abuse the trust, they will lose it. That's the way this works. ",
                    "created": "Fri, 18 Aug 2017 13:01:53 GMT"
                },
                {
                    "text": "They've certainly lost me. I don't trust Google even a bit. They don't own the web, they didn't create it, and I'm not going to submit to them. If you can't read this site with Chrome, so be it. That's their choice. ",
                    "created": "Fri, 18 Aug 2017 13:02:54 GMT"
                },
                {
                    "text": "I think the EFF should stand up for the rights of individual bloggers vs the giant corporation, but don't hold your breath. EFF is funded by Google. Same old shit, just a different industry. ",
                    "created": "Fri, 18 Aug 2017 13:04:17 GMT"
                }
            ]
        },
        {
            "text": "Siskiyou chickens",
            "created": "Fri, 18 Aug 2017 13:22:12 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "My longtime friend Stan Krute took this <a href=\"http://siskiyoulife.com/2017/Fair/121878_2000_max_captioned.jpg\">picture</a> of three young contestants waiting to be judged <a href=\"https://www.google.com/maps/place/Siskiyou+Golden+Fair/@41.7070062,-123.191682,9z/data=!4m5!3m4!1s0x0:0x1136dfc372999fd7!8m2!3d41.7070062!4d-122.640134\">at</a> the <a href=\"http://sisqfair.com/\">Siskiyou County Golden Fair</a>.",
                    "created": "Fri, 18 Aug 2017 13:22:24 GMT"
                },
                {
                    "text": "<img src=\"http:///scripting.com/images/2017/08/18/chickens.png\" width=\"600\" height=\"566\" border=\"0\" style=\"margin-top: 15px; margin-bottom: 15px;\" alt=\"A picture named chickens.png\">",
                    "created": "Fri, 18 Aug 2017 13:22:18 GMT"
                },
                {
                    "text": "When I saw the picture on Facebook I wasn't sure if it was a <a href=\"https://duckduckgo.com/?q=Norman+Rockwell&t=h_&ia=web\">Norman Rockwell</a> painting. Stan really captures a sense of pride and anticipation. Human qualities, in young people, and their chickens.",
                    "created": "Fri, 18 Aug 2017 13:29:52 GMT"
                }
            ]
        }
    ]
}