{
    "text": "August 19",
    "created": "Sat, 19 Aug 2017 14:43:22 GMT",
    "name": "19",
    "subs": [
        {
            "text": "A <a href=\"https://twitter.com/davewiner/status/899057695155683328\">picture</a> is worth a thousand tweets. ",
            "created": "Sun, 20 Aug 2017 00:24:43 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/899057695155683328"
        },
        {
            "text": "In September of last year, Evan Osnos wrote a <a href=\"http://www.newyorker.com/magazine/2016/09/26/president-trumps-first-term?currentPage=all\">piece</a> in the New Yorker that imagined what the beginning of a Trump presidency would look like. I wanted this to be the beginning of a thread in journalism, give us an idea of what we were getting into. But the focus remained on Trump's outrageousness and the Russian leaks about Hillary. We blew it. Now I'd like to see a new thread that imagines what the sequence of events might be from here-out assuming Trump stays in office and his militia grow in power and the violence escalates. ",
            "created": "Sat, 19 Aug 2017 16:35:01 GMT",
            "type": "outline"
        },
        {
            "text": "Somewhere in America someone is devising plans for mass extermination. For once I hope the good people of this country get out in front of the progression. At every step we've not been willing to consider how it could get worse, and do what's needed to head it off. Then it gets worse and we do it again. Right now we have a Nazi president (I don't credit him with being a \"sympathizer\" as some do). We still have a political system that's capable of dealing with him, but the people who have the power refuse to use it. People already have died. We have to be ready to deal with the thugs and their violence, either way. The question is can we handle having the American government leading them? One more Supreme Court appointment and we'll have <a href=\"https://en.wikipedia.org/wiki/Open_carry_in_the_United_States\">open carry</a> everywhere and you'll have to be a white male non-Jewish property owner to vote. ",
            "created": "Sat, 19 Aug 2017 14:43:23 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/08/15/uncleSam.png"
        },
        {
            "text": "God is goofing on me. After I wrote the super-serious <a href=\"http://scripting.com/2017/08/19.html#a104323\">post</a> above, I dropped my Apple Watch and broke the screen. I've only broken one mobile device screen in all the years I've been using them, and after that I developed a routine to keep it from happening. Can't wear it. Too broken. Not safe. But my wrist feels totally naked without it. ",
            "created": "Sat, 19 Aug 2017 15:01:00 GMT",
            "type": "outline"
        }
    ]
}