{
    "text": "August 21",
    "created": "Mon, 21 Aug 2017 13:10:18 GMT",
    "name": "21",
    "subs": [
        {
            "text": "It's Trumps's fault, until further notice. <i>Everything.</i>",
            "created": "Mon, 21 Aug 2017 22:43:38 GMT",
            "type": "outline"
        },
        {
            "text": "NYC eclipse report: Everyone in NYC stopped. No one is moving. All are looking skyward.",
            "created": "Mon, 21 Aug 2017 22:46:34 GMT",
            "type": "outline"
        },
        {
            "text": "When I am thinking about \"eclipse\" the word my brain uses is \"earthquake.\"",
            "created": "Mon, 21 Aug 2017 22:59:11 GMT",
            "type": "outline"
        },
        {
            "text": "I keep saying don't underestimate Trump. Then <a href=\"http://talkingpointsmemo.com/livewire/trump-looks-at-sun-during-solar-eclipse\">this</a>.",
            "created": "Mon, 21 Aug 2017 22:39:12 GMT",
            "type": "outline"
        },
        {
            "text": "I bet many people haven't heard this classic World War II <a href=\"https://twitter.com/davewiner/status/899659896513335296\">ballad</a>. ",
            "created": "Mon, 21 Aug 2017 15:50:59 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/899659896513335296"
        },
        {
            "text": "I'm guessing w/o looking that Trump's religious council consists of preachers from churches that serve white Christians in the south. If there were any preachers whose congregations were not Christian whites from the south, they would have gotten off last week. These so-called religious leaders need to have scapegoats I guess. Doesn't seem very holy to me. Who's responsible for the suffering of white people? Everyone who's of a different religion, or if they're black or hispanic. They have everyone covered. We're all keeping the Master Race down, so they can be more masterful and less depressed. They've been doing this for centuries. Maybe even millenia.",
            "created": "Mon, 21 Aug 2017 15:39:23 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/08/02/bigGulp.png"
        },
        {
            "text": "Dolores Claiborne is a pretty great Stephen King <a href=\"https://en.wikipedia.org/wiki/Dolores_Claiborne\">novel</a> that's set during a total <a href=\"https://en.wikipedia.org/wiki/Solar_eclipse_of_July_20,_1963\">eclipse</a> in Maine. It was also a <a href=\"https://www.youtube.com/watch?v=NCO6cm0tIoY\">movie</a> starring Kathy Bates.",
            "created": "Mon, 21 Aug 2017 13:49:24 GMT",
            "type": "outline"
        },
        {
            "text": "I want to try to reconcieve blogging, to make it more like Facebook, but not in a silo. I've been having trouble convincing people this is possible, but it is -- if we believe it can. It really is that simple. Like <a href=\"https://en.wikipedia.org/wiki/Tinkerbell_effect\">Tinkerbell</a> and Peter Pan.",
            "created": "Mon, 21 Aug 2017 13:22:56 GMT",
            "type": "outline"
        },
        {
            "text": "I have a new version of \"Instant Dave\" almost ready. It's got a lot of RSS in it, some new ideas related to RSS. Ones I'm sure you'll find interesting. ",
            "created": "Mon, 21 Aug 2017 14:15:16 GMT",
            "type": "outline"
        }
    ]
}