{
    "text": "August 22",
    "created": "Tue, 22 Aug 2017 13:10:57 GMT",
    "name": "22",
    "subs": [
        {
            "text": "Good morning eclipse fans!",
            "created": "Tue, 22 Aug 2017 13:10:58 GMT",
            "type": "outline"
        },
        {
            "text": "Latest progress report on Instant Dave in a <a href=\"http:///scripting.com/images/2017/08/22/stillDiggin.png\">screen shot</a>. ",
            "created": "Tue, 22 Aug 2017 15:19:45 GMT",
            "type": "outline"
        },
        {
            "text": "Sarah Larson's New Yorker <a href=\"http://www.newyorker.com/culture/culture-desk/game-of-thrones-season-7-episode-6-recap-you-dont-understand\">reviews</a> of Game of Thrones make me LOL. ",
            "created": "Tue, 22 Aug 2017 13:48:12 GMT",
            "type": "outline"
        },
        {
            "text": "When Doc was starting his <a href=\"http://doc.weblogs.com/\">blog</a> in 1998 or so,  it took about six months for it to catch on. I was regularly pointing to Doc from my <a href=\"http://scripting.com/\">blog</a>, because his writing was so good and perspectives about the net so valuable. Six months. You have to show people steadiness. Update even if they aren't reading in the numbers you'd like. Keep doing it. It takes time to build up a trust, a pattern, a habit. And that's what reading a blog is, a habit. Conclusion: If there's a will to reboot blogging, we have to create that kind of habit, across a number of sites. ",
            "created": "Tue, 22 Aug 2017 13:48:53 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/06/17/bowling.png"
        },
        {
            "text": "Disgusting things Repubs do",
            "created": "Tue, 22 Aug 2017 13:33:07 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Alan Dershowitz is a weird guy. He says he's a liberal, but his <a href=\"https://www.mediaite.com/tv/alan-dershowitz-liberals-in-statue-debate-doing-what-stalin-did/\">words</a> are Republican. I should explain what that means. :apple:",
                    "created": "Tue, 22 Aug 2017 13:17:42 GMT",
                    "image": "http:///scripting.com/images/2017/08/22/v8.png"
                },
                {
                    "text": "There's a dishonest debating style that Repubs use, never heard a Democrat use it. They go on about how unfair it is for some Democrat to do X, Y and Z. They are things that are obviously unfair. He keeps going. Lots of examples. Of things that never happened. You nod your head. Those disgusting Democrats. What awful people. Such hypocrites. ",
                    "created": "Tue, 22 Aug 2017 13:19:59 GMT"
                },
                {
                    "text": "You have to be very circumspect when listening to a Repub like Dershowitz. Ask yourself each time he declares something a Demo did. Did they do it? Probably not. ",
                    "created": "Tue, 22 Aug 2017 13:59:30 GMT"
                },
                {
                    "text": "People who work for BigTechCo's use this technique too. It can be pretty egregious. People assume if you work for a famous company You Must Know. They take advantage of this, and say things that are not true knowing you'll probably believe them.",
                    "created": "Tue, 22 Aug 2017 13:22:24 GMT"
                }
            ]
        }
    ]
}