{
    "text": "August 23",
    "created": "Wed, 23 Aug 2017 14:30:44 GMT",
    "name": "23",
    "subs": [
        {
            "text": "<a href=\"http://screen2.io/\">screen2.io</a> has been refreshed. A maintenence release to get it in sync with other software components here in DaveLand. :boom:",
            "created": "Wed, 23 Aug 2017 15:22:28 GMT",
            "type": "outline"
        },
        {
            "text": "It's becoming hard to find news sources to point to. They all pop up ads, including Wikipedia. Many have videos that start playing automatically. It's nice to find a news site that doesn't do this. So far Axios and TPM are both reliable. But they don't have all the stories I want to link to. ",
            "created": "Wed, 23 Aug 2017 15:56:44 GMT",
            "type": "outline"
        },
        {
            "text": "I like yesterday's blockbuster <a href=\"https://www.sbnation.com/nba/2017/8/22/16186928/kyrie-irving-trade-celtics-isaiah-thomas-cavaliers\">trade</a> betw Boston and Cleveland. I think Cleveland got the better deal. Kyrie Irving is a solid superstar, but I don't think he drives other players to perform. Not like the guy they traded for, Isaiah Thomas. He's a force of nature. I guess the Celtics thought he would burn out fast and Kyrie will last a while and will like staying in Boston. Cleveland is destined to be volatile. But it'll be interesting to watch Thomas and LeBron team up. Two very different kinds of players.",
            "created": "Wed, 23 Aug 2017 15:46:44 GMT",
            "type": "outline"
        },
        {
            "text": "And we're still waiting for the deal the Knicks make for <a href=\"http://bleacherreport.com/articles/2728856-5-trade-ideas-to-finally-get-carmelo-anthony-to-houston\">Melo</a>.",
            "created": "Wed, 23 Aug 2017 15:51:57 GMT",
            "type": "outline"
        },
        {
            "text": "Trump's speech last night was all about him, and not at all about the victims of the Charlottesville terrorism, a word btw he <i>still</i> refuses to use. Also Trump made no mention of the sailors who died on the USS McCain.",
            "created": "Wed, 23 Aug 2017 14:30:45 GMT",
            "type": "outline"
        }
    ]
}