{
    "text": "August 28",
    "created": "Mon, 28 Aug 2017 15:18:58 GMT",
    "name": "28",
    "subs": [
        {
            "text": "The <a href=\"http://www.berkeleyside.com/2017/08/28/berkeley-community-comes-force-hate-racism/\">Berkeleyside report</a> on the protests in Berkeley yesterday. ",
            "created": "Mon, 28 Aug 2017 20:25:16 GMT",
            "type": "outline"
        },
        {
            "text": "The next programming <a href=\"https://github.com/paulmillr/chokidar/issues/633\">question</a> is about the Node <a href=\"https://github.com/paulmillr/chokidar\">package</a> for <a href=\"https://davidwalsh.name/node-watch-file\">watching</a> local folders.",
            "created": "Tue, 29 Aug 2017 01:32:43 GMT",
            "type": "outline"
        },
        {
            "text": "Sarah Larson's recaps of Game of Thrones episodes are the best. The one for the <a href=\"https://www.newyorker.com/culture/culture-desk/game-of-thrones-season-7-finale-recap-a-dragon-a-wolf-and-an-about-face\">season finale</a> is no exception. \"At this moment, my neighbors learned what it sounds like in my apartment when they are watching the Super Bowl: loud, delirious bellowing and overjoyed profanity.\" Indeed. My neighbors as well. There is that one delicious moment in this episode that makes all the suffering if not worthwhile at least understandable. ",
            "created": "Mon, 28 Aug 2017 15:39:46 GMT",
            "type": "outline",
            "image": "http:///scripting.com/images/2017/08/28/littlefinger.png"
        },
        {
            "text": "Two compelling lifestyle fantasies. An Italian <a href=\"http://www.telegraph.co.uk/property/abroad/italian-ghost-town-sale-entire-village-available-less-price/\">ghost town</a> you can buy for €250K, or a Joshua Tree <a href=\"https://la.curbed.com/2014/1/31/10148482/breathtaking-joshua-tree-supervillain-lair-for-sale-for-first-time-1\">art house</a> for $3 million. I used to have fantasies of living in places like these. To the person who lives in the town by themself or in the beautiful desert house far away from everything, show them a picture of an apartment building in NYC and point to one window and say \"you could live here\" and they'd get all excited about all the people they would see every day just by walking around. The grass is always greener on the other side, happiness is always just around the corner.",
            "created": "Mon, 28 Aug 2017 16:16:01 GMT",
            "type": "outline"
        },
        {
            "text": "American-style, neo-Nazi and Nazi-sympathizer",
            "created": "Mon, 28 Aug 2017 15:19:55 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "See Krugman's bit: <a href=\"https://www.nytimes.com/2017/08/28/opinion/fascism-arpaio-pardon-trump.html?smid=fb-share&_r=1\">Fascism, American-style</a>. I reject that. Fascism is fascism, whether it's in the US or Germany. Same thing. Adding an <i>American-style</i> softens it. Makes it seem more acceptable. Oh it's like baseball, apple pie and Chevrolet. That must be better. ",
                    "created": "Mon, 28 Aug 2017 15:20:18 GMT"
                },
                {
                    "text": "I also don't get when they call them neo-Nazis. What does the \"neo\" part mean? Something innovative and new? It's just Nazi. They wear 88 pins, they chant German Nazi slogans. If it sounds and looks like a Nazi, assume it's a Nazi. ",
                    "created": "Mon, 28 Aug 2017 15:21:22 GMT"
                },
                {
                    "text": "One more thing -- they call Trump a Nazi-sympathizer. Why be so generous. What distinguishes a sympathizer from an actual Nazi? We've been doing this with Trump at every stage, pretending he's not as bad as he clearly is.",
                    "created": "Mon, 28 Aug 2017 15:22:27 GMT"
                }
            ]
        }
    ]
}