{
    "text": "2024 is different from 2016",
    "created": "Wed, 13 Nov 2024 14:41:32 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "It's good to have a record of the things you posted and when you posted it. On August 12 of this year, I tweeted <a href=\"https://bsky.app/profile/did:plc:oety7qbfx7x6exn2ytrwikmr/post/3kzjvirjq3d2q\">this</a>: \"When the NYT makes Trump sound like a reasonable candidate that a sane person might vote for, remember this day.\" I included a <a href=\"https://imgs.scripting.com/2024/11/13/trumpIncitesMob.png\">screen shot</a> of the front page of the NYT on Jan 7, 2021. One in three Trump voters still <a href=\"https://x.com/froomkin/status/1856384929476624841\">watch mainstream news</a>, which follows the lead of the NYT, and if they had been straight with us, perhaps enough people who like Trump's style would have realized the danger, and voted in a conservative way, ie to conserve the Constitution. Because of how they covered it, we now get to re-run the 2016 experiment all over again. ",
            "created": "Wed, 13 Nov 2024 13:40:05 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2024/11/13/mobIncited.png",
            "flInCalendar": true
        },
        {
            "text": "But, as <a href=\"https://podcasts.apple.com/us/podcast/trump-won-what-now-with-heather-cox-richardson/id1583132133?i=1000676185735\">Heather Cox Richardson</a> points out in Jon Stewart's weekly podcast (a must-listen) -- we have more experience too, and perhaps will know better how to deal with Trump and know that <b>his bark is often worse than his bite.</b> I have to say as the new reality sinks in, I'm not as scared as I was on Election Night last week or even Election Night in 2016. A lot of people will sell out this time who didn't before. But the problems of climate change have gotten worse in the intervening years,  and people feel it in their bones, pocketbooks and fears. You think inflation was bad? This will be far worse and it's happening now, and nothing we can do at a human scale will make it go away. ",
            "created": "Wed, 13 Nov 2024 14:44:20 GMT",
            "flInCalendar": true
        },
        {
            "text": "We're dealing with a very unusual drought in the eastern US now. Fires are breaking out where we never used to have them. Yeah this shit is real, and even people who don't believe in science are feeling it. ",
            "created": "Wed, 13 Nov 2024 14:45:01 GMT",
            "flInCalendar": true
        },
        {
            "text": "As someone once said, you should <a href=\"https://www.reddit.com/r/Stoicism/comments/xdc8t4/never_let_a_good_crisis_go_to_waste/\">never waste a good crisis</a>. A lot of other people feel compelled to move. Unfortunately some are moving to the wrong place, as they always do. Making change isn't easy, but is possible, if you understand how people move. As they try to figure out what the Dem's failed at, that's it. ",
            "created": "Wed, 13 Nov 2024 14:45:22 GMT",
            "flInCalendar": true
        },
        {
            "text": "Skate to where the <a href=\"https://www.reddit.com/r/RocketLeague/comments/1bvv11l/i_skate_to_where_the_puck_is_going_to_be_not/\">puck will be</a>, not where it was, as another famous philosopher once said. And people don't listen to their friends, they listen to their competitors (which I said, sadly, but then put that fact to use to get various standards to fly by without debate). There is a method to human madness, in other words, imho.",
            "created": "Wed, 13 Nov 2024 14:48:54 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}