{
    "text": "It all fits together now",
    "created": "Thu, 13 Jul 2017 12:47:42 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Rachel Maddow said it best last night. She's no longer confused. Now she sees how the pieces fit together. Me too. ",
            "created": "Thu, 13 Jul 2017 12:48:23 GMT",
            "flNumberedSubs": "true",
            "subs": [
                {
                    "text": "Trump, pre-bankruptcies, financed his ventures the old-fashioned way, with bank loans. Then he defaulted, returned pennies on the dollar, and could no longer raise legit capital.",
                    "created": "Thu, 13 Jul 2017 12:48:26 GMT",
                    "image": "http://scripting.com/images/2017/07/13/washingMachine.png",
                    "permalink": "http://scripting.com/2017/07/13.html#a084826"
                },
                {
                    "text": "At the same time, Putin and his cronies were ascending in Russia, and needed places to park their gains outside Russia. People like Trump were perfect. And they didn't have to worry about him defaulting because they had <a href=\"https://en.wikipedia.org/wiki/Russian_mafia\">good</a> <a href=\"https://en.wikipedia.org/wiki/Brighton_Beach#Russian-speaking_cultures\">enforcers</a> that weren't available to legal banks.",
                    "created": "Thu, 13 Jul 2017 12:49:27 GMT",
                    "permalink": "http://scripting.com/2017/07/13.html#a084927"
                },
                {
                    "text": "It's a win-win. Trump is the perfect front for money-laundering. A loudmouth self-promoting con-man. Decides to run for president. His mob friends suggest Paul Manafort would make a good campaign manager. Trump doesn't like to micro-manage, so he says sure, why not.",
                    "created": "Thu, 13 Jul 2017 12:50:28 GMT",
                    "permalink": "http://scripting.com/2017/07/13.html#a085028"
                },
                {
                    "text": "Now it's time for the next-level management program for Trump. He has graduated from one of many western money-launderers to the presumptive nominee of the Republican Party. The Russians had hacked the systems of both parties, now they knew what they would use the mail archives for. For the Democrats, they'd release the emails when they needed to change the focus away from some Trump misdeed, and for the Repubs they'd <a href=\"https://en.wikipedia.org/wiki/Blackmail\">use</a> the emails to keep them from \"getting any ideas\" about who was in charge. ",
                    "created": "Thu, 13 Jul 2017 12:52:22 GMT",
                    "permalink": "http://scripting.com/2017/07/13.html#a085222"
                },
                {
                    "text": "They contact <a href=\"http://nypost.com/2017/07/11/donald-trump-jr-is-an-idiot/\">Junior</a> through <a href=\"http://www.bbc.com/news/world-us-canada-40567707\">Goldstone</a>. He says Russia <a href=\"https://en.wikipedia.org/wiki/Useful_idiot\">loves</a> your dad, wants to see him elected, can we meet to discuss? Junior loves it. They get together. Seal the deal. The Russian rep doesn't talk much, asks what Junior and Kushner <a href=\"https://en.wikipedia.org/wiki/Self-incrimination\">want</a>. Manafort is sitting on both sides of the table (possibly unbeknownst to Junior and Kushner) but mostly on the Russian side, of course. BTW, you can be sure the Russians have a <a href=\"https://en.wikipedia.org/wiki/Kompromat\">recording</a> of what was said at this meeting. ",
                    "created": "Thu, 13 Jul 2017 12:55:08 GMT",
                    "image": "http://scripting.com/images/2017/07/13/juniors.png",
                    "permalink": "http://scripting.com/2017/07/13.html#a085508"
                },
                {
                    "text": "Follow-up meetings take place. They introduce people in both organizations to each other. There are lots of connections at all levels through the campaign. The tracks are not well covered. And of course Russians have copies of all the emails (as they had copies of the ones that just leaked). When Flynn was fired because he could be blackmailed that must have been a good laugh for Trump et al, because that was the tip of the tip of the tip of the iceberg. ",
                    "created": "Thu, 13 Jul 2017 12:56:46 GMT",
                    "permalink": "http://scripting.com/2017/07/13.html#a085646"
                }
            ],
            "permalink": "http://scripting.com/2017/07/13.html#a084823"
        },
        {
            "text": "Anyway, this seems to be \"the arc\" of the relationship between Trump and Russia. Both countries are now controlled by the mob. They don't care if we know. It's all pretty much out in the open and all that the Russians care about is that their money-laundering <a href=\"https://newrepublic.com/article/143586/trumps-russian-laundromat-trump-tower-luxury-high-rises-dirty-money-international-crime-syndicate\">flows</a> are turned back on. They don't care about the other things we thought they might care about. The US can do whatever they want. They just want to be able to continue to use American <a href=\"https://en.wikipedia.org/wiki/Billionaires%27_Row_(Manhattan)\">real estate</a> as their piggybank.",
            "created": "Thu, 13 Jul 2017 12:59:48 GMT",
            "permalink": "http://scripting.com/2017/07/13.html#a085948"
        },
        {
            "text": "PS: Looking forward, either the Russians get their way and can start laundering again, or they're going to make our lives ever-more-hellish.",
            "created": "Thu, 13 Jul 2017 14:28:35 GMT",
            "permalink": "http://scripting.com/2017/07/13.html#a102835"
        }
    ],
    "permalink": "http://scripting.com/2017/07/13.html#a084742"
}