{
    "text": "September 1",
    "created": "Tue, 01 Sep 2020 11:17:29 GMT",
    "name": "01",
    "subs": [
        {
            "text": "Today's song: <a href=\"https://www.youtube.com/watch?v=SHhrZgojY1Q\">Won't Get Fooled Again</a>. <a href=\"https://genius.com/The-who-wont-get-fooled-again-lyrics\">Lyrics</a>.",
            "created": "Tue, 01 Sep 2020 16:23:43 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=SHhrZgojY1Q"
        },
        {
            "text": "Had to do a lot of driving today, so I listened to a bunch of podcasts including two from political consultants. <a href=\"https://podcasts.apple.com/us/podcast/gov-jerry-brown-on-how-to-save-our-democracy-and-planet/id1523896927?i=1000489608055\">Joe Trippi</a> interviewed former California governor <a href=\"https://en.wikipedia.org/wiki/Jerry_Brown\">Jerry Brown</a> and the <a href=\"https://podcasts.apple.com/us/podcast/land-of-unrest/id1514968525?i=1000489728138\">Lincoln Project</a> podcast talked about polling and how evenly divided the bases of the political parties are. Brown talked about how hard it was going to be for Biden to govern. They would need to be creative to find a way around the deadlock. Then I wondered why? Aren't they missing something? Isn't Covid-19 offering the chance to bring us together? <a href=\"https://en.wikipedia.org/wiki/Ronald_Reagan\">Ronald Reagan</a> once asked his Soviet counterpart <a href=\"https://en.wikipedia.org/wiki/Mikhail_Gorbachev\">Mikhail Gorbachev</a> if aliens attacked, would he <a href=\"https://www.smithsonianmag.com/smart-news/reagan-and-gorbachev-agreed-pause-cold-war-case-alien-invasion-180957402/\">pause the Cold War</a> and work with Reagan to fight them? Gorbachev said <i>hell yes</i> he would. Isn't Covid exactly that kind of opportunity? Why isn't the Lincoln Project running ads that informs voters that if we had a merely competent president, one who got out of the way of the government, we would be doing a lot better. Not only would far fewer people get sick and die, but we could go out to dinner and a movie. We could take a vacation. We could have a party. We could have Thanksgiving dinner with our family and celebrate Christmas together this year. We could hug our family and friends. All that's standing in the way is our working together. I've felt all along that the virus is making us smarter, and part of that is getting us to work together because that's smart. Would one of the PACs be willing to try that message? Show pictures of people all over the world, everywhere but the US, enjoying their lives, and ask would you like this for America? All you have to do is work with each other. That's really all it would take. There's only one candidate offering that. ",
            "created": "Tue, 01 Sep 2020 21:13:04 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/09/01/bidenHarris.png"
        },
        {
            "text": "If you like <a href=\"https://en.wikipedia.org/wiki/Succession_(TV_series)\">Succession</a>, here's a <a href=\"https://www.npr.org/2020/08/31/907923589/actor-cherry-jones\">great interview</a> with <a href=\"https://en.wikipedia.org/wiki/Cherry_Jones\">Cherry Jones</a>. She played the <a href=\"https://succession.fandom.com/wiki/Nan_Pierce\">Nan Pierce</a>, owner of PGM (which is really the NYT), who Logan Roy (in real life, Rupert Murdoch) wanted to buy. It's a really good interview and of course it's about Succession so it's even better. ",
            "created": "Tue, 01 Sep 2020 16:34:18 GMT",
            "type": "outline"
        },
        {
            "text": "OK, so -- I think it's time for TV to pick up the cue from Twitter and follow all the advice they've been dumping on Facebook. When someone says something <a href=\"https://twitter.com/oliverdarcy/status/1300620487207399424\">like this</a>, I don't care if he's president, you <i>have</i> to cut him off. Otherwise you're responsible for what happens.",
            "created": "Tue, 01 Sep 2020 15:54:38 GMT",
            "type": "outline"
        },
        {
            "text": "Believe it or not I've only used Zoom once, in read only mode. I was attending the virtual funeral for a longtime friend's mother. I don't know how I've been so lucky. I really do not like the idea of Zoom. ",
            "created": "Tue, 01 Sep 2020 11:38:01 GMT",
            "type": "outline"
        },
        {
            "text": "I was invited to a panel discussion on Clubhouse recently. I was to be one of the celebs, and there would be an audience. This is something I have not liked ever since we did the four BloggerCons. The concept of an audience just makes people go out into the hallway, and if you want people to be excited and engaged, and share their best ideas, there should no audience at all. I think Clubhouse might be good for that. But the discussion leader, who is like a reporter or a teacher, has to know most of the people in the room, to know who to call on. And the \"Raise Hand\" feature needs to be disabled for this. And people have to understand when their mike turns off and someone else starts speaking. It also wouldn't be bad if the moderator could give a little haptic nudge via the phone to the person they were about to call on, saying \"wake up you're about to be called on.\" Don't want to catch anyone napping. ",
            "created": "Tue, 01 Sep 2020 11:38:18 GMT",
            "type": "outline"
        },
        {
            "text": "States should have to buy insurance against mass shootings, to fund health care for victims or damages to families of those killed. That would give them incentive to control factors that cause mass shootings.",
            "created": "Tue, 01 Sep 2020 11:42:07 GMT",
            "type": "outline"
        },
        {
            "text": "Good morning and welcome to September 2020. The August OPML has been <a href=\"https://github.com/scripting/Scripting-News/blob/master/blog/opml/2020/08.opml\">archived</a> for those who are interested in such things. ",
            "created": "Tue, 01 Sep 2020 11:17:30 GMT",
            "type": "outline"
        },
        {
            "text": "Isn't it funny how no one is running an ad that says basically if you're stuck at home and ever hope to get out vote for Biden/Harris. I think we all know with Trump after a year or two if we're still alive, we'll volunteer to get the virus if we can just go to a party or go out to dinner and a movie. ",
            "created": "Tue, 01 Sep 2020 16:17:39 GMT",
            "type": "outline"
        },
        {
            "text": "In the <a href=\"https://duckduckgo.com/?q=tabs+vs+spaces&t=hk&ia=web\">tabs vs spaces</a> debate, I am firmly in the \"neither\" camp. Too low level a question. My editor <a href=\"http://scripting.com/images/2020/09/01/indentation.png\">understands code structure</a>. I don't indent with tabs or spaces, I indent with structure. ",
            "created": "Tue, 01 Sep 2020 11:28:49 GMT",
            "type": "outline"
        },
        {
            "text": "Will we have Thanksgiving together this year?",
            "created": "Tue, 01 Sep 2020 21:33:12 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/09/01/thanksgivingByRockwell.png"
        }
    ]
}