{
    "text": "September 3",
    "created": "Thu, 03 Sep 2020 13:11:15 GMT",
    "name": "03",
    "subs": [
        {
            "text": "When <a href=\"https://www.nytimes.com/2020/09/02/obituaries/tom-seaver-dead.html\">Tom Seaver</a> pitched in <a href=\"https://en.wikipedia.org/wiki/Flushing,_Queens\">Flushing</a>, the <a href=\"https://en.wikipedia.org/wiki/New_York_Mets\">Mets</a> players lived in our <a href=\"https://en.wikipedia.org/wiki/Auburndale,_Queens\">neighborhood</a>. And we went to lots of games at <a href=\"https://en.wikipedia.org/wiki/Shea_Stadium\">Shea</a>, when we were kids. <a href=\"https://en.wikipedia.org/wiki/Tom_Seaver\">Seaver</a> was our hometown <a href=\"https://www.mlb.com/news/tom-seaver-dies-at-75\">hero</a>, an <a href=\"https://www.nydailynews.com/sports/baseball/mets/ny-tom-seaver-tribue-20200903-panxjsrusrcqxcllna3j7oesmm-story.html\">idol</a>. ",
            "created": "Thu, 03 Sep 2020 14:25:02 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/09/03/tomSeaverBaseballCard.png"
        },
        {
            "text": "Stop and watch this <a href=\"https://twitter.com/joshscampbell/status/1301324061373538304\">CNN story</a> about evictions in Houston. They call it the \"downward spiral of the COVID economy.\" We are going to pay for this. The sooner we start the easier it's going to be on everyone, esp the poor families, but really everyone. We're on a downward spiral. The stories are going to get worse. ",
            "created": "Thu, 03 Sep 2020 14:34:57 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/joshscampbell/status/1301324061373538304"
        },
        {
            "text": "1948: <a href=\"https://www.pbs.org/video/dewey-defeats-truman-iypfom/\">Dewey Defeats Truman</a>.",
            "created": "Thu, 03 Sep 2020 13:22:59 GMT",
            "type": "outline"
        },
        {
            "text": "Oy the White House <a href=\"https://twitter.com/atrupar/status/1301569231922900992\">thinks</a> they're running a campaign. They're supposed to be running a country.",
            "created": "Thu, 03 Sep 2020 17:46:05 GMT",
            "type": "outline"
        },
        {
            "text": "Had a great chat on \"Clubhouse\" last night. One takeaway, I understand why there's no connection to the web at this time, I would probably do it that way too. Feel the pain of the missing feature, and then take a careful first step after gaining experience. I've learned over the years that you can't take features away from users, without a lot of pain. So you have to add features carefully. That said, I'd love to post a followup to that chat, in writing, but there's no way to do it. Creating a connection between my Clubhouse world and my blog world would be interesting. For that they'll need an API. :rocket:",
            "created": "Thu, 03 Sep 2020 13:11:16 GMT",
            "type": "outline"
        },
        {
            "text": "Status report on \"bingeworthy\" -- we have something to work with. Look at all the <a href=\"http://scripting.com/images/2020/09/03/gameOfThronesRaters.png\">people who rated</a> Game of Thrones.",
            "created": "Thu, 03 Sep 2020 13:28:46 GMT",
            "type": "outline"
        },
        {
            "text": "This election should be a <a href=\"https://en.wikipedia.org/wiki/Blowout_(well_drilling)\">blowout</a>. Americans are dying, the economy is a wreck, the country is careening and this time the casualties are at home. In a sane society, Trump would be in jail, Pence would be president and Biden would be preparing to take office in January.  There should be a permanent people's campaign, all day every day, every year, whether or not there's an election. Clearly waiting for the politicians and journalists to do this isn't working. And the current tech networks are mired, trying to serve everyone. Politics has moved online. So far it's been chaotic. But we could envision something that's orderly and productive and still preserve the energy. The idealistic vision of the early web wasn't entirely wrong, imho. :-)",
            "created": "Thu, 03 Sep 2020 13:46:02 GMT",
            "type": "outline"
        }
    ]
}