{
    "text": "September 7",
    "created": "Mon, 07 Sep 2020 13:57:11 GMT",
    "name": "07",
    "subs": [
        {
            "text": "People <a href=\"https://www.metacritic.com/tv/borgen\">rave</a> about <a href=\"https://en.wikipedia.org/wiki/Borgen_(TV_series)\">Borgen</a>, a 3-season Danish series. I've never been able to find it streaming. Just stumbled across it <a href=\"https://www.netflix.com/title/70302482\">on Netflix</a>.  ",
            "created": "Mon, 07 Sep 2020 15:19:32 GMT",
            "type": "outline"
        },
        {
            "text": "What will you do if Trump is re-elected?",
            "created": "Mon, 07 Sep 2020 13:57:12 GMT",
            "type": "outline"
        },
        {
            "text": "BTW, re the pandemic, everyone who thinks Trump has done badly up till now, it's about to get much worse. He's found his Bill Barr for managing the pandemic. His name is <a href=\"https://www.npr.org/sections/health-shots/2020/09/04/909348915/president-trumps-new-covid-19-advisor-is-making-public-health-experts-nervous\">Scott Atlas</a>. Suggest reading <a href=\"https://www.theatlantic.com/ideas/archive/2020/09/what-young-healthy-people-have-fear-covid-19/616087/\">this article</a>. ",
            "created": "Mon, 07 Sep 2020 14:18:40 GMT",
            "type": "outline"
        },
        {
            "text": "The day after Election Day in <a href=\"http://scripting.com/2016/11/\">2016</a>, I went for a walk around midtown Manhattan. It looked just like it did the day before. Nothing changed about the city. But I felt like people looked at each other differently. Did this person vote for Trump? Do they think I voted for Trump? I wanted to wear a button that said \"I voted for HRC.\" Or better, I'm on the other side. I came up with the [%search: MLK button%]. I bought a thousand of them, and gave them away. I still wear it some days when I'm out in public. It was a more general \"Black Lives Matter\". It said people are sacred and differences should be celebrated. And we're scared, so let's be there for each other. Today almost four years later, I suspect if you walk around Manhattan things are visibly different, and it's at least indirectly because Trump has been president for four years. Four more years? Hard to imagine how transformed this country will be then.",
            "created": "Mon, 07 Sep 2020 14:50:50 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/12/09/mlk.png"
        },
        {
            "text": "Has anyone tried using polling to find out where the Covid-19 hot spots are? The kind of polling that asks who people voted for? <a href=\"https://twitter.com/davewiner/status/1302995546718769161\">Like this</a>.",
            "created": "Mon, 07 Sep 2020 20:27:12 GMT",
            "type": "outline"
        },
        {
            "text": "Trumpolini",
            "created": "Mon, 07 Sep 2020 16:07:55 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2020/09/07/duce.png",
            "description": "The virus is a powerful ally that Hitler never had.",
            "subs": [
                {
                    "text": "The bad thing about all the open corruption in the <a href=\"https://www.google.com/search?q=trumpolini\">Trump</a> admin, is they aren't all as sick and crazy and Trump, and know if they leave office, without Trump or someone worse in charge, they will go to jail. So they're going to fight like hell to keep him in office.",
                    "created": "Mon, 07 Sep 2020 16:08:09 GMT",
                    "image": "http://scripting.com/images/2020/09/06/bidenHarris2020.png"
                },
                {
                    "text": "Also if you accept the premise that they're also hell-bent on building a fascist reich, and I do, the virus is a powerful ally that Hitler never had. Hitler had to wait to start exterminating his enemies until he had absolute power locked down. Trump doesn't have to.",
                    "created": "Mon, 07 Sep 2020 16:08:48 GMT"
                },
                {
                    "text": "He can target death by cutting off funding strategically, by geography, economic status, age, race, or forcing people to do things that will expose them to the virus. They're already doing it, for example forcing schools to open. That translates into death and disease, as you know.",
                    "created": "Mon, 07 Sep 2020 16:08:53 GMT"
                }
            ]
        },
        {
            "text": "A classic",
            "created": "Mon, 07 Sep 2020 16:07:47 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "A classic for our times, right up there with ‘But her emails.”",
                    "created": "Mon, 07 Sep 2020 14:05:14 GMT",
                    "type": "outline",
                    "inlineImage": "http://scripting.com/images/2020/09/07/trumpBoatAtBottomOfLakeMagaMagaMaga.png"
                }
            ]
        }
    ]
}