{
    "text": "September 9",
    "created": "Wed, 09 Sep 2020 14:00:23 GMT",
    "name": "09",
    "subs": [
        {
            "text": "A cynic might ask, and our country is full of cynicism,  what difference would it have made if Woodward had disclosed what Trump said in March, in March. Well, it might have saved <a href=\"https://www.youtube.com/watch?v=f99oE_Yw4YA&feature=emb_logo\">this woman's father's life</a>. \"His only pre-existing condition was trusting Donald Trump, and for that he paid with his life.\" We've got to start caring about each other. ",
            "created": "Wed, 09 Sep 2020 21:43:27 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=f99oE_Yw4YA"
        },
        {
            "text": "I bought two Biden/Harris lawn signs on Zazzle for about $50 including shipping. They let you <a href=\"https://www.zazzle.com/co/cart?rnd=637352537975121016\">share your cart</a>, nice feature. Wish the price were a lot lower though. I want to see Biden signs everywhere.",
            "created": "Wed, 09 Sep 2020 21:10:29 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://www.npr.org/2020/09/09/911109247/trump-admitted-to-playing-down-the-coronaviruss-severity-per-new-book\">Woodward knew</a> Trump was lying about the virus, <a href=\"https://twitter.com/mkraju/status/1303727747899035649\">on the record</a>, in March. We're finding out in September. He's as bad as Trump.",
            "created": "Wed, 09 Sep 2020 18:25:18 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/mkraju/status/1303727747899035649"
        },
        {
            "text": "I'm wondering what's new in [%search: Glitch%] since I last <a href=\"https://github.com/scripting/Scripting-News/issues/168\">took a look</a>, back in April, over four days.",
            "created": "Wed, 09 Sep 2020 20:38:18 GMT",
            "type": "outline"
        },
        {
            "text": "I'm guessing the smoke is choking people who live in rural parts of Oregon, California and Washington, who say they have nothing in common with people who live in LA, SF, Portland and Seattle. Just want to point out they all breathe the same air. ",
            "created": "Wed, 09 Sep 2020 17:04:23 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/09/04/mrMet.png"
        },
        {
            "text": "About mail-in ballots. 1. Why not count them as they come in? 2. When people say they take longer because they have to verify your signature, that's exactly what they do when you vote in person, at least everywhere I've lived (lots of places). By definition that process takes 24 hours. I'm guessing it takes longer to count mail-ins because they have fewer people doing the work?",
            "created": "Wed, 09 Sep 2020 16:04:37 GMT",
            "type": "outline"
        },
        {
            "text": "Re the trick Trump is openly planning to play on Election Night. Obviously the thing to do is not report returns for seven days after the election. We already have rules about calling an election before all the polls are closed. Well it takes longer now. BFD. ",
            "created": "Wed, 09 Sep 2020 16:05:27 GMT",
            "type": "outline"
        },
        {
            "text": "Why doesn’t Biden announce a Covid task force and name the people and turn the mic over to them so that we can have scientific and straight regular update on what’s happening with the virus in the United States. No political interference.",
            "created": "Wed, 09 Sep 2020 14:04:48 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/05/01/fauciHead.png"
        },
        {
            "text": "If you haven't listened to the <a href=\"https://www.nytimes.com/2020/01/23/podcasts/1619-podcast.html\">1619 podcast</a>, I highly recommend it. It's not often that a podcast has such lasting value. Opened my eyes about my own country.",
            "created": "Wed, 09 Sep 2020 14:24:55 GMT",
            "type": "outline"
        },
        {
            "text": "I would prefer if there were no debates this time, but if there have to be debates: 1. It should be done virtually. I don't want Trump giving Biden the virus. 2. No interruptions. After your time is up, your mike is turned off. They should practice this so it works perfectly.",
            "created": "Wed, 09 Sep 2020 14:04:25 GMT",
            "type": "outline"
        },
        {
            "text": "San Francisco under fire. ",
            "created": "Wed, 09 Sep 2020 20:50:07 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/09/09/sanFranciscoSmoke.png"
        }
    ]
}