{
    "text": "September 10",
    "created": "Thu, 10 Sep 2020 12:24:55 GMT",
    "name": "10",
    "subs": [
        {
            "text": "Too many people are <i>still</i> looking out for #1.",
            "created": "Thu, 10 Sep 2020 21:03:46 GMT",
            "type": "outline"
        },
        {
            "text": "200K Americans died while Woodward sat on the tape. American lives. People like you. If you can rationalize their deaths then you're part of the problem, as is Woodward and Trump. A chain of depravity.",
            "created": "Thu, 10 Sep 2020 16:59:48 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/07/18/leinenkugel.png",
            "imageLink": "https://www.leinie.com/brewery"
        },
        {
            "text": "In medicine, if they're testing a drug and discover for sure it saves lives without harmful side-effects, they're obligated to stop the test and give everyone the drug. No more control group. No more placebos. It's ethical. Sometimes the information you uncover makes a difference, and holding onto it has an unacceptable cost. Same in journalism. Same in everything.",
            "created": "Thu, 10 Sep 2020 18:36:40 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://twitter.com/AWeissmann_/status/1304155795362373632\">Andrew Weissmann</a>, ex-DOJ lawyer explains Trump defense: \"I am on tape committing a fraud that resulted in tens of thousands of people dying and risking the lives of many more. But I’m not to blame because you, Bob Woodward, could have stopped me.\"",
            "created": "Thu, 10 Sep 2020 20:56:18 GMT",
            "type": "outline"
        },
        {
            "text": "In June, I was interviewed by <a href=\"https://en.wikipedia.org/wiki/Walter_Isaacson\">Walter Isaacson</a> for his <a href=\"http://scripting.com/2020/08/26.html#a193208\">August</a> <a href=\"https://www.stitcher.com/podcast/pacific-content/trailblazers-with-walter-isaacson\">podcast</a> about podcasting. They only used a few bits from the recording to tell their story. Here's the <a href=\"http://scripting.com/2020/06/04/isaacsonAudio.m4a\">full recording</a> of my side of the interview. About 40 minutes. You can't hear the interviewer's questions, but it's not too difficult to figure it out. As always I'm very long-winded. :smile:",
            "created": "Thu, 10 Sep 2020 15:09:30 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2020/06/04/isaacsonAudio.m4a",
            "enclosureType": "audio/x-m4a",
            "enclosureLength": "20493968"
        },
        {
            "text": "Pro tip: Before posting a reply, ask yourself if you're telling the other person to shut up, and if so take your own advice. ",
            "created": "Thu, 10 Sep 2020 15:54:49 GMT",
            "type": "outline"
        },
        {
            "text": "Watching the coverage of the <a href=\"https://www.cnn.com/2020/09/10/us/us-west-wildfires-thursday/index.html\">fires</a> on the West Coast, I was reminded of this outstanding <a href=\"https://www.youtube.com/watch?v=XM0uZ9mfOUI\">segment</a> on <a href=\"https://en.wikipedia.org/wiki/The_Newsroom_(American_TV_series)\">The Newsroom</a> on HBO. Aaron Sorkin writing at its best. ",
            "created": "Thu, 10 Sep 2020 14:08:25 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=XM0uZ9mfOUI"
        },
        {
            "text": "BTW, when they say a billionaire like Jeff Bezos made $60 billion in 2020, that's paper profit. The gains will be lost when the market crashes, as it is sure to do. It's not like having the money in a savings account. We're in a big market bubble now, maybe the biggest ever.",
            "created": "Thu, 10 Sep 2020 13:45:34 GMT",
            "type": "outline"
        },
        {
            "text": "If you think only in terms of public opinion, you’re in a trance. You’re not a pundit on CNN. How do you know if you do it? Here's an extreme example. I say geez it would have been so easy for the reporter to save a few thouand American's lives. And you say, but I don't think his base would care. So perverse, even depraved. Yet I had that exact exchange repeatedly on Twitter last night. Think about how dehumanized you've become. These are people. Their families and friends were devastated by their deaths. They suffered terribly before they died. And they died! Geez Louise. Where is your humanity. And btw, no one, and I mean <i>zero</i> people give a shit about your punditry. You should factor that in as well. ",
            "created": "Thu, 10 Sep 2020 13:21:48 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/09/01/mrFrog.png"
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1303845786485248000\">Poll</a>: Was Woodward wrong to withhold the Trump tape about him lying about the virus?",
            "created": "Thu, 10 Sep 2020 12:24:56 GMT",
            "type": "outline"
        },
        {
            "text": "Tom Cruise wants the truth. <a href=\"https://www.youtube.com/watch?v=9FnO3igOkOk\">Jack Nicholson says</a> he can't handle it.",
            "created": "Thu, 10 Sep 2020 12:29:33 GMT",
            "type": "outline"
        },
        {
            "text": "Boston friend <a href=\"https://twitter.com/stevegarfield\">Steve Garfield</a> is NY-famous. (From 2019.)",
            "created": "Thu, 10 Sep 2020 13:33:33 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/09/10/steveTwitterFamous.png"
        },
        {
            "text": "Wisconsin friend Joel Kamerman moved to the desert in southern California and now is posting <a href=\"http://scripting.com/images/2020/09/10/joelDesertSunset.png\">gorgeous sunsets</a> on <a href=\"https://www.instagram.com/joel.kamerman/\">Instagram</a>. ",
            "created": "Thu, 10 Sep 2020 20:11:45 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/09/10/joelDesertSunset.png"
        },
        {
            "text": "Tech industry friend <a href=\"http://scripting.com/davenet/stories/IntroducingDaveCarlick.html\">Dave Carlick</a> shares a <a href=\"http://scripting.com/images/2020/09/10/carlickValley.png\">gorgeous view</a> of the smoke over Silicon Valley.",
            "created": "Thu, 10 Sep 2020 21:15:46 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/09/10/carlickValley.png"
        },
        {
            "text": "Nick Arnett, California fire fighter",
            "created": "Thu, 10 Sep 2020 23:06:46 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "<i>I've known <a href=\"https://nickarnett.net/\">Nick Arnett</a> since he was a tech industry analyst in the 80s when I was the CEO of a software company. Since then, he has re-invented himself many times, always in public service. These days he's a California fire-fighter, working on the front lines. He <a href=\"https://www.facebook.com/arnett.nick/posts/10158685257688197\">posted</a> the following on Facebook. I'm reposting it here with permission. </i>",
                    "created": "Thu, 10 Sep 2020 23:07:03 GMT",
                    "subs": [
                        {
                            "text": "I’m starting to hear conspiracy theories about the fires. Although I understand the appeal to the part of our brains that longs to believe someone has control, they are still quite disturbing. Today, I heard that people believe this is all intentional, intended to destroy rural America. I can’t help but think this puts us far closer to civil unrest or war than I’d ever have imagined possible.",
                            "created": "Thu, 10 Sep 2020 23:10:11 GMT"
                        },
                        {
                            "text": "Equally scary is how entrenched the beliefs are, even though we know that the rumors are conspiracy theories promoted and encouraged by enemies who wish to bring about our downfall. They are succeeding, again far more than I would ever have imagined possible."
                        },
                        {
                            "text": "I’m not sure there are big solutions. I am certain of the truth and power of my favorite words from Mother Theresa: Do small things with great love. "
                        },
                        {
                            "text": "Voting is a small thing for each of us. Do it based on what you love, rather than what you oppose."
                        }
                    ]
                }
            ]
        }
    ]
}