{
    "text": "September 13",
    "created": "Sun, 13 Sep 2020 13:12:54 GMT",
    "name": "13",
    "subs": [
        {
            "text": "Today's song: <a href=\"https://www.youtube.com/watch?v=o5TmORitlKk\">What's Going On</a>.",
            "created": "Sun, 13 Sep 2020 19:57:08 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=o5TmORitlKk"
        },
        {
            "text": "The number of dead, for purposes of the election, should be the projected number as of Election Day. And a question should be part of the discussion. Do you want to be one of the dead ones?",
            "created": "Sun, 13 Sep 2020 13:13:04 GMT",
            "type": "outline"
        },
        {
            "text": "I had a heated discussion yesterday with a dear friend who I greatly respect, about the <a href=\"http://scripting.com/2020/09/11/135338.html?title=woodwardBetrayedUs\">Woodward</a> thesis. Here's the question I asked, at the core of my case, and I'd ask it to Jay Rosen too, and to you dear reader, if you think what Woodward did was understandable and/or excusable. Why do you care about winning the election? What are you trying to prevent? Think about it. If you're listening and not arguing, you'll get it. ",
            "created": "Sun, 13 Sep 2020 13:19:52 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/03/03/venus.png",
            "imageLink": "https://www.space.com/44-venus-second-planet-from-the-sun-brightest-planet-in-solar-system.html"
        },
        {
            "text": "I had to write a piece about this before I realized that \"Woodward\" is probably the best/worst example. Had it been a random reporter at the NYT, I think people would have looked at it differently. The Times brought us many terrible things like WMDs in Iraq and Hillary's Emails. Holding on to such an important bit of information about the president, and the snake oil he was selling about the disease, would be less excusable perhaps if it were a reporter no one heard of, instead of the most famous reporter in the world, possibly the most famous reporter ever. Who feels qualified to criticize The Great Woodward, the <a href=\"https://en.wikipedia.org/wiki/Saint_Peter\">St Peter</a> of the Church of the Savvy. ",
            "created": "Sun, 13 Sep 2020 13:23:39 GMT",
            "type": "outline"
        },
        {
            "text": "Someone on the NYT op-ed page has to call <a href=\"http://scripting.com/2020/09/11/135338.html?title=woodwardBetrayedUs\">Woodward</a> out. But journalism always covers up the sins of journalism. Please let me know if you see journalism <i>not</i> doing this, I'll give them an award. It never happens. If only Rachel, Chris, Al, Joy, Wolf, Erin, Jake, Brian or Anderson looked at the Woodward case, and broadcast a message loud and clear, <b>if any other reporter does this, we're going to crucify them.</b> They do it regularly for Facebook. Someone has to do it for them. We pay too high a price for their inability to admit the most costly errors. They've all set a terrible precedent by remaining silent. ",
            "created": "Sun, 13 Sep 2020 13:26:07 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://en.wikipedia.org/wiki/Jules_Feiffer\">Jules Feiffer</a>.",
            "created": "Sun, 13 Sep 2020 23:50:25 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/09/13/jules.png"
        },
        {
            "text": "Firmware file not compatible",
            "created": "Sun, 13 Sep 2020 19:36:16 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2020/09/13/willowNewYork.png",
            "description": "The iPhone could not be updated because the firmware file is not compatible. ",
            "subs": [
                {
                    "text": "When I update my iPhone using iTunes I get this error message.  ",
                    "created": "Sun, 13 Sep 2020 19:36:49 GMT",
                    "subs": [
                        {
                            "text": "The iPhone could not be updated because the firmware file is not compatible. ",
                            "created": "Sun, 13 Sep 2020 19:37:08 GMT"
                        }
                    ]
                },
                {
                    "text": "No one seems to know what that means when you <a href=\"https://www.google.com/search?q=%22firmware+file+is+not+compatible%22\">search</a> for it on Google, and none of the advice works and it's happened a number of times, and every time I have to re-discover the workaround. This time I'm writing a blog post so when I search for it, I'll have the answer.",
                    "created": "Sun, 13 Sep 2020 19:37:28 GMT",
                    "flNumberedSubs": "true",
                    "subs": [
                        {
                            "text": "Don't update the phone with iTunes. ",
                            "created": "Sun, 13 Sep 2020 19:38:23 GMT"
                        },
                        {
                            "text": "You can update it over wifi, it doesn't need iTunes to do the update.",
                            "created": "Sun, 13 Sep 2020 19:38:38 GMT"
                        },
                        {
                            "text": "Open the Settings app, scroll down to General, open it. ",
                            "created": "Sun, 13 Sep 2020 19:38:51 GMT"
                        },
                        {
                            "text": "Click on Software Update. Follow the instructions.",
                            "created": "Sun, 13 Sep 2020 19:39:25 GMT"
                        },
                        {
                            "text": "Works every damn time!",
                            "created": "Sun, 13 Sep 2020 19:39:54 GMT"
                        }
                    ]
                },
                {
                    "text": "It's basically the <a href=\"https://www.youtube.com/watch?v=7YyBtMxZgQs\">Indiana Jones</a> method of updating. ",
                    "created": "Sun, 13 Sep 2020 19:39:58 GMT"
                }
            ]
        }
    ]
}