{
    "text": "September 18",
    "created": "Fri, 18 Sep 2020 13:02:32 GMT",
    "name": "18",
    "subs": [
        {
            "text": "My grandparents were alive during the 1918 pandemic. I never thought to ask them about it. I wish I had.",
            "created": "Fri, 18 Sep 2020 21:04:04 GMT",
            "type": "outline"
        },
        {
            "text": "If [%search: Steve Jobs%] were alive, our living rooms would be very different.",
            "created": "Fri, 18 Sep 2020 16:37:04 GMT",
            "type": "outline"
        },
        {
            "text": "The wires are the problem, and Jobs fully understood this. I talked about this in <a href=\"http://scripting.com/2020/09/17.html#a211718\">yesterday's podcast</a>. They had the Mac office, school, backpack, pocket, the living room should belong to Apple. Not with a dongly thing and \"content.\" It should be the Apple experience at room scale. I want a full scale Apple/Pixar experience in my home. ",
            "created": "Fri, 18 Sep 2020 16:50:10 GMT",
            "type": "outline"
        },
        {
            "text": "Gotta wonder if Trump and Barr are planning on disrupting the <a href=\"https://twitter.com/CNN/status/1306963691028578305\">huge turnout</a> for early voting in Virginia. Actually I don't wonder, I'm sure they will. These are all antifa's, some very fine people, but some very not fine people too. Send in the <a href=\"https://en.wikipedia.org/wiki/Little_green_men_(Ukrainian_crisis)\">little green men</a>. ",
            "created": "Fri, 18 Sep 2020 16:42:04 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/CNN/status/1306963691028578305"
        },
        {
            "text": "<a href=\"http://scripting.com/2020/09/11/135338.html?title=woodwardBetrayedUs\">Woodward betrayed us</a>. Every time I hear a new recording of Trump talking, in April, about how horrible the virus is, I want everyone to think how much different it would be if those recordings had come out in <a href=\"http://scripting.com/2020/04/\">April</a>, not <a href=\"http://scripting.com/2020/09/\">September</a>. ",
            "created": "Fri, 18 Sep 2020 13:49:16 GMT",
            "type": "outline"
        },
        {
            "text": "I use Frontier to manage my source code, which no longer runs on the newest version of the Mac OS. I desperately want it to run on Linux so I can get out of this situation. In the meantime, I bought a new iPhone, and just updated it and got <a href=\"http://scripting.com/images/2020/09/18/softwareUpdateDialog.png\">this awful dialog</a> when I plugged it into my Mac. I clicked on Learn More hoping to find out which version of the OS it wants to install, but it <a href=\"https://support.apple.com/en-us/HT208831\">doesn't say</a>. I am running High Sierra, 10.13.8. I'm not going to update the Mac. I guess that means I'll be relying on the new Pixel 4a more and more, because I can't give up my ability to run Frontier on my desktop. Not a good situation, but as they say it is what it is. ",
            "created": "Fri, 18 Sep 2020 13:02:33 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/07/23/frontierBox.png"
        },
        {
            "text": "<a href=\"https://www.google.com/search?q=chuck+shotton+site%3Ascripting.com\">Chuck</a> pointed me at <a href=\"https://gigster.com/\">Gigster</a>, which I didn't know about, as a place I might hire a contractor to create a Linux version of Frontier. I'd like to see it run on Ubuntu, both in the graphic environment and headless. ",
            "created": "Fri, 18 Sep 2020 13:09:34 GMT",
            "type": "outline"
        },
        {
            "text": "College football 2020.",
            "created": "Fri, 18 Sep 2020 16:55:57 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/09/18/collegeFootball.png"
        }
    ]
}