{
    "text": "September 19",
    "created": "Sat, 19 Sep 2020 13:28:22 GMT",
    "name": "19",
    "subs": [
        {
            "text": "The Navalny <a href=\"https://en.wikipedia.org/wiki/Alexei_Navalny#Poisoning\">poisoning</a> is a warning to American politicians. ",
            "created": "Sat, 19 Sep 2020 16:28:54 GMT",
            "type": "tweet",
            "tweetId": "1307435394569469959",
            "tweetUserName": "davewiner"
        },
        {
            "text": "By now we should all know when the Repubs say anything it's meaningless. So... When <a href=\"https://www.npr.org/sections/death-of-ruth-bader-ginsburg/2020/09/19/914843085/susan-collins-whoever-wins-the-presidential-election-should-fill-scotus-vacancy\">Susan Collins</a> says oh my this should be done by a new president, then she'll disagree when McC goes ahead, and she'll vote to confirm, saying how disappointed she is. BTW, politically, RBG dying is the best thing that happened to Collins. Now she can talk about the Court instead of Trump, the virus and the economy, and oh yeh her vote to <a href=\"https://en.wikipedia.org/wiki/Impeachment_trial_of_Donald_Trump#Acquittal\">acquit</a> the <a href=\"http://scripting.com/2020/09/07/160755.html?title=trumpolini\">Trumpolini</a>. ",
            "type": "outline",
            "created": "Sat Sep 19 20:55:28 +0000 2020",
            "image": "http://scripting.com/images/2020/09/06/bidenHarris2020.png"
        },
        {
            "text": "Can you imagine a bunch of rude <a href=\"https://www.urbandictionary.com/define.php?term=skanky\">skanky</a> <a href=\"https://en.wikipedia.org/wiki/Trailer_trash\">schmucks</a> with with big guns showing up at the <a href=\"https://www.mlive.com/public-interest/2020/09/1000-open-carry-gun-activists-converge-on-michigan-capitol-lawn.html\">Michigan state capitol</a>, and they're allowed to menace everyone, and no cops show up with tear gas, no vigilantes protect property. Now imagine if they were black instead of white.",
            "created": "Sat, 19 Sep 2020 21:16:16 GMT",
            "type": "outline"
        },
        {
            "text": "The <a href=\"https://lincolnproject.us/\">Lincoln Project</a> is in a bind. As Repubs, they want to own the Court for the indefinite future, and here's their chance. Now the work they're doing to elect Biden is against their own interests. It's time for them to decide whether they really think we're going authoritarian, i.e. if the Supreme Court still matters if DJT wins. This may be nothing more than an election issue, only of symbolic value, if Trump has no intention of listening to the Court in the future, assuming he <s>wins</s> stays in power. The Lincolns seemed damned either way.",
            "created": "Sat, 19 Sep 2020 14:28:40 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"http://scripting.com/images/2020/09/19/supremeCourt.png\">New header image</a>, the Supreme Court last night, people gathered there to remember <a href=\"https://en.wikipedia.org/wiki/Ruth_Bader_Ginsburg\">Ruth Bader Ginsburg</a> who died yesterday.",
            "created": "Sat, 19 Sep 2020 13:32:33 GMT",
            "type": "outline"
        },
        {
            "text": "RBG dying is a gut punch almost as bad as <a href=\"http://scripting.com/2016/11/09/whyTrump.html\">election night 2016</a>.",
            "created": "Sat, 19 Sep 2020 13:28:23 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://github.com/scripting/Scripting-News/issues/187\">Braintrust query</a>: I am running the OPML Editor, which is a distribution of \"Frontier\", on a Mac running MacOS 10.13.6. Works fine. I'm afraid to update this computer, because I don't know what Apple is going to do to it. I use Frontier to write my JavaScript code, and also to keep around as an archive for about 20 years of work, that's still unmatched elsewhere. I don't want to lose my ability to run Frontier. Anyway I had a thought. Why not run Frontier inside VMWare, using 10.13.6, and then I could run it on any Mac. I think this would work and I could stop worrying about Apple breaking my work environment. ",
            "created": "Sat, 19 Sep 2020 13:49:11 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/09/19/hotrod.png"
        },
        {
            "text": "I'm <i>davescript</i> on TikTok.",
            "created": "Sat, 19 Sep 2020 13:31:32 GMT",
            "type": "outline"
        },
        {
            "text": "Questions re the format for the first debate.1. Trump and Biden in same place or different locations? 2. Live audience? 3. Moderator(s)?",
            "created": "Sat, 19 Sep 2020 13:32:00 GMT",
            "type": "outline"
        },
        {
            "text": "With all the bad news, we deserve <a href=\"https://twitter.com/RexChapman/status/1306973104686665728\">puppies</a>. :smile:",
            "created": "Sat, 19 Sep 2020 21:47:08 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/RexChapman/status/1306973104686665728"
        },
        {
            "text": "I love macadamia nuts.",
            "created": "Sat, 19 Sep 2020 13:31:51 GMT",
            "type": "outline"
        },
        {
            "text": "2020 hard-crossings",
            "created": "Sat, 19 Sep 2020 16:10:14 GMT",
            "type": "outline",
            "description": "We ignored the Final Notices and now the bill collector is at the door. ",
            "metaImage": "http://scripting.com/images/2020/09/19/collapsedBridge.png",
            "subs": [
                {
                    "text": "It just hit me that a lot of things are piling up on us. Like overdue bills we received the final notices years ago, we didn't pay up and now they've all come due at the same time. ",
                    "created": "Sat, 19 Sep 2020 16:10:21 GMT"
                },
                {
                    "text": "Here's the list.",
                    "created": "Sat, 19 Sep 2020 16:11:39 GMT",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "Authoritarianism. When the Senate didn't remove Trump after impeachment that was the end of the American system of checks and balances. Local government is broke.",
                            "created": "Sat, 19 Sep 2020 16:11:44 GMT"
                        },
                        {
                            "text": "Pandemic. We dismantled the government units we set up to deal with it. We taught the world how to deal with this crisis, but we ourselves lost our way.",
                            "created": "Sat, 19 Sep 2020 16:11:50 GMT"
                        },
                        {
                            "text": "Climate. Fires in California and Australia, hurricanes worse every year. The crisis will get worse in the future, but it's here now. ",
                            "created": "Sat, 19 Sep 2020 16:11:52 GMT"
                        },
                        {
                            "text": "Economy. Small business and individuals are in deep trouble.",
                            "created": "Sat, 19 Sep 2020 16:11:55 GMT"
                        },
                        {
                            "text": "Education and health care. How can they survive pandemic?",
                            "created": "Sat, 19 Sep 2020 16:12:02 GMT"
                        }
                    ]
                },
                {
                    "text": "If Trump is in power after the election, then you can add another.",
                    "created": "Sat, 19 Sep 2020 16:12:36 GMT",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "Looting of US complete. ",
                            "created": "Sat, 19 Sep 2020 16:12:52 GMT",
                            "flBulletedSubs": "true"
                        }
                    ]
                },
                {
                    "text": "Some of these mainly apply to the US, although the country is so central to the world economy and culture, it's hard to imagine the lines don't get crossed elsewhere, eventually. We're being dragged down the same hole as Russia and China, for example. How can Germany, France, etc avoid it. The UK is in the toilet with us. ",
                    "created": "Sat, 19 Sep 2020 16:12:59 GMT"
                }
            ]
        }
    ]
}