{
    "text": "September 25",
    "created": "Fri, 25 Sep 2020 13:22:40 GMT",
    "name": "25",
    "subs": [
        {
            "text": "Don't miss: <a href=\"http://scripting.com/2020/09/25/134351.html?title=bingeworthyProfilePages\">An important new feature in BingeWorthy</a>.",
            "created": "Sat, 26 Sep 2020 00:11:35 GMT",
            "type": "outline"
        },
        {
            "text": "Reporters forget past atrocities, so they can re-discover them, so it's (as far as they're concerned) news -- again. This makes their job approachable. Anything beyond this would require them to adapt, risk, improvise, grow. In software, ideas from users can be confusing, but also incredibly valuable. Users have nothing invested in the way you do things. They just know what they want. Knowing what users want is valuable, but news doesn't incorporate that, because they never listen to users, they only listen to each other, and often not even that.",
            "created": "Fri, 25 Sep 2020 16:04:26 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1309647969889779712\">Poll</a>: Why do Trump and the Repubs do what they do?",
            "created": "Sat, 26 Sep 2020 00:26:57 GMT",
            "type": "outline"
        },
        {
            "text": "It's true that in 2016 Trump said he wouldn't honor the vote if he lost, but there is a big difference between then and now. Now he's the president, and he lives in the White House and is commander in chief of the armed forces. There's a lot of time between Election Day and Inauguration Day. Time Trump can really fuck things up for us, beyond how fucked up they already are. Everyone thinks Trump is going to lose but refuse to leave. I think he has another plan. When I was playing a board game with my little brother when we were kids, if he didn't like how it was going, well you know what little brothers do. That's Trump. A snotty ass little brother if there ever was one. :smile:",
            "created": "Fri, 25 Sep 2020 16:03:16 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/09/25/sorry.png"
        },
        {
            "text": "I have a huge collection of MP3s and a <a href=\"https://en.wikipedia.org/wiki/Pixel_4a\">new Android phone</a>. Is there a music-playing Android app that can access files in Google Drive? I've been using that to transfer photos and movies from the phone to other devices and onto the web. I could easily do the same with music if I could play the MP3s from GD. ",
            "created": "Fri, 25 Sep 2020 13:22:41 GMT",
            "type": "tweet",
            "tweetId": "1309483988558413826",
            "tweetUserName": "davewiner"
        },
        {
            "text": "BingeWorthy profile pages",
            "created": "Fri, 25 Sep 2020 13:43:51 GMT",
            "type": "outline",
            "description": "New BingeWorthy feature. Publish your ratings.",
            "subs": [
                {
                    "text": "Here's the deal with profile pages.    ",
                    "created": "Fri, 25 Sep 2020 13:43:58 GMT",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "You have <a href=\"http://my.bingeworthy.io/bullmancuso/\">one</a>. I have <a href=\"http://my.bingeworthy.io/davewiner/\">one</a>.  ",
                            "created": "Fri, 25 Sep 2020 13:52:04 GMT"
                        },
                        {
                            "text": "Anyone who has signed on to \"BingeWorthy\" has one. ",
                            "created": "Fri, 25 Sep 2020 14:09:21 GMT"
                        },
                        {
                            "text": "They list all the shows you've rated, from best to worst. ",
                            "created": "Fri, 25 Sep 2020 14:09:06 GMT"
                        },
                        {
                            "text": "Profile pages are designed to share. When someone asks for a list of good things to binge, instead of thinking of a few off the top of the head, share a link to your profile page. ",
                            "created": "Fri, 25 Sep 2020 13:52:39 GMT"
                        },
                        {
                            "text": "You can edit your name, the image URL, description so if you're not happy with the initial versions (which we got from your Twitter profile), you can change them in the <a href=\"http://scripting.com/images/2020/09/25/settingsDialogLocation.png\">Settings dialog</a> in BingeWorthy. All this is echoed in your Facebook and Twitter metadata, so it'll show up when you paste a link into those services, and many others that read this form of metadata.",
                            "created": "Fri, 25 Sep 2020 13:54:04 GMT"
                        }
                    ]
                },
                {
                    "text": "If your screenname is bullmancuso, <a href=\"http://my.bingeworthy.io/bullmancuso/\">this</a> is your profile page. ",
                    "created": "Fri, 25 Sep 2020 13:53:15 GMT"
                },
                {
                    "text": "If you have questions or comments, please post them <a href=\"https://github.com/scripting/Scripting-News/issues/188\">here</a>. ",
                    "created": "Fri, 25 Sep 2020 13:55:45 GMT"
                },
                {
                    "text": "Screen shot of the top part of <a href=\"http://my.bingeworthy.io/davewiner/\">my profile page</a>. ",
                    "created": "Fri, 25 Sep 2020 17:08:04 GMT",
                    "inlineImage": "http://scripting.com/images/2020/09/25/profilePageScreenShot.png"
                }
            ]
        },
        {
            "text": "Trump plus the virus",
            "created": "Fri, 25 Sep 2020 15:22:49 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2020/09/07/duce.png",
            "description": "Trump plus the virus -- that's what we're up against.",
            "subs": [
                {
                    "text": "I remember reading this piece, carefully, word for word and beling relieved that there was a way to fight the virus. It's a summary of a <a href=\"https://www.nytimes.com/2020/03/12/podcasts/the-daily/coronavirus-pandemic.html\">podcast</a> McNeil did on March 12. ",
                    "created": "Fri, 25 Sep 2020 15:22:55 GMT",
                    "subs": [
                        {
                            "text": "<a href=\"https://www.nytimes.com/2020/03/22/health/coronavirus-restrictions-us.html\">March 22</a>: \"Terrifying though the coronavirus may be, it can be turned back. China, South Korea, Singapore and Taiwan have demonstrated that, with furious efforts, the contagion can be brought to heel.\" ",
                            "created": "Fri, 25 Sep 2020 15:25:57 GMT"
                        }
                    ]
                },
                {
                    "text": "It's one of those things that I'll remember forever. Before listening, I had no idea how we fight this. After listening, I understood how it works. And that it had worked, in China and South Korea and other places. It would have amazed me then that here it is 6 months later and only a few states have done it remotely this way. Our efforts in the Northeast are primitive in comparison, but they worked. A lot of people were made very sick, and a lot of people died, but we got the virus under control. But it's raging out of control elsewhere in the country. You know when the Dems say the election is about health, they're talking about the ACA, but that's wrong. There's a pandemic raging through our country and it's growing again. We have to connect with this. And we won't have any hope, any hope at all, if Trump remains president.",
                    "created": "Fri, 25 Sep 2020 15:26:07 GMT",
                    "image": "http://scripting.com/images/2020/09/06/bidenHarris2020.png"
                },
                {
                    "text": "<a href=\"http://scripting.com/2020/09/07/160755.html?title=trumpolini\">September 7</a>: \"If you accept the premise that [Trump is] hell-bent on building a fascist reich, and I do, the virus is a powerful ally that Hitler never had. Hitler had to wait to start exterminating his enemies until he had absolute power locked down. Trump doesn't have to.\" ",
                    "created": "Fri, 25 Sep 2020 15:33:12 GMT"
                },
                {
                    "text": "It's time to be scared. In the moment when you still have power. Later it will be too late. Trump plus the virus -- that's what we're up against. ",
                    "created": "Fri, 25 Sep 2020 15:33:42 GMT"
                }
            ]
        }
    ]
}