{
    "text": "September 28",
    "created": "Mon, 28 Sep 2020 12:28:25 GMT",
    "name": "28",
    "subs": [
        {
            "text": "Today's song: <a href=\"https://www.youtube.com/watch?v=Qa4An7uzPeg\">I Guess the Lord Must Be in New York City</a>. ",
            "created": "Mon, 28 Sep 2020 21:52:58 GMT",
            "type": "outline"
        },
        {
            "text": "Braintrust query: <a href=\"https://github.com/scripting/Scripting-News/issues/189\">Flow of ES6 modules</a>.",
            "created": "Mon, 28 Sep 2020 14:38:13 GMT",
            "type": "outline"
        },
        {
            "text": "This is the <a href=\"https://gen.medium.com/i-lived-through-collapse-america-is-already-there-ba1e4b54c5fc\">best thing I've read</a> today. It says when collapse happens you might not notice. We are post-collapse in the US, the author says. You know what, I believe it. \"I used to judge those herds of gazelle when the lion eats one of them alive and everyone keeps going — but no, humans are just the same. That’s the real meaning of herd immunity. We’re fundamentally immune to giving a shit.\"",
            "created": "Mon, 28 Sep 2020 22:03:45 GMT",
            "type": "outline"
        },
        {
            "text": "Remember Romney's <a href=\"https://youtu.be/M2gvY2wqI7M\">47 percent speech</a> to Republican donors. The nice Republican. They really think this way. Do they think you should live? Probably not. A waste of resources. You just want handouts. Repub dogma: 47 percent of the people are disposable. ",
            "created": "Mon, 28 Sep 2020 13:58:15 GMT",
            "type": "outline",
            "urlvideo": "https://youtu.be/M2gvY2wqI7M"
        },
        {
            "text": "The House could still impeach Trump to halt the ratification of the new Supreme Court justice. And the Democrats, assuming they take power in January, can increase the size of the court to whatever they want. Of course the Repubs will scream bloody murder and the press will repeat that, with volume, because it's an exciting story. And we know the Dems can't stand that. Look what they did to Al Franken. Concerned they would be called hypocrites by the Repubs, itself an act of total hypocrisy, they destroyed his career which was going pretty well, you'd have to say. One of the most eloquent Democrats in a party that has trouble finishing sentences, much less whole thoughts. ",
            "created": "Mon, 28 Sep 2020 12:45:33 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/09/28/trumpOnTheRun.png"
        },
        {
            "text": "Sometimes I think my blog is one of those diaries in science fiction stories that chronicle the downfall of a civilization. First things looked a little bad, then very bad, then boom! :boom:",
            "created": "Mon, 28 Sep 2020 13:28:19 GMT",
            "type": "outline"
        },
        {
            "text": "It drives me crazy that the press makes everything about Dems and Repubs. Yes the Dems will be disappointed if the country disintegrates into civil war and becomes a zombie zone full of covid, but don't you get that other people will be unhappy too?",
            "created": "Mon, 28 Sep 2020 12:58:42 GMT",
            "type": "tweet",
            "tweetId": "1310564928059736064",
            "tweetUserName": "davewiner"
        },
        {
            "text": "Debate question for Trump: Why do you want to be president?",
            "created": "Mon, 28 Sep 2020 13:18:14 GMT",
            "type": "outline"
        },
        {
            "text": "Trump's Taxes is not a horse race story. The questions it raises -- 1. Can a president so deeply in debt concentrate on his job, and 2. When making a decision can he focus on the needs of the country over his own needs?",
            "created": "Mon, 28 Sep 2020 13:13:42 GMT",
            "type": "outline"
        },
        {
            "text": "Tim Bray <a href=\"https://www.tbray.org/ongoing/When/202x/2020/09/25/Subscription-Overload\">wrote</a> how subscriptions don't work for news. All readers know this. Since people in news orgs must read other pubs, they must know it too. We need a meter on our browsers, a set of prefs we easily control, a max budget, a special offer to subscribe when it makes economic sense. Create an <i>easy path to subscribing, </i>not the brutal wall that interrupts you at exactly the wrong moment. We can <a href=\"http://scripting.com/2020/06/16/133627.html?title=newsHasBeenUnbundled\">bootstrap</a> a rational system for news that grows. The web should be a fantastic way to get news, not the repetive junky stuff we get now, but news with real nutrient value. We're stuck and don't need to be. ",
            "created": "Mon, 28 Sep 2020 12:31:25 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/05/26/cherries.png"
        },
        {
            "text": "We're waiting for an alliance between the people and the press that stops making everything about one party vs the other, and starts looking at us as a country of 328 million people. Look for new voices that can help you get to what matters. ",
            "created": "Mon, 28 Sep 2020 12:57:00 GMT"
        },
        {
            "text": "I suggested a few years ago that one of the networks move one of their evening shows to Michigan or Ohio, just to shift the perspective a bit. It would work. Probably one of the most revolutionary things they could do, and it's so easy. ",
            "created": "Mon, 28 Sep 2020 12:50:02 GMT"
        },
        {
            "text": "You know there are people you don't like and people you actually despise. But if they have a good idea, the right thing to do is suck it up and say so. ",
            "created": "Mon, 28 Sep 2020 13:00:45 GMT",
            "type": "outline"
        },
        {
            "text": "If th' president doesn't pay taxes why should I?!!!",
            "created": "Tue, 29 Sep 2020 00:32:49 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2020/09/28/ifThePresidentDoesntPayTaxesWhyShouldI.png"
        }
    ]
}