{
    "text": "The significance of Daytona",
    "created": "Sat, 25 Dec 2021 17:15:05 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I'm going to keep beating this drum until people hear it, get how significant Daytona  is. It's as if all this time we were driving on roads that only went in one direction. It took 27 years of blogging for me to get around to add a lane going in the other direction.  ",
            "created": "Sat, 25 Dec 2021 17:15:11 GMT",
            "flInCalendar": true
        },
        {
            "text": "So it's not surprising we thought blogs were for getting attention. That's all the medium supported, really. Yes we added feeds, so it could be somewhat more efficient to squeeze the new bits out of a sea of blogs. But this is more fundamental. Even if no one else reads my blog, having an idea harvester and an archive of years of writing gives me something no one has had before. No one. The sad part is Google could have and should have done this years ago. I think that's why I had the mental block that kept me from pursuing this. I figured it must be hard. It wasn't. It's just a <a href=\"http://daytona.scripting.com/?q=MySQL&collection=scriptingnews\">MySQL</a> database with the outlines loaded into them. And luckily I kept a pretty good archive, so over the period of a week or so I was able to load much of it into the database. I think I'll get the rest of it too.",
            "created": "Sat, 25 Dec 2021 17:15:49 GMT",
            "flInCalendar": true
        },
        {
            "text": "I'm going to keep banging the drum. There's a lot more potential in the web as an intellectual environment. We need to get beyond the loud screams for attention, another purpose for writing publicly. Obviously it's not for everyone or even most people. But for the people who think, and want to accumulate their knowledge over time, this bit of tech has been missing. ",
            "created": "Sat, 25 Dec 2021 17:18:16 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}