{
    "text": "April 1",
    "created": "Mon, 01 Apr 2019 13:56:56 GMT",
    "name": "01",
    "subs": [
        {
            "text": "Is there an iPhone app that records sound, but only saves bits where someone is talking or there is some other loud-enough sound?",
            "created": "Mon, 01 Apr 2019 18:35:31 GMT",
            "type": "tweet",
            "tweetId": "1112786330482827264",
            "tweetUserName": "davewiner"
        },
        {
            "text": "<i>Serverless</i> is one of those unfortunate names that confuse the hell out of people because it’s a lie. Your software most definitely runs on a server.",
            "created": "Mon, 01 Apr 2019 18:44:53 GMT",
            "type": "outline"
        },
        {
            "text": "The March archive in OPML is now available <a href=\"https://github.com/scripting/Scripting-News/blob/master/blog/opml/2019/03.opml\">on GitHub</a>. Now we commence work on April. ",
            "created": "Mon, 01 Apr 2019 14:14:49 GMT",
            "type": "outline"
        },
        {
            "text": "A funny thing happens when I listen to Bruce Springsteen. I can't stop singing his songs when my mind is idling. Two songs mainly. 1. <a href=\"https://www.youtube.com/watch?v=HC4bf67s5lQ\">Rosalita</a> and 2. <a href=\"https://www.youtube.com/watch?v=cAVkQG6wSF0\">Thunder Road</a>. ",
            "created": "Mon, 01 Apr 2019 13:56:57 GMT",
            "type": "outline"
        },
        {
            "text": "De-eliting journalism",
            "created": "Mon, 01 Apr 2019 14:21:11 GMT",
            "type": "outline",
            "description": "Journalism is going to be democratic. Written by you and me. It will be a civic thing, like voting or jury duty.",
            "subs": [
                {
                    "text": "There is a divide between the elites and the people, it's why the news orgs are constantly writing about how huge social networks are hurting journalism, but say nothing about how they hurt blogging. In their minds blogging was some kind of <a href=\"http://images.scripting.com/archiveScriptingCom/2005/02/10/cartoon.gif\">ridiculous idea</a> that ordinary people could write about what they see. ",
                    "created": "Mon, 01 Apr 2019 14:15:55 GMT",
                    "image": "http://static.scripting.com/larryKing/images/2013/10/20/laughNow.gif"
                },
                {
                    "text": "My mother would have told me it's because they're scared of you. I believe she was right about that. But it's a shame because if you want to crack the journalism puzzle (not the <a href=\"https://membershippuzzle.org/\">membership puzzle</a> a former colleague talks about), we're going to have to <i>de-elite</i> journalism. It's going to be democratic. Written by you and me. It will be a civic thing, like voting or jury duty.",
                    "created": "Mon, 01 Apr 2019 14:38:39 GMT"
                },
                {
                    "text": "Facebook could have been a home for this, if they had embraced blogging, but they didn't. They removed important features from the web like linking, simple styles, titles and enclosures for podcasting. Technically these are minor projects for a company with the engineering resources of Facebook. Like the journalists they were too arrogant to think there was value in what their users were writing. They just wanted to be the envelope within which we all lead our civic lives. But they didn't really believe in it.",
                    "created": "Mon, 01 Apr 2019 14:38:13 GMT"
                },
                {
                    "text": "This is the big picture for journalism in 2019, imho.",
                    "created": "Mon, 01 Apr 2019 14:33:08 GMT"
                }
            ]
        }
    ]
}