{
    "text": "April 4",
    "created": "Thu, 04 Apr 2019 14:12:33 GMT",
    "name": "04",
    "subs": [
        {
            "text": "BTW, people who think the web is over don't understand imho how technology flows. The web is basically repurposed Unix. It arrived the decade after the PC revolution. Conventional wisdom said that Unix was a small niche OS that programmers liked, but users primarily used Windows with a smattering of Mac. Along comes the web just as Bill Gates thought he had it all sewn up. Unix! When I first saw an HTTP url I thought \"users will never do this.\" Six months later there were billboards on Hwy 101 in Marin with URLs on them. They were talking about the web on radio and TV. Unix had the last laugh. So when the web reboots it might not be called the web. But look closely, at whatever geeky new technology people are raving about, and you'll see that at its core it's open technology. And that will build on the open stack, and the web will be the next layer down, and under that it's Unix.",
            "created": "Thu, 04 Apr 2019 16:02:28 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/04/04/heavenCanWait.png"
        },
        {
            "text": "How to get started investing",
            "created": "Thu, 04 Apr 2019 14:12:34 GMT",
            "type": "outline",
            "description": "I was explaining to a friend the other day, a smart person, how to get started investing. Here's how the story goes.",
            "subs": [
                {
                    "text": "First, do not get a financial advisor. You need to get a feel for driving your own money. That imho is the most important thing. <i>You can do it.</i> If you hire someone to take care of your money, you'll have even less of a feel for it than you do now (assuming you're keeping your money in a checking or savings account). And you'll grow to resent the manager the way you resented adults when you were a kid. Money has all that stuff tied up in it, sense of self worth, powerlessness, being an <a href=\"https://en.wikipedia.org/wiki/Impostor_syndrome\">impostor</a>. Money is a symbol for every personal issue. Okay good for you -- you now you have some money, don't rush to give up your power. Embrace it. ",
                    "created": "Wed, 03 Apr 2019 23:04:40 GMT",
                    "flNumberedSubs": "true",
                    "subs": [
                        {
                            "text": "Open an account at one of the famous companies, Schwab, Fidelity, Vanguard, E*Trade. They'll have a minimum amount to open an account of say $1000. That's how much you have to have to play with. And you should be prepared mentally to lose it all, even though if you follow my advice that is very very very unlikely to happen. ",
                            "created": "Wed, 03 Apr 2019 23:05:23 GMT"
                        },
                        {
                            "text": "If you read their advice they make it sound really complicated. I'm going to make it simple. Put the $1000 in the S&P 500. It's a stock that's made up of 500 companies' stocks. You can think of it as a meta-stock. A stock of stocks. They're chosen by a company named Standard and Poor. The companies are chosen because they're solid earners, have been around a while, and together they reflect the performance of the stock market. Each of them is relatively low risk, but combined, they are very low risk. They track the performance of the stock market. If the market goes up, the S&P 500 goes up, and down if the market goes down. ",
                            "created": "Wed, 03 Apr 2019 23:21:04 GMT"
                        },
                        {
                            "text": "Historically, the S&P 500 mainly goes up. That's why it's a relatively safe investment. Here's a <a href=\"http://scripting.com/images/2019/04/04/sandpgraph.png\">graph</a> of the S&P 500 over the last 20 years or so. At times it does go down. There was a stock market crash in 2008, you can see that in the graph. But look what happened after that, it started going up again. There's a reason for that, btw, politically it's very bad for an incumbent president to have the stock market go down. So they do things to make it go up. You can buy a little piece of that with your $1000. It's why investing in an index fund like S&P 500 is a no-brainer. ",
                            "created": "Wed, 03 Apr 2019 23:37:05 GMT"
                        },
                        {
                            "text": "Only put $1000 in this fund at first. And then track the value of your investment. That's all you should do until you feel comfortable that you know what you're doing. It should happen pretty quickly. It's not even as complicated as the lottery. What I've told you here is really all you need to know. You can of course read up on it. But you've only risked $1000, so the most you can lose is (drumroll please) $1000. And unless the economy completely melts down, and then you have other huge problems, your investment over time is pretty safe. And you can make a lot of money doing this. Doesn't seem fair does it? (It really isn't.)",
                            "created": "Thu, 04 Apr 2019 14:20:08 GMT"
                        },
                        {
                            "text": "Now comes the fun part. Every day check the value of the <a href=\"https://www.marketwatch.com/investing/index/spx\">S&P 500</a> compared to the price you paid. Do this forever. Think about what it means. And it may give you ideas to look at other meta-stocks. And you may see yourself differently too. ",
                            "created": "Thu, 04 Apr 2019 01:40:50 GMT"
                        }
                    ]
                },
                {
                    "text": "A note, they ask too many questions when you open an account at these services. They insist you answer questions you have no way to answer. Why not have a fast path to signing up. A button that says Hey I'm a Newbie Here and I don't want to answer any questions. I just want to put a little money in an index fund to see how this works. ",
                    "created": "Thu, 04 Apr 2019 14:27:50 GMT"
                }
            ]
        }
    ]
}