{
    "text": "April 6",
    "created": "Sat, 06 Apr 2019 16:42:04 GMT",
    "name": "06",
    "subs": [
        {
            "text": "This isn't going to be popular, but much of what's funded in grant-based journalism is meant to keep journalists employed, not to make journalism more useful to the people.",
            "created": "Sat, 06 Apr 2019 16:57:58 GMT",
            "type": "outline"
        },
        {
            "text": "Credible j-schools, in conjunction with their CS departments, should hold boot camps for reporters when aspects of tech become hot news. In 2016 it was email servers. Last year it was Facebook's API.",
            "created": "Sat, 06 Apr 2019 16:56:02 GMT",
            "type": "outline"
        },
        {
            "text": "Impeachment is political",
            "created": "Sat, 06 Apr 2019 16:42:05 GMT",
            "type": "outline",
            "description": "Impeachment is an act of the people, as the founders saw it.",
            "subs": [
                {
                    "text": "Impeachment is political, it's not about violating statutes, that's what the DoJ is for. Impeachment is when the country can't tolerate what the president is doing, and no remedy other than removal can protect the country. POTUS using <a href=\"https://twitter.com/markmobility/status/1114287002348863488\">Nazi genocide language</a> qualifies. ",
                    "created": "Sat, 06 Apr 2019 16:42:11 GMT",
                    "urltweet": "https://twitter.com/markmobility/status/1114287002348863488"
                },
                {
                    "text": "Impeachment is an act of the people, as the founders saw it. It's our representatives in Congress, specifically the House, who make the call, but they should only do it when the people demand it of them. Right now that demand is not there. Can't blame the Democrats for that. It's our job to make our will clear to our reps. We have not done that, yet. ",
                    "created": "Sat, 06 Apr 2019 16:42:38 GMT"
                }
            ]
        }
    ]
}