{
    "text": "April 14",
    "created": "Sun, 14 Apr 2019 16:01:31 GMT",
    "name": "14",
    "subs": [
        {
            "text": "Sitting in the Austin airport early this morning hearing the names of Muslims on the PA system, such an ordinary thing in normal times, I wondered where we would be in a couple of years. Will those people still be fully righted Americans, or will the rule of law have completely collapsed. I wondered what must go through their minds. How conspicuous they might feel. And who would be next. When will we start putting Americans in concentration camps, and what comes after that. I couldn't convince myself that these were foolish thoughts. ",
            "created": "Sun, 14 Apr 2019 22:55:04 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/06/20/orange.png"
        },
        {
            "text": "I just spent a few days in Austin at the ISOJ conference. I had a great time. Thanks to all the people who put on this complicated affair. I was interviewed yesterday morning by my longtime friend Rebecca MacKinnon, and co-conspiritor of original Berkman Thursday clan, and co-founder of Global Voices. Made a lot of new friends, and stayed true to my rather radical opinions about the course journalism should take into the future, and found to my surprise a lot of support among the assembled journalists and academics. ",
            "created": "Sun, 14 Apr 2019 16:01:32 GMT",
            "type": "outline"
        },
        {
            "text": "I now find myself on a longish layover in Philadelphia, in Terminal F. Never been to this airport (no reason to, because my endpoint is usually JFK or EWR, but this time it's Albany). Looking forward to bingeing on the NBA playoffs which have so far been quite exciting. The Nets won and Orlando won, against teams that were thought to be superior. I doubt if I'll ever be a Nets fan, but they're the only quality act in NYC these days. And of course Game of Thrones and Killing Eve tonight. A great time to have a TV and a couch! :-)",
            "created": "Sun, 14 Apr 2019 16:20:18 GMT",
            "type": "outline"
        },
        {
            "text": "Instant tech bootcamps for journalism",
            "created": "Sun, 14 Apr 2019 16:36:55 GMT",
            "type": "outline",
            "description": "It is possible to understand the basics of an email server, for example, in a couple of hours, even if you only have a user's understanding of email technology. ",
            "subs": [
                {
                    "text": "This idea came up in Austin and was well-received. When journalism discovers a tech issue that appears to be a scandal, I proposed there should be a quickly convened flash conference, hosted by a university journalism department in conjunction with its computer science department. A two-evening bootcamp for journalists in New York, where the tech behind the scandal is examined dispassionately and objectively, by computer scientists who speak the language of journalism. A \"poets\" course. It is possible to understand the basics of an email server, for example, in a couple of hours, even if you only have a user's understanding of email technology. In the second evening, a smaller group convenes with journalists and techies, to write a concise backgrounder on the tech, and it is published, quickly. The organization that does this would be something like Politifact, but rather than fact-checking a single story, it's providing the necessary background for all reporters, so the delay in getting seriously factual reports on the problem is minimized. It would also likely quickly evolve, and set a baseline for the kind of information every news org should publish along with a story about tech malfeasance. ",
                    "created": "Sun, 14 Apr 2019 16:44:57 GMT",
                    "image": "http://scripting.com/images/2019/04/14/cartoon.png"
                },
                {
                    "text": "The reason this is needed is that our political system has (imho) overreacted to sensational stories, such as Hillary's emails, or misunderstood the extent of Facebook's API. And also completely missed looming crises, failing to catch them in time for them to be prevented. It seems journalism should aspire to do this as well.",
                    "created": "Sun, 14 Apr 2019 16:43:02 GMT"
                }
            ]
        }
    ]
}