{
    "text": "April 20",
    "created": "Sat, 20 Apr 2019 15:11:32 GMT",
    "name": "20",
    "subs": [
        {
            "text": "Happy 4/20!",
            "created": "Sat, 20 Apr 2019 15:18:51 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=ABc8ciT5QLs"
        },
        {
            "text": "BTW, the corrupt president now has a corrupt attorney general. That's something to factor into your thinking.",
            "created": "Sat, 20 Apr 2019 17:17:55 GMT",
            "type": "outline"
        },
        {
            "text": "It's time to impeach",
            "created": "Sat, 20 Apr 2019 15:11:33 GMT",
            "type": "outline",
            "description": "If we don't impeach and remove, we no longer have a Constitution that's enforced re the president.",
            "subs": [
                {
                    "text": "<b>Ignore the Constitution?</b>",
                    "created": "Sat, 20 Apr 2019 17:25:26 GMT",
                    "subs": [
                        {
                            "text": "Those who say impeach is not the answer, what would Trump have to do in order to make impeach the right answer? ",
                            "created": "Sat, 20 Apr 2019 15:11:40 GMT"
                        },
                        {
                            "text": "Well here's the thing, what makes you think he won't do much worse between now and inauguration day in 2021?"
                        },
                        {
                            "text": "He wouldn't have any restraints between now and then."
                        },
                        {
                            "text": "And BTW, what restraints would there be on the next president? Maybe not such a buffoon as Trump. If we don't impeach and remove, we no longer have a Constitution that's enforced re the president. This guy has been ignoring it. We would all be ignoring it if he isn't impeached and removed.",
                            "created": "Sat, 20 Apr 2019 15:12:05 GMT"
                        }
                    ]
                },
                {
                    "text": "<b>Corrupt attorney general</b>",
                    "created": "Sat, 20 Apr 2019 17:24:47 GMT",
                    "subs": [
                        {
                            "text": "The corrupt president now has a corrupt attorney general. That's something to factor into your thinking.",
                            "created": "Sat, 20 Apr 2019 17:24:55 GMT"
                        },
                        {
                            "text": "One implication of this is that all the other DoJ cases that are open now, will soon be closed. It's within his power to close them. So if you're thinking about SDNY cases, forget it. They're not going to happen.",
                            "created": "Sat, 20 Apr 2019 17:25:07 GMT"
                        },
                        {
                            "text": "The only thing the people control now is the House. Are we going to let the Democrats make this a partisan thing? If you're an independent, now's the time to express that independence. You shouldn't care if a Democrat gets re-elected, if they're just as corrupt at the Repubs.",
                            "created": "Sat, 20 Apr 2019 17:25:12 GMT"
                        },
                        {
                            "text": "Trump's corruption is a moving target. He's found new people who go along with his most wantonly destructive acts, so the future offenses will be worse than the ones we're reviewing now.",
                            "created": "Sat, 20 Apr 2019 17:53:32 GMT"
                        }
                    ]
                }
            ]
        }
    ]
}