{
    "text": "April 21",
    "created": "Sun, 21 Apr 2019 15:50:30 GMT",
    "name": "21",
    "subs": [
        {
            "text": "<a href=\"http://scripting.com/2019/04/21/heWontStopYouMustKnowThat.m4a\">12-minute podcast</a> about where we're at with impeachment. Key point is that we can't just wish the problem away. We've been doing that for three years. Now resistance is more than symbolic. We've blown through every chance we've had to stop Trump. He will continue to ignore the Constitution. You want to live in that country? There only way to say no at this point is to impeach. This is a good timely podcast. Proud of how it came together. ",
            "created": "Sun, 21 Apr 2019 16:51:44 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2019/04/21/heWontStopYouMustKnowThat.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "5820048"
        },
        {
            "text": "It's too hard to publish something to the open web. It has to be available as simple content. Not rendered inside a commercial template. Technically it's a very simple problem, actually. And the raw serving capability is dirt cheap. But it needs a corporate entity to run it.",
            "created": "Sun, 21 Apr 2019 17:00:24 GMT",
            "type": "outline"
        },
        {
            "text": "An idea for <a href=\"https://www.thecrimson.com/\">The Crimson</a> -- interview scholars at Harvard Law School, ask this question. What could a corrupt president unrestrained by impeachment and thus the rule of law do between now and Inauguration Day 2021.",
            "created": "Sun, 21 Apr 2019 15:50:31 GMT",
            "type": "outline"
        },
        {
            "text": "You should use Facebook",
            "created": "Sun, 21 Apr 2019 17:19:19 GMT",
            "type": "outline",
            "description": "I stopped on the street yesterday to talk with a couple of neighbors. Among other things I said they should use Facebook. That deserved a follow-up email and a blog post. ",
            "subs": [
                {
                    "text": "<i>I stopped on the street yesterday to talk with a couple of neighbors. The question of whether they should use Facebook came up. They read the NY Times and hear how bad FB is, they don't want to use it. They say the same phrases the NYT uses. Educated thoughtful people, want to do what's right, but they're getting their truth from a conflicted organization, imho. I thought about it, and here's a follow-up email I wrote.</i>",
                    "created": "Sun, 21 Apr 2019 17:19:30 GMT",
                    "image": "http://scripting.com/images/2018/01/16/librarianActionFigure.png"
                },
                {
                    "text": "Nice to meet you X, and see you Y! ;-)",
                    "created": "Sun, 21 Apr 2019 17:22:20 GMT"
                },
                {
                    "text": "I thought some more about Facebook, of course it's a choice whether to use it or not, and they are the worst most greedy people in the world, they took from the web and refuse to give back, and there's very little nice I can say about the company. ",
                    "created": "Sun, 21 Apr 2019 17:22:24 GMT"
                },
                {
                    "text": "But I think the news pubs are doing a disservice by trashing FB so thoroughly without offering an alternative that works the way it should. What they really want is the rest of us to be quiet and listen to them. That is not going to happen because what goes on on the net is too valuable and people won't give it up."
                },
                {
                    "text": "I would love to see a world where we could use these great tools without giving up anything. We knew how to make that and it existed before FB, but they made it easier and figured out how to give it away free, and people didn't care to know about the cost..."
                },
                {
                    "text": "Anyway -- I've decided this isn't my battle. I'm going to get the benefit, and not worry about the cost. Nothing I can do about it anyway. ;-)"
                },
                {
                    "text": "Dave"
                },
                {
                    "text": "PS: I should probably make this a blog post. "
                }
            ]
        }
    ]
}