{
    "text": "April 25",
    "created": "Thu, 25 Apr 2019 15:37:33 GMT",
    "name": "25",
    "subs": [
        {
            "text": "Every time you criticize a Democratic candidate, please add \"Whatever happens I'm voting for whoever isn't Trump. I hope you are too.\" This ought to be our mantra. Disagreement is great. Suicide is not permitted.",
            "created": "Thu, 25 Apr 2019 21:46:53 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/04/25/fresca.png"
        },
        {
            "text": "Another problem in letting the silos usurp the name \"podcast\" is they will take it places that suit them, and when it's done, the term will mean \"failed get-rich-quick scheme.\"",
            "created": "Thu, 25 Apr 2019 21:16:49 GMT",
            "type": "outline"
        },
        {
            "text": "Once podcasting becomes a tech battleground, it will get to be like Disneyland or HBO. I like silos as much as anyone, I prefer Fresca to some unknown local brand of soda (are there any?) but what I love about podcasting is the mix of styles and ideas. ",
            "created": "Fri, 26 Apr 2019 00:38:13 GMT",
            "type": "outline"
        },
        {
            "text": "I just <a href=\"https://twitter.com/davewiner/status/1121462756249612294\">gave</a> $100 to Joe Biden. I have already given $100 to <a href=\"http://scripting.com/2018/11/23/205133.html\">Amy Klobuchar</a>. I am really starting to like Elizabeth Warren. I like the confidence. But whatever happens I'm voting for whoever isn't Trump. I hope you are too.",
            "created": "Thu, 25 Apr 2019 17:42:58 GMT",
            "type": "outline"
        },
        {
            "text": "You might try listening to someone who is sure they're right, no matter what their age. Sometimes they're right, I've found.",
            "created": "Thu, 25 Apr 2019 16:14:20 GMT",
            "type": "outline"
        },
        {
            "text": "BTW, if you've ever watched Jeopardy, you should watch at least one of the current shows with <a href=\"https://www.nytimes.com/2019/04/24/arts/jeopardy-james-holzhauer-interview.html\">James Holzhauer</a>. He's basically found a new level in the game. He is very knowledgable of trivia, but also risks a lot. And that's why he wins.",
            "created": "Thu, 25 Apr 2019 15:37:34 GMT",
            "type": "outline"
        }
    ]
}