{
    "text": "April 26",
    "created": "Fri, 26 Apr 2019 12:50:22 GMT",
    "name": "26",
    "subs": [
        {
            "text": "Good morning sports fans!",
            "created": "Fri, 26 Apr 2019 12:50:23 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://www.quora.com/Who-wrote-I-would-rather-sit-by-the-river-and-watch-my-enemies\">Someone said this</a>: \"If you wait by the river long enough, the bodies of your enemies will float by.\" ",
            "created": "Fri, 26 Apr 2019 21:49:50 GMT",
            "type": "outline"
        },
        {
            "text": "I've been steadily building out <a href=\"http://scripting.com/2019/04/17/144031.html\">my home theater</a>. Got a nice <a href=\"https://www.amazon.com/gp/product/B0002KVQBA/ref=ppx_yo_dt_b_asin_title_o05_s00?ie=UTF8&psc=1\">subwoofer</a> last week, and a <a href=\"https://www.amazon.com/gp/product/B000V2QVEQ/ref=ppx_yo_dt_b_asin_title_o01_s00?ie=UTF8&psc=1\">center channel</a> speaker came today. One thing I've realized is that Netflix has the best sound and picture of any of the other streamers, some of which are really shitty. So I always turn to Netflix to test a new setup. Also HBO has very high quality. Game of Thrones is great for testing, even though the first two episodes of the season have been very disney or hallmark. ",
            "created": "Fri, 26 Apr 2019 21:38:38 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/04/17/roku2.png"
        },
        {
            "text": "<a href=\"https://www.niemanlab.org/2019/04/i-felt-like-it-was-a-betrayal-and-we-had-raised-funds-on-false-pretense-the-correspondents-first-u-s-employee-speaks-out/\">Nieman Lab exposes</a> the snake oil at <a href=\"https://mediagazer.com/190426/p13#a190426p13\">TheC</a>. Journalists and academics need to be dispassionate when evaluating new ventures. This one was easy to <a href=\"http://scripting.com/2019/03/28/203444.html\">debunk</a>.",
            "created": "Fri, 26 Apr 2019 20:34:44 GMT",
            "type": "outline"
        },
        {
            "text": "If you look in the Chat tab on the <a href=\"http://scripting.com/\">home page</a>, you'll see the recent blog posts are present in the chat stream. From now on (knock wood) my posts should appear in the stream. That way it might be easier to tell at what point in the flow a comment appeared. At this time it does not update posts as they change. One step at a time. ",
            "created": "Fri, 26 Apr 2019 14:44:56 GMT",
            "type": "outline"
        },
        {
            "text": "Trump lies. Everyone knows it, even his “base.”",
            "created": "Fri, 26 Apr 2019 15:10:26 GMT",
            "type": "outline"
        },
        {
            "text": "Rebooting America",
            "created": "Fri, 26 Apr 2019 15:19:50 GMT",
            "type": "outline",
            "description": "All my life I've been waiting for a candidate to realize that although they're probably not going to win, there are things they can do to make things better right now, as a person with a powerful microphone, as a potential president. ",
            "subs": [
                {
                    "text": "A while back I said <a href=\"http://scripting.com/2019/03/17/135334.html\">Biden should not</a> run. But he's running. It is what it is and it's even worse than it appears. I look at Joe's eyes and I see they are the eyes of a very old man. Black dots. This happened to the eyes of my grandparents as they got close to the end. Joe seems to be in good health, but the eyes. ",
                    "created": "Fri, 26 Apr 2019 15:19:54 GMT",
                    "image": "http://scripting.com/images/2019/04/26/uncleSameNewYorkerCover.png"
                },
                {
                    "text": "There are tradeoffs with Joe. He's old. That means there's a lot to criticize, but it also means he has a time-tested idea of what America is. I know young people think they have experienced things we will never understand, and that's true, but it's also true a person of Biden's age has experienced things they will never know, except in history books, and they always tell the story of the winner, not the struggle and the choices that led to the outcome. ",
                    "created": "Fri, 26 Apr 2019 15:21:01 GMT"
                },
                {
                    "text": "It seems you'd want someone like Biden around during the campaign with a voice people listen to. I think every one of the Democrats who will not be the nominee must view it that way. A billion dollars will be raised during the primary. Think about the good you can do with that, in communicating important ideas, and achieving positive results for the Americans you hope to represent. All my life I've been waiting for a candidate to realize that although they're probably not going to win, there are things they can do to make things better right now, as a person with a powerful microphone, as a potential president. Maybe Biden is the one who gets that.",
                    "created": "Fri, 26 Apr 2019 15:22:47 GMT"
                },
                {
                    "text": "He's already said something that needs to be said and has put Trump on the defensive, re-stating his <a href=\"https://talkingpointsmemo.com/edblog/trump-doubles-down-on-very-fine-people\">Nazi-friendly</a> ideas. I think that's a good way to start. Call the Nazi a Nazi. And Trump certainly is that. But we got tired of HRC advertising only how awful Trump was -- we got it. How about some uplifty poetry to go with the negative bits. We want to feel we're part of a cause when we go into the voting booth.",
                    "created": "Fri, 26 Apr 2019 15:24:45 GMT"
                },
                {
                    "text": "I hope Biden remembers how he launched his campaign, and others follow suit. We're all trying to reboot America. Let's keep focused on that. ",
                    "created": "Fri, 26 Apr 2019 15:26:10 GMT"
                }
            ]
        }
    ]
}