{
    "text": "Apple's boastful robot",
    "created": "Wed, 02 Feb 2022 20:25:12 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "When you call 1-800-MYAPPLE, an intelligent robot answers the phone, introduces itself as as such and kept sending me to tech support when I had a customer service problem, and said so clearly in short phrases. I am trained at talking to Alexa, Siri and my Tesla, I know how to give them commands. ",
            "created": "Wed, 02 Feb 2022 20:25:23 GMT",
            "flInCalendar": true
        },
        {
            "text": "Then, on my way back to tech support, it asked me to identify myself, but didn't say what info it wanted. It paused and in a stern voice said I had not answered the question in enough time.  ",
            "created": "Wed, 02 Feb 2022 20:26:09 GMT",
            "flInCalendar": true
        },
        {
            "text": "And then it connected me to customer service to talk to a human.  ",
            "created": "Wed, 02 Feb 2022 20:26:51 GMT",
            "flInCalendar": true
        },
        {
            "text": "Which btw was exactly what I was hoping for when I called the number in the first place. ",
            "created": "Wed, 02 Feb 2022 20:33:40 GMT",
            "flInCalendar": true
        },
        {
            "text": "For a super high tech company this was embarrassing. ",
            "flInCalendar": true
        },
        {
            "text": "To their credit, the human I spoke with was apologetic.",
            "created": "Wed, 02 Feb 2022 20:27:06 GMT",
            "flInCalendar": true
        },
        {
            "text": "Do they test their software at Apple? ",
            "created": "Wed, 02 Feb 2022 20:27:12 GMT",
            "flInCalendar": true
        },
        {
            "text": "I also tried using their text chat service, it was worse. It repeatedly told me to use the self-help system. Why offer a chat service if you're just going to tell me to use the self-help system? (Interestingly the self-help system gave me information I did not have.)",
            "created": "Wed, 02 Feb 2022 20:27:44 GMT",
            "flInCalendar": true
        },
        {
            "text": "A $1300 purchase, btw. ",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}