{
    "created": "2024-10-03T04:00:00.000Z",
    "flInCalendar": true,
    "name": "03",
    "path": "2024/10/03",
    "text": "October 03",
    "type": "calendarDay",
    "subs": [
        {
            "text": "A ChatGPT news network would be pretty interesting. You could register as an independent blogger, and push your writing up to their cloud in real time. And then readers could ask what experts on <i>whatever</i> think about <i>what just happened</i> and it would know what your expertise is, and it could build the report also in realtime, in response to a very detailed question you could ask. And you could tell it whether or not you want lies, or if they should omit the lies. Personally I would opt out of the lies, but some people like lies in their news, kind of like menthol in cigarettes. And forget about paying the news orgs. They don't give you a way to opt out of the lies. ",
            "created": "Thu, 03 Oct 2024 19:21:31 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2019/08/18/bigLittleLies.png",
            "flInCalendar": true
        },
        {
            "text": "So far we've only created reading portals. What I want for myself and for you, is a <a href=\"http://scripting.com/2024/10/03/023255.html\">writing portal</a>. Think about it.",
            "created": "Thu, 03 Oct 2024 16:18:30 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I didn't like the code ChatGPT was writing for me, so I tried it in <a href=\"https://claude.ai/new\">Claude</a>, and the code is much closer to my style. I may try that again. I've heard it's better at supporting code than other chatbots. ",
            "created": "Thu, 03 Oct 2024 14:21:37 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "AI deflates the value of expertise",
            "created": "Thu, 03 Oct 2024 15:27:57 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I didn't read the WSJ story about the deflation of expertise, quoting <a href=\"https://en.wikipedia.org/wiki/Vinod_Khosla\">Vinod Khosla</a>, Silicon Valley venture capitalist, who I know from my time in California. He says AI leads to a deflation of expertise. I agree with him, AI absolutely deflates the value of expertise. ",
                    "created": "Thu, 03 Oct 2024 15:28:05 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It aggregates all of our knowledge in one place where it's easy to access, about anything you want to know. It answers questions that you can't get any other way. ",
                    "created": "Thu, 03 Oct 2024 15:34:45 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Some technological developments are profound. We never understand all the implications of a new technology when it comes online, but you do get some strong clues. You have to use it to know learn how to think about it. That's not unreasonable because we all grew up in a world that didn't have this technology, as my parents grew up in a world without television, and I didn't use a computer until I was 18 or use the web until I was 37. None of us grew up with anything but fiction about AI, and the fiction imho didn't grasp the implications very well.  ",
                    "created": "Thu, 03 Oct 2024 15:35:02 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "If I ask good questions ChatGPT stretches my mind in ways it never has been stretched before and I'm well educated and in my work have explored frontiers of knowledge, even so -- this is the most mind-stretching experience I've ever had. Not kidding. And I'm not a VC or prone to overhyping tech.\n",
                    "created": "Thu, 03 Oct 2024 15:32:47 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "What is a writing portal?",
            "created": "Fri, 04 Oct 2024 02:32:55 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "So far we've only created reading portals. What I want for myself and for you, is a writing portal. ",
                    "created": "Fri, 04 Oct 2024 02:34:51 GMT",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "A reading portal brings a lot of writers together so you can read them all in one place.",
                            "created": "Fri, 04 Oct 2024 02:34:59 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "A writing portal is the same idea but in reverse. I write in my portal, and it flows where ever I want it to.",
                            "created": "Fri, 04 Oct 2024 02:33:16 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "The problem is the reading portals aren't open to allow this to work.",
                    "flInCalendar": true
                },
                {
                    "text": "They all want you to write in their <a href=\"http://scripting.com/2024/01/14/031201.html\">tiny little text boxes</a>.",
                    "created": "Fri, 04 Oct 2024 02:33:29 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}