{
    "created": "2024-10-12T04:00:00.000Z",
    "flInCalendar": true,
    "name": "12",
    "path": "2024/10/12",
    "text": "October 12",
    "type": "calendarDay",
    "subs": [
        {
            "text": "I would switch to any <a href=\"https://en.wikipedia.org/wiki/List_of_podcast_clients\">podcatcher</a> that let me edit my subscription list outside their app, because I use that list in different contexts, also because I’d like to share my list with others, and would like that to be a dynamic connection, so I could add feeds as I learn about them, or remove feeds that have stopped updating. Also because there are lots of others, aka influencers who’d like to too. You’d own the market if you did this. ",
            "created": "Sat, 12 Oct 2024 21:19:40 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2021/12/12/zen.png",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://en.m.wikipedia.org/wiki/Cynicism_(contemporary)\">Cynicism</a> isn’t always the right explanation. Sometimes people just want to share something good with you, that doesn’t necessarily mean they’re stupid, maybe they just like you. ",
            "created": "Sat, 12 Oct 2024 16:50:35 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The common denominator between journalism, business and politics is that none of them have any respect for people. To rise in influence, money or power you have to give up imagination, and be ruled by cynicism. If you don’t believe this, show me a journalist who listens, a business that makes products for thinkers, or a politician who lets individual people lead them. ",
            "created": "Sat, 12 Oct 2024 21:18:48 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Why is this possible now?",
            "created": "Sat, 12 Oct 2024 14:54:03 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "BTW, the reason there's such a confluence of power between WordPress and Mastodon is this.",
                    "created": "Sat, 12 Oct 2024 14:54:09 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "WordPress has a <a href=\"https://github.com/Automattic/wp-calypso/tree/trunk/packages/wpcom.js\">complete, debugged, deployed, scaled and frozen API</a>. It's been around since 2016 or so.",
                    "created": "Sat, 12 Oct 2024 14:54:23 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "In contrast Mastodon, while they're doing excellent work, is trying to wrangle an already large community into a set of consistent interfaces. It's very hard for an outsider like myself to approach, esp when you're overloaded with your own work (which we all are).",
                    "flInCalendar": true
                },
                {
                    "text": "Meanwhile, Automattic has a small team whose only job is to make WordPress work with Mastodon.",
                    "flInCalendar": true
                },
                {
                    "text": "So I can build software that works with Mastodon without venturing into the rough seas of Mastodon-land. I can stay on the cruise-liner, which is the WordPress API.",
                    "created": "Sat, 12 Oct 2024 14:54:50 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I didn't even know they had this API until last summer. My jaw dropped when I first saw it. It even works with Node.js. And now that I'm on the other side, I haven't hit any insurmountable obstacles or had to wait for something to be decided.",
                    "flInCalendar": true
                },
                {
                    "text": "This is the proper way to build interop. Implementors make things work, not W3C committees (I say that with decades of experience with this, btw).",
                    "flInCalendar": true
                },
                {
                    "text": "I thought it deserved an explanation.",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Payback time for the Dodgers",
            "created": "Sat, 12 Oct 2024 15:09:33 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Well we know who the Mets are facing, starting tomorrow, in the National League championship series. ",
                    "created": "Sat, 12 Oct 2024 15:09:46 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Last time we played the Dodgers in the postseason we <a href=\"https://www.baseball-reference.com/postseason/2015_NLDS2.shtml\">kicked their ass</a>. And now they have the nerve to show up again. Geez some people never learn. ",
                    "created": "Sat, 12 Oct 2024 15:10:18 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "And we haven't forgotten how <a href=\"https://www.youtube.com/watch?v=BRbFJo83mlg\">Chase Utley</a> broke <a href=\"https://en.wikipedia.org/wiki/Rub%C3%A9n_Tejada\">Rubin Tejada's</a> leg, <a href=\"http://scripting.com/2015/10/11/baseballGotUglyLastNight.html\">deliberately</a>, basically ending his major league career. We thought he should have been arrested for that, no kidding -- it was a vicious un-baseball assault. He and the Dodgers showed <a href=\"https://dodgers.mlblogs.com/off-day-report-mattingly-addresses-utley-tejada-a2ba255e751f\">no remorse</a>. ",
                    "created": "Sat, 12 Oct 2024 15:12:23 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The only payback that matters is victory.",
                    "created": "Sat, 12 Oct 2024 15:20:02 GMT",
                    "inlineImage": "https://imgs.scripting.com/2024/10/12/payback.png",
                    "flInCalendar": true
                },
                {
                    "text": "Update: The Jankees are playing Cleveland in the ALCS, and while some people with limited imaginations wish for a <a href=\"https://en.wikipedia.org/wiki/Subway_Series\">Subway Series</a> betw the the two NY teams, I do not. I have a rule, I always root for the team the Jankees are playing. Thus I hope to see a World Series between the Mets and so-called \"Guardians.\" And of course the Mets would be heavily favored in that contest because the Cleveland team has changed their name to something impossible to pronounce, ethically. When you change your name, like <a href=\"http://scripting.com/2015/09/21/silverLiningMetsBook.html#aIWPAT\">tearing down your stadium</a> (something that took the Mets a long time to recover from) you basically put a hex on your team making it virtually impossible for your philosophy to prevail. So Mets v Guardians, while not necessarily what I predict, rather is something I <i>hope</i> <i>for</i>, and as long as the game is played with philosophy, that's the real victory! So get em METS and never forget there's always next year. :heart:",
                    "created": "Sun, 13 Oct 2024 00:52:47 GMT",
                    "image": "https://imgs.scripting.com/2024/10/12/mrMetAtBat.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}