{
    "created": "2024-10-17T04:00:00.000Z",
    "flInCalendar": true,
    "name": "17",
    "path": "2024/10/17",
    "text": "October 17",
    "type": "calendarDay",
    "subs": [
        {
            "text": "One of the things that makes me want to see Automattic stick around and grow is that they have a really large codebase that has been scaled, debugged and maintained for over 20 freaking years. And the most important thing -- they don't break users. The code I wrote to run against WordPress in the 00s still runs today. To me as a developer this speaks very loudly. It means it's safe to develop here. It means there's discipline in their development organization. Most companies don't do this, but the ones who do, have earned my deep respect. For all of Microsoft's sins, they were incredibly good at this too. It's why I liked working with them, and also why we laughed at each others' jokes if you can believe that. In some ways all the open source stuff is too complicated. I understand the concept of \"development org\" -- so I look at it that way. I dig around their codebase, see how they do things, and figure it'll work out pretty well if I just do it that way. Because the last people they're going to break are themselves. What I see on their latest APIs is maturity and completeness. They didn't rush off to the next thing before finishing. I found that in their Calypso API, which I've been building on. Honestly this is my kind of platform, it's what Manila's API would look like today probably if we had continued developing it. I'll see if I can find the docs around here somewhere. Long time ago. ;-)",
            "created": "Thu, 17 Oct 2024 22:30:19 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2024/06/11/nakedJenToday.png",
            "flInCalendar": true
        },
        {
            "text": "I made the <a href=\"https://github.com/scripting/reallysimple\">reallySimple package</a> for Node.js because I wanted to make it as easy as possible to read feeds in Node apps. It should be as easy as reading a file. Give it the URL of a feed, get back a JavaScript object that's as simple as feeds are. It can read RSS, Atom and RDF feeds, but you get the same object regardless of what form the feed was in. I'm up for creating some example apps if you're interested. There is a very simple <a href=\"https://github.com/scripting/reallysimple/tree/main/example\">Hello World app</a> included in the package and a set of <a href=\"https://github.com/scripting/reallysimple/tree/main/demos\">demo apps</a>. It's MIT-licensed, so you can do whatever you want with the code. It would lovely to see it ported. The idea is to plant some seeds in the Node.js world to make it easy for developers to try out new ideas with feeds, figuring the easier it is, the more people will do it. Be creative. Blow our minds! :-)",
            "created": "Thu, 17 Oct 2024 22:11:05 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2022/10/24/rssCoffeeMug.png",
            "flInCalendar": true
        },
        {
            "text": "The question has come up in various contexts, is a Substack feed a blog? Yes, I think it can be. For some reason people thought I'd say no. In 2003, I compiled a list of <a href=\"https://archive.blogs.harvard.edu/whatmakesaweblogaweblog/\">things that make a blog a blog</a>, and it's not about the software you use, rather it's about who's writing it, and whether they're being edited. Now it's a different question to ask if I would use it. I would not. Because it forces you to use their editor. And that's a <a href=\"https://www.google.com/search?q=pernicious\">pernicious</a> form of lock-in. It might sound like a small thing, but it means you can't easily try out something new. You are not available to other software developers as a possible user, so no software will be designed for you. I know how well that kind of system works. And that's probably why they lock you into using their editor. If I can't switch without breaking everything, I'm not going there. ",
            "created": "Thu, 17 Oct 2024 15:13:04 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2020/01/16/rodneyDangerfield.png",
            "flInCalendar": true
        },
        {
            "text": "Mathew Ingram <a href=\"https://tormentnexus.substack.com/p/is-ai-going-to-save-us-or-kill-us\">asks</a> if AI will save us or kill us. It could both save and kill us. That's what's so disturbing about evolving. We live such short lives, people aren't really designed to evolve, but because of medicine and other tech, we are often forced to do it. Evolution can come many ways. Losing a job may force you to evolve. The dissolution of a marriage. Having life-saving surgery with a long recovery saves you for sure, but it might also kill you because you can't go back to being the person you were before. There might not be a path back. One thing's for sure we <i>need</i> saving. We can't survive without radical change. We're on a path that doesn't work. Is there any way for us to change radically without a complete collapse? Well, actually kind of looks like we might have been given a path out through AI. But it means we must give up control. But here's the funny thing about that. We aren't giving up anything because no one has any control. That's a political question in the US, can one person become a mad king and thus gain complete control. But he's 78 and not in good health, and that control could only last a few years at most. We will need saving from that. If somehow we could configure AI so it did what humans can't and won't do, at least our civilization might have a way forward if not our species. Just some random thoughts. Maybe unthinkable, but they occur to me anyway, which is why I have a blog.  :smile:",
            "created": "Thu, 17 Oct 2024 14:51:40 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2020/04/29/gecko.png",
            "flInCalendar": true
        },
        {
            "text": "I keep writing on my hybrid <a href=\"https://mastodon.social/@daveverse.wordpress.com@daveverse.wordpress.com/113322998712983125\">WordPress/Mastodon blog</a> at my kitchen table. This morning I wrote about why I don't believe in the Ya Gotta Believe, a baseball slogan coined by a 1973 Mets pitcher Tug McGraw. It's on-topic because the Mets are in a challenging series with the Dodgers for the National League championship. No matter how it turns out, this is a historic year for the Mets, and no matter how it turns out I won't love the Mets any less if they lose. I think true believers believe in that -- love -- without any expectations, win or lose, or maybe <i>even more</i> if they lose. BTW, I know the rendering of the post isn't complete on Mastodon, and there are errors. I'm working with the people at Automattic at getting this right. I'm glad to see that Mastodon has the flexibility to do that. Anyway, I believe in the things I believe in, not because I \"gotta.\" I don't like the slogan because it doesn't reflect how I feel about the team. My philosophy is respectful (in a way) of the teams the Mets beat, because I understand that their fans don't love them any less because they lost. If anything I think the better slogan for the Mets would be this: <a href=\"https://www.google.com/search?q=site%3Ascripting.com+Wait+till+next+year!\">Wait till next year!</a> :smile:",
            "created": "Thu, 17 Oct 2024 13:44:43 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2020/08/04/melo.png",
            "flInCalendar": true
        }
    ]
}