{
    "created": "2024-10-18T04:00:00.000Z",
    "flInCalendar": true,
    "name": "18",
    "path": "2024/10/18",
    "text": "October 18",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Bloggers, here's an idea. When you write a piece you're proud of, end it with a sentence like this: \"And that's why I have a blog.\" It plants a seed, which through repetition and appearing in many places, might help people appreciate the purpose of a blog. We've had a lot of mud slung at us, let's start undoing that.\n",
            "created": "Fri, 18 Oct 2024 16:37:52 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The Dodgers <a href=\"https://www.usatoday.com/story/sports/mlb/2024/10/17/dodgers-vs-mets-score-nlcs-game-4-highlights/75724161007/\">soiled</a> our lovable slumping Mets last night. It was a sad sight. One to forget as soon as possible. And don't forget folks, there's always next year. If I were the Dodgers, I'd expect the Mets to win tonight, and the Dodgers will probably begrudgingly go along with it. Otherwise we'd have to destroy Citi Field as we did when the Yankees celebrated their World Series victory in 2000 on the field of Shea Stadium. I was actual there the night that will live in infamy. Back then at first I objected to the destruction of our shrine to the glory of past Mets teams, but then I realized we could never again rise to the peak of Mets philosophy in a chapel so soiled by the infidels. So if you don't mind Dodgers, we'd like to keep Citi Field, so we won't object if you let our Metsies win tonight's game. The song for tonight's game is <a href=\"https://www.youtube.com/watch?v=_ObVQPBD0Uw\">Ain't Too Proud to Beg</a> by the Temptations.",
            "created": "Fri, 18 Oct 2024 14:47:49 GMT",
            "type": "outline",
            "image": "https://imgs.scripting.com/2024/10/18/grimace.png",
            "flInCalendar": true
        },
        {
            "text": "There's this great story in the Fargo TV series where one of the villains says there's a point when an animal that has been captured, relaxes when it realizes that it is no longer a being and <a href=\"https://www.youtube.com/watch?v=LO1msLSfeSc&t=25s\">has become food</a>. \"At some level food it knows it's food.\" Evolution has been kind to us that way. At what point in last night's game did you realize that the Mets were no longer a baseball team and had become food? ",
            "created": "Fri, 18 Oct 2024 14:55:32 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Oh Sweet Jesus, Please God, No",
            "created": "Fri, 18 Oct 2024 16:46:31 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Will the NYT make it through the election without running an editorial that says <i>clearly</i> if we elect this mad king fascist and give him nukes and our military, and our industrial might, and what remains of our virtue, then we deserve the hell that will rain down on us. If this were a Hollywood movie, we'd be waiting for the climax, but I have a feeling they will exit existence with a whimper. ",
                    "created": "Fri, 18 Oct 2024 16:39:43 GMT",
                    "type": "outline",
                    "flInCalendar": true
                },
                {
                    "text": "Are we in a loop??",
                    "created": "Fri, 18 Oct 2024 16:46:39 GMT",
                    "inlineImage": "https://imgs.scripting.com/2024/10/18/ohSweetJesusNo.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "We'll meet again",
            "created": "Fri, 18 Oct 2024 16:59:41 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Imagine the editorial the NYT runs the day after the election when Trump wins and it dawns on them that it's really over. For good. No backsies. We're going down. Sayonara. Thanks for the memories. We'll meet again, don't know where, don't know when. ",
                    "created": "Fri, 18 Oct 2024 16:59:46 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It was nice knowing you.",
                    "created": "Fri, 18 Oct 2024 17:00:41 GMT",
                    "inlineImage": "https://imgs.scripting.com/2024/10/18/slimPickins.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}