{
    "created": "2024-10-19T04:00:00.000Z",
    "flInCalendar": true,
    "name": "19",
    "path": "2024/10/19",
    "text": "October 19",
    "type": "calendarDay",
    "subs": [
        {
            "text": "<a href=\"https://mastodon.social/@Gargron/113330804558010593\">Eugen Rochko</a>, the lead developer of Mastodon: \"Fediverse integration in Threads is still in a sorry state over a year since launch. They need to be able to follow us back. They need to see when we mention them. Those are such basic things.\" They got what they wanted, they got the users and press to relax because they’re Facebook who we know, but this is different, it’s the fediverse. And they got Eugen and others to validate them. This always works, standard tech playbook. they give up nothing, then the priority changes. I don't like being right. But they're never going to change in Silicon Valley. They do what works, and take advantage of newcomers who want to believe.  ",
            "created": "Sat, 19 Oct 2024 13:16:20 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "It's possible the Dodgers let the Mets win as I <a href=\"http://scripting.com/2024/10/18.html#a144749\">begged</a> them to yesterday, but it's also possible the Mets just <a href=\"https://sports.yahoo.com/live/dodgers-vs-mets-new-york-bats-come-alive-in-game-5-sending-series-back-to-los-angeles-201027428.html\">crushed</a> the Dodgers, but either way, the Mets are still in it. The series is now 3-2, and returns to Los Angeles tomorrow. So we don't have to tear down <a href=\"https://en.wikipedia.org/wiki/Citi_Field\">Citi Field</a> after all. If the Dodgers win it'll be in their own stadium. The Mets were magnificent! Absolutely inspiring. A three-run home run by Alonso started things off. Everyone got on base. Doubles and triples. It wasn't without the concern that our wonderful and lovable Mets would do the usual Mets thing and snatch defeat from the jaws of victory, but they held out. The final score was 12-6. We're still in it. Lets go Mets!",
            "created": "Sat, 19 Oct 2024 13:20:34 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I asked ChatGPT to <a href=\"https://imgs.scripting.com/2024/10/19/metswin.png\">illustrate</a> my post. Not bad. Very colorful!",
            "created": "Sat, 19 Oct 2024 13:29:55 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ]
}