{
    "created": "2024-10-25T04:00:00.000Z",
    "flInCalendar": true,
    "name": "25",
    "path": "2024/10/25",
    "text": "October 25",
    "type": "calendarDay",
    "subs": [
        {
            "text": "Tonight's song: <a href=\"https://www.youtube.com/watch?v=T5FN06LFfHk\">Unbroken Chain</a>.",
            "created": "Fri, 25 Oct 2024 23:54:52 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=T5FN06LFfHk",
            "flInCalendar": true
        },
        {
            "text": "Maybe political parties should have strongmen, that might have prevented us from having one as the head of the government. ",
            "created": "Fri, 25 Oct 2024 16:32:49 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I just changed the header graphic for my blog from the <a href=\"http://scripting.com/images/2024/10/16/mets1969TeamPicture.png\">1969 Mets</a>, to the <a href=\"http://scripting.com/images/2024/10/25/supremeCourt.png\">2024 Supreme Court</a>. They're Americans too, and I have a feeling they're going to be on the train to Aurora or Springfield before too long, if the worst happens. ",
            "created": "Fri, 25 Oct 2024 16:03:48 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "What a sad situation. What started with the open web in the 90s is now owned by billionaires, who, looking for new worlds to conquer have adopted a fascist buffoon as their frontman. It was never supposed to be owned by anyone.",
            "created": "Fri, 25 Oct 2024 14:35:57 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Journalism dies in darkness",
            "created": "Fri, 25 Oct 2024 23:56:17 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "The Washington Post <a href=\"https://www.npr.org/2024/10/25/nx-s1-5165353/washington-post-presidential-endorsement-trump-harris\">announcing</a> it wouldn’t endorse a candidate for president is the first glimpse we’ve had of how news publishing in the US has been devastated by fear of fascism. This must go back at least as far as the 2016 election and <a href=\"https://en.wikipedia.org/wiki/Hillary_Clinton_email_controversy\">Hillary’s emails</a>. The editorial people broke the wall, deciding to give the readers <a href=\"https://www.washingtonpost.com/style/media/2024/10/25/washington-post-endorsement-president/\">the first glimpse</a> we’ve gotten into the inner conflicts of one two most influential news orgs in the country.\n",
                    "created": "Fri, 25 Oct 2024 23:56:20 GMT",
                    "image": "https://imgs.scripting.com/2024/09/12/hippieHarrisSign.png",
                    "flInCalendar": true
                },
                {
                    "text": "Until now this was the one story they would never report on. Truly a milestone. And now that the window is open, open it further. Report on how a major news org holds back stories that would be of intense interest to the people, if only the news orgs did their jobs. This is where the \"public editors\" never went, and should have gone.\n",
                    "created": "Fri, 25 Oct 2024 23:56:39 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Let's bust some new norms",
            "created": "Fri, 25 Oct 2024 14:21:59 GMT",
            "type": "outline",
            "description": "We've relied too much on the Democrats to stick their necks out, when in fact all our necks are on the line here.",
            "metaImage": "http://scripting.com/images/2024/10/25/supremeCourt.png",
            "subs": [
                {
                    "text": "Why hasn’t the NY Times run a story that takes Trump at face value and explains to voters what it would be like to live in that United States? It should have been updated and run every time Trump ups the ante.  ",
                    "created": "Fri, 25 Oct 2024 13:53:35 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "<a href=\"https://www.threads.net/@kamalahq/post/DBjMQCDsZdy\">An example</a>. Trump says Americans who criticize the Supreme Court for overturning Roe v. Wade should be imprisoned:  “These people should be put in jail for the way they talk about our judges and justices.” ",
                    "created": "Fri, 25 Oct 2024 14:15:15 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "A news story on this subject should include calls to all the <a href=\"https://www.supremecourt.gov/about/justices.aspx\">justices</a> on the Supreme Court to ask if they agree or disagree. It's time to bust some new norms. They are above reproach, traditionally, but they decided that the president can do whatever he wants, break any law without penalty. Are they concerned that perhaps they might be imprisoned if they make a decision that Trump doesn't like? Let's learn from them, how they think American citizens should feel about this. After all they are American citizens too, aren't they? If we can be jailed, or worse, for our speech, why not them? :smile:",
                    "created": "Fri, 25 Oct 2024 14:28:56 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Of course if they refuse to answer, which they probably will, that should be part of the story. No deference allowed, by the journalists. Simple factual statements. ",
                    "created": "Fri, 25 Oct 2024 14:34:31 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "We've relied too much on the Democrats to stick their necks out, when in fact all our necks are on the line here. So if you have something to say about this, now is the time to do it. In a couple of weeks it might be too late. ",
                    "created": "Fri, 25 Oct 2024 14:18:00 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ]
}