{
    "text": "May 16",
    "created": "Tue, 16 May 2017 15:24:02 GMT",
    "name": "16",
    "subs": [
        {
            "text": "If we survive Trump I bet Comey gets a record-setting book deal. And who plays Comey in the movie? ",
            "created": "Wed, 17 May 2017 03:35:34 GMT",
            "type": "outline"
        },
        {
            "text": "We need the Occam Razor's channel now more than ever. The cable TV networks are acting like lawyers. Here's what's really going on. Trump has been in business with Russia for a decade. When you crack open Flynn you find he's a Russian agent. He was feeding secrets to the Russians before, during and after the campaign. So the question of Russia blackmailing Trump or Flynn is moot. They <i>are</i> Russia.  ",
            "created": "Tue, 16 May 2017 23:42:28 GMT",
            "type": "outline"
        },
        {
            "text": "As part of my next project, I needed to finish the daveutils package by giving it a <a href=\"https://github.com/scripting/utils\">repository</a> on GitHub. Formerly it was just available <a href=\"https://www.npmjs.com/package/daveutils\">through</a> NPM.",
            "created": "Tue, 16 May 2017 16:30:31 GMT",
            "type": "outline"
        },
        {
            "text": "Here's the next new <a href=\"https://github.com/scripting/rss\">repository</a>, for the <a href=\"https://www.npmjs.com/package/daverss\">daverss</a> package. Cleaning up loose ends in the new world I'm trying to pull together.  ",
            "created": "Tue, 16 May 2017 17:24:08 GMT",
            "type": "outline"
        },
        {
            "text": "This morning I posted on Scripting News the <a href=\"http://scripting.com/2017/05/16/experimentingWithAPersonalTwitter.html\">story</a> of the new Slack group, and created a <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSczq-JCEHdjxTzE916RImGgv7Zg_vwtsEpmi-IJzapYS2KxGg/viewform?c=0&w=1\">Google Form</a> that allows people to request an invite. This, I hope, is the first step of a bootstrap, on both the reading and the editorial side. I don't know if one blogger (me) will be able to hold the interest of the group, and I'm pretty sure Slack is not the right environment (it's configured for workgroups, not news). But this is an easy first step, and that's how you learn what the second step is, and on from there. ",
            "created": "Tue, 16 May 2017 15:24:03 GMT",
            "type": "outline"
        }
    ]
}