{
    "text": "May 18",
    "created": "Thu, 18 May 2017 09:56:22 GMT",
    "name": "18",
    "subs": [
        {
            "text": "If we ever get rid of Trump we're going to have to trash all the govt's computers because they will all have Russian spyware on them. ",
            "created": "Thu, 18 May 2017 14:10:26 GMT",
            "type": "outline"
        },
        {
            "text": "In April I was <a href=\"http://scripting.com/2017/04/14/journalismAndTheBraintrust.html\">writing</a> about journalism and the braintrust. The braintrust is an important often overlooked idea. You have gathered a lot of brains around you. Do you trust them?",
            "created": "Thu, 18 May 2017 14:02:52 GMT",
            "type": "outline"
        },
        {
            "text": "This is a test. For the next sixty seconds this station will conduct a test of the emergency broadcast system. Had this been an actual emergency you would have been instructed to tune to a local station for news and other information. ",
            "created": "Thu, 18 May 2017 13:54:00 GMT",
            "type": "outline"
        },
        {
            "text": "Matt Yglesias <a href=\"https://www.vox.com/policy-and-politics/2017/5/18/15654566/trump-toddler\">says</a> Trump is not a toddler, he's a product of America's culture of impunity for the rich. Oh yeah. I know all about it. And corporations. The press is totally complicit. Their idea of credibility is how much money you have. So you become a billionaire and now, the story goes, you're smarter than everyone else. What if a person, <a href=\"http://scripting.com/davenet/2000/10/19/transcendentalMoney.html\">wisely</a>, doesn't organize their creativity solely for the purpose of becoming obscenely rich? Is there any way to win? It would be great if journalism, becoming aware of this, works to change the culture. Look for good ideas that come from non-super-rich.",
            "created": "Thu, 18 May 2017 13:02:46 GMT",
            "image": "http://scripting.com/images/2017/05/18/trumpHead.png",
            "type": "outline"
        },
        {
            "text": "New version of <a href=\"https://github.com/scripting/river5\">River5</a> delivered. New <a href=\"https://www.npmjs.com/package/davereader\">NPM package</a> contains the core of River5 which can be used in other apps. I converted my rssToSlack app (not released) to use the davereader engine. All seems to work. Blog <a href=\"http://scripting.com/2017/05/18/davereaderIsTheEngineOfRiver5.html\">post</a> written.",
            "created": "Thu, 18 May 2017 12:51:35 GMT",
            "type": "outline"
        },
        {
            "text": "Also deployed the Old School CMS to a server. This only matters to me. Noted here for the archive. ;-)",
            "created": "Thu, 18 May 2017 12:56:33 GMT",
            "type": "outline"
        },
        {
            "text": "Trump suffers so America can be Great Again",
            "created": "Thu, 18 May 2017 18:54:09 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "<img src=\"http://scripting.com/images/2017/05/18/trumpSuffersSoAmericaCanBeGreatAgain.png\" width=\"400\" height=\"327\" border=\"0\" alt=\"A picture named trumpSuffersSoAmericaCanBeGreatAgain.png\">",
                    "created": "Thu, 18 May 2017 18:54:18 GMT"
                }
            ]
        }
    ]
}