{
    "text": "May 24",
    "created": "Wed, 24 May 2017 20:17:50 GMT",
    "name": "24",
    "subs": [
        {
            "text": "Perhaps part of the reason devs are so down on XML is that the browsers make it impossible for you to see what's in an XML file. Chrome, Safari, Firefox all either have bugs, or actively prevent you from seeing. I inevitably have to write a script when I want to look inside an RSS file. Every time that happens I mutter <i>Fuck You Google</i> under my breath. I am a Chrome user. :-)",
            "created": "Wed, 24 May 2017 21:08:32 GMT",
            "type": "outline"
        },
        {
            "text": "This has been a week of goal-setting. One of my goals is to make the news distribution system more effective, and lessen the reliance on silos. To do so, I am committed to relaying links to important and interesting news when I am working at my desktop, and often when I have my iPad with me. With just a few more people doing the same we could have a richer more diverse news flow, without added cost, without the price extracted by the silos. ",
            "created": "Wed, 24 May 2017 20:55:03 GMT",
            "type": "outline"
        },
        {
            "text": "RSS is for people with ideas who want to circumvent the gatekeepers of journalism. These days those gatekeepers are big tech companies, Google, Facebook, Twitter. It used to be the big news orgs. But the power has shifted. RSS stands ready to help the news industry regain control of distribution. It might or might not work, but it's probably the only way it can happen. ",
            "created": "Wed, 24 May 2017 20:17:51 GMT",
            "image": "http://scripting.com/2017/05/20/rsshat.png",
            "type": "outline"
        },
        {
            "text": "I love the Internet part #830982",
            "created": "Thu, 25 May 2017 02:57:01 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "<img src=\"http://scripting.com/images/2017/05/24/trumpPopeEtc.png\" width=\"600\" height=\"381\" border=\"0\" alt=\"A picture named trumpPopeEtc.png\">",
                    "created": "Thu, 25 May 2017 02:57:13 GMT"
                }
            ]
        }
    ]
}