{
    "text": "May 26",
    "created": "Fri, 26 May 2017 14:35:18 GMT",
    "name": "26",
    "subs": [
        {
            "text": "Most people have never had to fight to regain control of a hacked server. That imho is the best analogy for what's happened to the US govt.",
            "created": "Fri, 26 May 2017 18:57:51 GMT",
            "tweetId": "868179444200075268",
            "tweetUserName": "davewiner",
            "type": "tweet"
        },
        {
            "text": "I fear we don't have much time left to get smart about news distribution. ",
            "created": "Fri, 26 May 2017 16:51:20 GMT",
            "tweetId": "868147576322830336",
            "tweetUserName": "davewiner",
            "type": "tweet"
        },
        {
            "text": "BTW, the last two posts, plus this one, have used the new Markdown capability. :-)",
            "created": "Fri, 26 May 2017 16:24:05 GMT",
            "type": "markdown"
        },
        {
            "text": "I just added simple Markdown support to *Old School*. If you set the type of a node to markdown, when it's rendered, either on a page, or in a feed, the text is passed through a Markdown renderer. I'm using [marked](https://github.com/chjj/marked). It's got a very nice ability to override renderer options. I was able to catch the rendering for a paragraph and not return the HTML markup for paragraphs because in this context it's redundant.",
            "created": "Fri, 26 May 2017 16:11:15 GMT",
            "image": "http://scripting.com/images/2017/05/26/cat.png",
            "type": "markdown"
        },
        {
            "text": "This is a **test**. *Please* ignore. ",
            "created": "Fri, 26 May 2017 15:50:23 GMT",
            "type": "markdown"
        },
        {
            "text": "My web-level document model",
            "created": "Fri, 26 May 2017 14:38:06 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I've been digging around in the archive lately, looking at stuff I created 5, 10 and 20 years ago, because it's relevant again. ",
                    "created": "Fri, 26 May 2017 14:38:30 GMT"
                },
                {
                    "text": "And there's something I do differently from just about everyone else. ",
                    "created": "Fri, 26 May 2017 16:57:15 GMT"
                },
                {
                    "text": "I view a domain name as a very inexpensive commodity. I think of a domain name as if it were a file name. No more significant. So I have lots of them. And I'm creating more, because this model works, is rational and follows the grain of the web. ",
                    "created": "Fri, 26 May 2017 16:57:12 GMT"
                },
                {
                    "text": "It's interesting because while the web companies do lots of buildings *inside* domains, I see the whole Internet namespace as an interesting object to play with. ",
                    "created": "Fri, 26 May 2017 14:40:52 GMT",
                    "type": "markdown"
                },
                {
                    "text": "For example, when I documented the <a href=\"http://source.smallpict.com/2014/07/12/theSourceNamespace.html\">source namespace</a> for RSS feeds, it got its own domain. It's also just an OPML file in my Dropbox folder. You can't get to it through Dropbox, but you can most definitely get to it through the web.",
                    "created": "Fri, 26 May 2017 17:00:06 GMT"
                }
            ]
        }
    ]
}