{
    "text": "May 30",
    "created": "Tue, 30 May 2017 13:17:23 GMT",
    "name": "30",
    "subs": [
        {
            "text": "If you have comments on the <a href=\"http://scripting.com/2017/05/30.html#a110554\">JSON version</a> of Scripting News, please post an <a href=\"https://github.com/scripting/Scripting-News/issues\">issue</a> on the GitHub section for Scripting News. ",
            "created": "Tue, 30 May 2017 20:32:34 GMT",
            "type": "outline"
        },
        {
            "text": "I'd like to pay more for news, but...",
            "created": "Tue, 30 May 2017 20:27:35 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I pay some amount of money to the <a href=\"https://www.nytimes.com/subscriptions/Multiproduct/lp8XKUR.html\">NYT</a> every month, I think it's $20 per? Not sure. But these days I probably get as much value from the NYT as I would from the Washington Post. There are a couple of other pubs I'd subscribe to if the price were more reasonable, considering I only exceed their quota of free stories by about the middle of the month. The New Yorker is one for sure. And there are free-to-read pubs that deserve some of the money too, like <a href=\"http://talkingpointsmemo.com/edblog\">TPM</a> and <a href=\"http://nymag.com/author/Jonathan%20Chait/\">New York Mag</a>. It's not fair that I pay the NYT and not them. ",
                    "created": "Tue, 30 May 2017 20:27:43 GMT",
                    "image": "http://static.scripting.com/larryKing/images/2013/12/10/cow.gif"
                },
                {
                    "text": "But I'm not ready to create multiple pay-to-read accounts. I want a system.",
                    "created": "Tue, 30 May 2017 20:41:23 GMT"
                },
                {
                    "text": "So how about forming a trust of some kind, and I pay money to it and that creates a allocates a certain number of reads for me per week across all participating publications. And the money is distributed at the end of the month according to how many articles I read on each site. ",
                    "created": "Tue, 30 May 2017 20:30:13 GMT"
                },
                {
                    "text": "Maybe they should even give me credits for any reads that come from links I distribute? I have about 70K followers on Twitter and am a daily linkblogger. ",
                    "created": "Tue, 30 May 2017 20:31:14 GMT"
                },
                {
                    "text": "I, and probably a lot of other news readers, would like to have the money flow more smoothly and to get a chance to spread it out instead of giving it all to one publication. ",
                    "created": "Tue, 30 May 2017 20:31:49 GMT"
                },
                {
                    "text": "Not sure how such a service would get started though. ",
                    "created": "Tue, 30 May 2017 20:32:21 GMT"
                }
            ]
        },
        {
            "text": "JSON in Feed Land",
            "created": "Tue, 30 May 2017 15:18:54 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "The last couple of weeks the idea of feeds that do more or less what RSS does, in JSON instead of XML, has been under consideration.",
                    "created": "Tue, 30 May 2017 15:19:03 GMT",
                    "image": "http://scripting.com/images/2017/05/30/elephant.png"
                },
                {
                    "text": "At the same time I was working on a <a href=\"http://scripting.com/2017/05/05/iWantMyOldBlogBack.html\">new version</a> of <a href=\"http://scripting.com/\">my blog</a>, codenamed <i>Old School. </i>In doing the work, I found a bunch of problems with the code I was using to generate RSS feeds. I wrote it a long time ago, probably when I was first doing <a href=\"http://radio3.io/\">Radio3</a>. Parts of it came from <a href=\"http://fargo.io/\">Fargo</a>. It had an assumption baked into it that the items in the feed all went to or came from Twitter. That's not an assumption I can make about my current software. Twitter is important, but it's not <i>everything. </i>;-)",
                    "created": "Tue, 30 May 2017 15:23:22 GMT"
                },
                {
                    "text": "So I decided to try an experiment. In addition to writing the feed in XML, I also wrote it in JSON. It's a very simple matter. I had done a prototype of it in 2012, that's <a href=\"http://rssjs.org/\">archived</a>. The comment thread there is very interesting. It is itself a historic document with comments from people who had strong opinions when core RSS was being discussed in the late 90s and early 00s.",
                    "created": "Tue, 30 May 2017 15:24:59 GMT"
                },
                {
                    "text": "One <a href=\"http://rssjs.org/#comment-652876959\">comment</a> in particular, from Julian Bond, someone who rarely agreed with or supported my ideas, had a bit of advice that was, to me, stunning. He argued for not re-litigating the old disputes, and just accept RSS as-is, with all the scars and false starts in place. Of course he had no argument with me. That's exactly what i intended to do. I wasn't signing up for more years of misery on mail lists. I made a conscious decision about that in 2002. Never went back, never want to.  ",
                    "created": "Tue, 30 May 2017 15:26:33 GMT"
                },
                {
                    "text": "Chuck Shotton, a longtime friend, provided a <a href=\"http://rssjs.org/#comment-645922090\">justification</a> for JSONifying RSS. It's a good one and one that I hadn't thought of. It's true that today's RSS-reading apps have to have an XML parser, but there may be new apps that are easier to make in JSON. Non-publishing uses for RSS. I tend only to think of publishing, but Chuck does commercial realtime stuff at considerable scale. I trust his judgement, even if I don't always take his advice. :-)",
                    "created": "Tue, 30 May 2017 15:30:07 GMT"
                },
                {
                    "text": "Back to the JSON version of Scripting's RSS 2.0 feed. The translation is very straightforward. It could have been done algorithmically but I decided to do it by hand, to force me to review and understand every element, not just of the base format, but also for a <a href=\"http://source.scripting.com/\">namespace</a> that I use in all my work. I wanted not only to understand how RSS could be transported with a different syntax, JSON, but also how the extension mechanism would make the jump. It worked without a hitch. And honestly I think it's beautiful. ",
                    "created": "Tue, 30 May 2017 15:32:40 GMT"
                },
                {
                    "text": "I have much to write about this, but I wanted to introduce the idea, and also let people have a look at the result. And here it is.",
                    "created": "Tue, 30 May 2017 15:33:24 GMT"
                },
                {
                    "text": "<a href=\"http://scripting.com/rss.json\">http://scripting.com/rss.json</a>",
                    "created": "Tue, 30 May 2017 15:35:53 GMT"
                }
            ]
        },
        {
            "text": "NetNewsWire, please support titleless items",
            "created": "Tue, 30 May 2017 16:08:38 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I got an email from NetNewsWire user Frank Leahy, requesting that I add titles to my feed for items that don't have titles. ",
                    "created": "Tue, 30 May 2017 16:08:50 GMT",
                    "image": "http://scripting.com/images/2017/05/30/loveRss.png"
                },
                {
                    "text": "He sent a <a href=\"http://scripting.com/images/2017/05/30/netnewswiretitlelessitems.png\">screen shot</a> to illustrate how his reader deals with titleless items. ",
                    "created": "Tue, 30 May 2017 16:09:15 GMT"
                },
                {
                    "text": "As you can see they represent an item without a title as <i>Untitled</i> in the left panel, and as <i>No title</i> in the right panel.",
                    "created": "Tue, 30 May 2017 16:11:26 GMT"
                },
                {
                    "text": "I'm not sure what the right answer is, but this is not it.",
                    "created": "Tue, 30 May 2017 16:12:07 GMT"
                },
                {
                    "text": "The words <i>Untitled</i> and <i>No title</i> do not appear in <a href=\"http://scripting.com/rss.xml\">my feed</a>.",
                    "created": "Tue, 30 May 2017 16:12:16 GMT"
                },
                {
                    "text": "They must not appear in their display.",
                    "created": "Tue, 30 May 2017 16:12:32 GMT"
                },
                {
                    "text": "An idea, they could do what Frank asked me to do, show the first few words from the post in the list view. And nothing in the right view. These items have no titles for artistic reasons. The author did not put them there. You, as a software developer, are not entitled to add them (haha that's a pun).",
                    "created": "Tue, 30 May 2017 16:12:40 GMT"
                },
                {
                    "text": "I think <a href=\"https://blackpixel.com/contact/\">Black Pixel</a> now owns NetNewsWire. If you know them could you send them a link to this post. Thanks! ",
                    "created": "Tue, 30 May 2017 16:13:34 GMT"
                },
                {
                    "text": "We'll get this done. ;-)",
                    "created": "Tue, 30 May 2017 16:14:03 GMT"
                }
            ]
        },
        {
            "text": "A story about Woz",
            "created": "Tue, 30 May 2017 15:07:57 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "<i>I wrote this <a href=\"https://www.facebook.com/dave.winer.12/posts/117622468445167?notif_t=like&notif_id=1496147434459341\">piece</a> on Facebook on this day in 2013. As far as I can tell I didn't post it on my blog. It should totally be in the archive. So here goes..</i>",
                    "created": "Tue, 30 May 2017 15:08:02 GMT",
                    "image": "http://scripting.com/2016/08/11/hope.png"
                },
                {
                    "text": "I was once giving a talk at MacWorld Expo, probably in 1986 or 1987. This was the peak of popularity of <a href=\"http://scripting.com/dwiner/outlinersProgramming.html\">MORE</a>. There were probably 500 people in the room.",
                    "created": "Tue, 30 May 2017 15:11:41 GMT"
                },
                {
                    "text": "Just before I got up to speak, my marcom person, Kandes Bregman, showed me that Woz was sitting in one of the first rows, like an ordinary person. I had never met him at the time.",
                    "created": "Tue, 30 May 2017 15:17:56 GMT"
                },
                {
                    "text": "Early in the talk, I asked for a show of hands of people who used MORE."
                },
                {
                    "text": "Woz's arm shot straight up. Everyone else just raised their arm. He made a point of it."
                },
                {
                    "text": "I thought how cool. Here's a guy who doesn't have to care, he's richer than god, and look at how passionate he is about the product."
                },
                {
                    "text": "I felt like I had really accomplished something."
                },
                {
                    "text": "The thing is that Woz is still doing it. Travelling around the world, meeting with regular people, listening to their dreams, and helping them if he can."
                },
                {
                    "text": "He's like a technology elf. He believes in the power of people, not just as users of technology but also as creators of technology."
                },
                {
                    "text": "These are my values too."
                },
                {
                    "text": "I remember how empowered I was by Woz's most fantastic creation -- the Apple II. Up until then computers were far away, things you couldn't touch, only for the experts. I could program them, but I couldn't feel them."
                },
                {
                    "text": "The best thing about the Apple II was the memory-mapped video. To display a character you just stored it in a magic memory location. And that was it. It appeared on the screen."
                },
                {
                    "text": "My least favorite feature of the Apple II, cards that got unseated from their slots and fried the mother board. I had a few of those. I was pretty poor in those days so losing a mother board could really set me back! :-)"
                },
                {
                    "text": "But I'd rather suffer for having too much power than being restricted from going places my imagination wants to go."
                },
                {
                    "text": "That's what Woz gave us. That and that he puts his heart into his work. And the guy's got a big heart."
                }
            ]
        },
        {
            "text": "Morning cleanup notes",
            "created": "Tue, 30 May 2017 15:08:53 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Good morning sports fans! ;-) ",
                    "created": "Tue, 30 May 2017 13:17:24 GMT",
                    "type": "outline"
                },
                {
                    "text": "More cleanup work this morning. JY <a href=\"https://github.com/scripting/Scripting-News/issues/6\">reported</a> that we're not pinging when the feed updates. That's true. Need to do that. Right now I'm looking into a bug in feed generation. A real mystery. ",
                    "created": "Tue, 30 May 2017 13:38:00 GMT",
                    "type": "outline"
                },
                {
                    "text": "Theoretically I am now pinging when the RSS feed updates. But I'm not seeing anything in the rsscloud.io log. Let's see if anything shows up after I've posted this item. Np. Oy. Later update: My pings are now showing up in the <a href=\"http://rpc.rsscloud.io:5337/viewLog\">log</a>. Whew. ",
                    "created": "Tue, 30 May 2017 14:37:12 GMT",
                    "type": "outline"
                }
            ]
        }
    ]
}