{
    "text": "May 31",
    "created": "Wed, 31 May 2017 13:03:20 GMT",
    "name": "31",
    "subs": [
        {
            "text": "NYT <a href=\"http://www.niemanlab.org/2017/05/the-new-york-times-is-eliminating-the-position-of-public-editor-heres-the-sulzberger-memo/\">eliminates</a> the public editor position replacing it with a new way for users to make suggestions. The challenge for the Times is to figure out how to tap into the knowledge, experience and intellect of their community. As long as they see us as an audience we will continue to drift away.",
            "created": "Wed, 31 May 2017 19:20:38 GMT",
            "image": "http://scripting.com/2016/10/19/fatcat.png",
            "type": "outline"
        },
        {
            "text": "I just tried to record a movie using QuickTime Player. First time I've done that since installing a new version of the OS. It was a good demo, but when I was done I couldn't find the little controller window that lets you stop recording. Fumbling around I did manage after a couple of minutes to quit the app and save the movie. But when I came back there was no audio so the whole thing was worthless. This is why I'm reluctant to upgrade. Apple always changes little stupid things. I end up losing work.",
            "created": "Wed, 31 May 2017 17:16:02 GMT",
            "type": "outline"
        },
        {
            "text": "Innovation. I am now storing the OPML file for this blog in my Dropbox folder. I think I just recreated Fargo. I'll let you know. ;-)",
            "created": "Wed, 31 May 2017 16:13:09 GMT",
            "type": "outline"
        },
        {
            "text": "Wonder if El Presidente does things to hurt the country because his feelings are hurt?",
            "created": "Wed, 31 May 2017 15:22:59 GMT",
            "type": "outline"
        },
        {
            "text": "I get it. <a href=\"https://www.hulu.com/live-tv\">Hulu</a> is what you buy when you cancel your cable subscription. ",
            "created": "Wed, 31 May 2017 15:06:41 GMT",
            "type": "outline"
        },
        {
            "text": "It comes back like swimming or riding a bike. When I start the day there's a blank section of the outline where my ideas will show up. I press the big <a href=\"http://scripting.com/images/2017/05/31/bigPlus.png\">plus</a> icon to create a new section and type: <i>Good morning sports fans! </i>I have no idea where this came <a href=\"https://en.wikipedia.org/wiki/Good_Morning_Sports_Fans\">from</a>. But I used to do it in the old days, so it feels right. Later in the day the greeting might be deleted or move. But at the top of the day it's at the top of the page. ",
            "created": "Wed, 31 May 2017 15:08:08 GMT",
            "image": "http://scripting.com/images/2017/05/31/bike.png",
            "type": "outline"
        },
        {
            "text": "Why I can't/won't point to Facebook blog posts",
            "created": "Wed, 31 May 2017 15:40:26 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Three reasons.",
                    "created": "Wed, 31 May 2017 15:40:39 GMT"
                },
                {
                    "text": "1. It's impractical. I don't know what your privacy settings are. So if I point to your post, it's possible a lot of people might not be able to read it, and thus will bring the grief to me, not you, because they have no idea who you are or what you wrote. ",
                    "created": "Wed, 31 May 2017 15:40:49 GMT"
                },
                {
                    "text": "2. It's supporting their downgrading and killing the web. Your post sucks because it doesn't contain links, styling, and you can't enclose a podcast if you want. The more people post there, the more the web dies. I'm sorry no matter how good your idea is fuck you I won't help you and Facebook kill the open web.",
                    "created": "Wed, 31 May 2017 15:40:53 GMT"
                },
                {
                    "text": "3. Facebook might go out of business. I like to point to things that last. Facebook seems solid now, but they could go away or retire the service you posted on. Deprecate the links. Who knows. You might not even mind, but I do. I like my archives to last as long as possible.",
                    "created": "Wed, 31 May 2017 15:43:06 GMT"
                },
                {
                    "text": "Get a blog. If your ideas have any value put them on the open web. Facebook is trying to kill it. Trust me you will hate yourself if they succeed. Same with <a href=\"https://pxlnv.com/linklog/amp-taking-over/\">Google</a>. ",
                    "created": "Wed, 31 May 2017 15:45:08 GMT"
                }
            ]
        },
        {
            "text": "Pinging with JY",
            "created": "Wed, 31 May 2017 14:58:10 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Good morning sports fans!",
                    "created": "Wed, 31 May 2017 13:03:21 GMT",
                    "type": "outline"
                },
                {
                    "text": "An interesting morning of programming is planned. To kick it off I added a <a href=\"http://scripting.com/misc/pingLog.json\">log</a> of cloud pings generated by my blog, to help <a href=\"https://github.com/scripting/Scripting-News/issues/6\">JY and Andrew</a> figure out where the bug is. I say this knowing full well that my code is indicted, it's the newest code in the mix. I really appreciate these two guys pitching in. And I'm glad to make the intro. Andrew and JY are two of the nicest most generous people I know in the programming world. ",
                    "created": "Wed, 31 May 2017 13:03:57 GMT",
                    "type": "outline"
                },
                {
                    "text": "Update: We seem to have solved the problem. Doing one more update to see if it works for real. ",
                    "created": "Wed, 31 May 2017 14:58:20 GMT"
                }
            ]
        },
        {
            "text": "Tweeting with Don Cheadle",
            "created": "Wed, 31 May 2017 13:14:09 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I had an interesting <a href=\"https://twitter.com/davewiner/status/869657952864677890\">back and forth</a> with <a href=\"https://www.google.com/url?sa=t&rct=j&q=&esrc=s&source=web&cd=1&cad=rja&uact=8&ved=0ahUKEwi0s8vLnZrUAhUr_4MKHah-DncQFggoMAA&url=https%3A%2F%2Fen.wikipedia.org%2Fwiki%2FDon_Cheadle&usg=AFQjCNHJDOUu9dm8ZEr-A1H9BjA7r_Q6dA&sig2=d_NUIPp_25vuzrU3xXMYMg\">Don Cheadle</a> on Twitter last night. I <a href=\"https://twitter.com/davewiner/status/869650778247626752\">quote-tweeted</a> a post of his echoing something I said <a href=\"http://scripting.com/2017/05/29.html#a100542\">here</a> on Monday. ",
                    "created": "Wed, 31 May 2017 13:10:20 GMT",
                    "image": "http://scripting.com/images/2017/05/29/wonderWoman.png"
                },
                {
                    "text": "If the all-women showings had happened on their own, without a company in the middle, it would have been less controversial imho. And whether or not their intentions are good, the product (a movie) gets exposure. The company profits. Appearances matter. Even though this is all I said, I got called names by people on Twitter. Emasculating things.  As if I were saying much more. Horrible things I don't believe and of course would never say.",
                    "created": "Wed, 31 May 2017 13:29:37 GMT"
                },
                {
                    "text": "Check out the headline on this Huffpost <a href=\"http://www.huffingtonpost.com/entry/don-cheadle-shuts-down-men-having-temper-tantrums-over-women-only-screenings_us_592dc0f6e4b0c0608e8beac5\">article</a>. This is where this leads. You think that isn't abusive? You think men like to be described that way? I think most men shut up when they think they're about to be accused of this, no matter how temperate their ideas or relaxed they are, and of course that's the point. It may feel powerful to make people shut up, but remember they're people and that will breed resentment, and it's probably coming back to you in some way that's painful to <i>you.</i>",
                    "created": "Wed, 31 May 2017 13:18:35 GMT"
                },
                {
                    "text": "All this is happening at a time when we're in real trouble because of decades of divisive opportunism. We are at war with ourselves in the US. We have to learn how to undo the divides and unite in our common interest. We are very sick. It's as if our country had heart disease and refused to stop smoking. There might still be time to turn this around, but it isn't going to happen until this behavior stops.",
                    "created": "Wed, 31 May 2017 13:23:38 GMT"
                },
                {
                    "text": "So have all-women gatherings, as long as they're legal and ethical. And companies should stay out of it. And please, don't make it about humiliating men.",
                    "created": "Wed, 31 May 2017 13:28:35 GMT"
                },
                {
                    "text": "As they say, thanks for listening. ;-)",
                    "created": "Wed, 31 May 2017 13:47:19 GMT"
                }
            ]
        }
    ]
}