{
    "text": "Morning coffee notes",
    "created": "Sat, 03 Feb 2024 14:28:11 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I read <a href=\"https://ma.tt/2024/02/vision-pro-first-impressions/\">two</a> <a href=\"https://ma.tt/2024/02/rowing-to-alcatraz/\">posts</a> from <a href=\"https://en.wikipedia.org/wiki/Matt_Mullenweg\">Matt Mullenweg</a> last night. I asked friends at Automattic if it's my imagination or is Matt blogging a lot more now than he used to and they say yes. ",
            "created": "Sat, 03 Feb 2024 14:15:48 GMT",
            "flInCalendar": true
        },
        {
            "text": "Matt is a good writer, it turns out. I read his posts as he dealt with the Tumblr situation, which was evolving quickly in real time at the end of last year. You can tell he's done a lot of this, relating to users and developers. I was going to say I've never led a community as large as his, but that's not exactly true. In general people don't treat you very well if you're at the top of something large, esp if they don't pay anything for it, it seems. ",
            "created": "Sat, 03 Feb 2024 14:28:54 GMT",
            "flInCalendar": true
        },
        {
            "text": "Watching him deal with it has made me question the idea of me making software for other people. There was a brief period between 2017 and 2021 that I only made software for myself, and I liked that a lot, but it has the downside that the ideas have little chance of surviving to influence others. So as the <a href=\"http://scripting.com/2022/09/18.html\">20th anniversary</a> of \"RSS 2.0\" approached, I convinced myself to try one more time. Now this morning, in the middle of a pretty huge transition for \"FeedLand\", that's been going slowly and confusingly, and is far from done, I realize that such a major upheaval in an already-deployed server-based product, is really asking for trouble. I feel it in my digestive system, as I used to when I was a kid and internalized all the stress from home life. I'm feeling that stress in a way I haven't felt in a long time. So I think this is the last time I do this. My next product will be a writer's tool and will largely run on the user's machine, and have a small server component, by design, with software that's been well burned-in. I'm not worried about that. And it's okay, because I really think this is the last big corner-turn that FeedLand will need. ",
            "created": "Sat, 03 Feb 2024 14:34:55 GMT",
            "flInCalendar": true
        },
        {
            "text": "I probably should write a post explaining what this change is about, or at least record a podcast. If you want to see the details, it's all there in the narrated work <a href=\"https://github.com/scripting/feedlandInstall/issues/56\">thread</a>. And I will continue to post there until the transition is complete. ",
            "created": "Sat, 03 Feb 2024 14:31:24 GMT",
            "flInCalendar": true
        },
        {
            "text": "This morning, while I'm waiting for the last query to run, I'm looking through the old sites on the other server (mentioned <a href=\"http://scripting.com/2024/02/02.html#a162816\">yesterday</a>) and have been looking through various archives I'm carrying with me, including the book my father wrote called <a href=\"http://mbatoolbox.org/\">MBA Toolbox</a>. It's a responsibility I feel, and I often think I should modernize the site. It's got the look of a Manila site from the late 90s or early 00s. But it doesn't look all that bad, and he did all the work himself, so this is the way he wanted it to look. ",
            "created": "Sat, 03 Feb 2024 14:11:07 GMT",
            "flInCalendar": true
        },
        {
            "text": "PS: I noted from his Wikipedia <a href=\"https://en.wikipedia.org/wiki/Matt_Mullenweg\">page</a> that Matt was born 15 days before the Mac was announced, an event we celebrated the 40th anniversary of last month, which adds up because Matt celebrated his 40th birthday a few days before all that. 🎉",
            "created": "Sat, 03 Feb 2024 14:41:48 GMT",
            "flInCalendar": true
        },
        {
            "text": "PPS: It turns out we were closer than I thought when I wrote this piece this morning. By noon, the server was updated, the software had been modified to work with the new database schema, and it re-opened to users. What I thought initially would take a few hours took 1.5 days. Once the corner was turned, I took a nap, watched some <a href=\"https://en.wikipedia.org/wiki/BoJack_Horseman\">Bojack Horseman</a>, am going to do a Peloton and then watch the Knicks, and I'm starting to feel human again. Whew. ",
            "created": "Sat, 03 Feb 2024 21:03:40 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}