{
    "text": "We lost the war",
    "created": "Wed, 05 Feb 2020 18:28:34 GMT",
    "type": "outline",
    "description": "I didn't realize we had lost the war to Russia until Biden asked if his government was a failure. It was.",
    "subs": [
        {
            "text": "I saw a <a href=\"https://twitter.com/JoeBiden/status/1225111846207684608\">tweet</a> by Joe Biden just now where he asks if the government he was part of was a failure. When you ask the question like that, the answer is somewhat startling. Yes. The Obama government was a failure. In the same way the French government of 1940 was a failure. Sure, they passed some good laws, and the people of France were happy, but when the <a href=\"https://en.wikipedia.org/wiki/Battle_of_France\">Germans marched into Paris</a> in 1940, you would have to say that the existing government of France failed. ",
            "created": "Wed, 05 Feb 2020 18:28:41 GMT"
        },
        {
            "text": "We were attacked in 2016, and we lost. How do I know we lost? We're not mounting a defense. We didn't counter-attack. If we had, and we had won, Putin would be gone, and Russia would be establishing an American style government. Instead, Putin is fine, and we're installing, gradually, a Russian-style government. That's the only explanation for what's happening in the Senate this afternoon at 4PM Eastern.",
            "created": "Wed, 05 Feb 2020 18:30:17 GMT"
        },
        {
            "text": "Biden, if he has any honor, will withdraw from the race. We lost. He was VP when we lost. We cannot under any circumstances go back to that approach. That would be certainly a loser. If there's any hope for us, we need a very radical departure from the previous path, and I do not mean Bernie Sanders. People who think that are as much in denial as Joe Biden was before he asked the question. Now that he has, if he has guts like he says he does, it's time to step aside. ",
            "created": "Wed, 05 Feb 2020 18:31:57 GMT"
        },
        {
            "text": "PS: Is there a reason Nancy Pelosi can't be the next president? If there is I don't know what it is. In fact, she is our leader. And a very good one at that.",
            "created": "Wed, 05 Feb 2020 18:41:34 GMT"
        }
    ]
}