{
    "text": "January 5",
    "created": "Tue, 05 Jan 2021 12:55:30 GMT",
    "type": "calendarDay",
    "name": "05",
    "subs": [
        {
            "text": "If the Repubs are going to <a href=\"https://www.washingtonpost.com/opinions/2020/11/23/republican-party-split-two-lets-keep-it-that-way/\">split in two</a>, maybe the Dems can pick up a few. Couldn't hurt.",
            "created": "Tue, 05 Jan 2021 19:45:51 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"http://scripting.com/2005/06/24.html#When:8:51:38AM\">Audible</a> just gave me a status upgrade to \"nibbler.' I don't know who designs these things, but did they think that I, a sentient human being of 65 years and many accomplishments would appreciate being labeled as such by a fucking <i>algorithm?</i> This is right up there with <a href=\"http://scripting.com/2015/05/12/whyIMovedOffHeroku.html\">Heroku</a> telling me (again via algorithm) that I am a \"hobbyist\" developer. Excuse me. I have a MS in Computer Science from a fine <a href=\"https://www.wisc.edu/\">school</a>. I have won awards for my software, and invented many things, probably as many as anyone at your <a href=\"http://salesforce.com/\">fine company</a>, so please keep your opinion of my programming ability to your robot self. Sincerely, Dave Winer, a master of science. ",
            "created": "Tue, 05 Jan 2021 19:15:20 GMT",
            "type": "outline",
            "image": "http://images.scripting.com/archiveScriptingCom/2005/06/24/hope.jpg",
            "flInCalendar": true
        },
        {
            "text": "I crack myself up sometimes. :rocket:",
            "created": "Tue, 05 Jan 2021 19:24:22 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Highly recommend the <a href=\"https://www.msnbc.com/rachel-maddow/watch/-two-of-the-most-egregious-voter-suppressors-abrams-points-to-kemp-raffensperger-records-98796613566\">Maddow interview with Stacey Abrams</a> last night, esp her evaluation of Kemp and Raffensperger. It's almost accidental that they ended up on the right side of Trump's attempt to steal the election, the same way a broken clock is right twice a day.",
            "created": "Tue, 05 Jan 2021 13:11:19 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://twitter.com/danmactough/status/1346523595229589504\">Dan MacTough</a>: \"My eyes (and head) been killing me this morning. Had the idea to change the 'picture mode' on my external monitor (warmer color, less bright) and instantly felt me entire face relax. Like I had been squinting to keep the sun out of my eyes or something.\"",
            "created": "Tue, 05 Jan 2021 19:06:02 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Subscribe to the <a href=\"http://xmlviewer.scripting.com/?url=http://scripting.com/cuomo/rss.xml\">Andrew Cuomo</a> podcast. ",
            "created": "Tue, 05 Jan 2021 21:55:18 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I had a conversation with a friend yesterday about why I go for connecting big things to other big things. It's not for money or fame, it's about power -- for the users of the open web. Which is what got me back into software development with a passion in the early 90s. I had already lived through a couple of generations of wide open \"blue sky\" that was later foreclosed on by the bankers. I felt that the technology of the web, as with the personal computer before it, could be used to enhance communication, and that could be used to solve problems, the ones we're still grappling with today. That's why it's not enough to make cool software, though I admit I love doing that -- it's for the power it gives to people to solve our problems. I still believe in that, as I did when I first got into software development in the 1970s. ",
            "created": "Tue, 05 Jan 2021 12:58:35 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/01/05/carlson.png",
            "flInCalendar": true
        },
        {
            "text": "Every year Mark Zuckerberg takes on a personal challenge, running 365 miles, reading 25 books. <a href=\"https://www.facebook.com/dave.winer.12/posts/668630340011041\">In 2018</a> he focused on \"fixing important issues.\" I suggested one. \"Stop killing the open web. Never mind fancy tech, support the features the web has had since inception. Linking, first and foremost, then simple styling, titles for posts and podcasting. Then take a vacation and kick back. We don't need boy genius heroics, just trust the decentralization you say you believe in.\" This is still on his todo list as far as I'm concerned. Be kind to the web that created your opportunity to create Facebook. ",
            "created": "Tue, 05 Jan 2021 12:55:31 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/10/01/beets.png",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}