{
    "text": "January 6",
    "created": "Wed, 06 Jan 2021 15:20:01 GMT",
    "type": "calendarDay",
    "name": "06",
    "subs": [
        {
            "text": "I've been looking for an iconic image. This might be it. ",
            "created": "Wed, 06 Jan 2021 22:15:43 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2021/01/06/touristTerrorist.png",
            "flInCalendar": true
        },
        {
            "text": "Another candidate. ",
            "created": "Wed, 06 Jan 2021 22:41:13 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2021/01/06/confederateAnarchist.png",
            "flInCalendar": true
        },
        {
            "text": "<b>Earlier...</b>",
            "created": "Wed, 06 Jan 2021 22:15:27 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Today's song: <a href=\"https://youtu.be/gqsT4xnKZPg\">Happy Days Are Here Again</a>. ",
            "created": "Wed, 06 Jan 2021 15:49:22 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=gqsT4xnKZPg",
            "flInCalendar": true
        },
        {
            "text": "I don't get why the DOJ is supposed to be <a href=\"http://scripting.com/images/2021/01/06/demoralized.png\">demoralized</a>. If I had stuck it out through Trump, and Barr and the other jerks, I would be pretty jazzed to see <a href=\"https://www.huffpost.com/entry/biden-attorney-general-merrick-garland_n_5fcea0d3c5b6636e09279a5b\">Merrick Garland</a> show up to rebuild. Organizations rebound pretty quickly, I've found.",
            "created": "Wed, 06 Jan 2021 18:58:55 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"http://scripting.com/stories/2010/12/29/humansAreCrazy.html\">2010</a>: \"An amazing scene in a Frontline episode in the Iraqi parliament while Saddam Hussein ruled Iraq. It was time for a purge. Saddam had decided to execute the whole legislature. The doors were locked and they started taking out people one by one and shooting them. Saddam, sadist that he was, videotaped it. So you could see what these guys were doing as they figured out, one by one, what was happening. So what did the condemned legislators do while waiting to be shot? They gave speeches, denouncing each other as the real enemy of the state, and proclaiming their love for Saddam, the best friend he ever had. Didn't work, they were all killed.\" They used to have video on the <a href=\"https://www.pbs.org/wgbh/pages/frontline/shows/saddam/\">PBS site</a>, but it was a victim of the deprecation of Flash. If you know of another copy, please send me a pointer. ",
            "created": "Wed, 06 Jan 2021 18:32:47 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I changed the <a href=\"http://scripting.com/images/2021/01/06/headerImage.png\">header image</a> on my blog to a <a href=\"http://scripting.com/images/2021/01/06/usCapitol.png\">beautiful shot</a> of the US Capitol. Amazing how quickly the political action moved from Georgia to DC. But all this Trump michegas is masking the big story -- the pandemic is digging in with increased virality all over the world, but especially in the US. With power as it's currently configured, we finally have a chance to help ourselves. But only barely. ",
            "created": "Wed, 06 Jan 2021 15:36:26 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I went to sleep around 10PM Eastern last night, woke up a little after 2AM, dreading the moment, and there’s good news! Goodbye Loeffler. Buh bye Perdue. Fuck off <a href=\"https://www.google.com/search?q=site%3Ascripting.com+moscow+mitch\">#moscowmitch</a>. Better leave town now lame duck Trump. We must be doing something right. And of coruse the \"we\" who's doing right, is.. ",
            "created": "Wed, 06 Jan 2021 15:20:43 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Stacey Abrams does it right: She finds out what the people need. That's a pretty good basic method for politics. And she says, I think correctly, that as the Dems get better at that, the Repubs will have to too. ",
            "created": "Wed, 06 Jan 2021 15:20:02 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Let's see how much guts and vision Biden has. How big a role does he give Abrams, short-term, in forming the future of the Democratic Party. She's a big deal, for the long term. Let's see how beholden Biden is to her competitors within the party. ",
            "created": "Wed, 06 Jan 2021 15:22:49 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The thing to look out for now -- senators switching parties. With a 50-50 split and things in motion in red-vs-blue states, there should be some opportunities for that. and right now is the time of max leverage.",
            "created": "Wed, 06 Jan 2021 15:35:32 GMT",
            "type": "tweet",
            "tweetId": "1346848098719576065",
            "tweetUserName": "davewiner",
            "flInCalendar": true
        },
        {
            "text": "There's a continuous heartbeat connecting back in time, through your mother, and her mother, and so on back to the first mother with a heart that beats. ",
            "created": "Wed, 06 Jan 2021 16:52:33 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Stacey Abrams.",
            "created": "Wed, 06 Jan 2021 19:21:30 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2021/01/06/staceyAbramsInline.png",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}