{
    "text": "January 9",
    "created": "Sat, 09 Jan 2021 15:03:18 GMT",
    "type": "calendarDay",
    "name": "09",
    "subs": [
        {
            "text": "Today's song: <a href=\"https://www.youtube.com/watch?v=bS3O5zg290k\">The Beat Goes On</a>. ",
            "created": "Sat, 09 Jan 2021 20:11:32 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=bS3O5zg290k",
            "flInCalendar": true
        },
        {
            "text": "Late on Saturday evening: <a href=\"https://www.buzzfeednews.com/article/johnpaczkowski/amazon-parler-aws\">Amazon gave Parler 24 hours to get off AWS</a>. Lots to say about this. In the meantime watch my Twitter <a href=\"https://twitter.com/davewiner/status/1348113115511214082\">thread</a>. ",
            "created": "Sun, 10 Jan 2021 04:39:01 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "We'll look back on this week as the moment everything changed.",
            "created": "Sat, 09 Jan 2021 17:02:33 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Assume Trump's devs are scrambling to get up a new social net. I'm sure they'll find something. I heard it said they won't get thru the App Store and Google Play. This is true. So guess what -- they'll have to use the open web. Politics and tech make strange bedfellows. ;-)",
            "created": "Sat, 09 Jan 2021 17:49:10 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "A friend writes on Facebook: \"Apple, Google, AT&T and Verizon know who was inside the Capitol. The FBI has names and warrants already.\" ",
            "created": "Sat, 09 Jan 2021 20:14:39 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I would love to see <a href=\"https://twitter.com/alfranken\">Al Franken</a> get a role in the new administration.",
            "created": "Sat, 09 Jan 2021 16:24:14 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The arguments about how you don't have free speech on private platforms don't reflect the reality of Twitter and Facebook, which have monopolistic power in the worlds they define. Those worlds are huge, powerful, growing, and most important here -- exclusive. We call them [%search: silos%] in tech, but they behave like monopolies in other contexts. They don't imho have the rights of truly private companies because they wield government-like power that can have the effect of restricting speech. Because they are silos, there's no way to route around them. This is dangerous stuff. Suppose for example the Republican Party owned Twitter. You can see how that would damage free discourse in our political system. And it's not impossible for a political entity to take control of Twitter, they're not very highly valued in the stock market. That's why the government must be involved in decisions that cut off political leaders. What made this situation so difficult is that it was <i>the president</i> who needed to be silenced, before he could do more damage. A tough call, and a very difficult precedent. BTW, I do advocate for political parties becoming social networks. I think they already are that. ",
            "created": "Sat, 09 Jan 2021 16:29:34 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/05/18/melo.png",
            "flInCalendar": true
        },
        {
            "text": "Also, having the employees of Twitter and Facebook influening the censorship decisions the companies make is not good ethically. The employees should do their jobs, they should not personally have any say in who gets to use the network. We need ethical rules for professionals in tech. Here's an example from the medical profession. If you were a doctor in a hospital, and they wheeled in someone whose political opinions you abhor, you have to treat them no matter what. We insist that bakeries in Indiana bake cakes for gay couples as they would for heterosexual couples. It's easy to see when people you disagree with overstep professional ethical boundaries, much harder to see it when you do it yourself. ",
            "created": "Sat, 09 Jan 2021 16:39:28 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "These kinds of decisions have a lot of impact. For example, I was blacklisted from speaking at a few tech conferences probably because their sponsors didn't like the affect my work was having on their closed networks. As a result, I'm perceived to having left tech, when in fact, a couple of powerful and/or rich people pressured conference promoters to not allow me a public presence. When I complained about it on my blog, or in person to friends, they shrugged it off, kind of the way Repubs shrug off ethical failures in their work. There are consequences to this kind of back-room deal-making. By this time very few people have any sympathy for Trump, but this act sets a precedent. You may not like it when someone you support is cut off this way. ",
            "created": "Sat, 09 Jan 2021 16:42:51 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I would love to see the rioters deported to some country where they really don't have political freedom. Let them try to bust down the doors to the Kremlin, for example, see <a href=\"https://en.wikipedia.org/wiki/Gulag\">what</a> <a href=\"https://en.wikipedia.org/wiki/Novichok_agent\">happens</a>. ",
            "created": "Sat, 09 Jan 2021 15:03:19 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}