{
    "text": "January 10",
    "created": "Sun, 10 Jan 2021 05:15:52 GMT",
    "type": "calendarDay",
    "name": "10",
    "subs": [
        {
            "text": "As it settles in, what Trump and his family did, what Giuliani did, there is no penalty harsh enough to fit the crime. That they still have their freedom says there’s something missing in the Constitution. That Trump still have has freedom says there’s something missing in the Constitution.",
            "created": "Sun, 10 Jan 2021 19:36:47 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "They need a new rule in Congress. Don't bother electing anyone who tried to overthrow the US government. We will not let them sit down.",
            "created": "Sun, 10 Jan 2021 20:17:57 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I decided to give <a href=\"http://Fubo.tv\">Fubo</a> a try, because I'd <a href=\"http://scripting.com/2020/12/28/203054.html?title=iWontAddNewSpectrumServices\">like</a> to <a href=\"http://scripting.com/2020/12/27.html#a164205\">watch Knicks games</a>. Well, there's a deal stopper, no CNN. The Knicks are not worth $65 a month, even if they are good this year.",
            "created": "Sun, 10 Jan 2021 20:58:53 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"http://scripting.com/liveblog/users/davewiner/2015/12/10/0613.html\">2015</a>: \"If we could get neutral places on the Internet, with no business models attached to them and no ownership we could create some important new stuff. What? We won't know until we have it.\"",
            "created": "Sun, 10 Jan 2021 17:26:22 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Via Dan Conover on Facebook: \"It's only a coup if it's from the Coup d'état region of France. Otherwise, it's just sparkling White Supremacist insurrection.\"",
            "created": "Sun, 10 Jan 2021 17:06:00 GMT",
            "type": "tweet",
            "tweetId": "1348321386494877697",
            "tweetUserName": "davewiner",
            "flInCalendar": true
        },
        {
            "text": "I'm getting stir crazy. I'm just starting to notice it, but I think it's been happening for some time. Let's try to remember that everyone else is dealing with the same fucked up situation.",
            "created": "Sun, 10 Jan 2021 16:50:19 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Your access to all of the internet depends on the permission of a lot of big companies. Any one of them could break your illusion of independence. So when you get all righteous about how they have the right to shut you down, remember, you aren't them, and they control you.",
            "created": "Sun, 10 Jan 2021 15:46:59 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "It seems to me what happened with Congress on Wednesday was like that <a href=\"https://vimeo.com/103604320\">scene</a> in The Godfather, when Michael realizes his father, in the hospital, is not being guarded.",
            "created": "Sun, 10 Jan 2021 05:15:53 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "A long time ago I wanted to try Google Cloud Platform. I had to give them a credit card. I quickly decided I didn't want the service, so I turned off my test project. Now the card has expired and they're sending me emails saying that I have to register a new credit card. But my bill is $0, has been forever. I don't owe them any money and I don't want the service. I have written them feedback using their support mechanism. Yet I still get the warning emails. The easy thing to do would be to give them a new credit card. This is the power of huge faceless corporations. Even small ones can threaten your credit rating. A foot doctor sends me bills for $40 every few months. Can't talk to the doctor, they won't permit it. Or Experian had a bug that caused my credit to be hurt. It has hurt a lot of other people, I hear. This is the background to the idea of Amazon shutting off an annoying customer because people, including their employees, are hassling them about it. You better stay popular with the people Amazon cares about or you'll be out on the street. I'm not going to give Google a new credit card. Let's see what happens.",
            "created": "Sun, 10 Jan 2021 15:56:29 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}