{
    "text": "January 11",
    "created": "Mon, 11 Jan 2021 16:15:47 GMT",
    "type": "calendarDay",
    "name": "11",
    "subs": [
        {
            "text": "Today's song: <a href=\"https://www.youtube.com/watch?t=13&v=GdxUIZOzd5E\">Get Together</a>. ",
            "created": "Mon, 11 Jan 2021 19:16:17 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?t=13&v=GdxUIZOzd5E",
            "flInCalendar": true
        },
        {
            "text": "Trump doesn't need Twitter, he could just use a blog. If he did, there would be pathways for people to find out he updated, and software that would let his followers read his latest messages, in reverse chronological order. There would be no Twitter to shut him down. Now, I'm not sure where he could go to get the blog hosted. I wonder if Blogger and <a href=\"http://scripting.com/images/2021/01/11/messageFromWordpress.png\">Wordpress</a> et al have considered what they'd do if he started a blog in either of those places. Thing to know is \"RSS\" is a lot easier to deploy than a Twitter-like system, and it could be distributed. We looked at lots of those things in the heyday of [%search: Napster%] to route around the music industry. I hate that I'm helping Trump be the monster he is, but I feel obligated to share this with my followers, who probably want to think about real-world applications of distributed internet technology. ",
            "created": "Mon, 11 Jan 2021 21:35:04 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/03/28/hillary.png",
            "flInCalendar": true
        },
        {
            "text": "Here's something positive. Re this <a href=\"https://www.washingtonpost.com/local/how-trump-supporters-turned-one-mild-mannered-dc-lawyer-into-the-angry-guyonporch/2021/01/07/384be64c-5106-11eb-83e3-322644d82356_story.html\">profile</a> of the <a href=\"https://twitter.com/NRKveronica/status/1347002291249770496\">GuyOnPorch and WomanInCar</a> meme that became viral. Let me set the stage. The guy on the porch is an older white man. He's screaming obscenities at MAGAs (off-camera) telling them to get the fuck out of DC. Then the camera swings to a black woman in her car, and she's kind of astonished to see the white man saying what she was thinking. And she said so. I cried watching it. Later in the profile they said something that grabbed me. “Humphries was stunned that it was this 60-year-old White man speaking her truth. Their truth.” I wanted to give them both a big hug. We need to get our shit together. It's not just her truth and his truth, it's the truth of America. We love this country. And that means we love each other. For real. ",
            "created": "Mon, 11 Jan 2021 17:16:14 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/NRKveronica/status/1347002291249770496",
            "flInCalendar": true
        },
        {
            "text": "I had a post here entitled Morning Depression Notes. I deleted it. I don't need to make your day worse. But I do want to say Monday January 11, 2021 is one of the worst days ever. I somehow made it through 2020 without getting depressed. But 2021, it's a real challenge. Maybe I just want to say one thing. Let's <a href=\"https://en.wikipedia.org/wiki/Fourteenth_Amendment_to_the_United_States_Constitution#Participants_in_rebellion\">remove</a> all the Republican senators, except Mitt Romney. Send them all home. They had a chance to stop this, the Dems tee'd it up for them, all they had to do was vote to convict. Sure they might have lost their jobs. They're going to lose them anyway. But they might have had a tiny little bit of residual honor, and we all could have stood up for them, when the MAGA mob comes for them. Now, let em go -- out the airlock. Good riddance. ",
            "created": "Mon, 11 Jan 2021 16:27:38 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/01/11/drummer.png",
            "flInCalendar": true
        },
        {
            "text": "When we throw the Repubs out the airlock, I nominate <a href=\"https://en.wikipedia.org/wiki/Lee_Zeldin\">Lee Zeldin</a> to lead the parade, for <a href=\"https://twitter.com/RepLeeZeldin/status/1348476260528357380\">this tweet</a>. ",
            "created": "Mon, 11 Jan 2021 16:31:14 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}