{
    "text": "January 12",
    "created": "Tue, 12 Jan 2021 14:23:38 GMT",
    "type": "calendarDay",
    "name": "12",
    "subs": [
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1349030842467815430\">Poll</a>: Will Trump be president on January 21? ",
            "created": "Tue, 12 Jan 2021 16:38:38 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1349030842467815430",
            "flInCalendar": true
        },
        {
            "text": "Reality check: Trump attacked the United States.",
            "created": "Tue, 12 Jan 2021 20:04:57 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I wish I had that video of the Iraqi parliament, locked in by Saddam, being taken out one by one to be shot. The doors locked. Giving speeches saying how much they love Saddam, arms waving, crying. He had them shot anyway. I think the Congressional Repubs should see it. And Mike Pence. He already knows what it feels like. ",
            "created": "Tue, 12 Jan 2021 20:09:14 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "If the [%search: Mission Impossible%] people were still around, they'd figure out a way to get the MAGAs to turn on Trump. ",
            "created": "Tue, 12 Jan 2021 18:00:57 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=wwpXUn2dF5c",
            "flInCalendar": true
        },
        {
            "text": "Seeming unlikely things keep happening, yet this doesn't affect people's inability to imagine weird freaky things happening. They snap back to \"normal\" whatever that is. Normal never actually existed. A more accurate way to describe that feeling is this: \"asleep.\"",
            "created": "Tue, 12 Jan 2021 14:57:50 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Over the years Trump was on Twitter, I had him blocked. I urged people I follow not to RT him. That's the first and only rule of trolls, <i>don't feed them.</i> That's what they need. His fans love that he pisses off the libtards (that's you btw). How much more effective it would have been if instead of waiting for Twitter to ban him, we all did it, by blocking him. Pay no attention. That would have been incredible. But people need to learn. Okay now it's time not to RT the Repubs as they desperately try to reboot their reality distortion field. Let Trump's base take care of them. Don't RT them. <i>Let them fail.</i> When you feed their attempts at controversy you are, perhaps ironically, saving them.",
            "created": "Tue, 12 Jan 2021 14:25:07 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/03/11/hillaryClinton.png",
            "flInCalendar": true
        },
        {
            "text": "As things get worse for Trump, and they are getting worse, the odds he’ll blow a nuke go up. Will we look back on this, after the fact, and realize there was something we could’ve done to prevent it. Will history forgive us if it happens and we didn’t do anything.",
            "created": "Tue, 12 Jan 2021 14:23:39 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}