{
    "text": "January 14",
    "created": "Thu, 14 Jan 2021 15:25:48 GMT",
    "type": "calendarDay",
    "name": "14",
    "subs": [
        {
            "text": "Last Wednesday was a <a href=\"https://en.wikipedia.org/wiki/2021_storming_of_the_United_States_Capitol#:~:text=The%20storming%20of%20the%20United,in%20the%202020%20presidential%20election.\">horrible day</a> for white Americans.",
            "created": "Thu, 14 Jan 2021 20:30:22 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "White people should wear a <a href=\"http://scripting.com/2016/12/30/theMlkButtonsArrived.html\">MLK button</a>. Here's what it says: \"I am not a white supremacist. I believe in an America that loves and respects <i>all</i> its people. No one is allowed to interfere with or limit another person's right to vote. Government of the people, by the people and for the people.\"",
            "created": "Thu, 14 Jan 2021 15:58:43 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/06/17/mlkButton.png",
            "flInCalendar": true
        },
        {
            "text": "I wouldn't listen to anyone who spouts hate about white men any more than I would one who hates on black men. I'm so fed up with people who spew hate. They're all evil, sick, selfish people. There is no acceptable form of hate. ",
            "created": "Thu, 14 Jan 2021 15:43:06 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The Nets traded for <a href=\"https://www.espn.com/nba/story/_/id/30706097/sources-houston-rockets-trade-james-harden-brooklyn-nets\">James Harden</a>, one of the top stars in the NBA. They gave up most of their draft picks, so their future looks pretty grim. And they now have two of the most worst-attitude players in the NBA in Kyrie Irving and Harden. Not sure about Durant. But I wonder how many games Kyrie is going to play this year, when ball-hog Harden is on the court. Maybe he can lead the second team. Somehow the power has to gravitate away from the stars, and back to the teams. In the meantime, it's kind of a blessing for the Knicks that none of the superstars want to play there. That way every victory feels earned. The team has a spirit. Of course they have egos, but none so dominant as the ones who now play for Brooklyn. Now I just wish I could watch the Knicks for less than $65 a month, which is a ripoff that I refuse to pay. ",
            "created": "Thu, 14 Jan 2021 15:25:49 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Terrorism and tech",
            "created": "Thu, 14 Jan 2021 16:32:00 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2021/01/14/dataCenter.png",
            "description": "Tech is interesting! But the big news orgs aren't confident, and their stories are often shallow or misleading. ",
            "subs": [
                {
                    "text": "The NYT needs someone who understands tech at a human level, the way <a href=\"https://www.nytimes.com/by/donald-g-mcneil-jr\">Donald McNeil</a> understands viruses. Yesterday's <a href=\"https://www.nytimes.com/2021/01/13/podcasts/the-daily/capitol-attack-social-media-parler-twitter-facebook.html\">Daily</a> could have been so much better, more informative, and less scary.  ",
                    "created": "Thu, 14 Jan 2021 16:32:24 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The terrorists will hit some new speed bumps now that they've had some success. If their online groups follow the pattern of every group I've ever belonged to, it won't be long before they're attacking each other. Probably has already started.",
                    "created": "Thu, 14 Jan 2021 16:32:48 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Just like there were defenses against the virus, which we learned about in March from McNeil, there are defenses against the terrorists, beyond deplatforming.",
                    "created": "Thu, 14 Jan 2021 16:33:22 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Maddow needs help too. You know how she always asks if she got it right and the other person says yes. Well, when it comes to tech, the answer is no. Her stories, when they involve tech are usually nonsense.(I say usually because I haven't heard them all.)",
                    "created": "Thu, 14 Jan 2021 16:33:35 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "For example, the app stores on Google and Apple. That's where Parler was cut off. They didn't provide back-end services, they provided distribution. Like when you buy bread at the supermarket, they didn't make the bread, but they have it all there in one place for you to buy.",
                    "created": "Thu, 14 Jan 2021 16:33:53 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "With Apple and Google, they make it very hard if not impossible to install something that didn't come through their store. This is for security, and also gives them full control over the platform. So when they removed Parler, that was pretty much the end for them on mobile devices. They still had the open web until Amazon knocked them off there too.",
                    "created": "Thu, 14 Jan 2021 16:34:04 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Also the news is butchering the difference between Amazon and the others (Twitter, Facebook, Apple, Google). They are providing something completely different. And them kicking Parler off is pretty unprecedented for them. That in itself is big news. Like the failure of a vaccine.",
                    "created": "Thu, 14 Jan 2021 16:34:14 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "There's another interesting angle that they touched on yesterday in the Daily, that <a href=\"https://en.wikipedia.org/wiki/Deplatforming\">deplatforming</a> has a disadvantage, it means it's harder to spy on the terrorists. Something like this happened 20 years ago with Napster. At that time everyone was getting their music from Napster. The music industry, sued them, and won, buh bye Napster. But something was lost there. The idea of a central place for music, that might have been interesting. It'll never happen again, just like we will never get the Coronavirus contained again, as it was before 2019.",
                    "created": "Thu, 14 Jan 2021 16:34:19 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Tech is interesting! But the lack of confidence among journalists not only lets people manipulate them (Hillary's emails) it often distributes information that's just plain wrong and that's too bad. Because a lot of these things aren't mysteries now.",
                    "created": "Thu, 14 Jan 2021 16:34:29 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "The impeachiest.",
            "created": "Thu, 14 Jan 2021 15:32:32 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2021/01/14/turnAroundDonaldAndGoHome.png",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}