{
    "text": "January 15",
    "created": "Fri, 15 Jan 2021 14:45:06 GMT",
    "type": "calendarDay",
    "name": "15",
    "subs": [
        {
            "text": "Every so often the Daily podcast hits it out of the park, as with <a href=\"https://www.nytimes.com/2021/01/15/podcasts/the-daily/impeachment-peter-meijer-trump.html\">today's interview</a> with Republican congressperson <a href=\"https://en.wikipedia.org/wiki/Peter_Meijer\">Peter Meijer</a>, who voted to impeach Trump, after voting to certify Biden's win. ",
            "created": "Fri, 15 Jan 2021 21:03:32 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I was <a href=\"http://scripting.com/images/2021/01/15/memoTrump.png\">looking</a> at the home page on <a href=\"https://www.memeorandum.com/\">Memeorandum</a> this morning, wondering how journalism would adjust to not having a daily Trump story (or more) to obsess over. How will everyone else deal with that. What will Maddow talk about every night? The fear factor should diminish, one would hope. Former presidents have much less power than sitting presidents. Trump could be the exception. They will have plenty to write about. First the impeachment. The trials of the January 6 insurrectionists. Trump's trials, bankruptcy. Trump going to jail? One can hope. Will this be good for Biden? For us? I don't know. The Democrats need to get a great online organizing machine rolling, for more than raising money and getting out votes. We need to have healthy forms of political action, to balance out the evil kind, which we're seeing so much of. Say what you will about Trump, he did organize an active base. The Democrats could too, but they don't seem to know it. Same as it always was. ",
            "created": "Fri, 15 Jan 2021 15:54:45 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/06/18/orangeCrush.png",
            "flInCalendar": true
        },
        {
            "text": "Come to think about it, Maddow will have plenty to talk about as details of how Trump and his associates hollowed out and looted the US government while they were in office. We'll be finding smoking holes in the ground for decades to come. Things that used to work that no longer exist. So if you need a nightly story of <a href=\"https://slate.com/news-and-politics/2020/04/trump-coronavirus-american-carnage.html\">American carnage</a>, you will be well taken care of. ",
            "created": "Fri, 15 Jan 2021 16:05:06 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Twitter CEO Jack Dorsey's <a href=\"https://twitter.com/jack/status/1349510771928010753\">thread</a> from the Wednesday about the \"significant ramifications\" of banning Trump from Twitter. In the thread he talks about Twitter funding an <a href=\"https://twitter.com/jack/status/1349510780043988992\">open decentralized standard</a> for social networks called Blue Sky. I remember when they announced this in 2019, I think I offered to help then, and I offered again today. Creating an open distributed system at Twitter's scale is an ambitious undertaking.",
            "created": "Fri, 15 Jan 2021 15:42:20 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "There are, as far as I know, two places to get a Covid vaccine in Ulster County, the <a href=\"https://covid19.ulstercountyny.gov/vaccine-resource-center/\">county itself</a> in Kingston and the <a href=\"http://drnealsmoller.com/vax\">Village Apothecary</a> in Woodstock. Neither are making appointments now, but you can register to be notified when they are. If you know of others, send me a link and I'll try to post it here or in the <a href=\"http://scripting.com/?tab=links\">linkblog</a>. ",
            "created": "Fri, 15 Jan 2021 14:45:07 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Roku's UI?",
            "created": "Fri, 15 Jan 2021 18:11:57 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I think Roku is an incredible product. The remote is the best. The UI is great. On screens that integrate it, where Roku is the OS, it's even better. It's how screens should work, imho. I called it the <a href=\"http://scripting.com/2019/04/17/144031.html\">Entertainment Desktop</a> in April 2019. ",
                    "created": "Fri, 15 Jan 2021 18:12:02 GMT",
                    "image": "http://scripting.com/images/2019/04/17/roku2.png",
                    "flInCalendar": true
                },
                {
                    "text": "But there's something I've heard a lot -- Roku's user interface \"needs work.\" Or it's old-looking, dated. ",
                    "created": "Fri, 15 Jan 2021 18:12:53 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "But I don't get it. Compared to what? It seems pretty good to me, and I've spent decades thinking about and working on interfaces for stuff like that.",
                    "created": "Fri, 15 Jan 2021 18:13:23 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "PS: Remember iTunes?",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}