{
    "text": "January 16",
    "created": "Sat, 16 Jan 2021 15:26:11 GMT",
    "type": "calendarDay",
    "name": "16",
    "subs": [
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1350480969443270656\">Vaccinating all Americans</a> in short order is the kind of thing we're good at. While I was growing up, we went to space. I remember the Mercury and Gemini missions, and I was 14 years old when we landed on the moon. When there are catastrophes elsewhere in the world, America helps them dig out. We can do this. It will be a great thing to be reminded of our capabilities. We've spent the last four years losing. We need a win. This one is a slam dunk.   ",
            "created": "Sat, 16 Jan 2021 16:42:06 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I needed a script to loop over a calendar-structured folder to generate a list of the most recent updates to a set of projects that are backed up in these folders. I used Frontier. Here's the <a href=\"http://scripting.com/testing/code/listChangedProjects/script.txt\">script source</a>. This is the kind of thing that's much quicker in a scripting system than it would be in Node or some another system language.  ",
            "created": "Sat, 16 Jan 2021 16:45:30 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Why does GitHub make people log in to see an <a href=\"https://gist.github.com/scripting/ab9c485db8480cc7eea091f33730aa96\">example script</a>? ",
            "created": "Sun, 17 Jan 2021 03:42:02 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "People are obsessed with what others should do, but here's something you can do. 1. Unfollow and block trolls. 2. Unfollow and block friends who RT trolls. If we all did this, and were open about it, we could beat trolls. Trolls don't change, but you can.",
            "created": "Sat, 16 Jan 2021 16:04:48 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "You know why you need programmers around? We're always looking for ways things can go wrong.",
            "created": "Sat, 16 Jan 2021 17:06:00 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://www.metacritic.com/movie/the-departed\">The Departed</a> is on <a href=\"https://www.netflix.com/title/70044689\">Netflix</a>. What an incredible movie. I've watched it so many times. Never fails to grab my full attention.",
            "created": "Sun, 17 Jan 2021 03:47:23 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "There are 20K troops in DC. Who do they take orders from? Do they think Biden won, or it was stolen from Trump. How many of them believe in the peaceful transfer of power. The question really is, who is the individual cop or soldier loyal to. Since the Civil War, as far as I know, this has not been in question.  ",
            "created": "Sat, 16 Jan 2021 17:09:34 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "America lands on the moon in 1969.",
            "created": "Sat, 16 Jan 2021 17:00:17 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2021/01/16/moonLanding.png",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}