{
    "text": "January 17",
    "created": "Sun, 17 Jan 2021 17:33:48 GMT",
    "type": "calendarDay",
    "name": "17",
    "subs": [
        {
            "text": "I've been working, in slow mode, on a new feature for my outliners, [[tagging]]. I saw a similar idea in action with <a href=\"https://roamresearch.com/\">Roam Research's</a> outliner, and thought it was a really nice idea. I always want to save references to my notes in a cumulative index, like the index in the back of a book. This has always been a good companion to the fluid hierarchy, the outline structure which is more like the table of contents in front of a book. Only when you're working electronically, there isn't really a middle. Everything is in both places, at the same time. It's ideas like this that make programmers' eyes glaze over. They start using words like orthogonal, or loosely connected, and of course the always welcome \"distributed.\" Really having fun programming the last week or so. As the world is falling apart. Why not? It's not like any of us are getting out of this alive. :rocket:",
            "created": "Sun, 17 Jan 2021 22:40:37 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/05/30/elephant.png",
            "flInCalendar": true
        },
        {
            "text": "White supremacy is the crisis in the US. There was confusion after 9/11 if we were at war, and now it's even more confusing. What's not confusing is that both events were Acts of War. If I were white, and I am, I'd want to have a way to clearly say I am not with them.   ",
            "created": "Sun, 17 Jan 2021 18:30:46 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "It's nice to see more people using \"thread.center\".",
            "created": "Sun, 17 Jan 2021 18:15:37 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Seth Meyers' <a href=\"https://www.youtube.com/watch?v=VGV61CqJF5c\">closer look</a> at Trump's failed Insurrection. ",
            "created": "Sun, 17 Jan 2021 20:00:59 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Good morning everybody ",
            "created": "Sun, 17 Jan 2021 17:08:49 GMT",
            "type": "outline",
            "description": "No matter what, things will change radically in the US in the next few days.",
            "metaImage": "http://scripting.com/images/2021/01/17/twinTowers.png",
            "subs": [
                {
                    "text": "There's a weird feeling in the world right now. Tomorrow is a <a href=\"https://en.wikipedia.org/wiki/Martin_Luther_King_Jr._Day\">national holiday</a>, and Wednesday is Inauguration Day. No matter what, things will change radically in the US in the next few days.  ",
                    "created": "Sun, 17 Jan 2021 17:15:20 GMT",
                    "image": "http://scripting.com/images/2020/03/12/usAttacked.png",
                    "imageLink": "https://archive.nytimes.com/www.nytimes.com/packages/html/nyregion/9-11imagemap.html?mcubz",
                    "flInCalendar": true
                },
                {
                    "text": "I got an answer to a <a href=\"http://scripting.com/2021/01/16.html#a170934\">question</a> I asked yesterday, about who 20K+ troops in DC will report to, until Biden is sworn in. By law they report to the commander-in-chief, President Trump. Just a fact. If Trump orders them to assassinate everyone at the inauguration, it's not all that different from what Trump told the mob to do on January 6. So unfortunately it is in the realm of possibility.  ",
                    "created": "Sun, 17 Jan 2021 17:15:42 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It all hinges on who the troops are loyal to. Turns out the military thought of that, and <a href=\"https://www.defenseone.com/threats/2021/01/troops-inauguration-pre-screened-extremism-says-dc-guard-commander/171456/\">pre-screened</a> the soldiers assigned to this job to weed out white supremacists. I kid you not. They know how to do that? I guess it would be naive for them not to.",
                    "created": "Sun, 17 Jan 2021 17:44:13 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I have a nightmareish vision of <a href=\"https://en.wikipedia.org/wiki/Assassination_of_Anwar_Sadat\">Anwar Sadat's assassination</a> in 1981. If you haven't seen it, <a href=\"https://www.youtube.com/watch?v=cKu-u-W5J84\">watch the video</a>. You've never seen anything like it, even in a movie or TV show.  As they <a href=\"http://scripting.com/2021/01/16.html#a170600\">say</a>, this is why you want to have programmers around, we think about these things. :boom:",
                    "created": "Sun, 17 Jan 2021 17:20:06 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I read last night that <a href=\"https://www.defenseone.com/ideas/2021/01/pentagon-wont-throw-traditional-farewell-ceremony-trump/171408/\">the Pentagon turned Trump down</a> for a great military send-off on Wednesday morning. Interesting, are they allowed to do that? No one seems to be questioning it. ",
                    "created": "Sun, 17 Jan 2021 17:18:16 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Anyway, if it goes smoothly and the Bidens end up running the government on Thursday, and recinding Trump's orders, the tension goes down a lot. We still have to deal with Trump, and Republicans, but really if they could just STFU our real business is with the virus. ",
                    "created": "Sun, 17 Jan 2021 17:19:55 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "All the usual mottos apply, Let's Have Fun, Still diggin, and It's not like anyone gets out of this alive. ",
                    "created": "Sun, 17 Jan 2021 17:20:51 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Famous Front Pages",
            "created": "Sun, 17 Jan 2021 17:41:46 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "We thought we lost a lot on 9-11, but it's nothing compared to what we're losing now. ",
                    "created": "Sun, 17 Jan 2021 17:43:06 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "NYT <a href=\"https://archive.nytimes.com/www.nytimes.com/packages/html/nyregion/9-11imagemap.html?mcubz\">front page</a> on 9/12/2001.",
                    "created": "Sun, 17 Jan 2021 17:41:16 GMT",
                    "inlineImage": "http://scripting.com/images/2021/01/17/usAttacked.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}