{
    "text": "January 23",
    "created": "Sat, 23 Jan 2021 14:59:42 GMT",
    "type": "calendarDay",
    "name": "23",
    "subs": [
        {
            "text": "Today's song: <a href=\"https://www.youtube.com/watch?v=j4YMmSvDz9w\">On the Road to Freedom</a>.",
            "created": "Sat, 23 Jan 2021 14:59:43 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "As you may know, I got <a href=\"http://scripting.com/2021/01/20.html#a210604\">vaccinated</a> on the 20th. Only side-effect: a shoulder-ache at the injection site. I wonder why there isn't a database I'm registered in, so data can be gathered on the effectiveness of the vaccine over time and geography, so it can be added to other data to learn more about the virus. I registered for the [%search: Kinsa%] groupware thermometer for that purpose. Millions of people have been vaccinated all over America, but as with everything it's fairly disorganized. I do have an official-looking CDC identification card, but no corresponding web registration.",
            "created": "Sat, 23 Jan 2021 20:56:38 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Wouldn't it be great if, on Monday, everyone in the Senate, Republican and Democrat, dressed up like Bernie, including the mittens. I would be so impressed. A country that can laugh at itself is the most powerful, respectful country in the world.",
            "created": "Sat, 23 Jan 2021 15:31:19 GMT",
            "type": "tweet",
            "tweetId": "1353002592914313218",
            "tweetUserName": "davewiner",
            "flInCalendar": true
        },
        {
            "text": "Follow-up on the <a href=\"http://scripting.com/2021/01/22.html#a142908\">Rijksmuseum download</a>. It's huge, 1.72GB uncompressed. But it's a <i>JSON file. </i>Not sure what I'd use it for. I wanted the images. Oy. Also it took a couple of days to download. ",
            "created": "Sat, 23 Jan 2021 18:23:41 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "\"America first\" is a dog whistle for \"White people first.\" Even that's a lie. It really means \"Let's watch the world burn.\"",
            "created": "Sat, 23 Jan 2021 20:15:07 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I read in the comments of a <a href=\"https://www.facebook.com/permalink.php?story_fbid=10157399193110947&id=109161715946\">story</a> on Facebook how particular people in Vermont are about people who come from other places. The places I like best are where people don’t have any weird ideas about how they’re better than people who were born elsewhere. I’m a first gen American, child of people who ran for their lives, and were welcomed to this great country. They had no other place to go. What if America hadn't welcomed us? I've been to places where they hate outsiders, and many more places where they welcome them. I had a warm feeling walking around a small city in Italy, where I didn't speak the language and almost no one spoke English, but people were patient and smiled a lot and were gentle with the tourist from America. I got lost on the train, hundreds of miles out of my way, and the workers on the train spoiled me, passing me off to the next one to get me to my destination. Maybe they laughed, but I never saw it. The note they gave me explained my predicament in Italian, very respectfully (it was translated for me by my host when I arrived in Trieste). So I try to go out of my way to welcome visitors. Because it's a generous thing to do, but also because I know that I have benefited from this kind of generosity myself. And I always try to remember that I'm no better than anyone else, even if they were born in Vermont. :boom:",
            "created": "Sat, 23 Jan 2021 15:21:27 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "\"You can observe a lot by just watching.\" -- [%search: Yogi Berra%].",
            "created": "Sat, 23 Jan 2021 21:07:51 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2021/01/23/yogiBerra.png",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}