{
    "text": "January 24",
    "created": "Sun, 24 Jan 2021 14:19:41 GMT",
    "type": "calendarDay",
    "name": "24",
    "subs": [
        {
            "text": "Today's song: <a href=\"https://www.youtube.com/watch?v=F1mqrCTFoz4\">Time After Time</a>.",
            "created": "Sun, 24 Jan 2021 16:35:57 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "One of the really nice things about Facebook is that every morning after breakfast they show me my posts from the past. So right now I'm re-living the incredible <a href=\"https://en.wikipedia.org/wiki/2017_Women%27s_March\">Women's March</a> after the Trump inauguration. And this makes me wonder -- why aren't we in the streets marching now? In 2017 it was mostly symbolic, a cry of pain that we all heard, ourselves, but it didn't help make the government better. Today if we were all in the streets the Repubs might not be so bold in Congress. They all saw what happened in Georgia. Show them it could happen in Missouri, Oklahoma, Nebraska, North Carolina and Florida too. Make sure they know what we demand. They're scared and confused now. It's a good time to apply pressure. And to the Democrats, why aren't you organizing us! What are you waiting for? How many more chances to save American democracy do you think we're going to get?",
            "created": "Sun, 24 Jan 2021 14:19:42 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/01/24/pussyHat.png",
            "flInCalendar": true
        },
        {
            "text": "Yes I know these rants don't accomplish anything. At some point it has to stop. When I ran a startup in the 80s I remember trying to visualize the last day there, but I couldn't. Then one day I realized I had left, and I didn't even remember the last day. Like the last time I saw my mother, or an old girlfriend -- I don't remember most of those days either. But I do remember the day Trump took office. And I remember marching, and wondering if it would do any good. Like the rants I write today. Anyway one thing is for sure, we won't get many more chances to fix the country. I believe I know the answer -- look to the left and right not up or down. We don't have to unite with the miscreant Republicans in Congress. Most of them work for Moscow. We have to connect with other Americans who vote against democracy. This is not optional. So it's important to remember that and think of things we can do to shake ourselves out of our ruts and get out in the streets, figuratively and literally. ",
            "created": "Sun, 24 Jan 2021 14:32:45 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://www.goodreads.com/quotes/760902-we-but-mirror-the-world-all-the-tendencies-present-in\">Gandhi</a>: “We but mirror the world. All the tendencies present in the outer world are to be found in the world of our body. If we could change ourselves, the tendencies in the world would also change. As a man changes his own nature, so does the attitude of the world change towards him. This is the divine mystery supreme. A wonderful thing it is and the source of our happiness. We need not wait to see what others do.” ",
            "created": "Sun, 24 Jan 2021 14:40:23 GMT",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://journalism.utexas.edu/faculty/rosental-alves\">Rosental Alves</a> wrote to tell me about a <a href=\"https://vsafe.cdc.gov/\">CDC site</a> that tracks people who have been vaccinated. \"V-safe is a smartphone-based tool that checks in on you after your COVID-19 vaccination. Your participation helps keep COVID-19 vaccines safe — for you and for everyone.\" This answers the question I asked <a href=\"http://scripting.com/2021/01/23.html#a205638\">yesterday</a>, why aren't they staying in touch with vaccinated people. There is a system in place, apparently, I just didn't know about it. Now I do, and so do you. :boom: ",
            "created": "Sun, 24 Jan 2021 14:45:19 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/01/24/bush.png",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://www.facebook.com/raines.cohen/posts/10159415645719669\">Raines Cohen, on Facebook</a>: \"Five years ago a 400-mile day trip for a family baby-naming ceremony was routine. What will be 'normal' five years from now?\" I commented: It's a good thing we stopped doing that. I only took one plane trip myself in the couple of years leading up to 2020. it was shocking, after being away for so long, how much carbon was burned for so little reason. we have to stop having this \"carbon party\" -- and the virus gave us a new perspective for that. It's a total silver lining. BTW I was already living in the country when I took the trip. I was going to Austin, and flew through Albany NY, which is a very small airport compared to the bay area or NY. But I had to make a connection in O'Hare, and that's when it hit me how ridiculous this was. I was going to a conference that could just as easily have been held online. It will be held online from now on, I expect (and hope). I guess what this means is that where you park your ass makes a much bigger difference now than it used to. The people you have personal contact with will be the ones who live where you do. Everyone else will be virtual. Long distance travel will be a luxury.",
            "created": "Sun, 24 Jan 2021 15:37:41 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}