{
    "text": "January 26",
    "created": "Tue, 26 Jan 2021 14:15:31 GMT",
    "type": "calendarDay",
    "name": "26",
    "subs": [
        {
            "text": "Today's song: <a href=\"https://www.youtube.com/watch?v=-DFhuE_XeT8\">Georgia on my Mind</a>. In the mess of January 6, we didn't get enough time to savor the wonder of Georgia. Two Repubs gone, two Dems take their place. This can be replicated all over the country, where ever there are Repubs in charge of states with large African-American populations. The power of the ballot. It's something, as long as democracy rules. And I suspect it wasn't a coincidence that the white racists got violent the day after Georgia.  ",
            "created": "Tue, 26 Jan 2021 14:42:55 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/01/26/weather.png",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"http://scripting.com/2001/01.html\">It took 20 years</a>, but the <a href=\"https://en.wikipedia.org/wiki/Grateful_Dead\">Grateful Dead</a> have <a href=\"https://www.facebook.com/gratefuldead/posts/10157877331176659\">acknowledged</a> that their music played a vital role in the <a href=\"http://scripting.com/2015/09/30/aPodcastAboutPodcasting.html\">bootstrap</a> of podcasting. I needed MP3 files to test the publishing and podcasting system I had built. I remembered that the Dead, uniquely, let their fans do whatever they wanted with their music. In the days just after Napster, this meant a lot to me. So the very <a href=\"http://xmlviewer.scripting.com/?url=http://scripting.com/misc/fromDaveOfsCom/rss/gratefulDead.xml\">first podcast feed</a> ever was casting old Grateful Dead tunes like Truckin and The US Blues. ",
            "created": "Tue, 26 Jan 2021 18:50:32 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Instead of <a href=\"https://www.axios.com/twitter-newsletter-publishing-revue-8a74f20d-61c9-4095-9b3c-202c3b3fe77c.html\">buying an email newsletter</a> company I wish Twitter would allow long form enclosures that are text, not just images and video. Twitter is a better delivery system potentially than email. Email is what it is, but because Twitter is controlled by one company, it can still move. They have a good API, it performs well, and it covers a lot of the functionality. ",
            "created": "Tue, 26 Jan 2021 15:34:41 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Today I am in agreement with NYC mayoral candidate Andrew Yang about the Knicks and Jeremy Lin. <a href=\"https://twitter.com/bflats2020/status/1354055404393811969\">He says</a>: \"When the Knicks dumped Jeremy Lin that was the last straw for me. This is the franchise that gave <a href=\"https://www.sportskeeda.com/basketball/5-worst-contracts-handed-out-in-nba-history/2\">Jerome James</a> $30 million. You let the most beloved Knicks figure in years who lit the Garden and City up walk over money?  Come on.\" Amen. Under his note are a mix of comments including the usual that Lin wasn't that good, but who knows. If the Knicks had loved him maybe he would have continued to be an inspiration to the team and to New Yorkers. Instead, the Knicks stuck with Melo, who clearly was jealous of the attention <a href=\"http://scripting.com/2013/12/19/whatIfTheKnicksHadKeptJeremyLin.html\">Lin</a> was getting. Lin might have done great if they had kept coach <a href=\"https://en.wikipedia.org/wiki/Mike_D%27Antoni\">Mike D'Antoni</a>, but they let him go too. Who knows. But nothing was known at the moment the Knicks said goodbye to Linsanity. And for all the Asian-Americans who live in the city, a cause of celebration disappeared. I think I may have loved the whole thing mostly because of the way it made them light up in civic pride. And I couldn't help but feel that the NBA was being a bit racist in their treatment of Lin. My suggestion to the mayoral candidate, Mr Yang, is that he campaign on giving <a href=\"https://en.wikipedia.org/wiki/James_L._Dolan\">James Dolan</a> the boot. Find a new owner for the Knicks. I also agree with commenters who said you can't decide to leave a team. Once a Knick fan, <a href=\"http://scripting.com/stories/2012/05/02/punchingGlassInALockerRoom.html\">sadly</a>, always a Knicks fan. ",
            "created": "Tue, 26 Jan 2021 14:16:37 GMT",
            "type": "outline",
            "image": "http://static.scripting.com/larryKing/images/2013/12/07/knicksTeam.gif",
            "flInCalendar": true
        },
        {
            "text": "Every <a href=\"http://scripting.com/2021/01/26.html\">day</a> I start this blog with an empty slate. Maybe I won't find anything to write about today? Somehow it never seems to happen. This is a rare <a href=\"http://scripting.com/stories/2009/11/24/naturalbornBlogger.html\">condition</a>, it seems. ",
            "created": "Tue, 26 Jan 2021 14:15:32 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://www.tvinsider.com/984957/the-expanse-why-we-love-fear-camina-drummer-cara-gee/\">Drummer</a>: \"All the optimists I know are dead.\"",
            "created": "Wed, 27 Jan 2021 01:21:50 GMT",
            "type": "outline",
            "inlineImage": "http://scripting.com/images/2021/01/26/drummer.png",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}