{
    "text": "January 29",
    "created": "Fri, 29 Jan 2021 15:15:02 GMT",
    "type": "calendarDay",
    "name": "29",
    "subs": [
        {
            "text": "A rite of passage. A few months ago I bought some <a href=\"https://www.amazon.com/Apple-MWP22AM-A-AirPods-Pro/dp/B07ZPC9QD4\">$250 headphones</a> from Apple. They were great. Today one of them fell out of my ear when I was taking off my mask, and disappeared into my jacket or the ether or whatever, but it's gone now. Oh well.",
            "created": "Fri, 29 Jan 2021 21:55:57 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "When I was in <a href=\"https://www.bxscience.edu/\">high school</a> a bunch of us asked to be excused from class at the same time. We went to the bathroom and flushed all the toilets at once. We figured the plumbing system hadn't been designed for that. The moral of the story is our whole system is designed that way. The stock market, the political system, the police, health care, the national guard. With 300 million people in the US, we could overload and destroy any system on any day, by coordinated action. That we <i>don't</i> do it is a key feature of civilization. ",
            "created": "Fri, 29 Jan 2021 15:15:03 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/01/29/butthead.png",
            "imageLink": "https://en.wikipedia.org/wiki/Butt-Head",
            "flInCalendar": true
        },
        {
            "text": "I read on twitter earlier that women have feelings and men have opinions. I didn't respond because I would have gotten excoriated. This is the kind of bullshit you read on twitter all the time. I'd like to see this, gender hate, be made illegal. It kind of becomes a self-fulfilling prophecy when every time a male child shows emotion they're punished for it. And who is doing this regulating, creating such unhealthy beasts? A lot of times it's women, our mothers, aunts, friends, etc. Men are people, full people, with all the human features. When you present us as horrible inhuman beings you are doing the greatest harm.",
            "created": "Fri, 29 Jan 2021 15:15:39 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The story of the filibuster",
            "created": "Fri, 29 Jan 2021 17:18:30 GMT",
            "type": "outline",
            "description": "40 percent of the Senate, which often is much less than 40 percent of the people, can stop anything from happening. This sucks.",
            "metaImage": "http://scripting.com/images/2021/01/29/mrSmithGoesToWashington.png",
            "subs": [
                {
                    "text": "The <a href=\"https://www.nytimes.com/column/the-daily\">NYT Daily podcast</a> is sometimes very good, riveting even, and certainly useful. Esp covering the pandemic. But on politics, they are often in the woods. Taking something simple and not only making it sound complex, but <i>saying</i> that they're doing that. It's tricky. If I tell you right now there's no point reading further because you'll never understand what I'm saying, you might keep reading but you wouldn't understand. A certainty. Or if I say \"You're not going to like this..\" you won't like it. I've seen myself react this way. And later thought, hold on, I never got a chance to like it or dislike it! Oy.    ",
                    "created": "Fri, 29 Jan 2021 17:12:17 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Anyway the history of the filibuster. It's one of those things like stock options that people feel they can't understand and in <a href=\"https://www.nytimes.com/2021/01/28/podcasts/the-daily/filibuster-senate-mcconnell-democrats.html\">yesterday's Daily podcast</a> they didn't help demystify it. I can't believe the reporter and interviewer didn't understand, but they kind of pretended they were confused. ",
                    "created": "Fri, 29 Jan 2021 17:19:36 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "So here's a rough timeline of the advent and demise of the filibuster in the US Senate. ",
                    "created": "Fri, 29 Jan 2021 17:20:38 GMT",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "It was a rule first adopted for the US Senate in 1917. It said this. If someone is talking endlessly, you can stop them, with 67 votes. A 2/3 majority. When you stop them, you can vote, and then a 51% majority rules. Simple. Before 1917 there was no way to shut up a speaker and start to vote, believe it or not. The vote to shut someone up is called <a href=\"https://en.wikipedia.org/wiki/Cloture\">cloture</a>. ",
                            "created": "Fri, 29 Jan 2021 17:20:31 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "In 1974 they made it so that when you're voting on money only, 51 percent rules. No filibuster allowed. You'll hear this referred to as \"reconcilliation.\"",
                            "created": "Fri, 29 Jan 2021 17:21:24 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "In 1975, they dropped it to 3/5 or 60 votes. ",
                            "created": "Fri, 29 Jan 2021 17:21:19 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Then a key change. The speaker who wants to hold up the vote didn't actually have to take the floor and do the speaking. They just said they would do it if they had to. That was enough to prevent majority rule. One senator. That's pretty fucked up if you ask me. BTW, they call this a \"virtual filibuster\" on the <a href=\"https://en.wikipedia.org/wiki/Filibuster_in_the_United_States_Senate\">Wikipedia page</a>. Cool.",
                            "created": "Fri, 29 Jan 2021 17:25:18 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "In 2013, they made it so that it didn't apply to confirming cabinet members and judges, except for Supreme Court judges. Only in Supreme Court confirmations would 60 votes be required, all other confirmations required 51. ",
                            "created": "Fri, 29 Jan 2021 17:21:36 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "And finally in 2017, they made it so it worked that way for Supreme Court judges too. ",
                            "created": "Fri, 29 Jan 2021 17:21:45 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "Sometimes it's the Repubs and sometimes the Dems that change the rules. It's a dance. When it's the Dems it's the Repubs who forced them to do it. Not so sure about the other way. The Repubs are the obstructionist and flamethrowing party. ",
                    "created": "Fri, 29 Jan 2021 17:33:13 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The Dems are Charlie Brown, the Repubs are Lucy. ",
                    "created": "Fri, 29 Jan 2021 19:23:41 GMT",
                    "inlineImage": "http://scripting.com/images/2021/01/29/charlieBrownAndLucyWithFootball.png",
                    "flInCalendar": true
                },
                {
                    "text": "Right now the filibuster can only be used for non-budgetary laws. There's a lot to that. For example, if  you wanted to overhaul health care in the US, you'd need a \"filibuster-proof\" majority which is a fancy way of saying you need 60 votes. Practically speaking neither party can get that many, so if it holds the current Congress can only pass legislation about money, and of course confirm judges. ",
                    "created": "Fri, 29 Jan 2021 17:43:57 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Anyway the TL;DR version is that they're whittling it down, and probalby next time, it'll go away altogether, going back to where they were before 1917. Simple majority rule, speaking time limited by rule, not vote. I think everyone understands that's the fair way to go. Otherwise 40 percent of the Senate, which often is much less than 40 percent of the people, can stop anything from happening. That's what happened during the Obama presidency when teh Repubs controlled the Senate, and they are poised to do it again. But this time the Dems have it in their power to nuke the filibuster, and end the tyranny of the minority. And if they have the votes and guts to do it, they should. Because someday soon the Repubs will do it, and the first to do it, gets the greatest reward. They can change things so that it's unlikely the Repubs ever get a majority in the Senate again. And since they have been a solid minority party for quite some time, it's time for their party to end. Regroup, come back to earth and try to get a majority of the votes. They'll have to stop being authocratic authoritarian conspiracy theorist nutjobs to get the votes, one would hope. :-)",
                    "created": "Fri, 29 Jan 2021 17:21:52 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Ideas may have to wait for their time",
            "created": "Fri, 29 Jan 2021 16:47:43 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "If I may boast a little, it's frustrating to know where things will eventually go, and wanting them to go there sooner, so we don't have to suffer while we're waiting. ",
                    "created": "Fri, 29 Jan 2021 16:47:45 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Podcasting was like that. If I tried to explain it to any of its most avid supporters today, back in 2004, they would have ignored it as the rantings of a crazy software developer.",
                    "flInCalendar": true
                },
                {
                    "text": "Now there's so much distance in time, and there are many more media things to do with networks, things that we need now. ",
                    "created": "Fri, 29 Jan 2021 16:48:15 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "But nothing's changed about listening. I can't get an idea on the air for the life of me. ;-)",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}