{
    "text": "January 30",
    "created": "Sat, 30 Jan 2021 15:48:37 GMT",
    "type": "calendarDay",
    "name": "30",
    "subs": [
        {
            "text": "Today's song: <a href=\"https://twitter.com/brooke/status/1355555659224215556\">Sweet Child O' Mine</a>.",
            "created": "Sat, 30 Jan 2021 16:39:00 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/brooke/status/1355555659224215556",
            "flInCalendar": true
        },
        {
            "text": "The pandemic came closer to me yesterday, I heard from a friend whose sister died of Covid. I feel lucky to have been vaccinated, but am confused about where we are now, and the future is still hard to have a feel for, or to even have a theory of. At least we have solid management on a national level, and that will help everyone, everywhere. The US never forgot how to be the US, even though we had an insane clown-like president for four years. The vaccine is here now, and more are on the way. And I know enough math to understand that the benefit of the vaccine starts as soon as one person is vaccinated. The more people who are immune, the slower the spread of the virus, complicated by its mutations which give it new power to evade. We're running a race now. At least we're <i>in</i> the race now. That's something. But think of all the unnecessary suffering and death we're leaving behind. Today, it has a more substantial meaning to me than it did just a couple of days ago. ",
            "created": "Sat, 30 Jan 2021 16:13:13 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/12/03/doctor.png",
            "flInCalendar": true
        },
        {
            "text": "BTW, when you get vaccinated you are told to sign on to a CDC website and create an account. I did that. I want everyone to know it looks very well done. They're going to use a government network to track progress of the vaccine. First smart thing I've seen from the government, with my own two eyes, since the pandemic started. ",
            "created": "Sat, 30 Jan 2021 16:17:38 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I <a href=\"http://scripting.com/2021/01/29.html#a215557\">lost</a> one of my AirPods. I can replace it for $89, or try something new, which is what I'll do. I'll let you know. In the meantime, I solved the problem with the crappy UI for the LG screen I bought <a href=\"http://scripting.com/2020/12/14/173714.html?title=myNewTv\">last month</a>. I bought the top-of-the-line <a href=\"https://www.amazon.com/gp/product/B08Q34DRLZ/ref=ppx_yo_dt_b_asin_title_o01_s00?ie=UTF8&psc=1\">Roku device</a>, plugged it in, and it gives the same great picture, and lets me control everything from the much more <a href=\"http://scripting.com/2019/04/17/144031.html\">elegant Roku remote</a>. I loaded on all the apps I need, including Fubo, which is not available for the LG, and after a few hours I realized why the Roku remote is so superior. There are so few buttons, and they're big enough, that I don't have to look at the remote to operate the UI. This is important for a TV where you use it in a dark room, ideally. Roku is the best. People say it's dated, I think it's really that it works, and that's what I want. ;-)",
            "created": "Sat, 30 Jan 2021 16:25:14 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I think some people think if you can develop software that you can't have interesting ideas in, or deep knowledge of, other topics. We're a mystery to them. People have no idea how the bits do their dance to make the things happen on the screen. So if we talk about politics or media, well there can't be much there. They won't look into that box. Interestingly, it seems our supposed ignorance also extends to how the computers work. They always have to get an expert who if they ever wrote software hasn't done so for 20 years. If this theory is true, can you imagine how much damage this ignore-ance is doing?",
            "created": "Sat, 30 Jan 2021 16:05:19 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Now you can get a <a href=\"https://bluecheckhomes.com/\">blue checkmark</a> for your home. Brilliant idea, and probably will be a hit. But I can't imagine putting one on my house. Come the revolution they'll round up people with the blue checkmarks. Let's not make it too easy for them.",
            "created": "Sat, 30 Jan 2021 16:04:16 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "What if they had blue checkmarks for people who pass a basic math literacy test. ",
            "created": "Sat, 30 Jan 2021 16:11:38 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "A newly elected congressperson says Jews shoot lasers from space to start fires on earth. Lots of news stories spell her distinctive name carefully. I swear I will try to not remember her name. Too late. I remember her name. Thanks journalism. Who’s killing democracy again?",
            "created": "Sat, 30 Jan 2021 15:48:38 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I read in a NY Times op-ed that we have to tax the rich to pay for pandemic relief. Not an income tax, which most would support, but an asset tax. So if your house has increased in value, you have to give the government money. Even if you didn’t sell it. There is no rule that you have to pay for the relief btw. The government prints money. There is no inflation, kind of the opposite pressure on the economy, we’re in a depression. Part of the reason for relief is to stimulate the economy. So a wealth tax could cause a stock market crash, I’m sure economic advisers would warn the president. All those rich people selling stock to pay the trillions in tax. Maybe we should tax people who write stupid op-ed in the NY Times instead. 🤪",
            "created": "Sat, 30 Jan 2021 15:49:03 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Biden sought unity, but he should not have connected it to bipartisanship. Unity means solving problems for the whole country, not just states that voted for him. That was Trump's CrazyTown USA. A total loser for Repubs. But the Repubs are the party built around one race supreme, über alles. They left a wide open field for the Dems. The Repub politicians, every one of them, are vestigial, members of a party with nowhere to go. Lost souls. You don't get bipartisan with <a href=\"https://www.youtube.com/watch?t=58&v=QUYKSWQmkrg&feature=youtu.be\">dead people</a>. We're in a loop here. Whites, if you insist on ruling, you lose. The \"others\" are even stronger in 2021 than they were in 1865.",
            "created": "Sat, 30 Jan 2021 17:48:01 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "It's so cold that my fingers and toes become numb when I go for a 40-minute walk. ",
            "created": "Sat, 30 Jan 2021 18:36:48 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I'm writing too much today.",
            "created": "Sat, 30 Jan 2021 17:40:46 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Turn a new leaf?",
            "created": "Sat, 30 Jan 2021 16:53:34 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Maybe our first vacations after the pandemic should be one of the following.  ",
                    "created": "Sat, 30 Jan 2021 16:53:40 GMT",
                    "flNumberedSubs": "true",
                    "subs": [
                        {
                            "text": "Charitable.  ",
                            "created": "Sat, 30 Jan 2021 16:53:56 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "About learning.  ",
                            "created": "Sat, 30 Jan 2021 16:54:02 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Spiritual.  ",
                            "created": "Sat, 30 Jan 2021 16:54:03 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Meditative.  ",
                            "created": "Sat, 30 Jan 2021 16:54:04 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Creating peace.   ",
                            "created": "Sat, 30 Jan 2021 16:53:57 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "And not drunken rituals.  ",
                    "flInCalendar": true
                },
                {
                    "text": "Maybe we should turn a new leaf when this is over, if it ever is.",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}