{
    "text": "Minding my dream",
    "created": "Sun, 16 Dec 2018 16:25:36 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "My subconscious had me dream something really odd last night. Not something I’d mind sharing publicly, but there is no place. I suppose it’s the kind of thing everyone who has lost both parents goes through. Probably something that goes back to before we were even human. But we are not so evolved that there is a proper online place for it. If I wrote a memoir, I could put the story in there. Nothing I’m even remotely ashamed of.",
            "created": "Sun, 16 Dec 2018 16:25:52 GMT",
            "image": "http://scripting.com/images/2018/12/16/handbook.png"
        },
        {
            "text": "So I'm going to tuck it away here in a corner of my blog. ",
            "created": "Sun, 16 Dec 2018 16:26:17 GMT"
        },
        {
            "text": "Here's the dream...",
            "created": "Sun, 16 Dec 2018 16:30:26 GMT"
        },
        {
            "text": "I'm lost and going back home. My glasses are broken. I'm trying to put them back together. (Note in the real world I don't need glasses any longer.) I'm walking along 32nd Ave a block away from my parents' house thinking about getting comfort from my father. Then I realize he's dead. No matter I'll have a nice talk with mom. Then boom, it hits me. She's dead too.",
            "created": "Sun, 16 Dec 2018 16:26:30 GMT"
        },
        {
            "text": "It's a terrible feeling. I get back to the house, but it's all different. There's a swimming pool out back, and a big guest house. It's dark. I can't see well. The glasses have seemingly repaired on their own, but it's a new design. My father's brother, my uncle Sam, is puttering about. He can't hear me. I can hear him but it's mumbling. I feel okay but lost. ",
            "created": "Sun, 16 Dec 2018 16:27:42 GMT"
        },
        {
            "text": "I wake up.",
            "created": "Sun, 16 Dec 2018 16:28:40 GMT"
        },
        {
            "text": "I seem to remember doing something like this before. Perhaps it takes a few tries before the knowledge permeates some deeper level? ",
            "created": "Sun, 16 Dec 2018 16:28:44 GMT"
        }
    ]
}