{
    "text": "November 1",
    "created": "Thu, 01 Nov 2018 14:43:47 GMT",
    "name": "01",
    "subs": [
        {
            "text": "I got the new <a href=\"#a150254\">monitor</a>. It's bigger than the old one. Bright. But interestingly nowhere near as nice as the Mac. I guess all <a href=\"https://www.apple.com/shop/buy-mac/imac-pro\">money</a> that buys you something. 🤠",
            "created": "Thu, 01 Nov 2018 16:52:59 GMT",
            "type": "outline"
        },
        {
            "text": "Why are we surprised when <a href=\"https://duckduckgo.com/?q=president+pussy+grabber&t=h_&ia=web\">President Pussy Grabber</a> makes the border the issue. Boundaries are his playground. He likes to violate them. Do you think once the troops are on the border, they might go into Mexico?",
            "created": "Thu, 01 Nov 2018 15:58:43 GMT",
            "type": "outline"
        },
        {
            "text": "I checked in with a friend from Berkeley yesterday about stuff I had been writing here. I felt yesterday's <a href=\"http://scripting.com/2018/10/30/174911.html\">piece</a> about Lakoff, family and framing was kind of a breakthrough. Lakoff's strict father vs nuturing mother, along with my recent realization that we as a society exist in a <a href=\"http://scripting.com/2018/09/29/001342.html\">soup</a> of abuse. She said something other people have said, she didn't come from an abusive family. I accept that. It's still true that abuse is the context of our lives. It's hidden. Kids are taught to cover for their parents. Yet abuse is viewed, in our discourse, as exceptional. Something that can be fixed by punishing a few people. It's not going to be that easy. Just look at how our political system has embraced not just a strict father, but an abusive one. People voted for him. Not because they're any of the things people say they are. They voted for him because he is, to them, comfortable and trustworthy. Now look at that and tell me abuse isn't the context we live in. It's meant to be a mathematical statement, btw. Not that we chose it, or deserve it. It is what it is.",
            "created": "Thu, 01 Nov 2018 15:09:45 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/11/01/soup.png"
        },
        {
            "text": "24 hours later and <a href=\"http://scripting.com/2018/10/31.html#a170639\">Dropbox</a> still has over <a href=\"http://scripting.com/images/2018/11/01/dropbox.png\">1.5 million files</a> to download. Files I already have here in my old Dropbox folder. Yesterday at this time it had 1.6 million files left. I guess it might be done by Christmas. :boom:",
            "created": "Thu, 01 Nov 2018 15:37:16 GMT",
            "type": "outline"
        },
        {
            "text": "I finally found something to buy that I'm genuinely excited about. I keep a second monitor to the left of my main screen. I think of it as a rear-view-mirror in a car. It's where I keep the status readouts, hit counters, server monitors, etc. I watch TV on that monitor (via Spectrum's website). Anyway, the monitor has, until now, been an old Apple screen from 2006 or so. I had bought it to go with my old Mac Pro. That old monitor can't plug into my new iMac Pro. So then I thought, let's buy a new one. Of course monitors have gotten a lot better and cheaper since 2006. The <a href=\"https://www.amazon.com/gp/product/B00IZBIMLK/ref=oh_aui_detailpage_o02_s00?ie=UTF8&psc=1\">new one</a> is going to be glorious, or so I think. Should arrive later today via Amazon. Watch this <a href=\"#a165259\">space</a>.",
            "created": "Thu, 01 Nov 2018 15:02:54 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/11/01/newMonitor.png"
        },
        {
            "text": "In April, I set up a <a href=\"http://newriver5.glitch.me/\">demo river</a> on <a href=\"https://glitch.com/\">Glitch</a>, an interesting development system for people getting started in Node. They don't charge to run your application, but if it isn't accessed frequently they put it to sleep, and wake it up next time it's accessed. Just for fun I tried installing River5. It works! And even better, here we are six months later, and the app is still running, and doing a great job of getting the news. I would have thoughth it would have to do a scan for new news when I accessed it, but it's been reading news all night. There must be other people using it? Not sure. But it's good. :rocket:",
            "created": "Thu, 01 Nov 2018 14:45:08 GMT",
            "type": "outline"
        },
        {
            "text": "An example of framing. People who are anti-abortion say they're \"pro-life.\" If you're pro-choice you could deny them their framing and call them anti-abortion. (It's more accurate since we're all pro-life. Even people who are pro-choice.) More <a href=\"http://scripting.com/2018/10/31/171035.html\">here</a>. ",
            "created": "Thu, 01 Nov 2018 14:43:48 GMT",
            "type": "outline"
        }
    ]
}