{
    "text": "November 3",
    "created": "Sat, 03 Nov 2018 13:11:19 GMT",
    "name": "03",
    "subs": [
        {
            "text": "The brilliance of the design of our government is that we can have a mini-revolution very two years and an all-out revolution every four. But we are too spoiled and lazy to get this. If we fail to overthrow our Repub masters on Tuesday, we deserve what comes next.",
            "created": "Sun, 04 Nov 2018 00:18:20 GMT",
            "type": "outline"
        },
        {
            "text": "When you want to remember how <a href=\"http://scripting.com/2014/10/26/rememberingMookie.html\">weird</a>, wild, wonderful and improbable reality can be, tune into the <a href=\"https://www.mlb.com/mets/video/bb-moments-grounder-to-buckner/c-3235125\">10th inning</a> of Game 6 of the 1986 World Series. ",
            "created": "Sat, 03 Nov 2018 13:37:20 GMT",
            "type": "outline"
        },
        {
            "text": "Dropbox is finished with its <a href=\"http://scripting.com/2018/11/02.html#a140427\">sync</a>. The new iMac Pro desktop is up to date. This caused its own problems. I edit my blog in an outliner that saves to a Dropbox-sync'd folder. This way I can use the same editor on my laptop when I'm traveling. I reloaded the editor this morning, the month of November was gone. I guess overnight Dropbox replaced the new version with the old version. It has missed the last few days of my work. Luckily I was also writing the OPML to a server, so I had a backup copy. I could have always re-entered the text from the website, so it wasn't ever in danger of being lost. Not sure what the moral of the story is. :boom:",
            "created": "Sat, 03 Nov 2018 13:26:26 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/11/03/accordionGuy.png"
        },
        {
            "text": "A post from Facebook in 2014",
            "created": "Sat, 03 Nov 2018 13:11:20 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "People are uncomfortable with male vulnerability.",
                    "created": "Sat, 03 Nov 2018 13:11:47 GMT"
                },
                {
                    "text": "Be strong, be a man, man up."
                },
                {
                    "text": "Be happy with what you have, but don't be too happy. :-)"
                },
                {
                    "text": "I don't mind being strong for others, being a source of protection, but inside I'm just like you. So are your sons and brothers and fathers and uncles."
                },
                {
                    "text": "We have to find a good compromise. A way to be true to who we are, and have people's expectations of who we are come closer to the reality.",
                    "created": "Sat, 03 Nov 2018 13:12:44 GMT"
                },
                {
                    "text": "See: <a href=\"https://www.facebook.com/dave.winer.12/posts/293577557516323\">Original post 11/3/2014</a>.",
                    "created": "Sat, 03 Nov 2018 13:12:46 GMT"
                }
            ]
        }
    ]
}