{
    "text": "November 9",
    "created": "Fri, 09 Nov 2018 14:58:34 GMT",
    "name": "09",
    "subs": [
        {
            "text": "A rambling 22-minute <a href=\"http://scripting.com/2018/11/09/electionRamblings.m4a\">podcast</a> on the <a href=\"http://scripting.com/2018/11/07/142734.html\">election</a>. Why it's important to savor victory. There was a lot of good news in Tuesday's results. Feel the winning. The political system might be killing us, but America, underneath it all, is still America. Most important, by giving the House to a party that will do real oversight, we re-asserted the control by the people over the government. Whether you support Trump or not, this has to be seen as good. ",
            "created": "Fri, 09 Nov 2018 15:58:50 GMT",
            "type": "outline",
            "enclosure": "http://scripting.com/2018/11/09/electionRamblings.m4a",
            "enclosureType": "audio/mpeg",
            "enclosureLength": "11020125",
            "image": "http://scripting.com/images/2018/11/09/obama.png"
        },
        {
            "text": "Obama should go on a victory tour now, hold rallies to drive home what we accomplished by showing up to vote. Host SNL. Visit with Jimmy Kimmel. Do an interview with the NYT. He's the one Democrat who can't be accused of campaigning for 2020. Solidify the message, we asked people to vote, and they did, and look what we accomplished. When I ran a company, I always made my sales people visit the distributors after we shipped a hit product. It wasn't for sales, it was to soak of the feeling of winning.",
            "created": "Fri, 09 Nov 2018 16:21:11 GMT",
            "type": "outline"
        },
        {
            "text": "Theory why Trump fired Sessions and appointed Whitaker now. They know Mueller is about to issue his report. They wanted to move first, do something, anything, to be able to say they were on top of it. It won’t work, he’s the <a href=\"https://www.youtube.com/watch?v=a8jphxpi1ro\">Keystone Kops</a> president.",
            "created": "Fri, 09 Nov 2018 17:41:08 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=a8jphxpi1ro"
        },
        {
            "text": "Are there any USB-C drives? I was sure there would be by now, but are there?? Can't find them on <a href=\"https://www.amazon.com/s/ref=nb_sb_noss_1?url=search-alias%3Daps&field-keywords=usb-c+drive\">Amazon</a>. What is USB-C good for?? (Update: LaCie has a <a href=\"https://www.amazon.com/LaCie-Porsche-Design-Photography-STFD2000400/dp/B01GV3FB4Y/ref=sr_1_8?ie=UTF8&qid=1541823455&sr=8-8&keywords=usb-c%2Bdrive&th=1\">2TB portable</a> USB-C drive. $90.)",
            "created": "Fri, 09 Nov 2018 16:25:51 GMT",
            "type": "outline"
        },
        {
            "text": "Heartbreak and trust",
            "created": "Fri, 09 Nov 2018 14:58:35 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Have you ever been in a failed friendship, relationship, business partnership? I'm beginning to think most people haven't, based on their willingness to forget that Trump is a lying con artist who is being blackmailed by Putin and probably a dozen other countries by now.",
                    "created": "Fri, 09 Nov 2018 14:58:48 GMT"
                },
                {
                    "text": "A friend posted: \"This will be an easily disproven lie\" about something Trump said. Please. It's like a wife who's sleeping around. Everyone knows but you (the spouse). Trump always lies. It's more interesting to try to prove he's not lying.",
                    "created": "Fri, 09 Nov 2018 14:58:58 GMT"
                },
                {
                    "text": "Moral of the story, with Trump, always --",
                    "created": "Fri, 09 Nov 2018 14:59:13 GMT",
                    "flNumberedSubs": "true",
                    "subs": [
                        {
                            "text": "He's a <a href=\"http://this.how/trolls/\">troll</a>.",
                            "created": "Fri, 09 Nov 2018 14:59:16 GMT"
                        },
                        {
                            "text": "Don't take the bait.",
                            "created": "Fri, 09 Nov 2018 14:59:16 GMT"
                        }
                    ]
                }
            ]
        }
    ]
}