{
    "text": "November 13",
    "created": "Tue, 13 Nov 2018 14:43:07 GMT",
    "name": "13",
    "subs": [
        {
            "text": "It's somewhat embarrassing to have all those <i>0 Likes</i> on <a href=\"http://scripting.com/2018/11/13.html\">my posts</a>, but I'm going to leave them there. It's a worthwhile <a href=\"https://github.com/scripting/Scripting-News/issues/102\">bootstrap</a> imho. It can lead somewhere if we want it to. ",
            "created": "Tue, 13 Nov 2018 15:22:23 GMT",
            "type": "outline",
            "fllikeable": "true"
        },
        {
            "text": "Something bothered me about <a href=\"https://www.cnn.com/2018/11/13/media/cnn-sues-trump/index.html\">CNN's protest</a> of their reporter being excluded from the White House. It took me a while to pinpoint. I guess they would like us to have their back -- but do they have ours? They do so many things that sell us out as they chase profit. It's as if they've found a way to monetize America's failure. Maybe one of these events will wake them up and they'll realize they aren't protected anymore than we are, and they should do what they can to halt our descent, even if it makes them lose money. Until they do that, I don't see why I should care whose reporters are in the White House carrying the Republican message. ",
            "created": "Tue, 13 Nov 2018 15:14:31 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/11/13/sam.png",
            "fllikeable": "true"
        },
        {
            "text": "As a language hacker I wonder if we could make a meme somehow happen where people think the word <a href=\"https://www.urbandictionary.com/define.php?term=Flake\">flake</a> came from <a href=\"https://en.wikipedia.org/wiki/Jeff_Flake\">Jeff Flake</a> instead of it being a coincidence.",
            "created": "Tue, 13 Nov 2018 16:10:39 GMT",
            "type": "tweet",
            "tweetId": "1062377512196599810",
            "tweetUserName": "davewiner"
        },
        {
            "text": "In January, House Dems should pass a bill that updates the Affordable Care Act to fix all that should have been fixed in 2014, and undoes the damage Repubs did. This is the platform for 2020.",
            "created": "Tue, 13 Nov 2018 14:43:08 GMT",
            "type": "outline",
            "fllikeable": "true"
        },
        {
            "text": "I was just telling a friend about Al Pacino's <a href=\"https://www.youtube.com/watch?v=myyWXKeBsNk\">speech</a> in <a href=\"https://en.wikipedia.org/wiki/Any_Given_Sunday\">Any Given Sunday</a>. I know a lot of people don't like sports movies but this one is the story of age, how the coach and the young quarterback (played by Jamie Foxx)  learn to work together. It's got all the schmaltz of typical sports movie. But the acting is so good, and the story simple and universal and heart-grabbing. Old people remember being young. We aren't young anymore, but we have experience and knowledge to offer, and when we work together the winning is so much sweeter. I would like the newly elected <a href=\"https://www.politico.com/story/2018/06/20/pelosi-democrats-candidates-midterms-655484\">Democrat reps</a> to watch this movie and work with Nancy Pelosi. She knows how to win. We have a really big problem to solve and we have to work together to solve it. If we don't work together, we'll die as individuals. ",
            "created": "Tue, 13 Nov 2018 14:49:27 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/11/13/patriots.png",
            "fllikeable": "true"
        },
        {
            "text": "Journalism's line separating us from them",
            "created": "Tue, 13 Nov 2018 18:19:52 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I think the problem with journalism in 2018 is that it relies on a centralized model, journalists who are paid salaries and everyone else  who pays to read what the salaried journalists produce. It's not all the way there yet, but it's close. ",
                    "created": "Tue, 13 Nov 2018 18:20:00 GMT",
                    "image": "http://scripting.com/images/2017/09/02/mrFrog.png"
                },
                {
                    "text": "But -- who really wants to read what the paid journalists write? And why? And what about the knowledge and perspectives of the readers, why are they wasted in this model? I understand why they were wasted in the pre-Internet world, because the cost of distribution was prohibitive, but that's no longer an issue. ",
                    "created": "Tue, 13 Nov 2018 18:20:11 GMT"
                },
                {
                    "text": "The standard answer, which I don't disagree with is how do you separate the wheat from the chaff? The repetitive rote stuff that just echoes what a few opinion leaders put out there versus original insights that could help us solve problems? But how does the system do it now? The columnists are very predictable, they're mostly rehashing the same themes over and over, applied to different events. And as <a href=\"https://en.wikipedia.org/wiki/Matt_Taibbi\">Matt Taibbi</a> says so well in this <a href=\"https://taibbi.substack.com/p/the-church-of-averageness-continued\">paywalled piece</a> (somehow accidentally I was allowed to read it) most of what they talk about in the news is pure bullshit. We knew that, but it's nice to hear someone on the other side of the paywall say it.",
                    "created": "Tue, 13 Nov 2018 18:21:09 GMT"
                },
                {
                    "text": "Ultimately that model is going to break because of their inability to do the corner-turn that the new technology has required of them since the web opened up. The turn is this: stop paying writers, and figure out how to find the good stuff in a sea of bullshit. The same problem everyone has and no one has an answer to. The news org that has the courage to tackle that problem, and solves it, will lead the consolidation, which will imho happen very quickly.",
                    "created": "Tue, 13 Nov 2018 18:23:26 GMT"
                }
            ]
        }
    ]
}