{
    "text": "November 15",
    "created": "Thu, 15 Nov 2018 13:42:08 GMT",
    "name": "15",
    "subs": [
        {
            "text": "I'm almost ready to ship the first release of my Likes server with an API for JavaScript running in the browser. I took time to get it right, I hope. Could be the beginning of something interesting! I'll do another review tomorrow before posting pointers.",
            "created": "Thu, 15 Nov 2018 20:30:47 GMT",
            "type": "outline",
            "fllikeable": "true",
            "image": "http://scripting.com/images/2018/11/15/obama.png"
        },
        {
            "text": "Given that Facebook is now known to be a shitshow, hopefully they can do a better job of peering with the open web so we have a way out, and aren’t betting the whole future of online discourse on it.",
            "created": "Thu, 15 Nov 2018 21:58:26 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://github.com/scripting/Scripting-News/issues/103\">Braintrust query</a>: Are you a member of <a href=\"https://decorrespondent.nl/\">De Correspondent</a> in the Netherlands? What, in your own words, makes it different from other news orgs? There's been a lot of hype as they start up in the US. It would be interesting to hear about it from a member's perspective. <i>Thanks!</i>",
            "created": "Thu, 15 Nov 2018 17:15:01 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=NTS09Wo1xhI\">Elvis Costello</a>: \"Don't bury me cause I'm not dead yet.\"",
            "created": "Thu, 15 Nov 2018 14:02:03 GMT",
            "type": "outline"
        },
        {
            "text": "People who climb the ladder don't want to hear that the ladder went nowhere.",
            "created": "Thu, 15 Nov 2018 14:20:23 GMT",
            "type": "outline"
        },
        {
            "text": "TFW you're at a board meeting and all the options suck but you decide do to something that can't work because you have to do <i>something.</i>",
            "created": "Thu, 15 Nov 2018 14:13:27 GMT",
            "type": "tweet",
            "tweetId": "1063072613709287424",
            "tweetUserName": "davewiner"
        },
        {
            "text": "I'm tired of being the audience. I want to be part of the news system. Not a passive part. Contributing experience, point of view, ability to write, and hope for our species to survive. To pass on what I know. To help. To be useful. All the models of news as an industry are meant to get us to give them money while lying to us that we're part of their process. Our job is to give them money and then chill while they run the world. I don't like how they're running the world. Maybe news wasn't meant to be an industry. Maybe it's a calling, a passion, a civic responsibility. No one pays you to vote or sit on a jury. We have to re-think news on a grand scale. And the news people refuse to do that.",
            "created": "Thu, 15 Nov 2018 13:46:22 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/11/15/butHerEmails.png"
        },
        {
            "text": "Worth isn't a function of money, or what others think of you. It's what you find when you look inside. That's what you're worth.",
            "created": "Thu, 15 Nov 2018 13:42:09 GMT",
            "type": "outline"
        }
    ]
}