{
    "text": "November 20",
    "created": "Tue, 20 Nov 2018 13:57:40 GMT",
    "name": "20",
    "subs": [
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1064920835507527680\">Poll</a>: Can the Republicans take control of the House? ",
            "created": "Tue, 20 Nov 2018 16:38:24 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1064920835507527680"
        },
        {
            "text": "I need a way to tell my watch that my back hurts and it should stop <a href=\"http://scripting.com/images/2018/11/20/watchNag.png\">nagging me</a>. I’ll get back on the program when it’s better.",
            "created": "Tue, 20 Nov 2018 14:15:30 GMT",
            "type": "outline",
            "fllikeable": "true"
        },
        {
            "text": "Tis the season to binge-watch. I started out with a depressing watch, <a href=\"https://en.wikipedia.org/wiki/Making_a_Murderer\">Making a Murderer</a>, season 2. (Small spoilers ahead.) It was a real slog. I kept watching because I wanted to know what happens, and I didn't want to find out by reading about it <a href=\"https://duckduckgo.com/?q=steven+avery+brendan+dassey&t=h_&iar=news&ia=news\">on the net</a>. It's very depressing, even more so than season 1. And complicated. After a while I started tuning out the complications, figuring they were telling the truth and that if it became significant, they would explain it all again. And the tedious interviews with the parents of the two prisoners. I thought maybe one of them would die? Spoiler: Not much happened. The best part was Avery's new attorney, <a href=\"https://duckduckgo.com/?q=Kathleen+Zellner&t=h_&iar=news&ia=news\">Kathleen Zellner</a>. I find her very interesting, smart, and if they did a show just about her I'd probably watch. I think the two families are permanently fucked and my opinion of the State of Wisconsin, which used to be very high (I went to UW-Madison, loved it) is now pretty low. ",
            "created": "Tue, 20 Nov 2018 13:57:41 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/11/20/bucky.png",
            "fllikeable": "true"
        },
        {
            "text": "So my back hurts, I just slogged through a depressing <a href=\"http://scripting.com/2018/11/20.html#a135741\">series</a>. It's cold and dreary in NYC. I hear about the new Coen Brothers movie, <a href=\"https://en.wikipedia.org/wiki/The_Ballad_of_Buster_Scruggs\">The Ballad of Buster Scruggs</a>, on <a href=\"https://www.netflix.com/title/80200267\">Netflix</a>, and it's getting good reviews from <a href=\"https://www.nytimes.com/2018/11/08/movies/the-ballad-of-buster-scruggs-review.html\">AO Scott</a> and a friend who knows me well. So I sit down to watch. It's weird, episodic, but a movie not a series. I had heard the <a href=\"https://en.wikipedia.org/wiki/Coen_brothers\">Coens</a> were working on a series. The first segment was funny, I actually lol'd a few times. The second was okay, but the third sent me in a tailspin of depression. Oh no this is not what I had in mind. I was hoping for Fargo or <a href=\"https://en.wikipedia.org/wiki/The_Big_Lebowski\">Lebowski</a>, but this makes No Country look like a fun dramedy. A few hours later I picked it up again, and it got better, way better. The segments were very Coen-ish, both funny and tragic. You know. Like the end of even the funniest Coen-y movies. I say go ahead and watch it, but if it's bumming you out, realize that's not all it's doing. The whole thing is a massive joke, on you.  :boom:",
            "created": "Tue, 20 Nov 2018 14:22:58 GMT",
            "type": "outline",
            "fllikeable": "true"
        },
        {
            "text": "Next up: The new <a href=\"https://www.netflix.com/title/80997085\">Narcos</a> series, in Mexico. ",
            "created": "Tue, 20 Nov 2018 14:34:11 GMT",
            "type": "outline"
        }
    ]
}