{
    "text": "November 24",
    "created": "Sat, 24 Nov 2018 14:43:54 GMT",
    "name": "24",
    "subs": [
        {
            "text": "New feature. The <a href=\"http://likes.scripting.com/\">home page</a> of my Likes server now includes a <a href=\"http://scripting.com/images/2018/11/24/topLikes.png\">list</a> of the 10 most-liked posts. Yes, I know titles would be nice to have. Most of my posts don't have titles. Also released a new version of the <a href=\"https://github.com/scripting/likes\">Likes server</a> with this feature included. ",
            "created": "Sat, 24 Nov 2018 16:44:59 GMT",
            "type": "outline",
            "image": "http://radio-weblogs.com/0001015/images/2002/11/28/turkey.gif"
        },
        {
            "text": "People who say they know what Facebook should do. How could they. Nothing like it has ever existed. It’s a miracle that it works at all. This is what I think when critics profess to know what’s wrong and how to fix it.",
            "created": "Sat, 24 Nov 2018 19:51:35 GMT",
            "type": "outline"
        },
        {
            "text": "I waited for a weekend to try this experiment. I wanted to see what would happen if I <a href=\"http://scripting.com/images/2018/11/24/deletedFiles.png\">nuked</a> the data folder on my main \"River5\" installation. So that's what I did today. You'll see the effect anywhere one of my rivers appears. For example, this is what <a href=\"http://podcatch.com/\">podcatch.com</a> <a href=\"http://scripting.com/images/2018/11/24/podcatchHomePage.png\">looks like</a> right now. Hopefully that will change when the next podcast shows up, and by Monday there should be a full complement. ",
            "created": "Sat, 24 Nov 2018 15:55:15 GMT",
            "type": "outline"
        },
        {
            "text": "When I use my own apps and Chrome shows <font color=\"red\" style=\"font-size: .9em\">NOT SECURE</font> in red, I realize they are warning me, not about my security but their intentions toward the web.",
            "created": "Sat, 24 Nov 2018 17:00:56 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1065267723519832064"
        },
        {
            "text": "An idea for a New Year's resolution. At least once a day agree with someone. Not silently. Say \"I agree with you.\" No qualification, not \"I agree with you, but..\" It's jarring at first, then liberating. And the responses will surprise you. ",
            "created": "Sat, 24 Nov 2018 14:43:55 GMT",
            "type": "tweet",
            "tweetId": "1066342105012994048",
            "tweetUserName": "davewiner"
        }
    ]
}