{
    "text": "November 26",
    "created": "Mon, 26 Nov 2018 15:44:09 GMT",
    "name": "26",
    "subs": [
        {
            "text": "New header image. A <a href=\"http://scripting.com/images/2018/11/26/fireplace.png\">burning log</a> in a fireplace, for the season. Previous image: <a href=\"http://scripting.com/images/2018/10/15/nighthawks.png\">Nighthawks</a> by Edward Hopper. ",
            "created": "Mon, 26 Nov 2018 22:13:56 GMT",
            "type": "outline"
        },
        {
            "text": "There should be a service that sends you the daily archive of my blog automatically via email the next morning. It should be totally turnkey. I would have nothing to do with it. It's a simple RSS application. Okay stupid question -- does such an application exist? ",
            "created": "Mon, 26 Nov 2018 18:36:52 GMT",
            "type": "tweet",
            "tweetId": "1067125392224518151",
            "tweetUserName": "davewiner"
        },
        {
            "text": "The new <a href=\"https://en.wikipedia.org/wiki/Narcos_(season_3)\">Narcos season</a> set in Mexico is terrible. Everything about it is awful. I kept watching because I wanted to understand how they could make something so bad. I think what they did is write down the arc of the various threads in the previous two seasons, and they just repeated the story with different characters. They have these idiotic conversations about characters you know nothing about and don't care about. Even the star, the new Pablo Escobar is a flat character. His old fat sidekick is terrible. I understood him in the first few scenes he appeared in, but then he became this crazy guy. The beauty of Narcos in previous seasons is that you could get into the head of Pablo Escobar and it made sense. You felt for him and each of the people around him, even though he was a monster. In the end of Season 3 there is one scene where the two main characters meet each other for the first and last time. That one scene was good. There was some truth in it. But otherwise it was a big fucking meh. So what. Even their stories about how <a href=\"https://www.maximumyield.com/definition/4378/sensimilla\">sensimilla</a> works were wrong. Couldn't they read the Wikipedia page and do a little fact checking? It's actually interesting science. ",
            "created": "Mon, 26 Nov 2018 18:08:36 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/11/26/narcos3.png"
        },
        {
            "text": "Had a great phone talk last night with <a href=\"https://en.wikipedia.org/wiki/Jon_Udell\">Jon Udell</a>. We've known each other for a long time. We went to the same conferences in the early days of the web. I read everything he wrote in his BYTE and Infoworld columns, which were the best. He's a clear thinker, super smart, and feels the web the same way I do. He's also a prodigous <a href=\"https://blog.jonudell.net/\">blogger</a>. If you follow me here on \"Scripting News\", you should add Jon's <a href=\"https://blog.jonudell.net/feed/\">feed</a> to your reader. :boom:",
            "created": "Mon, 26 Nov 2018 16:05:26 GMT",
            "type": "outline"
        },
        {
            "text": "Jon just posted an <a href=\"https://blog.jonudell.net/2018/11/25/the-reengineering-of-three-california-lakes/\">excellent piece</a> about the Salton Sea, Owens Valley and Mono Lake in California. As a longtime California resident, I've always been interested in how water is managed in the west, whose major cities have no water of their own. That's what happened to the water flowing off the eastern face of the <a href=\"https://en.wikipedia.org/wiki/Sierra_Nevada_(U.S.)\">Sierras</a>. ",
            "created": "Mon, 26 Nov 2018 16:17:04 GMT",
            "type": "outline"
        },
        {
            "text": "I recently switched from an iPhone 6S to an <a href=\"https://www.amazon.com/Apple-iPhone-Max-Fully-Unlocked/dp/B07HCTCMT7\">iPhone XS Max</a>. Along the way it never occurred to me that I was giving up my <a href=\"https://www.fastcompany.com/90270691/i-still-miss-my-headphone-jack-and-i-want-it-back\">headphone jack</a>. The 6S has one the XS does not. I guess it's less of an issue to me now because in 2018 it seems Bluetooth works reliably. Previous iPhones, headphones and speakers would lose their pairing regularly. This got super annoying when I'm out riding my bike, it means stopping and fiddling around with the phone while I really want to be moving. Eventually I gave up on Bluetooth for that application and went to a hard wire connection. The speakers all still have the headphone jack. Now I guess I'm entering a new frontier. But I still have my iPhone 6S in the <a href=\"http://scripting.com/images/2018/11/26/junkDrawer.png\">right top drawer</a> of my desk along with all the other obsolete hardware I couldn't manage to actually throw away. BTW, I love the XS. Not sure exactly why, but I do. :heart:",
            "created": "Mon, 26 Nov 2018 15:44:10 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/11/26/iphoneXsMax.png"
        },
        {
            "text": "Sorry this isn't capitalism",
            "created": "Mon, 26 Nov 2018 18:03:37 GMT",
            "type": "outline",
            "description": "It's a mess, a glorious human mess, that if left to grind it's way to completion leaves a dead planet in its wake.",
            "subs": [
                {
                    "text": "Here's where capitalism, such as it is, becomes ridiculous.",
                    "created": "Mon, 26 Nov 2018 18:03:49 GMT"
                },
                {
                    "text": "When people have enough money to pay for lavish lifestyles for themselves and generations of their offspring, what do they want? Orders of magnitude more money.",
                    "created": "Mon, 26 Nov 2018 18:05:11 GMT"
                },
                {
                    "text": "Fuck the earth, fuck everyone else.",
                    "created": "Mon, 26 Nov 2018 22:20:38 GMT"
                },
                {
                    "text": "I say \"such as it is\" because capitalism is an idea not reality. It can only exist when there's so much space between people they can't pool resources and don't need cops and courts to keep them from killing each other. ",
                    "created": "Mon, 26 Nov 2018 18:03:59 GMT"
                },
                {
                    "text": "And when technology is so backward that they can't create medicine or machines. After that it ain't capitalism anymore. It's a mess, a glorious human mess, that if left to grind it's way to completion leaves a dead planet in its wake. ",
                    "created": "Mon, 26 Nov 2018 22:20:59 GMT"
                }
            ]
        }
    ]
}