{
    "text": "We haven't won the war",
    "created": "Fri, 14 May 2021 15:35:57 GMT",
    "type": "outline",
    "description": "It's too early to declare victory over the virus. We haven't won.  ",
    "metaImage": "http://scripting.com/images/2021/05/14/missionAccomplished.png",
    "subs": [
        {
            "text": "It's too early to declare victory over the virus. We haven't won.  ",
            "created": "Fri, 14 May 2021 15:37:30 GMT",
            "flInCalendar": true
        },
        {
            "text": "It's like a Knicks game where they're leading going into the fourth quarter and then somehow the other team swings into high gear and gets through the Knicks defenses, and they win. It happens even in 2021 (the <a href=\"https://www.youtube.com/watch?v=RozIVdLmNpE\">Lakers game</a>, for example).",
            "created": "Fri, 14 May 2021 15:38:15 GMT",
            "flInCalendar": true
        },
        {
            "text": "They thought they had the virus licked in India, and then something happened, we don't even know yet what, the balance tipped and virus is winning big, and as a result their health system has collapsed and the near future is bleak.",
            "created": "Fri, 14 May 2021 15:38:22 GMT",
            "flInCalendar": true
        },
        {
            "text": "After the last year \"it can't happen here\" must be totally discredited right? ",
            "created": "Fri, 14 May 2021 15:39:04 GMT",
            "flInCalendar": true
        },
        {
            "text": "Anyway we do not get to declare victory now. It's not over.",
            "created": "Fri, 14 May 2021 15:39:08 GMT",
            "flInCalendar": true
        },
        {
            "text": "There are kids who can't be immunized, anticipating you'll say kids don't get sick -- that's wrong, they do, and we don't know the long-term effects, and kids are different from adults in that they <i>have</i> a long-term future. So we have to protect them.",
            "created": "Fri, 14 May 2021 15:39:27 GMT",
            "flInCalendar": true
        },
        {
            "text": "I have a friend who has had a kidney transplant. He got vaccinated, but the belief is that it doesn't do much for <a href=\"https://en.wikipedia.org/wiki/Immunosuppression\">immunosuppressed</a> people like my friend. Sentencing him to death because we don't want to wear masks sounds pretty harsh, and that's what it amounts to, if the virus is allowed to run wild. Which is, it seems to me, certain to happen now. There aren't enough vaccinated people to stop that from happening, imho.",
            "created": "Fri, 14 May 2021 15:40:18 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}