{
    "text": "Driving on a mountain road",
    "created": "Thu, 19 Sep 2024 13:14:38 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I was driving on a mountain road yesterday to pick up a pizza in a nearby town. I drive it fairly regularly, and I have a car that handles well so I drive at the speed limit or a little above. ",
            "created": "Thu, 19 Sep 2024 13:25:14 GMT",
            "image": "https://imgs.scripting.com/2019/06/03/tinaTheBearNurseFromBojackHorseman.png",
            "flInCalendar": true
        },
        {
            "text": "Still, what often happens on this road is some asshole tailgates, getting so close that if I hit the brakes suddenly they would have no time to react, and would slam into the rear of my car. And you do sometimes have to hit the brakes because animals appear on the road, deer, turkeys are common. Sometimes even bears. ",
            "created": "Thu, 19 Sep 2024 13:30:26 GMT",
            "flInCalendar": true
        },
        {
            "text": "I've never hit an animal, but I have come close.  ",
            "created": "Thu, 19 Sep 2024 13:29:12 GMT",
            "flInCalendar": true
        },
        {
            "text": "There's no way to pass on this road. ",
            "created": "Thu, 19 Sep 2024 13:26:15 GMT",
            "flInCalendar": true
        },
        {
            "text": "I've been in the other driver's place when a tourist is driving 30 in a 45 mph zone, and what do you do? Keep your distance and don't freak out. It's perfectly legal to go 30 in a 45 mph zone. ",
            "created": "Thu, 19 Sep 2024 13:26:40 GMT",
            "flInCalendar": true
        },
        {
            "text": "Anyway I slow down, to send a signal to the other driver, and also to mitigate damage if there is an accident. This asshole leans on their horn. I slow down more. ",
            "created": "Thu, 19 Sep 2024 13:26:59 GMT",
            "flInCalendar": true
        },
        {
            "text": "And when I come to a stop sign I come to a full stop and pause, thinking okay they'll pass me now, and I'll get a chance to see who this asshole is. They stayed behind and leaned on the horn again.  ",
            "created": "Thu, 19 Sep 2024 13:27:21 GMT",
            "flInCalendar": true
        },
        {
            "text": "When we come to the next stop sign, it's the end of the road and you can go left or right. I'm going right, they're going left, and the road is wide so the asshole pulls up to the left of me and I look over and see a middle-aged woman, could be a teacher or a nurse. I was amazed. The last kind of person I would expect to make such a scene. ",
            "created": "Thu, 19 Sep 2024 13:27:33 GMT",
            "flInCalendar": true
        },
        {
            "text": "If I had a chance I would have asked what the hell they were doing. ",
            "created": "Thu, 19 Sep 2024 13:27:57 GMT",
            "flInCalendar": true
        },
        {
            "text": "BTW, I don't speed on these roads because I like driving them, I love the mountains, and the fresh air, and I wasn't in any kind of a hurry. It's not uncommon to get a tailgater but usually they take the hint when I slow down and add a few car lengths between us. ",
            "created": "Thu, 19 Sep 2024 13:28:03 GMT",
            "flInCalendar": true
        },
        {
            "text": "One of the reasons I have a blog is so I have a place to write these stories. :smile:",
            "created": "Thu, 19 Sep 2024 13:28:23 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}