{
    "text": "ChatGPT can level the playing field",
    "created": "Thu, 24 Apr 2025 13:30:28 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "There's a company that I have an account with because they're the only ones who provide the service I need, so I have to stay with them. They have made my telephone unusable, they call me all the time from varying phone numbers, wanting me to do things, or with a \"courtesy reminder\" that I could spend more money with them. My number is a cell phone btw. On my user profile on their site, I unchecked <i>phone</i> as a way for them to contact me, only leaving email checked. They appear to be ignoring this. My question is this -- how do I get their attention and get them to stop calling me. The constant interruptions are interfering with my life and work.",
            "created": "Thu, 24 Apr 2025 13:30:37 GMT",
            "flInCalendar": true
        },
        {
            "text": "That was a ChatGPT prompt. It gave me lots of options, but two were outstanding.",
            "created": "Thu, 24 Apr 2025 13:32:20 GMT",
            "flBulletedSubs": "true",
            "subs": [
                {
                    "text": "First, they knew their privacy account, and a form on their website for reporting privacy violations. ",
                    "created": "Thu, 24 Apr 2025 13:32:41 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "They suggested I use commands in my cell phone to block unknown numbers. ",
                    "created": "Thu, 24 Apr 2025 13:33:13 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "I hadn't thought of doing this until today. Usually the big companies have all the power. They can force you to call them back and wait on hold and then it's not clear they'll even understand or respect the request. ChatGPT also suggested the FTC (heh I doubt if it can do much with Trump as president) or the state Attorney General (we still have a government in NY). ",
            "created": "Thu, 24 Apr 2025 13:34:09 GMT",
            "flInCalendar": true
        },
        {
            "text": "So think about it next time you have trouble with a megamonolithic company that's bullying you. We may have a tool at our disposal that levels the playing field.",
            "created": "Thu, 24 Apr 2025 13:35:41 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}