{
    "text": "I was going to choose <a href=\"https://heathercoxrichardson.substack.com/\">Heather Cox Richardson</a> as my <a href=\"http://daytona.scripting.com/?q=Blogger%20of%20the%20Year&collection=scriptingnews\">Blogger of the Year</a>. She didn't start blogging this year, but this is the year I started <a href=\"http://daytona.scripting.com/?q=heather%20cox%20richardson&collection=scriptingnews\">reading her</a> daily posts, and I found them valuable and quite bloggy. I also loved her weekly <a href=\"https://podcasts.voxmedia.com/show/now-then\">podcast</a>.  But in one of the latest nightly posts she writes about <a href=\"http://daytona.scripting.com/?q=smoking%20gun&collection=scriptingnews\">smoking guns</a> as if we don't already know the extent of Trump's involvement in the January 6 coup. This general lack of courage on the part of the establishment press and politics is putting our future at great risk. The question isn't whether there's enough evidence to indict every member of the Trump Administration at the end of 2020 and early 2021, but rather why isn't the DoJ led by the supposedly courageous <a href=\"http://daytona.scripting.com/?q=Merrick%20Garland&collection=scriptingnews\">Merrick Garland</a> doing anything to save the republic! When is it going to happen? And what are they afraid of. I think at the end of 2021 a blogger of the year should be grounded in reality. Our patience is long exhausted. Maybe a Civil War is inevitable. Maybe the original Civil War never ended. But I know this, I'd rather have the war while Abraham Lincoln (as played by Joe Biden) is president than <a href=\"https://en.wikipedia.org/wiki/Jefferson_Davis\">Jefferson Davis</a> (Donald Trump). So let's say, for now, there is no Blogger of the Year for 2021. It should have been Heather Cox Richardson, and maybe if she stands up for the republic we can amend the record in 2022. ",
    "created": "Thu, 30 Dec 2021 14:37:22 GMT",
    "type": "outline",
    "image": "http://scripting.com/images/2021/12/30/jeffersonDavis.png",
    "imageLink": "https://en.wikipedia.org/wiki/Jefferson_Davis",
    "flInCalendar": true
}