{
    "text": "Why we call the upper chamber of our legislature <i>The Senate</i>",
    "created": "Thu, 15 Jun 2017 19:11:43 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Tech people often choose different names for well-understood concepts that already have well-known names. But outside of tech there are concepts that have names, like the characters in the Bible or Quran, where continuity and prior art were so important that they used the same characters and names, \"cross-platform,\" for centuries. ",
            "created": "Thu, 15 Jun 2017 19:12:13 GMT",
            "image": "http://scripting.com/images/2017/06/15/caesar.png",
            "permalink": "http://scripting.com/2017/06/15.html#a030613"
        },
        {
            "text": "I was just discussing the California state senate with Bram Cohen on Facebook. (No links to Facebook, sorry.) So in California they call the state senate the senate not some other word like guffmab (made up word). How did they come up with this name? Well most states had two-chamber legislatures, and they were mostly called the senate and assembly. Since California was a relative latecomer to the union, even though it has always been an innovative and different place, they went with the established conventions.",
            "created": "Thu, 15 Jun 2017 19:13:45 GMT",
            "permalink": "http://scripting.com/2017/06/15.html#a030645"
        },
        {
            "text": "And all those previous states were of course copying the US government, which called its upper chamber the senate too. For some reason they didn't all go with the name of the lower chamber, there must be an interesting story to go with that. ",
            "created": "Thu, 15 Jun 2017 19:14:44 GMT",
            "permalink": "http://scripting.com/2017/06/15.html#a030644"
        },
        {
            "text": "Anyway, of course the founders of the United States used prior art, copying <a href=\"https://en.wikipedia.org/wiki/Roman_Senate\">ancient Rome</a>, which called the upper chamber of their legislature the Senate, going all the way back to 753 BC. Why not. Everyone knew what a senate was, why not leverage that, keep confusion down, help people feel comfortable. In tech we'd call this interop. :cat:",
            "created": "Thu, 15 Jun 2017 19:15:24 GMT",
            "permalink": "http://scripting.com/2017/06/15.html#a030624"
        },
        {
            "text": "Now the American founders could have said hey Rome is defunct, they're all dead, and the United States is going to be much bigger than Rome ever was, so we can come up with a new name and no one will miss the old one. But they didn't think that way. Using the Roman name gave a familiarity and legitimacy to what they were doing that a new name couldn't have. ",
            "created": "Thu, 15 Jun 2017 19:17:35 GMT",
            "permalink": "http://scripting.com/2017/06/15.html#a030635"
        }
    ],
    "permalink": "http://scripting.com/2017/06/15.html#a030643"
}