{
    "text": "The Internet is going the wrong way",
    "created": "Thu, 10 May 2018 13:35:13 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "<b>Evidence</b>",
            "created": "Thu, 10 May 2018 13:40:31 GMT",
            "subs": [
                {
                    "text": "Click a link in a web browser, it should open a web page, not try to open an app which you may not have installed. This is what Apple does with podcasts and now news.",
                    "created": "Thu, 10 May 2018 13:35:19 GMT"
                },
                {
                    "text": "Facebook is taking the place of blogs, but doesn't permit linking, styles. Posts can't have titles or include podcasts. As a result these essential features are falling into disuse. We're returning to AOL. Linking, especially is essential.",
                    "created": "Thu, 10 May 2018 13:36:00 GMT"
                },
                {
                    "text": "Google is forcing websites to change to support HTTPS. Sounds innocuous until you realize how many millions of historic domains won't make the switch. It's as if a library decided to burn all books written before 2000, say. The web has been used as an archival medium, it isn't up to a company to decide to change that, after the fact. ",
                    "created": "Thu, 10 May 2018 13:36:54 GMT"
                },
                {
                    "text": "Medium, a blogging site, is gradually closing itself off to the world. People used it for years as the place-of-record. I objected when I saw them do this, because it was easy to foresee Medium pivoting, and they <a href=\"http://www.niemanlab.org/2018/05/medium-abruptly-cancels-the-membership-programs-of-its-21-remaining-publisher-partners/\">will</a> <a href=\"https://www.techmeme.com/#a180510p16\">pivot again</a>. The final pivot will be when they go off the air entirely, as commercial blogging systems eventually do. ",
                    "created": "Thu, 10 May 2018 13:39:18 GMT"
                }
            ]
        },
        {
            "text": "<b>Instead</b>",
            "created": "Thu, 10 May 2018 13:40:34 GMT",
            "subs": [
                {
                    "text": "We should preserve the past on the web, and learn to make sites even more future-safe. The web is where human knowlege accumulates. ",
                    "created": "Thu, 10 May 2018 13:40:36 GMT"
                },
                {
                    "text": "It's time for tech people to have values, as journalism, medicine and law do. Deliberately taking features out of the web, claiming pieces of the web as corporate property, forcing the history offline, all are terrible abuses of what make the Internet great. An ethical technologist would refuse to do this work.",
                    "created": "Thu, 10 May 2018 13:45:12 GMT"
                },
                {
                    "text": "When we teach people to create technology, they should learn to respect and enhance the things that make the Internet great, not help modern day <a href=\"https://en.wikipedia.org/wiki/Robber_baron_(industrialist)\">robber barons</a> appropriate them. ",
                    "created": "Thu, 10 May 2018 13:42:38 GMT"
                },
                {
                    "text": "The Internet is a place for the people, like parks, libraries, museums, historic places. It's okay if corporations want to exploit the net, like DisneyLand or cruise lines, but not at the expense of the natural features of the net. ",
                    "created": "Thu, 10 May 2018 13:43:44 GMT"
                }
            ]
        }
    ]
}