{
    "text": "What is Frontier?",
    "created": "Thu, 30 Mar 2023 16:26:31 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "<i>Disclaimer: This was written by my personal chatbot, obviously based on things I have written. It's pretty good, even though some of its facts are wrong, and includes some ideas I never came up with but make sense. I've never put it together this concisely though, so it points to another use for chatbots, distilling a lot of data into a few paragraphs, which you can then edit to make come out like you want it to.</i>",
            "created": "Thu, 30 Mar 2023 16:27:19 GMT",
            "flInCalendar": true
        },
        {
            "text": "Frontier is a software environment developed by UserLand Software in the late 1990s (Note: development actually started in 1988). It was designed to be a high-level scripting environment that combined an outliner-based editor, an object database, and an integrated scripting language. Frontier was used to build a variety of web-based applications and services, including content management systems, blogging platforms, and syndication tools.",
            "created": "Thu, 30 Mar 2023 16:26:50 GMT",
            "flInCalendar": true
        },
        {
            "text": "At its core, Frontier is an outliner-based environment that allows users to create and manipulate hierarchical outlines of information. These outlines can be used to store and organize data, as well as to create scripts and macros that automate tasks within the environment. Frontier also includes an object database that allows developers to store and retrieve data in a structured way, as well as an integrated scripting language that can be used to create custom applications and services.",
            "flInCalendar": true
        },
        {
            "text": "Frontier was a pioneering platform in the early days of the web, and it played a key role in the development of many of the technologies that we take for granted today, including RSS syndication and web-based content management systems. While Frontier is no longer actively developed, its legacy lives on in many of the tools and technologies that we use today.",
            "created": "Thu, 30 Mar 2023 16:27:09 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}