{
    "text": "March 6",
    "created": "Sat, 06 Mar 2021 14:41:49 GMT",
    "type": "calendarDay",
    "name": "06",
    "subs": [
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1368212762493673475\">Poll</a>: Do you like the idea of using email to write for your blog?",
            "created": "Sat, 06 Mar 2021 14:52:19 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://en.wikipedia.org/wiki/Non-fungible_token\">NFT's</a> are kind of like that <a href=\"https://en.wikipedia.org/wiki/The_Million_Dollar_Homepage\">million-pixel-page</a> project from the 90s, only you can have an infinite number of them.",
            "created": "Sat, 06 Mar 2021 16:40:59 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "One of the reasons I love writing for the blog is that I've made the best software for me for editing it. I didn't make it for anyone else. I know of one person who has adapted it for his own use, that's it. The software still is far from as good as it could be. It needs the one feature my old outliner in Frontier had, scriptability. I need to get outside the limits of the JavaScript environment in the browser and on the server, while relying on the software I've built so far, to define a new <a href=\"http://scripting.com/stories/2008/04/19/suspensionOfDisbeliefAppli.html\">virtuality</a> that is perfectly scriptable. To exist at a higher level, both as a writer and a developer. I've been to the top of this mountain before, but this time I'm taking a different path to the top. And maybe it isn't even the same mountain. That's what makes these writing/software explorations so interesing, and risky. :boom:",
            "created": "Sat, 06 Mar 2021 14:44:18 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/03/06/charlieChaplin.png",
            "flInCalendar": true
        },
        {
            "text": "I like Chris Lydon who does the <a href=\"https://radioopensource.org/\">Radio Open Source</a> podcast. In this week's <a href=\"https://radioopensource.org/plague-year-two/\">episode</a>, interviewing an expert on pandemics, he exclaimed \"Oy oy oy,\" almost wearily. Now Chris is nice, as I said, but he’s a total <a href=\"https://en.wikipedia.org/wiki/Goy\">goy</a>, so it was LOL funny to hear him say that phrase. Oy!",
            "created": "Sat, 06 Mar 2021 14:59:04 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I want to know more about who the listeners are for the <a href=\"https://radioopensource.org/\">Radio Open Source</a> podcast. I bet they're amazing. I'd start by asking listeners to send in a photo of where they listen to the podcast. We'd publish them (after reviewing to be sure they're safe for work). It'd be quite a conversation starter. They have a Disqus comment section on the blog, and they get some comments. ",
            "created": "Sat, 06 Mar 2021 15:07:22 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Key fact: Every time someone gets infected, the virus has another chance to mutate and thereby get around our vaccines. So it's in all our interests to reduce the number of infections, to slow mutations. Does this make sense? Somewhere in my education, I don't remember where, they taught me to think like this. Two or more processes that interact happening at the same time. It's reality. We're in a contest with the virus. It won for many months, and it's still winning, but now we have a strategy for slowing its growth. We will not eliminate it. These are basic facts most people haven't begun to absorb. ",
            "created": "Sat, 06 Mar 2021 14:41:50 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/09/01/pumpItUp.png",
            "flInCalendar": true
        },
        {
            "text": "I don't like the Holier Than Thou BS of the Democratic Party. If the <a href=\"https://nymag.com/intelligencer/2021/03/how-never-trumpers-are-becoming-pro-democracy-republicans.html\">Never Trumpers</a> form a new party, I might join up. I'd like a party that endorses only two things, 1. the Constitution and 2. a return to majority rule. All other issues, up to the individual to decide.",
            "created": "Sat, 06 Mar 2021 15:02:47 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}