{
    "text": "March 8",
    "created": "Mon, 08 Mar 2021 13:22:01 GMT",
    "type": "calendarDay",
    "name": "08",
    "subs": [
        {
            "text": "<a href=\"https://en.wikipedia.org/wiki/Non-fungible_token\">NFTs</a> are easy to understand. It's like buying a work of art to hang in your house. Everyone else can have a print. The print is just as beautiful, but the original can possibly appreciate in value. It's controversial because it uses the blockchain (probably the first time I've used that word on this blog) which uses a lot of energy. Isn't there a way to achieve the same without that cost? ",
            "created": "Mon, 08 Mar 2021 13:28:29 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/08/05/norm.png",
            "flInCalendar": true
        },
        {
            "text": "I'm thinking about selling one of <a href=\"https://cyber.harvard.edu/blogs/gems/crimson1/fridayDave.mp3\">my first podcast</a>s, the one that got the ball rolling, that started my series of <a href=\"http://morningcoffeenotes.com/\">Morning Coffee Notes</a> podcasts, and then inspired a community to develop, which caused more podcasts and on and on. People are dismissive of NFTs, and critical, but there's been no other way for a maker of new media types such as myself to get credit for our creations. Looking back, I certainly would have led the bootstrap of podcasting, even if I didn't get credit for it, someone had to do it, we needed to use the internet for audible expression and no one else seemed able to do it. But I'd like young people to know how these things work, they don't have to start companies to make a significant contribution. They can stay in their art. ",
            "created": "Mon, 08 Mar 2021 13:35:39 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1368902132229869576\">Poll</a>: Are you watching more cable news since Biden took office?",
            "created": "Tue, 09 Mar 2021 00:43:59 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "It took a while for me to get how common <a href=\"https://en.wikipedia.org/wiki/Gaslighting\">gaslighting</a> is. If someone says, in a discussion, that you're upset, they're gaslighting. It's wrong because: 1. They have no insight into how you feel. 2. They're changing the subject. Gaslighting is insidious. ",
            "created": "Mon, 08 Mar 2021 14:19:22 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/08/02/moscowMitchButton.png",
            "flInCalendar": true
        },
        {
            "text": "A bit of advice to people who want a vaccine but aren't yet eligable. It pays to hang around places that do vaccinations near closing time, because they're required to get extra vaccines into people's arms, if they don't they're wasted. There are, apparently, lots of cancellations and no-shows in some places, so your chances are  getting better all the time. Just want to be sure everyone knows. ",
            "created": "Mon, 08 Mar 2021 13:22:02 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "For ten points use the word <a href=\"http://thesaurus.land/?word=ablution\">ablution</a> in a sentence. ",
            "created": "Tue, 09 Mar 2021 00:42:43 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Welcome to social media. A person who does not understand humor will contact you shortly. ",
            "created": "Tue, 09 Mar 2021 00:40:07 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}