{
    "text": "March 9",
    "created": "Tue, 09 Mar 2021 14:33:16 GMT",
    "type": "calendarDay",
    "name": "09",
    "subs": [
        {
            "text": "<a href=\"https://nymag.com/intelligencer/2021/03/why-dr-michael-olsterholm-delayed-his-second-vaccine-shot.html\">Osterholm's new prediction:</a> More virulent variants will likely kick off a surge in cases and deaths in the U.S. in a matter of weeks—just as most states lift restrictions. ",
            "created": "Tue, 09 Mar 2021 15:14:30 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "If Osterholm's analysis is right, and it seems likely, the virus is going to explode again soon. What a difference it would make if we had a leader who could do fireside chats and keep us all directed in the most positive way,  as [%search: Cuomo%] did last year. Biden is doing the right things, but he doesn't have a good fireside manner. Cuomo was one-in-a-generation. I think that is now impossible. I think ultimately this was a product of very bad judgment on his part and journalism without perspective. ",
            "created": "Tue, 09 Mar 2021 15:27:17 GMT",
            "image": "http://scripting.com/images/2020/06/18/whoMasksAreFor.png",
            "flInCalendar": true
        },
        {
            "text": "The new <a href=\"http://scripting.com/images/2021/03/09/bronxScienceEntrance.png\">header graphic</a> on my <a href=\"http://scripting.com/2021/03/09.html\">blog</a> is a picture of the entrance to the <a href=\"https://en.wikipedia.org/wiki/Bronx_High_School_of_Science\">Bronx High School of Science</a>, where I went many years ago. The legend was <a href=\"https://thesciencesurvey.com/photography/2020/04/14/the-bronx-science-mural/\">the</a> <a href=\"http://scripting.com/images/2021/03/09/mural.png\">mural</a>, showing great scientists of the past, was what we got instead of a pool. We also noticed that the test tube in <a href=\"https://www.haydenplanetarium.org/tyson/photos/2002-10-city-of-stars/bronx-high-school-science.php\">Marie Curie's</a> hand was actually floating in air. Maybe after all these years they've fixed that bug. :smile:",
            "created": "Tue, 09 Mar 2021 23:38:13 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "How can we build <a href=\"https://twitter.com/MaddowBlog/status/1369139051740151814\">public health infrastructure</a> if the next time there's a Republican administration they'll dismantle and gut it.",
            "created": "Tue, 09 Mar 2021 17:01:00 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://www.audible.com/\">Audible</a> has a collection of books that members can listen to for free. So I downloaded a bunch of classics I read in school to see if I wanted to read any of them again. 1984. Brave New World. And <a href=\"https://en.wikipedia.org/wiki/Adventures_of_Huckleberry_Finn\">The Adventures of Huckleberry Finn</a>. I started reading it, and the racial slur that got <a href=\"https://donaldgmcneiljr1954.medium.com/nytimes-peru-n-word-part-four-what-happened-in-peru-2a641a9b5e83\">Donald McNeil</a> fired is all through the first chapter. A dozen times probably. It's really hard to listen to, so I stopped reading it. ",
            "created": "Tue, 09 Mar 2021 14:45:35 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Let this <a href=\"http://scripting.com/images/2021/03/09/dontShareRage.png\">cartoon</a> guide you when you want to share rage. Don't.",
            "created": "Tue, 09 Mar 2021 14:54:54 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "My kitchen is mine",
            "created": "Tue, 09 Mar 2021 14:33:17 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2021/03/09/kitchen.png",
            "subs": [
                {
                    "text": "The most amazing thing happens when woman friends visit. They take over my kitchen. Move things around. Hide them. Put things in places they don't belong. Sometimes I find them years later.",
                    "created": "Tue, 09 Mar 2021 14:33:28 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I got so used to it, and btw angered about it, that I tried to make a deal with my aunt when she and my uncle came to visit when I lived in <a href=\"https://en.wikipedia.org/wiki/Woodside,_California\">Calif</a>. I said if you tell me why you want to do it, I'll let you. (At least they asked, I think that was probably my uncle's influence, I should have asked him why they asked, usually they don't, they just start doing). Anyway, when I made the offer Aunt Marsha said nothing and went ahead and started cleaning and reorganizing.  ",
                    "created": "Tue, 09 Mar 2021 14:59:10 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It. Happens. All. The. Time. And I hate it. I fucking hate it. I tell them this before they do it. I tell them while they're doing it. I warn them, don't mess with the kitchen, after they've done it, and they do it again. Oy.",
                    "created": "Tue, 09 Mar 2021 14:34:52 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "So here's what it says to me. ",
                    "created": "Tue, 09 Mar 2021 19:48:26 GMT",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "We like our men incapable of taking care of themselves.",
                            "created": "Tue, 09 Mar 2021 19:48:18 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "You are a man, therefore you cannot take care of yourself.",
                            "created": "Tue, 09 Mar 2021 19:48:18 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "I will do it for you. ",
                            "created": "Tue, 09 Mar 2021 19:48:23 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "Now on their side -- I don't think there's much thought to it. I think I am invisible to them. Not a factor. Subconsciously somehow they got the idea that there is no woman who owns this kitchen therefore I do. ",
                    "flInCalendar": true
                },
                {
                    "text": "I've asked many times if they would do this to a woman friend, come for a visit and start rearranging and cleaning their kitchen. No one has said yes, but I think some of them actually do it. But most won't because it's such a sign of disrespect. I guess maybe they can see other women. Or they can relate to it, they can imagine how they would feel if their friend tried to take over <i>their</i> kitchen. ",
                    "created": "Tue, 09 Mar 2021 14:35:59 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I can't speak for all men (and neither can you btw) but some of us want powerful and capable women friends. People who have big positive ideas and try to do their part to help. More than anything what we want from women is to be seen as real people. ",
                    "created": "Tue, 09 Mar 2021 23:35:43 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Let's help each other, and start by giving us all the benefit of the doubt, and assume we mean well and can and want to take care of ourselves. ",
                    "created": "Tue, 09 Mar 2021 14:37:57 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Why is her success about her ex?",
            "created": "Tue, 09 Mar 2021 23:36:19 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Her ex is an asshole, obviously.",
                    "created": "Tue, 09 Mar 2021 14:37:30 GMT",
                    "inlineImage": "http://scripting.com/images/2021/03/09/sheSpokeToHerEx.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}