{
    "text": "March 12",
    "created": "Fri, 12 Mar 2021 15:18:34 GMT",
    "type": "calendarDay",
    "name": "12",
    "subs": [
        {
            "text": "I've discovered I really enjoy writing verb docs. how weird, i used to hate it. i hired someone to do it <a href=\"http://docserver.userland.com/\">for Frontier</a>. But now it's like playing a game. I keep wanting to do another verb. ",
            "created": "Fri, 12 Mar 2021 21:41:19 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The pandemic is very much not over. <a href=\"https://mobile.reuters.com/article/amp/idUSKBN2B41FM\">Italy is locking down over Easter</a>. We all know what's happening. And again, the US is largely going exactly the wrong way. We're mistaking feelings for reality. It feels like spring is here, and it's time to emerge from hibernation. It's the wrong impulse. If you use your mind, you can see the feelings are wrong. Adults do the right thing anyway. Look at Italy. Smart. ",
            "created": "Fri, 12 Mar 2021 18:06:52 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Why I wanted the vaccine",
            "created": "Fri, 12 Mar 2021 16:07:15 GMT",
            "type": "outline",
            "description": "I was horrified to think of dying alone, suffocating, feeling awful, surrounded by people who were overworked and exhausted.",
            "metaImage": "http://scripting.com/images/2021/03/12/covidHospital.png",
            "subs": [
                {
                    "text": "I have a friend who I have known for a long time, who I love very much, who is one of the smartest people I know, who I would trust with my life, who says she does not want the vaccine. I have told her I'm going to write about it, without naming her, because the goal isn't to shame her, not even slightly, but rather to explore why I was enthusiastic to receive the vaccination, and to be open about it, to share my thoughts and experiences.",
                    "created": "Fri, 12 Mar 2021 16:06:02 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "First, why I wanted the vaccine. The main reason: I was horrified to think of dying alone, suffocating, feeling awful, surrounded by people who were overworked and exhausted. Your body is theirs. Your life is in their hands. ",
                    "created": "Fri, 12 Mar 2021 16:08:17 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Hospitals are harsh places. It's never quiet, the lights are always on, people come and go at all times. You're in pain, weak, and groggy from the meds they give you, and you have to grapple with whatever the future holds for you. I've been there myself, with parents who were gravely ill, this is not a place you want to go in good times, and it most definitely is not a place to be during a pandemic, where the odds of survival, if you're sick enough to be in the hospital, are awful. 1 in 10, say. So you're lying there, feeling terrible, with no one to help your soul through the most difficult thing a person has to do, knowing you're almost certainly not getting out of there alive. The fear of dying that way overwhelms me. I'd do almost anything to avoid it. Take a vaccine, twice? Sure! No problem. ",
                    "created": "Fri, 12 Mar 2021 16:41:49 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Okay so what about the other side. Why would you <i>not</i> want to take a vaccine. I listened, and skimmed the <a href=\"https://pandemic.solari.com/family-financial-disclosure-form-for-covid-19-injections/\">brochure</a> my friend sent. And I thought about it. Conceding that the vaccine makers are all big companies with problems in their history, I also know they went through a vetting process with the FDA, and other regulators elsewhere. Yes, it's possible that the government officials could be bribed, but I honestly don't believe they were. Had it only been the Trump government that was supervising it, I would have been more suspicious than I am now. I'd say I'm 95% confident that the FDA can be trusted, and they say the vaccines can be trusted so that's 95% good enough for me. Considering the risk of the awful death I outlined in the first part, this would be enough for me to risk it. But there's more. Suppose the government was in cahoots with the drug manufacturers, what is the probability that that fact would not leak? That's where my real trust lies. I think most professionals in every profession want to do it well. But in this case, <i>every</i> doctor and researcher would have to be in on it. And that's just not possible, imho. The world doesn't work that way. ",
                    "created": "Fri, 12 Mar 2021 16:12:08 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "As much as I love and trust this friend, I also have a friend who is a biomedical researcher who I've known since he was a little person, five or six years old. A real brat who grew up to be a wonderful friend, who I have been talking with since the beginning of the pandemic. He's now in his mid-30s, and because of his field, had early access to the vaccine. He took it. The question of me not taking it never came up in our talks. ",
                    "created": "Fri, 12 Mar 2021 16:23:12 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I follow lots of doctors' advice. Some of it has been awful and left me with disabilities. Ones that I can live with and are not painful, and ones which are actually hard to live with. So I am very skeptical of the competence of individual doctors. But I also understand that their prescriptions are the result of a huge amount of testing, statistics, cost and risk analysis. With vaccines, they aren't just prescribing a treatment for individuals, I also got the vaccine for everyone else. ",
                    "created": "Fri, 12 Mar 2021 16:24:48 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "This is true of all medicine. The drugs we take to control our diseases aren't designed for each of us individually, they are designed for all humans, we are all assumed to be the same, because there's no other sane way to do it. That's why they print the side-effects warnings on the labels, so we know that while this treatment works for most people, for some it will hurt them, and for some it <i>will kill</i> them. I don't want to die that way either, but I understand statistics and probability and I also understand that I am part of a community, and my health affects yours in a pandemic, and vice versa. ",
                    "created": "Fri, 12 Mar 2021 16:36:56 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "There's more to the story, but this is enough for now. :boom:",
                    "created": "Fri, 12 Mar 2021 16:43:58 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Slow down to hurry up",
            "created": "Fri, 12 Mar 2021 16:07:33 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I'm juggling too many balls in my development work. I just lost about 24 hours tracking down a problem. I had some code outside of my <a href=\"https://github.com/scripting/twitter\">davetwitter</a> module that really belonged in there, so after a half-day of working on something else, I decided to quickly move the code from where it was to where I wanted it. However since I was actively developing the davetwitter module, I included it using a <a href=\"https://nodejs.org/en/knowledge/getting-started/what-is-require/\">require</a> call to include a copy of the file, without going through NPM; and here's the key thing, in one place, and in another I used NPM. I couldn't understand why a properly initialized config object at startup would all of a sudden be completely uninitialized when I used it later. The answer was there were two davetwitters, one initialized the other not. A sloppy mistake I would never have made in a bootstrap. This kind of thing only happens when factoring. I guess the moral of the story is I should only attempt these integrations at the beginning of the day, when no other project is loaded into my brain, and I'd be more likely to spot these kinds of mismatches. In the end it cost me a lot of time to try to do it quickly. That's a lesson I've had to learn many times, and still am learning. I even have a slogan for it -- \"Slow down to hurry up.\" ",
                    "created": "Fri, 12 Mar 2021 15:18:35 GMT",
                    "type": "outline",
                    "image": "http://scripting.com/images/2021/03/12/juggler.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}