{
    "text": "March 15",
    "created": "Mon, 15 Mar 2021 13:55:23 GMT",
    "type": "calendarDay",
    "name": "15",
    "subs": [
        {
            "text": "Scripting News on this day <a href=\"http://scripting.com/2020/03/15.html\">one year ago</a>. When the new normal was still very un-normal. ",
            "created": "Mon, 15 Mar 2021 16:19:08 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2020/03/15/vitaminD3.png",
            "flInCalendar": true
        },
        {
            "text": "Here's an idea. A feed that replays the then-new podcast-o-sphere, starting in June 2004. In June 2021.  ",
            "created": "Mon, 15 Mar 2021 16:36:25 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "A company says \"I'm sorry you're inconvenienced.\" Maybe I'm not inconvenienced. Perhaps I'm devastated. Or bored. Irritated. Puzzled. Bewildered. Suicidal. Horny. Perturbing. Vexing. Fetching. Capricious. Circumspect. Hobbled. Riotous. Homicidal. Wistful.",
            "created": "Mon, 15 Mar 2021 17:00:49 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Last night's <a href=\"http://scripting.com/email/\">email</a> was a repeat of Saturday's email. I think the problem was related to the switchover to <a href=\"https://www.timeanddate.com/time/change/usa\">Daylight Saving Time</a> on Saturday night. Fingers crossed about tonight's email. If you're reading this at midnight on Tuesday morning, it worked. :boom:",
            "created": "Mon, 15 Mar 2021 13:55:24 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I found a way to save trees. I bought a pile of <a href=\"https://www.amazon.com/gp/product/B00JCG1V42/ref=ppx_yo_dt_b_search_asin_title?ie=UTF8&psc=1\">dish towels</a> and put them on the kitchen counter where the paper towels and paper napkins used to be. When they get dirty, I throw them in the washing machine with the clothes. And re-stack them. And they're nicer to use than napkins.",
            "created": "Mon, 15 Mar 2021 14:02:36 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "About Roam's product",
            "created": "Mon, 15 Mar 2021 14:47:14 GMT",
            "type": "outline",
            "description": "I think I'm starting to figure out Roam's product.",
            "metaImage": "http://scripting.com/images/2021/03/15/kate.png",
            "subs": [
                {
                    "text": "Thanks to my correspondents on Twitter, I think I'm starting to figure out <a href=\"https://duckduckgo.com/?q=roam+research&t=h_&ia=web\">Roam's</a> product. I am guessing about some of these things, using the blogger's ethos, put your mistakes out there for everyone to see so you can learn faster. :-) ",
                    "created": "Mon, 15 Mar 2021 14:47:17 GMT",
                    "flBulletedSubs": "true",
                    "subs": [
                        {
                            "text": "In Roam's world an outline is computed, not stored. There is no \"OPML\" file for an outline, as with my outliners. There is a database with blocks of text, and they are connected to other nodes/blocks through links that are represented textually by double-square brackets or with a hashtag as in Twitter. ",
                            "created": "Mon, 15 Mar 2021 14:47:30 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "In Roam, the outline hierarchy is a way of browsing the results of a query. I've often thought of this as an interesting way of doing things, and even have an experiment up that I think is Roam-like, <a href=\"http://thesaurus.land/?word=roam\">thesaurus.land</a>. It's a way of navigating a database of synonyms, using an outline structure as the presentation format. It works.",
                            "created": "Mon, 15 Mar 2021 14:48:14 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Can you reorganize an outline in Roam? I haven't heard about anyone doing that. This is one of the reasons I'm not sure Roam actually is an outliner. In my world, an outliner has two defining functions: 1. You have control of detail, via expand and collapse and 2. You can reorganize according to structure. The text is on rails. ",
                            "created": "Mon, 15 Mar 2021 15:00:30 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "People expect by entering all their ideas into Roam's database that there will eventually be serendipities, things they will learn by seeing connections they had not seen before. ",
                            "created": "Mon, 15 Mar 2021 14:49:15 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "You are expected to use Roam for all your note-taking. Many people see Roam as a replacement for Evernote. ",
                            "created": "Mon, 15 Mar 2021 15:13:14 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "In my world, OPML support is not incidental. Each of my outliners is a church, but the religion is OPML. There is no lock-in in this world. You can use any other tool that can read or write OPML. So when I ask if Roam supports OPML, I'm asking if their product can play with products that are compatible with mine. This is like asking, imho, if a news reader can deal with RSS. With OPML the standard is rock solid. For some reason no one has screwed with it (thankful).",
                            "created": "Mon, 15 Mar 2021 15:06:34 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Can I use my own editing tools to get my ideas into their database? I don't know. I suspect a developer could create a bridge. Most of my writing is available in OPML. There are lots of examples in the <a href=\"https://github.com/scripting/Scripting-News/tree/master/blog\">repository</a> that holds my blog content starting in May 2017. The rest of it is on the web, and I can provide a zip archive for a developer who wants to try importing all 26-plus years of my blog. ;-)",
                            "created": "Mon, 15 Mar 2021 14:55:29 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Cuomo, BBC, men, women and hate",
            "created": "Mon, 15 Mar 2021 16:20:43 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Why do I write so much about men, women and hate. Because I guess it's taboo, and my life was in many ways formed around dysfunction between genders, and I feel fear when I see a man taken down, fear that it's going to happen to me. I'm pretty sure many other men feel the same, because I've been in places where men can talk privately, and this is a big topic, the fear that our lives will be ruined. ",
                    "created": "Mon, 15 Mar 2021 16:21:06 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Even so, I don't think I'm alone as a man who seeks the approval of women. This might be the single driving force in my life, probably going back to birth. I kid you not. ",
                    "created": "Tue, 16 Mar 2021 01:31:08 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Anyway, I appreciate not being <a href=\"http://thesaurus.land/?word=excoriate\">excoriated</a> for touching this third rail. I tiptoe up to this topic, but then I'm getting older, with less at stake, and the world is crumbling anyway, so why not take a chance. I think there may be a resolution possible, maybe it'll come at the last minute, in time to get us focused on solving the problems we share, not just the ones that divide us. ",
                    "created": "Mon, 15 Mar 2021 16:24:05 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Anyway, I wrote earlier...",
                    "created": "Mon, 15 Mar 2021 16:24:59 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Just heard, on the BBC, about a book entitled <a href=\"https://www.amazon.com/Men-Who-Hate-Women-Misogyny-ebook/dp/B08QY6PXX5/ref=tmm_kin_swatch_0?_encoding=UTF8&qid=&sr=\">Men Who Hate Women</a> written by a woman. I don't doubt that there are men who do hate women. On the other hand, I also don't doubt that there are women who hate men. Maybe if we worked on all the hate, what an idea that would be. In the interview the author said that hate speech by men includes the statement that not all men hate women. We always have to be so careful because you never know what's going to be considered hateful. Not hating women and saying so is not hate, imho, it's more like pleading for mercy. To think it's hate is straight out of <a href=\"https://www.goodreads.com/quotes/6146-war-is-peace-freedom-is-slavery-ignorance-is-strength\">1984</a>. Further, it's exactly this kind of crap that makes people fear women, because they can ruin a man's life so easily. I've seen it happen. And when it does, it does not, imho, in any way help anyone. It's just more of what you hated about men being applied to men, and probably feeding more hate all around. You can't stop hate with fear. Also: every man had a mother, and early in life that little man was putty in that woman's hands. If you want to fix the problems, and make life better for women, you have to work on women's attitudes too, and help that little dude love <i>himself. </i>",
                    "created": "Mon, 15 Mar 2021 14:03:25 GMT",
                    "type": "outline",
                    "image": "http://scripting.com/images/2020/11/01/lizLemon.png",
                    "flInCalendar": true
                },
                {
                    "text": "I watched <a href=\"https://www.metacritic.com/movie/invictus\">Invictus</a> on <a href=\"https://www.netflix.com/title/70118779#:~:text=2009%20%7C%20PG%2D13%20%7C%202h,Watch%20all%20you%20want.\">Netflix</a>, a 2009 movie about <a href=\"https://en.wikipedia.org/wiki/Nelson_Mandela\">Nelson Mandela</a> and rugby in South Africa. It's not an incredibly great movie, but it's worth watching to learn how Mandela treated the whites who oppressed blacks during <a href=\"https://en.wikipedia.org/wiki/Apartheid\">apartheid</a>, which was ended, as Mandela became president. It's hard to summarize the whole philosophy in a short blog post, but I'll try. When you win, try to protect the dignity of the people you defeated, assuming you have to live with them. He would say the women's movement in 2021 is doing it wrong, by aiming to destroy the lives of men. It may make you feel good in the moment, but it's only going to perpetuate the problem, perhaps even make it worse, as the fear becames betrayal because some men who are charged really are innocent, and that turns into the hate we <i>all</i> want to try to overcome. Everyone suffers when people are abused. I know this first hand, from the experience of my parents and how that was passed down to my generation. The thing to do is to stop all abuse, learn where its roots are, and help people overcome the history that makes them view the world the way they do. ",
                    "created": "Mon, 15 Mar 2021 14:22:44 GMT",
                    "type": "outline",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}