{
    "text": "March 18",
    "created": "Thu, 18 Mar 2021 14:13:17 GMT",
    "type": "calendarDay",
    "name": "18",
    "subs": [
        {
            "text": "A year of pandemic-imposed isolation takes a toll. This might be the worst moment of the year. It's rainy and cold. Spring keeps teasing, but it never comes. There's nothing you can do that would be a normal rainy day. When the sun comes out, this weekend, I hope it'll feel better. I'm sure it will.",
            "created": "Thu, 18 Mar 2021 14:58:34 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "An idea for sites who block ad blockers. What if I compensate you for the lost ad revenue from my visit? Could we work out a deal? Come on, give a shit about your readers.",
            "created": "Thu, 18 Mar 2021 15:01:45 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Audiobooks should start at the beginning of the book, skipping the forewords, prefaces, dedications, notes on the 18th edition. Or make it two files so I can listen to the preambles at the end, if I care. ",
            "created": "Thu, 18 Mar 2021 18:19:41 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Fox's business model",
            "created": "Thu, 18 Mar 2021 20:52:34 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2021/03/18/libsmarching.png",
            "description": "When the libs are angry, Fox is happy. ",
            "subs": [
                {
                    "text": "Fox's business model: Getting <a href=\"https://en.wikipedia.org/wiki/Liberalism\">libs</a> upset. ",
                    "created": "Thu, 18 Mar 2021 20:46:39 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "It's simple. Their audience likes to hear about liberals freaking out. If you can make them cry, even better. All they have to do is come up with a few things that piss off the libs every week, and they're gold. And if the libs don't get upset, you can just lie and say they did.  ",
                    "created": "Thu, 18 Mar 2021 20:56:50 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Imho they aren't the only news org doing this.  As Maddow says, watch this space. ",
                    "created": "Thu, 18 Mar 2021 20:53:18 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "To be clear, it's not my business model or any other kind of model to get anyone upset. Quite the opposite. I want to get everyone to work with each other. It's my impossible dream. :boom:",
                    "created": "Thu, 18 Mar 2021 20:53:30 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "When the libs are angry, Fox is happy. ",
                    "created": "Thu, 18 Mar 2021 20:54:06 GMT",
                    "inlineImage": "http://scripting.com/images/2021/03/18/libsmarching.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "It's not really a scam",
            "created": "Thu, 18 Mar 2021 14:13:18 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "It's been fascinating to watch writers <a href=\"https://mediagazer.com/210317/p16#a210317p16\">come to grips</a> with the idea that Substack is not a level playing field. They recruited some famous writers, paid them advances, in some cases (apparently, not verified as far as I know) of up to $250K. The rest of the writers got nothing but the opportunity to make money from their newsletters. By seeding the market with this money they could honestly say that some writers were making six figures from their Substack work, implying perhaps that you could too. Maybe you could. But honestly -- you won't. The system they've set up doesn't work that way.",
                    "created": "Thu, 18 Mar 2021 14:13:29 GMT",
                    "image": "http://scripting.com/images/2021/03/18/hamsterCage.png",
                    "flInCalendar": true
                },
                {
                    "text": "One writer called it a <a href=\"https://thehypothesis.substack.com/p/heres-why-substacks-scam-worked-so\">scam</a> but I'm not sure that's a good word for what's going on. It's more like \"business model\" or \"growth strategy.\" This is how the tech industry works. They do whatever it takes to create an illusion of potential growth, then they sell that to seed investors, who in turn sell it to angels, then to Series A and B and so on, and ultimately to the public. Huge amounts of money are raised, and none of it goes to the writers who keep the wheels spinning, in the case of Substack and their ilk, writers. And the writers who may think of themselves of savvy tech journos are scammed, that's where the real scam is, they largely did it to themselves by believing the fairy tale that they could get rich off writing, or even make a good living. ",
                    "created": "Thu, 18 Mar 2021 14:15:12 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "An aside, this is not new. Medium has been paying writers for years. I know several of them and have confirmed it. I found out by questioning why they wrote for Medium, when it seemed against their values. The answer: they needed the money. ",
                    "created": "Thu, 18 Mar 2021 14:54:57 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I regularly make offers to work with writers on easy writing and distribution systems without the constraints. But you all keep going for the tech industry business models. They get rich, and we're always starting over. When you decide you want to do this for real, with your eyes open, learning from all the experience, write a manifesto and call for open source devs to help you, and then we can get something going. But until the writers lead here, you're going to keep having your hearts broken and the tech for writing on the web will continue to go nowhere. ",
                    "created": "Thu, 18 Mar 2021 14:32:00 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}