{
    "text": "March 21",
    "created": "Sun, 21 Mar 2021 14:46:51 GMT",
    "type": "calendarDay",
    "name": "21",
    "subs": [
        {
            "text": "An idea for a <a href=\"https://github.com/scripting/Scripting-News/issues/205\">pilot program</a> connecting the daily flow from Scripting News with one of the new knowledge databases. ",
            "created": "Sun, 21 Mar 2021 16:35:15 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "So all the kids are <a href=\"https://news.yahoo.com/miami-beach-declares-spring-break-201052496.html\">down in Florida</a> distributing the newest variants of the virus to each other so they can go home and deliver it to their friends and family, esp states with no mask mandate, and 100% re-opened. Just in time for the virus to go exponential for a second summer.",
            "created": "Sun, 21 Mar 2021 19:27:40 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "As a long-suffering <a href=\"https://www.google.com/search?q=site%3Ascripting.com+knicks\">Knicks</a> fan, I have say it <a href=\"https://twitter.com/TheKnicksWall/status/1372726485627310082\">looks like</a> the drought just might be over. ",
            "created": "Sun, 21 Mar 2021 15:40:51 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Here's another thing people don't get, imho. The Republicans are over. Look forward. It doesn't matter who did what in the past, our two-party democracy has become something else. What it is, I don't know.",
            "created": "Sun, 21 Mar 2021 16:10:13 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Aidan Choi's imagery",
            "created": "Sun, 21 Mar 2021 14:55:21 GMT",
            "type": "outline",
            "description": "Art about an assault on a Chinese-American grandmother, who fought back and sent her attacker to the hospital.",
            "metaImage": "http://scripting.com/images/2021/03/21/asianGrandma.png",
            "subs": [
                {
                    "text": "<a href=\"https://twitter.com/enochchoi\">Enoch Choi</a> has appeared <a href=\"https://www.google.com/search?q=site%3Ascripting.com+%22enoch+choi%22\">on this blog</a> many times, he's a heroic <a href=\"http://scripting.com/2020/03/24.html#a165220\">doctor</a>, natural-born <a href=\"http://scripting.com/manila/bloggerCon/2004/10/19.html\">blogger</a>, he works to save lives, always, and now, is caring for Covid patients in the <a href=\"https://en.wikipedia.org/wiki/Santa_Clara_Valley\">Santa Clara Valley</a> in California. ",
                    "created": "Sun, 21 Mar 2021 14:55:29 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "He's also an <a href=\"https://actionnetwork.org/forms/call-for-a-community-centered-response-to-violence-against-aapi-communities\">advocate</a> for <a href=\"https://twitter.com/search?q=%23StopAsianHate&src=typed_query\">Asian-Americans</a>, and now his son Aidan, who I watched grow up on Facebook, is an <a href=\"https://achoi2022.wixsite.com/website\">artist</a>, and has a couple of pieces about an <a href=\"https://www.bbc.com/news/world-asia-china-56453806\">assault</a> on a Chinese-American grandmother, who fought back and sent her attacker to the hospital, in San Francisco last week.  ",
                    "created": "Sun, 21 Mar 2021 15:10:25 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Asian grandpa, by <a href=\"https://achoi2022.wixsite.com/website\">Aiden Choi</a>.",
                    "created": "Sun, 21 Mar 2021 15:00:05 GMT",
                    "inlineImage": "http://scripting.com/images/2021/03/21/asianGrandpa.png",
                    "flInCalendar": true
                },
                {
                    "text": "Asian grandma, by <a href=\"https://achoi2022.wixsite.com/website\">Aiden Choi</a>.",
                    "created": "Sun, 21 Mar 2021 15:01:18 GMT",
                    "inlineImage": "http://scripting.com/images/2021/03/21/asianGrandma.png",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "Why is everything shit in America",
            "created": "Sun, 21 Mar 2021 15:17:08 GMT",
            "type": "outline",
            "description": "We are the richest country there is, it's not hyperbole. And yet we have one of the worst benefit systems for our people.",
            "metaImage": "http://scripting.com/images/2021/03/21/hundredDollarBill.png",
            "subs": [
                {
                    "text": "Everything should be great in America, but it isn't. Why?",
                    "created": "Sun, 21 Mar 2021 15:17:23 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "FIrst watch this <a href=\"https://twitter.com/seyitaylor/status/1373646185311969285\">video</a> from a 60 Minutes interview with Fed chairman Lewis Powell on how he creates money. ",
                    "created": "Sun, 21 Mar 2021 15:17:47 GMT",
                    "urltweet": "https://twitter.com/seyitaylor/status/1373646185311969285",
                    "flInCalendar": true
                },
                {
                    "text": "One of the biggest misperceptions about how money works, even among educated people, is that we have to pay for projects by raising taxes. The fact they're missing is that the Federal Reserve creates money. So we don't have to raise taxes to provide relief to victims of disasters. ",
                    "created": "Sun, 21 Mar 2021 15:19:44 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "When they say the debt is something our children and grandchildren will have to pay off, that's not true either. We can pay the debt by printing money. If we owe you $100 who's to say if we got that money by taxing Americans or simply by giving you new money we created for that purpose?",
                    "created": "Sun, 21 Mar 2021 15:44:07 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Money has to start somewhere, and unlike a household budget, the US government has an infinite supply of it. Basically the only country with the power to create new money that can be spent everywhere is the United States. ",
                    "created": "Sun, 21 Mar 2021 15:21:16 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The United States is unique because our dollar is the <a href=\"https://en.wikipedia.org/wiki/Reserve_currency\">reserve currency</a> for the world. So if say Egypt owes money to India, they pay them in dollars. If a small country is reserving some money for a future project, they store it in dollars. Our currency, unlike all others, is in demand all around the world. Which means we can give them dollars we just printed and they will send us goods that cost real money, because of course when we printed the money, it was real, simply because we printed it. ",
                    "created": "Sun, 21 Mar 2021 15:45:41 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "We are the richest country there is, it's not <a href=\"http://thesaurus.land/?word=hyperbole\">hyperbole</a>. And yet we have one of the worst benefit systems for our people in the world. If people really understood how this works (just re-read this piece) they would be enraged about how health, education, infrastructure, everything basically, in the US, is shit. You see this when you travel to Europe. A sense that everything is first class. And they don't have the economic advantage that we do. ",
                    "created": "Sun, 21 Mar 2021 15:22:07 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "So, why is it this way, such a rich country that lives so poorly? Some of it is the rich self-dealing, grift, the 1%, inequality, etc -- but a lot of is the dysfunction of Congress. ",
                    "created": "Sun, 21 Mar 2021 15:34:21 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The quality of life for Americans hasn't been a priority in Washington, at least not until very recently. There is cause for hope of that changing. Just don't believe the politicians when they say something good for the people has to be \"paid for.\" Tell them you understand how it works, and the exact opposite is true, it does not ever have to be paid for. We, the United States, can buy whatever we want. And we need to start doing that. ",
                    "created": "Sun, 21 Mar 2021 15:39:02 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}