{
    "text": "March 22",
    "created": "Mon, 22 Mar 2021 12:58:56 GMT",
    "type": "calendarDay",
    "name": "22",
    "subs": [
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1373798428027813891\">Poll</a>: Why did you switch to Chrome from MSIE? ",
            "created": "Mon, 22 Mar 2021 12:58:57 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://twitter.com/dsearls/status/1374100894078230528\">Doc Searls overheard</a>: \"Trump was cocaine for news sellers. They binged, and now they've crashed. Question: was what they wrote and said while high actually journalism? Or even news? Serious questions.\"",
            "created": "Mon, 22 Mar 2021 21:02:53 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1374044950946533380\">Programmers</a>, do you find that <a href=\"https://stackoverflow.com/questions/17139519/what-is-localstorage\">localStorage</a> in the browser is not reliable?",
            "created": "Mon, 22 Mar 2021 17:07:10 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "In my experience, most programmers don't care how things came to be the way they are. I'm different, I always want to know the story. I find this the most fascinating thing about us humans, how do we synthesize ideas, build on other people's work. More common is people try to ignore the past, esp if it interferes with their success. ",
            "created": "Mon, 22 Mar 2021 16:41:20 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "NFTs contain a good idea, and it's not the money",
            "created": "Mon, 22 Mar 2021 16:50:48 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I don't care for the money in NFTs, I don't really believe it's there, but what I do want is an alternative to patents to get people credit for their innovations. ",
                    "created": "Mon, 22 Mar 2021 16:51:06 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Patents have really screwed things up, but no one has ever picked up on the idea that we could have something like patents, but without the tarriff. I want people to know whose work they're using. ",
                    "flInCalendar": true
                },
                {
                    "text": "Once I made enough money, I stopped trying to put barriers on where my ideas could flow. But as a result, I rarely have been able to finish an idea before a big company comes along and takes it over. ",
                    "flInCalendar": true
                },
                {
                    "text": "It's a bad system, no way to win. If you have to join a big company to be creative, well you can see from that how little creativity there would be. ",
                    "flInCalendar": true
                },
                {
                    "text": "What great musician or artist worked for a company like Google or Microsoft? ",
                    "created": "Mon, 22 Mar 2021 16:51:27 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The potential of NFTs is it could document how ideas entered the world. I'd be fine if we took the money out of it, also the blockchain. ",
                    "created": "Mon, 22 Mar 2021 16:51:28 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}