{
    "text": "March 23",
    "created": "Tue, 23 Mar 2021 13:37:57 GMT",
    "type": "calendarDay",
    "name": "23",
    "subs": [
        {
            "text": "I've been doing a lot of work on web scripting for the last few months. Put everything else aside. I think I'm ready to create a small subset of \"Frontier\" that runs in the cloud. Basic components are outlining of course, twitter and a cloud-based file system. Scripts run from a user-editable menu as they did in Frontier. Still major things to work out, it's probably months away. But I might start sharing little bits of the work I'm doing, to get discussions going, esp with Frontier alums. The language is JavaScript, but here's the thing -- we don't need callbacks for asynchronous operations, it flows just like any other language. <a href=\"https://blog.andrewshell.org/\">Andrew Shell</a> figured out the escape from callbacks, that was what convinced me that you could make a scripting system based on JavaScript. BTW, the codename for the project is Drummer.  ",
            "created": "Tue, 23 Mar 2021 13:38:13 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/12/24/drummer.png",
            "flInCalendar": true
        },
        {
            "text": "Drummer is to Frontier as Little Outliner is to MORE.    ",
            "created": "Tue, 23 Mar 2021 14:02:22 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "In the Roam <a href=\"https://twitter.com/10ch/status/1374343900765192198\">world</a>, which I am following, they document their workflows. Come up with best practices. This is really eye-opening for me. Inspired me to do a <a href=\"https://twitter.com/davewiner/status/1374354453768380416\">quick writeup</a> of how I manage my development projects using an outliner. ",
            "created": "Tue, 23 Mar 2021 14:03:41 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "One curious thing from working on Drummer: I like working on verb docs. I find it relaxing, satisfying, rewarding. I just realized why. I'm writing a book. At the top level the structure is rigid. I like working within such a structure. By verb docs, I mean docs like what you <a href=\"http://docserver.userland.com/file/exists\">see</a> on <a href=\"http://docserver.userland.com/\">DocServer</a> from Frontier, which is still running, btw. The difference is this time I'm writing the docs. Last time I didn't have the energy to do it, but now it's the structure for my review of various aspects of the system. Reading the verb docs you'll know I went through that verb's functionality before release. Of course I'm also documenting the bugs.  ",
            "created": "Tue, 23 Mar 2021 16:22:00 GMT",
            "type": "outline",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}