{
    "text": "March 24",
    "created": "Wed, 24 Mar 2021 12:31:58 GMT",
    "type": "calendarDay",
    "name": "24",
    "subs": [
        {
            "text": "I have arrived at an interesting place. Every day of every week feels like a weekend day. ",
            "created": "Wed, 24 Mar 2021 13:14:07 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "Drummer's key innovation",
            "created": "Wed, 24 Mar 2021 16:13:31 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "Following up on yesterday's news about \"Drummer\", its key innovation is that you can write JavaScript code that's much simpler because it does not need to use callbacks. ",
                    "created": "Wed, 24 Mar 2021 16:10:23 GMT",
                    "type": "outline",
                    "flInCalendar": true
                },
                {
                    "text": "An example: ",
                    "created": "Wed, 24 Mar 2021 16:14:03 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "<code>dns.getDomainName (dns.getDottedId (\"liveblog.co\"))</code>",
                    "created": "Wed, 24 Mar 2021 16:14:09 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "This works even though both DNS operations do I/O.",
                    "created": "Wed, 24 Mar 2021 16:21:41 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "We are using JavaScript's threading, we are not blocking the CPU. ",
                    "created": "Wed, 24 Mar 2021 16:14:32 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "A programmer in any other language will be scratching their head wondering what's the big deal. I know. I've been saying that for years. If Python can do this, I don't see why JavaScript shouldn't. ",
                    "created": "Wed, 24 Mar 2021 16:17:55 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Note: JavaScript as spec'd <i>can't</i> do this. But we were able to make this work with a very simple pre-processor.",
                    "created": "Wed, 24 Mar 2021 16:14:59 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "What is a callback?",
            "created": "Wed, 24 Mar 2021 16:32:24 GMT",
            "type": "outline",
            "description": "In JavaScript functions can be called when an operation is complete. ",
            "subs": [
                {
                    "text": "I looked around for a decent explanation of JavaScript callbacks, but they take too long to get to the point, or they never explain what they are. Maybe it's too hard to explain? I've been writing a lot of docs lately, so let me try! :-)",
                    "created": "Wed, 24 Mar 2021 16:32:30 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Callbacks are used when an operation is going to take a long time and your program wants to do other things while it's waiting. So you create a function to run when the operation is done, and provide that function to the slow operation you're calling with the intent that it will call this function when it's done. Thus it is a <i>callback</i> function. ",
                    "created": "Wed, 24 Mar 2021 16:33:09 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "An example:",
                    "created": "Wed, 24 Mar 2021 16:40:04 GMT",
                    "flCodeSubs": "true",
                    "subs": [
                        {
                            "text": "fs.readFile (\"notes.txt\", function (err, filetext) {",
                            "created": "Wed, 24 Mar 2021 16:40:07 GMT",
                            "subs": [
                                {
                                    "text": "if (err) {",
                                    "created": "Wed, 24 Mar 2021 16:49:00 GMT",
                                    "subs": [
                                        {
                                            "text": "console.log (err.message);",
                                            "flInCalendar": true
                                        },
                                        {
                                            "text": "}",
                                            "flInCalendar": true
                                        }
                                    ],
                                    "flInCalendar": true
                                },
                                {
                                    "text": "else {",
                                    "created": "Wed, 24 Mar 2021 16:49:06 GMT",
                                    "subs": [
                                        {
                                            "text": "console.log (\"The file contains \" + filetext.length + \" characters.\");",
                                            "flInCalendar": true
                                        },
                                        {
                                            "text": "}",
                                            "flInCalendar": true
                                        }
                                    ],
                                    "flInCalendar": true
                                },
                                {
                                    "text": "});",
                                    "created": "Wed, 24 Mar 2021 16:40:30 GMT",
                                    "flInCalendar": true
                                }
                            ],
                            "flInCalendar": true
                        },
                        {
                            "text": "console.log (\"Hi mom!\")",
                            "created": "Wed, 24 Mar 2021 16:41:12 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "If you look in the console, you'll see:",
                    "created": "Wed, 24 Mar 2021 16:41:30 GMT",
                    "flCodeSubs": "true",
                    "subs": [
                        {
                            "text": "Hi mom!",
                            "flInCalendar": true
                        },
                        {
                            "text": "The file contains 28 characters.",
                            "created": "Wed, 24 Mar 2021 16:48:42 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "&nbsp;",
                            "created": "Wed, 24 Mar 2021 16:50:01 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                },
                {
                    "text": "An example of a real world callback. ",
                    "created": "Wed, 24 Mar 2021 16:34:46 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "After you upload a video to Facebook, you'll get a dialog when the upload is done saying this is going to take a bit of time to process, so we'll let you know when it's done. In the meantime you can read stuff. When the video is ready, you get a message saying you can watch the video now. That's the basic flow of a callback. ",
                    "created": "Wed, 24 Mar 2021 16:50:55 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "When Medium shrugs",
            "created": "Wed, 24 Mar 2021 12:31:59 GMT",
            "type": "outline",
            "description": "Until writers lead, you're going to keep having your hearts broken and the tech for writing on the web will continue to go nowhere.",
            "metaImage": "http://scripting.com/images/2021/03/24/atlasHoldingUpTheEarth.png",
            "subs": [
                {
                    "text": "<a href=\"https://www.crunchbase.com/organization/medium\">Medium</a> has been around since 2011, getting pretty close to ten years, and in that time, they have switched business strategies many times. The appear to have <a href=\"https://ev.medium.com/medium-editorial-team-update-8679bcb9fe81\">done it again</a> <a href=\"https://mediagazer.com/#a210323p19\">yesterday</a>. So here's another opportunity to take stock of writing on the web, and where we have been and what could change.",
                    "created": "Wed, 24 Mar 2021 12:32:23 GMT",
                    "subs": [
                        {
                            "text": "First, I got a nice <a href=\"https://twitter.com/jayrosen_nyu/status/1374541139970260996\">note</a> from Jay Rosen thanking me for pushing him to keep his own web presence, to not depend on any of the platforms. It's gratifying to see a longtime friend doing so well with this approach.",
                            "created": "Wed, 24 Mar 2021 12:34:03 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Jay then sent me a link to an <a href=\"https://jabberwocking.com/why-have-blog-audiences-declined-over-the-past-decade/\">article</a> by Kevin Drum asking why blogging has declined in the past decade. I think there's more to it than what Drum says, that the disappearance of Google Reader, while it certainly hurt the cause, is only part of the puzzle. The problem is that I can't write on my blog and share it with the popular publishing platforms without limiting what I can do with my blog. If you add up all the limits of Twitter, Facebook, Google Reader and Medium, then you can't blog at all because their requirements are contradictory. ",
                            "created": "Wed, 24 Mar 2021 12:35:02 GMT",
                            "collapse": "true",
                            "subs": [
                                {
                                    "text": "One requires titles and two don't allow titles. ",
                                    "created": "Wed, 24 Mar 2021 12:52:02 GMT",
                                    "flInCalendar": true
                                },
                                {
                                    "text": "Facebook doesn't support the basics of blogging, links, simple styles, podcast enclosures and (again) titles. ",
                                    "created": "Wed, 24 Mar 2021 15:08:19 GMT",
                                    "flInCalendar": true
                                },
                                {
                                    "text": "Medium supports most of what you would want them to support but doesn't allow updating, so if you make a change you have to do it by hand. ",
                                    "created": "Wed, 24 Mar 2021 15:08:25 GMT",
                                    "flInCalendar": true
                                },
                                {
                                    "text": "None of them want to peer with blogs. They all insist you do your writing with their tools of greatly varying quality, and some are reallllly bad. Even the new hope of writers everywhere, Substack, requires you to use their editor. ",
                                    "created": "Wed, 24 Mar 2021 15:08:32 GMT",
                                    "flInCalendar": true
                                },
                                {
                                    "text": "So, trying to keep this short as possible, in 2017 I gave up trying to peer with any of those services, and went back to writing my blog the way I like to write, and the lights came back on. It works again. So the moral of the story imho is to forget about peering, and just blog the way you want to, and I think we can all be happy.",
                                    "created": "Wed, 24 Mar 2021 12:52:40 GMT",
                                    "flInCalendar": true
                                }
                            ],
                            "flInCalendar": true
                        },
                        {
                            "text": "Now I mentioned Google Reader in the list of limiting environments. Oddly, even though it's long gone, it is still controlling how we blog. They didn't support the full RSS spec, they don't handle posts without titles. And all the replacements for Reader copied their limits, so even though it's gone, it's influence is still strong, contributing limits to blogging that weren't here before they came and went. ",
                            "created": "Wed, 24 Mar 2021 12:41:26 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "Is Twitter's character limit protecting Medium? If so, please now would be a good time to change course. Twitter is only increasing in importance. I would love to seem them make a deliberate effort to do all that RSS can do in transporting web writing, so we can start building again, from a sane base. As much as I love Twitter, its constraints are still unbearable. ",
                            "created": "Wed, 24 Mar 2021 12:42:48 GMT",
                            "flInCalendar": true
                        },
                        {
                            "text": "One more thing. We're still waiting for independent writers to take the lead here, as I <a href=\"http://scripting.com/2021/03/18/141318.html?title=itsNotReallyAScam\">wrote</a> last week. \"Until the writers lead here, you're going to keep having your hearts broken and the tech for writing on the web will continue to go nowhere.\"",
                            "created": "Wed, 24 Mar 2021 12:57:05 GMT",
                            "flInCalendar": true
                        }
                    ],
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}