{
    "text": "March 26",
    "created": "Fri, 26 Mar 2021 14:07:43 GMT",
    "type": "calendarDay",
    "name": "26",
    "subs": [
        {
            "text": "The Bible: <a href=\"https://www.biblegateway.com/passage/?search=Matthew%207%3A1-3&version=KJV\">Judge not, that ye be not judged</a>.",
            "created": "Fri, 26 Mar 2021 14:20:21 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "One reason I ask questions about the process by which people want to deprive a person of their life, is that it's come to the point where they want to erase an accomplished person because they don't like his ideas, or the questions he asks. When I read the accusations, I cross out all of those, give them no weight at all. It's fine if you don't like his ideas, now mind your own business. Why do I care? A couple of reasons. Offensive questions and foreign ideas help me think through my own values, and sometimes I find a way to compromise, and sometimes I even change my mind. I don't mind discomfort. I check to see if I'm in any danger, or if anyone else is, and if the answer is no, then <a href=\"https://www.urbandictionary.com/define.php?term=Live%20and%20Let%20Live\">live and let live</a>. The second reason is that some people find <i>my</i> ideas offensive. I write every day. I don't know why but this has great value to me. I can imagine a mob of internet <s>assholes</s> people deciding that my ideas are too offensive to be permitted. If I can imagine that then I have to question it when it's happening to someone else. It's called empathy.",
            "created": "Fri, 26 Mar 2021 14:22:43 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/03/26/comradeStalin.png",
            "flInCalendar": true
        },
        {
            "text": "When I lived in California people would always ask \"Why is he like that?\" The answer may simply be that I'm from New York. NYers are just as likely to tell you to fuck off as to say good morning or have a nice day. They mean basically the same thing. It's like \"namaste\" -- the divinity in my being acknowledges the divinity in yours. When you're in California you have to tone it down, a lot, or they'll kill you with passive aggressiveness. NYers are more transparent. You don't have to guess how they feel about something as much. ",
            "created": "Fri, 26 Mar 2021 17:15:46 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "It's spooky how accurate weather forecasts are these days. ",
            "created": "Fri, 26 Mar 2021 16:26:26 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "It's really cool to watch the Democrats in Georgia rip the Repubs to pieces.",
            "created": "Sat, 27 Mar 2021 01:32:37 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "We can't impeach the NYT no matter how much they betray our trust.",
            "created": "Fri, 26 Mar 2021 19:36:19 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "It’s time for a new Georgia tradition, handing friendly strangers a bottle of water and a tasty snack, but only if they’re not Republicans.",
            "created": "Fri, 26 Mar 2021 16:29:43 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "I regret turning off the <a href=\"https://www.postingandtoasting.com/2021/3/26/22351476/knicks-106-wizards-102-grind-them-down\">Knicks game</a> last night with two minutes left in the 4th quarter. They were behind by too many points, and they weren't playing well. I figured this game is gone. I was surprised the starters were still playing. Much later I saw fan exclamations on Twitter, that seemed to say the Knicks had won. They did. I've learned my lesson. This season's Knicks are special. They win games they have no right winning. The roll over Russell Westbrook and Bradley Beale like they were the rookies and the Knicks were the team packed with franchise players. It's like the 2015 Mets, perhaps. I honestly don't care if the Knicks make the playoffs. They have such heart, such love for themselves and each other. It's pure joy to watch them play. ",
            "created": "Fri, 26 Mar 2021 14:37:37 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2021/03/26/rjBarrett.png",
            "flInCalendar": true
        },
        {
            "text": "[%search: Spectrum%] isn't finished with me. Yesterday they turned off my TV service. Not clear why. But after a long day's work I had to have four separate phone conversations with their reps, over three hours, to get it working again. I paid my bill, etc. They just have no idea what they're doing imho. Anyway, Spectrum is making me buy an AppleTV in order to watch the Knicks. The AppleTV will stay in its box and go into a closet, where I will pay a monthly fee for it. I already have two AppleTVs, and I don't use either one. Too many remotes, too many different UIs. Once i get over the sheer waste of it, the price is actually competitive. YouTubeTV costs about the same, w/o the AppleTV. And YTTV does not have the Knicks. Where I live there is no other way to get the Knicks. I actually think this is true for the entire NY area. And before you tell me about Fubo, they don't have the Knicks either.",
            "created": "Fri, 26 Mar 2021 17:56:07 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "What's going on",
            "created": "Fri, 26 Mar 2021 14:18:19 GMT",
            "type": "outline",
            "metaImage": "http://scripting.com/images/2021/03/26/marvinGayeFans.png",
            "description": "Every generation thinks they know what's really going on, when they're young.",
            "subs": [
                {
                    "text": "A truth that comes home regularly, every generation, no matter how smart they think they are, has their share of idiots. ",
                    "created": "Fri, 26 Mar 2021 14:18:23 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Every generation thinks they know what's really going on, when they're young, only to realize in a few years that they have absolutely no idea what is going on.  ",
                    "created": "Fri, 26 Mar 2021 14:18:35 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "The maturing process all the way to the end is about steadily realizing this truth, more and more.",
                    "created": "Fri, 26 Mar 2021 14:18:48 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I don't really know about the end yet -- I'm just extrapolating. It could be that the actual end is a revelation and at that point you really do know what's going on.",
                    "created": "Fri, 26 Mar 2021 14:18:49 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "And now a <a href=\"https://www.youtube.com/watch?v=Y9KC7uhMY9s\">special treat</a>. :smile:",
                    "created": "Fri, 26 Mar 2021 14:19:24 GMT",
                    "urlvideo": "https://www.youtube.com/watch?v=Y9KC7uhMY9s",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}