{
    "text": "Follow-up on <a href=\"http://scripting.com/2023/12/08.html#a140102\">yesterday's</a> bits about The Atlantic. 1. It is available on newsstands, I did a search and found I could pick it up at the <a href=\"https://stores.barnesandnoble.com/store/3405\">Barnes & Noble</a> <a href=\"https://www.google.com/maps/place/1200+Ulster+Ave,+Kingston,+NY+12401/@41.9651793,-74.0275494,13z/data=!4m6!3m5!1s0x89dd0f2c78ed7179:0xe5adbff00343979c!8m2!3d41.9651793!4d-73.9889256!16s%2Fg%2F11bw442113?entry=ttu\">in Kingston</a>, a 1/2 hour drive from where I live. <a href=\"https://www.barnesandnoble.com/w/the-atlantic-magazine/1104733038?ean=2940000280874\">$2.20 per issue</a>. A fair price imho. I advertised I'd be willing to pay $5 to read all the articles in the special issue about the second Trump presidency. Driving one hour round trip raises the price considerably. 2. A couple of readers wrote to say that the full text of the Atlantic is available in their RSS 2.0 feed. I knew that, but that isn't the issue. It's very generous of The Atlantic to offer their publication that way, but I'm not looking for a free ride, just a fair deal. I might want to subscribe to The Atlantic, what better way to offer it than on a piece-price basis. I might end up paying more than the subscription price. If I was doing that regularly you bet I'd subscribe. 3. I really dislike the term \"micropayments.\" It's disrespectful of the customer's money, and businesses that do that don't deserve our patronage. When you add up the per-article expense of great pubs like The New Yorker or The Atlantic there would be nothing micro about the money I'd spend. It's the commitment I want to avoid. Magazines are notoriously difficult to unsub from. I'd rather pay more and stay anonymous to them. Anyway, as always thanks to my readers who always offer up good food for thought! :smile:",
    "created": "Sat, 09 Dec 2023 13:08:03 GMT",
    "type": "outline",
    "image": "https://imgs.scripting.com/2023/12/08/atlanticCover.png",
    "flInCalendar": true
}