{
    "text": "Andrew Hickey",
    "created": "Mon, 19 May 2025 22:06:50 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "<a href=\"https://bsky.app/profile/did:plc:2tjsq6a4vn6pww2iva5qj23v\">Andrew Hickey</a> whose <a href=\"https://500songs.com/podcast/\">podcast</a> I support, also appears to be strongly against people using ChatGPT. ",
            "created": "Mon, 19 May 2025 22:06:57 GMT",
            "flInCalendar": true
        },
        {
            "text": "I am a programmer, so you might think I'd see it the same way because what I do is similar to what musicians and prose writers do in that I create \"intellectual property\" which can be easily copied.",
            "created": "Mon, 19 May 2025 22:09:27 GMT",
            "flInCalendar": true
        },
        {
            "text": "But we have a different culture in software, we tend to by default share what we do and let other people use it. They're supposed to credit us, but people are selfish and greedy and they will tend to take whatever isn't bolted down, and it sucks, but you accept it.",
            "flInCalendar": true
        },
        {
            "text": "What's funny is Hickey appears to have no clue how much he's benefited from this ethos. His success probably would not have been possible without some people thinking it's more important to create the medium he could use any way he saw fit, than to own one that would probably have kept him out.",
            "created": "Mon, 19 May 2025 22:12:28 GMT",
            "flInCalendar": true
        },
        {
            "text": "Creating is not as linear as he appears to think, which so ironic because that's basically what his freaking podcast is about. He loves to say \"no one did anything first\" (paraphrasing) and that's basically the <a href=\"http://scripting.com/stories/2011/09/09/onlyStealFromTheBest.html\">same idea</a>.",
            "created": "Tue, 20 May 2025 02:31:49 GMT",
            "flInCalendar": true
        },
        {
            "text": "And I don't doubt that the next big media invention, the next <a href=\"https://daytona.scripting.com/search?q=podcasting\">podcasting</a> perhaps, will benefit enormously from having ChatGPT available for the people developing it.",
            "created": "Mon, 19 May 2025 22:10:51 GMT",
            "flInCalendar": true
        },
        {
            "text": "PS: This appeared earlier as a <a href=\"https://bsky.app/profile/scripting.com/post/3lpjn22v22s2k\">post</a> on Bluesky. And I wrote every freaking word, as I always do unless disclaimed.",
            "created": "Mon, 19 May 2025 22:12:45 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}