{
    "text": "Thinking out loud",
    "created": "Fri, 28 Jan 2022 14:58:57 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1486374478594592777\">A thinking-out-loud thread</a> from Twitter, a couple of days ago.  ",
            "created": "Fri, 28 Jan 2022 14:58:25 GMT",
            "subs": [
                {
                    "text": "Looking back, there's no doubt my work had huge influence over media, though they don't know it, or wouldn't acknowledge it.   It also has had huge influence over politics.",
                    "created": "Wed, 26 Jan 2022 16:24:25 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "I don't care so much about how media uses the new tech, but the fact that the Dems have left it to the Repubs to abuse it, and won't use it themselves (one exception, the Dean campaign, h/t Joe Trippi), that's a tragedy.",
                    "created": "Wed, 26 Jan 2022 16:24:26 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "There's so much we can do now we could never do before, but it's waiting for a political leader to use it for good. Obama looked like he got it, but he didn't follow through. We're stuck until a Dem decides to take the leap, as Dean did. ",
                    "created": "Wed, 26 Jan 2022 16:24:26 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "Where did Dean get the idea that he could use blogs and create a network of his supporters and let them run wild? I'm pretty sure it didn't come from Dean himself.",
                    "created": "Wed, 26 Jan 2022 16:24:26 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "\"Run wild\" is the wrong term.  \"Make politics\" is a better way of looking at it.  The core problem is journalism and Dem politics don't trust voters. That's why they won't make the obvious leap. And that's why we're mired in the mess we're in, and it keeps getting worse.",
                    "created": "Wed, 26 Jan 2022 16:30:15 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "When the tech VCs talk about \"decentralization\" they're talking about chicken shit decentralization.  What we really need is political decentralization.  Our founders, Franklin, Jefferson, Madison, Hamilton, btw, were chickenshit too. ;-)",
                    "created": "Wed, 26 Jan 2022 16:31:20 GMT",
                    "flInCalendar": true
                },
                {
                    "text": "One of the polling companies should do a survey that asks -- Do you feel that you, or people like you, have any say in governing the United States.   Here's what I think you'd get.  1% of Dems will say they do.  4% of Repubs. ",
                    "created": "Wed, 26 Jan 2022 16:40:43 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}