{
    "text": "What is Scroll?",
    "created": "Mon, 17 Feb 2020 15:01:59 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I have a test account for <a href=\"https://scroll.com/\">Scroll</a> so I can figure out what it is.",
            "created": "Mon, 17 Feb 2020 15:02:03 GMT"
        },
        {
            "text": "Scroll is interesting because it comes from <a href=\"https://twitter.com/arctictony\">Tony Haile</a>. He's a real product guy, having created Chartbeat. For the last few years, as I understand, he's been going to various future-of-news conferences. I met him at the Newsgeist show a couple of years ago. He's been talking about collaborating with news orgs on a new distribution system, and that's Scroll. There's a page for Scroll on <a href=\"https://www.crunchbase.com/organization/scroll\">Crunchbase</a> and they have a <a href=\"https://twitter.com/tryscroll\">Twitter</a> account. ",
            "created": "Mon, 17 Feb 2020 15:02:19 GMT"
        },
        {
            "text": "Once you're logged on <a href=\"http://scripting.com/images/2020/02/17/scrollscreen.png\">you see</a> a list of partners, and a section called reading activity. I wasn't paying attention the first few times I went there, but I assume they gave me a cookie, so that when I show up at their partner sites, it knows it's me, and they share the fact that I read that article with Scroll. I assume then that they give the publisher a micropayment from the monthly fee I pay them. The reading activity section shows me the partner stories I read. ",
            "created": "Mon, 17 Feb 2020 15:03:44 GMT"
        },
        {
            "text": "I guess the theory goes like this. Paywalls are a pain in the butt. Users hate them. But you can go to these sites, without subscribing, without caring about the paywall. Read the story, and the fee is deducted from your Scroll balance. ",
            "created": "Mon, 17 Feb 2020 15:05:15 GMT"
        },
        {
            "text": "<a href=\"https://scroll.com/sites\">This page</a> has a list of their partners, not sure if you can read this without paying. ",
            "created": "Mon, 17 Feb 2020 15:06:43 GMT"
        },
        {
            "text": "If every pub adopted it, I could cancel my subscriptions to the Washington Post, NY Times and The Athletic. And I would be able to read as many articles on currently paywalled sites like New York, New Yorker, The Atlantic and a few others that I usually run out of free reads on before the end of a month. I would no longer have to ration my clicks, and I would feel free to share links to all sites, as I did before there were paywalls. ",
            "created": "Mon, 17 Feb 2020 15:07:04 GMT"
        },
        {
            "text": "So that's the trick. Tony has to get the paywalled sites that are in demand, the ones which people are on the edge of subscribing to but don't. He already has the sites without paywalls. But I don't see the ones I miss there. And until they are there, while I like Tony and expect great things from him, honestly, there's no reason for me to use Scroll.",
            "created": "Mon, 17 Feb 2020 15:09:21 GMT"
        }
    ]
}