{
    "text": "August 6",
    "created": "Tue, 06 Aug 2019 14:58:54 GMT",
    "name": "06",
    "subs": [
        {
            "text": "<a href=\"http://scripting.com/images/2019/08/06/welcomeToNYCWalkFaster.png\">Welcome</a> to NYC. Walk faster.",
            "created": "Tue, 06 Aug 2019 16:35:22 GMT",
            "type": "outline"
        },
        {
            "text": "Dear future-of-news people. Please pay attention to <a href=\"https://www.thecut.com/2019/08/beto-orourke-responds-to-mass-shootings-what-the-fuck.html\">what Beto did</a> with the journalists. That's what a real public editor would do. It would be great. We could possibly get our world back on track. Knight Foundation &mdash; want to make a real investment in news? Real public editors.",
            "created": "Tue, 06 Aug 2019 17:25:23 GMT",
            "type": "outline"
        },
        {
            "text": "I read a story about the <a href=\"https://www.voanews.com/usa/when-mass-shootings-drive-survivors-suicide?fbclid=IwAR10pwVUJkftmr4duAxaYg3Ozwd8ffzN41PPZdGWGyDdoeEHaoPdpgM5nAY\">survivors</a> of the <a href=\"https://en.wikipedia.org/wiki/2017_Las_Vegas_shooting\">Las Vegas massacre</a> and it opened my eyes. We don't even help them out with their medical bills. So the travesty of gun violence is multiplied by the inhumanity of our health care system.",
            "created": "Tue, 06 Aug 2019 16:29:21 GMT",
            "type": "outline"
        },
        {
            "text": "My dear departed hippie <a href=\"http://greatvavavoom.com/\">uncle</a> started a bums union. They would revoke your union card if you were caught working. He gave it a name. The Amalgamated Bums and Drifters of America. It was a joke of course. He loved to work.",
            "created": "Tue, 06 Aug 2019 16:25:10 GMT",
            "type": "outline"
        },
        {
            "text": "Preparing for 25 years",
            "created": "Tue, 06 Aug 2019 15:59:50 GMT",
            "type": "outline",
            "description": "On October 7, this blog will have existed and been continually updated for 25 years.",
            "subs": [
                {
                    "text": "On October 7, this blog will have existed and been continually updated for 25 years.",
                    "created": "Tue, 06 Aug 2019 15:59:55 GMT",
                    "image": "http://scripting.com/2015/02/07/chuckBerry.png"
                },
                {
                    "text": "There were times I took as much as a couple of weeks off, but I usually blogged when I was traveling. I have observations, things I want to write down, basically all the time. I don't see the blog as work, to me it's more like a part of living.",
                    "created": "Tue, 06 Aug 2019 16:17:19 GMT"
                },
                {
                    "text": "It may be hard to remember this, but in the early days net connections away from home were exceptional. You didn't get internet connectivity in hotels, there were no cell phones. I once went for a two-week massage course without being able to check my email once. Even listening to voicemail required a drive into town! ",
                    "created": "Tue, 06 Aug 2019 16:09:30 GMT"
                },
                {
                    "text": "A lot of other things happened while this blog was running. Needless to say there were no blogs when it started. There was only email, no instant messaging. No RSS or podcasting, no Twitter, Facebook, Google. Amazon and Netscape were less than a year old. Microsoft tried to take over the web and failed. Steve Jobs came back to Apple and brought us the iPhone. And much more.",
                    "created": "Tue, 06 Aug 2019 16:10:33 GMT"
                },
                {
                    "text": "Anyway, I'm thinking about how I want to celebrate this. It'll be the first time I put any forethought into such a thing. We went through 5, 10, 15 and 20 years with very little in the way of observation. Not sure why this one is special, but it seems that it is.",
                    "created": "Tue, 06 Aug 2019 16:01:15 GMT"
                },
                {
                    "text": "One thing I'd like to know, are there any of the original email subscribers from 1994 around still reading the blog or on the net even? Does anyone have any of the original \"Amusing rants from Dave Winer's desktop\" emails? I'd actually like to know the exact time on 10/7/94 that the first email went out. ",
                    "created": "Tue, 06 Aug 2019 16:02:20 GMT"
                },
                {
                    "text": "I'd also like to hear from people who read this stuff as it was booting up, as it started from a way to promote a friend's event, to a report on the event, to observations on tech products, to gestalts about <i>holy shit this is an incredible medium</i> posts. It didn't take long for it to become clear that something interesting was happening here. I wonder what it looked like from the other side of the net connection. ",
                    "created": "Tue, 06 Aug 2019 16:04:18 GMT"
                },
                {
                    "text": "Some people said for sure what Dave is doing is preparing to compete with Stewart and Esther, charging $495 per year for a newsletter, and $2000 a year for an industry conference. I was never thinking about that, this blog has never had a business model. I never wanted it to, and I've written about why. I'm sure I could find it if anyone is interested. ",
                    "created": "Tue, 06 Aug 2019 16:05:41 GMT"
                },
                {
                    "text": "Anyway if you have a story to tell about this, email me at dave.winer@gmail.com. What did it feel like to receive the emails. What did you think was happening? When did it occur to you that you could write like I was or did it? Anything that you want to say I'm interested in hearing as long as it isn't flamey. :boom:",
                    "created": "Tue, 06 Aug 2019 16:06:50 GMT"
                }
            ]
        },
        {
            "text": "Why change hurts",
            "created": "Tue, 06 Aug 2019 14:58:55 GMT",
            "type": "outline",
            "description": "Some standard UIs are so strong that they can never be changed. ",
            "subs": [
                {
                    "text": "Ben Thompson <a href=\"https://twitter.com/benthompson/status/1158623851376304128\">tweeted</a>: \"The new Twitter for web is hilariously better than the old Twitter. It is amazing the degree to which people hate change.\"",
                    "created": "Tue, 06 Aug 2019 14:59:09 GMT",
                    "urltweet": "https://twitter.com/benthompson/status/1158623851376304128"
                },
                {
                    "text": "I <a href=\"https://twitter.com/davewiner/status/1158696279544946688\">responded</a>: \"There’s a reason. We incorporate the mechanics of software at a subconscious level after repeated use. It’s not amazing that we hate change, it’s rational. Something that used to 'just work' now takes effort to control. Until we incorporate the new UI at a subconscious level.\"",
                    "created": "Tue, 06 Aug 2019 14:59:59 GMT",
                    "urltweet": "https://twitter.com/davewiner/status/1158696279544946688"
                },
                {
                    "text": "I <a href=\"https://twitter.com/davewiner/status/1158698843564847106\">continued</a>: \"I'm typing this on a QWERTY keyboard.\" Some standard UIs are so strong that they can never be changed. The original <a href=\"https://en.wikipedia.org/wiki/QWERTY\">QWERTY</a> design was optimized to prevent a mechanical <a href=\"https://en.wikipedia.org/wiki/Typewriter\">typewriter</a> from jamming. The keyboard on the iPad I typed that tweet on was completely implemented in software. Nothing that can ever get jammed. But the original reason it was designed that way is long forgotten. It's just the way keyboards are done. There have been <a href=\"https://en.wikipedia.org/wiki/List_of_Latin-script_keyboard_layouts\">attempts</a> to change the design, but they proved too unpopular. ",
                    "created": "Tue, 06 Aug 2019 15:00:46 GMT",
                    "urltweet": "https://twitter.com/davewiner/status/1158698843564847106",
                    "image": "http://scripting.com/images/2019/08/06/qwerty.png"
                },
                {
                    "text": "Another <a href=\"https://twitter.com/davewiner/status/1158702258353258496\">example</a>. I can drive any car because there are invariant UI standards for basic controls. I might not be able to control air conditioning or the radio, but I can steer, accelerate, brake, indicate a turn, the same way on every car. It would be chaos if every time you rented a car you'd have to re-learn how to drive. That said, try renting a car in the UK, Jamaica or Japan where everything is on the <a href=\"https://en.wikipedia.org/wiki/Left-_and_right-hand_traffic#History\">other side</a>. It takes a long time to get used to it, even though at a conscious level the difference is simple to understand. ",
                    "created": "Tue, 06 Aug 2019 15:03:36 GMT",
                    "urltweet": "https://twitter.com/davewiner/status/1158702258353258496"
                },
                {
                    "text": "Yet another example, one I like to cite a lot -- <a href=\"http://scripting.com/2014/11/12/weAreBreakingYourCityDealWithIt.html\">imagine</a> if they remapped the streets of a city. \"Broadway will run east-west instead of the old inefficient north-south route. Now it will connect the Hudson and East rivers! You'll be able to use Broadway to get to Brooklyn or New Jersey. We encourage developers to build new tunnels that cross these two wonderful third-party opportunities.\" It doesn't work that way in real cities, but software platforms, managed by Google, Apple or Facebook (examples) often do. Nowadays even <a href=\"http://this.how/googleAndHttp/\">open platforms</a> do. Ugh. ",
                    "created": "Tue, 06 Aug 2019 15:17:46 GMT"
                }
            ]
        }
    ]
}