{
    "text": "August 15",
    "created": "Thu, 15 Aug 2019 13:48:15 GMT",
    "name": "15",
    "subs": [
        {
            "text": "The problem isn't Trump, <a href=\"https://twitter.com/davewiner/status/1162102238107643904\">it's</a> the news system that got him elected. ",
            "created": "Thu, 15 Aug 2019 20:42:33 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1162102238107643904"
        },
        {
            "text": "Help I am so addicted <a href=\"https://www.youtube.com/watch?v=aY3FxWRz1cw\">to</a> <a href=\"https://en.wikipedia.org/wiki/What_Up_with_That\">What Up With That?</a>",
            "created": "Thu, 15 Aug 2019 14:33:48 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=aY3FxWRz1cw"
        },
        {
            "text": "Anything that gets us to hate each other based on race, age, gender is a <a href=\"https://en.wikipedia.org/wiki/Wedge_issue\">wedge</a>, and it's designed to keep us from unifying, which allows the assholes to keep control.",
            "created": "Thu, 15 Aug 2019 13:48:16 GMT",
            "type": "outline"
        },
        {
            "text": "Why it feels good to stop judging other people",
            "created": "Thu, 15 Aug 2019 20:13:38 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "On Facebook my friend Scott Knaster, who I've known since early Mac days, wrote a <a href=\"https://www.facebook.com/dave.winer.12/posts/1007571732783565?comment_id=1007692502771488&comment_tracking=%7B%22tn%22%3A%22R%22%7D\">comment</a> about judging things and people. \"A few years ago I decided to be really careful about using the word hate when I speak or write. E.g. I don't hate liver, or the Dodgers. It's a little thing, somewhat silly, but I like doing it.\" ",
                    "created": "Thu, 15 Aug 2019 20:13:49 GMT",
                    "image": "http://scripting.com/images/2019/08/15/chihuahua.png"
                },
                {
                    "text": "This is why it's easy to be friends with Scott. :star:",
                    "created": "Thu, 15 Aug 2019 20:14:38 GMT"
                },
                {
                    "text": "My <a href=\"https://www.facebook.com/dave.winer.12/posts/1007571732783565?comment_id=1007692502771488&reply_comment_id=1007698752770863&comment_tracking=%7B%22tn%22%3A%22R%22%7D\">reply</a>, also on Facebook: \"It's good Scott because you hear yourself say these things and deep down inside it creates dissonance. You're human. Judgement of others is way way above your pay grade. It's god's job, whatever that means, certainly not a mortal's job. ",
                    "created": "Thu, 15 Aug 2019 20:14:52 GMT"
                },
                {
                    "text": "\"I really began to understand this when people in my family started dying. Opinionated and judgemental people. Okay what of their judgement now? Who the fuck cares. And all that angst. They could have saved themselves the pain. Because what they thought re good or bad meant not a thing in the end. Which means to me that it didn't mean a thing when they were alive either.\"",
                    "created": "Thu, 15 Aug 2019 20:15:51 GMT"
                },
                {
                    "text": "PS: There are some topics where judgement is fun. Such as the baseball teams we love and our hate for their enemies. You can see that in Scott's comment about the Dodgers (he's a diehard Giants fan). I would forgive him for hating the Dodgers, because it's basically self-mockery. And I hate do the Yankees. But when you break it down, what is it exactly that I hate? The Bronx? Certainly not. The stadium? Well it is an inferior stadium, no one can argue otherwise. But hate? I'm a <a href=\"http://scripting.com/davenet/1998/05/06/yoQuieroScriptingNews.html\">barking farting chihuahua</a>, looking for a little love and understanding in my short life on planet Earth. My hate wouldn't mean very much. But when it comes to baseball and the Yankees, it's mine. It migh† be all I have, so I try to hold on to it. #lgm",
                    "created": "Thu, 15 Aug 2019 20:19:08 GMT"
                }
            ]
        }
    ]
}