{
    "text": "August 21",
    "created": "Wed, 21 Aug 2019 14:11:41 GMT",
    "name": "21",
    "subs": [
        {
            "text": "I don't know maybe it's just me, but I think \"proclaims himself the second coming of God\" might be <a href=\"https://www.vox.com/policy-and-politics/2019/8/21/20826507/trump-king-jews-anti-semitism\">grounds</a> for impeachment.  ",
            "created": "Wed, 21 Aug 2019 18:13:10 GMT",
            "type": "outline"
        },
        {
            "text": "Reading <a href=\"https://jetgirl.art/2019/07/21/rss-is-better-than-reddit-twitter-and-email-subscriptions-for-updates/\">this story</a> for me is what it must have felt like to be a dinosaur having its bones discovered by a curious archaeologist, before there was archeology. ",
            "created": "Wed, 21 Aug 2019 18:10:32 GMT",
            "type": "outline"
        },
        {
            "text": "Last night I <a href=\"https://twitter.com/EthanZ/status/1163989963706380288\">read</a> on Twitter that <a href=\"http://www.ethanzuckerman.com/blog/2019/08/20/on-me-and-the-media-lab/\">Ethan Zuckerman</a> had resigned as part of a developing scandal with the <a href=\"https://www.media.mit.edu/about/mission-history/\">MIT Media Lab</a> and the notorious <a href=\"https://en.wikipedia.org/wiki/Child_sexual_abuse\">child molester</a> <a href=\"https://en.wikipedia.org/wiki/Jeffrey_Epstein\">Jeffrey Epstein</a>. My first reaction was this is a mistake. Wait until more is known about what happened. I think it would be more courageous to stay in his position, and help the organization deal with the crisis. And he <i>is</i> staying through the academic year, according to his post. So I guess he's there for another year? A lot will change in that year. It was a very dramatic few hours last night. Twitter feasts on those moments. But there are people's lives, education and careers involved. Slow down and figure out what happened. ",
            "created": "Wed, 21 Aug 2019 18:31:06 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/EthanZ/status/1163989963706380288",
            "image": "http://scripting.com/images/2019/08/21/auBonPainCoffee.png"
        },
        {
            "text": "Background: Zuckerman is a former colleague at Berkman Center in the early 2000s. His work and mine were related to blogging as a civic act, both our projects were very successful. I also know Joi Ito from Silicon Valley and he was a frequent contributor at BloggerCon. I visited both of them at the Media Lab in 2016. I wrote up my thoughts from that visit (of course) in a <a href=\"http://scripting.com/liveblog/users/davewiner/2016/02/21/1045.html\">blog post</a>.  ",
            "created": "Wed, 21 Aug 2019 18:34:06 GMT",
            "type": "outline"
        },
        {
            "text": "An update to the software that runs scripting.com. Sometimes when you'd click on the <a href=\"http://scripting.com/images/2019/08/21/signOnButtonScreenShot.png\">Sign on button</a> in the upper left corner of the home page you'd get taken to a bogus page. Then you'd try it again and it'd work. Well I think I've got it now so that it always takes you to the right place. ",
            "created": "Wed, 21 Aug 2019 17:15:13 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://github.com/scripting/Scripting-News/issues/126\">Braintrust query</a>: Is there a way in the Chrome debugger to set a breakpoint when the value of a global changes? <i>myGlobals.val</i> is initialized when the app starts, but when it's used it has a different value. I want to break at the line that changes its value.",
            "created": "Wed, 21 Aug 2019 15:03:06 GMT",
            "type": "outline"
        },
        {
            "text": "GEICO has an <a href=\"https://www.youtube.com/watch?v=QkHcx-QnVUQ\">incredible spot</a> running now. A group of office workers gather around a mobile phone playing a GEICO app with a virtual version of the gecko, on the backdrop of the actual desk. Then the real gecko shows up, waving his hand and saying in his British accent \"Hey I'm real.\" The humans in the office laugh. \"He thinks he's real.\" It's funny on three levels which makes it even funnier. ",
            "created": "Wed, 21 Aug 2019 14:29:23 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=QkHcx-QnVUQ"
        },
        {
            "text": "If Trump were a reality show",
            "created": "Wed, 21 Aug 2019 14:11:42 GMT",
            "type": "outline",
            "description": "Oh how crazy the world would be if Trump were a reality show, as opposed to an actual president.",
            "subs": [
                {
                    "text": "If Trump were an actual reality show instead of a fake one, a group of expat neo-Nazi Danes would form a government-in-exile (offices in Trump Tower in NYC) and would do a deal with the US to sell Greenland for very little money. Remember, they are the reality show version, so they need the exposure. Win-win. Their Instagram influencer channel goes crazy, orders for Danish <a href=\"https://en.wikipedia.org/wiki/Jackboot\">jack boots</a> goes viral. ",
                    "created": "Wed, 21 Aug 2019 14:11:56 GMT",
                    "image": "http://scripting.com/images/2019/08/21/trumpActionFigure.png"
                },
                {
                    "text": "Trump declares war on the fake (in reality TV world, but actual in real world) government of Denmark. US war ships blockade <a href=\"https://en.wikipedia.org/wiki/Port_of_Copenhagen\">Copenhagen</a>. There is a crisis in the UN Security Council (the reality TV version). Interesting confluence, at the exact same moment the real UN Security Council is meeting about how to re-exert its dominance. Meanwhile reality TV governments-in-exile form on Instagram for the UK, China, Russia and the Philippines. Ratings soar.  ",
                    "created": "Wed, 21 Aug 2019 14:13:22 GMT"
                },
                {
                    "text": "Trump announces his Christmas Special will take place at the <a href=\"https://en.wikipedia.org/wiki/Tivoli_(Copenhagen)\">Tivoli Gardens</a> amusement park in Copenhagen.  ",
                    "created": "Wed, 21 Aug 2019 14:18:56 GMT"
                }
            ]
        }
    ]
}