{
    "text": "August 22",
    "created": "Thu, 22 Aug 2019 13:42:41 GMT",
    "name": "22",
    "subs": [
        {
            "text": "New feature. Now you can receive Scripting News every night via email. It's still in <a href=\"https://github.com/scripting/Scripting-News/issues/125\">testing</a> and there's a little more development work to do, but it's ready for people to try it out. I created my own system because I <a href=\"http://scripting.com/2019/08/09/185406.html\">wanted</a> more control over how it works. ",
            "created": "Thu, 22 Aug 2019 13:42:42 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://newrepublic.com/article/154826/jeffrey-epsteins-intellectual-enabler\">Evgeny Morozov</a> re John Brockman and Jeffrey Epstein. ",
            "created": "Thu, 22 Aug 2019 16:23:48 GMT",
            "type": "outline"
        },
        {
            "text": "It’s time for a news channel that only reports on how we’re getting rid of Trump and Repubs. If there’s nothing to report they play old <a href=\"https://en.wikipedia.org/wiki/MTV\">MTV</a> <a href=\"https://www.youtube.com/watch?v=oHg5SJYRHA0\">videos</a> from the 80s.",
            "created": "Thu, 22 Aug 2019 15:47:50 GMT",
            "type": "outline"
        },
        {
            "text": "Dave-by-email, day 1",
            "created": "Fri, 23 Aug 2019 00:25:02 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "I wish I had more on the home page for what will be for many their first Scripting News <a href=\"https://github.com/scripting/Scripting-News/issues/125\">by email</a>. A few comments. It's a bit of a loop-close because my blogging used to go out via email for years before I went exclusively web. Once \"RSS\" was up and running it seemed counter-productive to keep pushing the email channel, and for a while it made sense until Google dominated and then shut down their RSS app. Then email resurged. ",
                    "created": "Fri, 23 Aug 2019 00:30:05 GMT",
                    "image": "http://scripting.com/images/2017/05/13/smallCow.png"
                },
                {
                    "text": "In May 2017 I rebooted the original style of blogging on Scripting News, with intermixed titleless posts and and longer titled posts, all on one page, archived daily and monthly. It's now stable, so it made sense to bring back the email. ",
                    "created": "Fri, 23 Aug 2019 00:31:09 GMT"
                },
                {
                    "text": "I remember when I turned off the email, Doc Searls said I shouldn't do it. I never forgot that. Glad Doc is in the initial group of subscribers. I think that will affect the way I write here, for the better. ",
                    "created": "Fri, 23 Aug 2019 00:31:30 GMT"
                },
                {
                    "text": "BTW, I plan to add the linkblog links for the day to the daily email. ",
                    "created": "Fri, 23 Aug 2019 00:31:55 GMT"
                }
            ]
        }
    ]
}