{
    "text": "August 24",
    "created": "Sat, 24 Aug 2019 13:26:46 GMT",
    "name": "24",
    "subs": [
        {
            "text": "2014: <a href=\"http://scripting.com/2014/07/16/whyCodingIsTheWrongWord.html\">Why \"coding\" is the wrong word</a>. ",
            "created": "Sat, 24 Aug 2019 15:00:46 GMT",
            "type": "outline"
        },
        {
            "text": "There is such a thing as a <a href=\"https://www.amazon.com/Wifi-Thermometer/s?k=Wifi+Thermometer\">wifi thermometer</a>.",
            "created": "Sat, 24 Aug 2019 15:09:30 GMT",
            "type": "outline"
        },
        {
            "text": "Two views of one scene",
            "created": "Sat, 24 Aug 2019 15:12:55 GMT",
            "type": "outline",
            "description": "Was it Stephen King and Stanley Kubrick pleading with the world to just let them create?",
            "subs": [
                {
                    "text": "The two views: If you live with a creative person, this scene from The Shining will be familiar. At least you'll know other people have to deal with this. On the other hand, if you're a creative person, this scene speaks for your frustration with the world. ",
                    "created": "Sat, 24 Aug 2019 15:13:25 GMT"
                },
                {
                    "text": "<iframe width=\"400\" height=\"225\" src=\"https://www.youtube.com/embed/yRRsE0LvUqU\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>",
                    "created": "Sat, 24 Aug 2019 15:15:10 GMT"
                },
                {
                    "text": "Listen to the music, it tells the story from his point of view. Every creative person can relate. Was it Stephen King and Stanley Kubrick pleading with the world to just let them create?",
                    "created": "Sat, 24 Aug 2019 15:17:24 GMT"
                }
            ]
        },
        {
            "text": "Dave in Woodstock",
            "created": "Sat, 24 Aug 2019 13:26:47 GMT",
            "type": "outline",
            "description": "I see the combination of art, tech and protest being a powerful thing. We've been here before. ",
            "subs": [
                {
                    "text": "One of the reasons I moved to Woodstock is that I want to try for once being a software developer in an artistic context. ",
                    "created": "Sat, 24 Aug 2019 13:32:41 GMT"
                },
                {
                    "text": "I've always seen software as a creative thing, like writing, painting or sculpting, but the rest of the world can't seem to process this idea. I've tried doing my thing in Madison, Silicon Valley, Cambridge, Seattle and New York City. Everywhere I go I get blank stares when I say I create software as an individual. But where do you work? I work for myself. Who do you sell it to? I don't sell it. ",
                    "created": "Sat, 24 Aug 2019 13:51:13 GMT"
                },
                {
                    "text": "I do make money, from time to time, by selling something I've created, but most of what I create doesn't make money, the opposite, it costs me money to make. It's been that way ever since I was in my 20s and left Madison for Silicon Valley to make my fame and fortune. Like a musician goes to Nashville or Memphis, I'd say to my friends. I'm pretty sure they didn't believe me. I got lucky a few times, my products were hits, and I sold them to companies. I've tried being a CEO, and was able to do the job, sort of, but every day when I wake up, I'd rather create something than manage something. I don't like being responsible for other people's careers. So once was enough for being a CEO. It worked, we were able to go public, and the money I made made it possible for me to live a creative life, which is where I am most comfortable, most myself.",
                    "created": "Sat, 24 Aug 2019 13:44:48 GMT"
                },
                {
                    "text": "I make software for others. More recently I've made products only for myself, with pretty great results. Something new happens when you relax the assumption that the software has to be easy to learn. My target market, me, is amazingly up to speed on how the stuff works. (It's meant to be ironic.)",
                    "created": "Sat, 24 Aug 2019 13:40:44 GMT"
                },
                {
                    "text": "Anyway, I've found it's no different here. People have a hard time understanding that you could do art with materials such as compilers, servers, editors, networks, display screens, etc. People in general have no idea what those things are but they're no less visible than the raw materials of writing (plot, character, arcs). I'm patient. Not pushing too hard. ",
                    "created": "Sat, 24 Aug 2019 13:36:08 GMT"
                },
                {
                    "text": "I got a chance to start over, because this is not inherently a tech-loving community. The other day I used the word \"modal\" to describe myself. My friend had no idea what the word meant. I'm glad he asked. ",
                    "created": "Sat, 24 Aug 2019 13:37:26 GMT"
                },
                {
                    "text": "At the very least I've relocated to an stunningly beautiful place, where the cost of living is way lower than in any of the previous places I've lived. The smell of the place reminds me of childhood, where we vacationed when I was young. That makes my inner child feel secure, as it did the first time around. ",
                    "created": "Sat, 24 Aug 2019 13:47:16 GMT"
                },
                {
                    "text": "In a sense I want to go back to the early 90s, when blogging was still a twinkle in the eye, an intuition that if we created easy ways to publish, people would do it. The power of tech is that it becomes invisible and the message of the writer, the artist comes to the front. I see the combination of art, tech and protest being a powerful thing. We've been here before. ",
                    "created": "Sat, 24 Aug 2019 13:32:57 GMT"
                }
            ]
        }
    ]
}