{
    "text": "August 26",
    "created": "Mon, 26 Aug 2019 15:02:46 GMT",
    "name": "26",
    "subs": [
        {
            "text": "I'm reworking the Dave-by-email service to not require Twitter login. I want all my friends to use it, and the login is a barrier. It'll be the first new service for this blog that does not require login. To configure it you will need to log in. I'll keep you posted on progress. ",
            "created": "Mon, 26 Aug 2019 18:17:50 GMT",
            "type": "outline"
        },
        {
            "text": "Yesterday's <a href=\"https://github.com/scripting/Scripting-News/issues/127\">braintrust query</a> resolved. Turns out <a href=\"https://www.w3schools.com/jsref/jsref_eval.asp\">eval</a> in JavaScript is tricky re catching errors within a <a href=\"https://www.w3schools.com/js/js_errors.asp\">try</a>. If the code being eval'd makes an asynchronous call, errors in the callback won't be caught by the try, and the app that made the eval call crashes, <a href=\"https://github.com/scripting/Scripting-News/issues/127#issuecomment-524656665\">in this case</a>, <a href=\"https://github.com/scripting/pagepark\">PagePark</a>. The problem was introduced by a new version of Node where the callback on <a href=\"https://www.w3schools.com/nodejs/nodejs_filesystem.asp\">fs.writeFile</a> is not optional. A confluence of buried problems come to the surface, crashes the server, repeatedly, not sure for what gain. Requiring a callback when none is needed. The tail wagging the dog imho. It creates errors, doesn't prevent them. I never would have made that change to the Node kernel. ",
            "created": "Mon, 26 Aug 2019 15:02:47 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2018/05/17/mrNatural.png"
        },
        {
            "text": "An editorial for the news industry re users",
            "created": "Mon, 26 Aug 2019 18:12:40 GMT",
            "type": "outline",
            "description": "Learn to say yes.",
            "subs": [
                {
                    "text": "I've run two Silicon Valley startups in my career, and have led development and promotion for several widely-adopted open formats. I've gotten millions of people to use my ideas. And have learned a lot doing this.",
                    "created": "Mon, 26 Aug 2019 18:12:46 GMT",
                    "image": "http://scripting.com/2016/01/30/strongman.png"
                },
                {
                    "text": "One thing I've learned with all this hindsight, it's better if your default answer is yes, not no. See if there's a way you can give the users what they want. This approach will evolve over time, you'll learn how to anticipate their wants. ",
                    "created": "Mon, 26 Aug 2019 18:12:55 GMT"
                },
                {
                    "text": "You'll learn to think like your users. That's a *good* thing. That's how you create a place for yourself in their minds, their lives and their wallets. :-)",
                    "created": "Mon, 26 Aug 2019 18:13:04 GMT"
                }
            ]
        },
        {
            "text": "It's the users dummy!",
            "created": "Mon, 26 Aug 2019 18:24:35 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "True story. My company was having a party in a suite in the St Francis Hotel in SF in 1980-something. <a href=\"https://en.wikipedia.org/wiki/Guy_Kawasaki\">Guy Kawasaki</a>, then head evangelist at Apple hands me a list of feature requests for ThinkTank. ",
                    "created": "Mon, 26 Aug 2019 18:24:40 GMT"
                },
                {
                    "text": "He said the list was from \"JLG\", the new head of product at Apple who was moving to Cupertino from France. I handed him the list back, and said I want to meet him, knowing he would want to meet me. Finally, an exec at a tech company who used the product. ",
                    "created": "Mon, 26 Aug 2019 18:24:52 GMT"
                },
                {
                    "text": "This advice I would give to anyone in any industry, but never has there been an industry more in need of being their own users than the news industry. They are immune to ideas from outside. This is what's crippling their industry, not the web or whatever.  ",
                    "created": "Mon, 26 Aug 2019 18:24:58 GMT"
                }
            ]
        }
    ]
}