{
    "text": "August 27",
    "created": "Tue, 27 Aug 2019 13:37:31 GMT",
    "name": "27",
    "subs": [
        {
            "text": "<a href=\"https://om.co/2019/08/27/some-changes/\">Om Malik</a> is a natural born blogger, returning to his roost. ",
            "created": "Tue, 27 Aug 2019 17:02:40 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://www.youtube.com/watch?v=vEeQgL0MYWc\">Mr Hart, here's a dime</a>. Take it, call your mother, and tell her there is serious doubt about you ever becoming a lawyer.",
            "created": "Tue, 27 Aug 2019 16:39:17 GMT",
            "type": "outline",
            "urlvideo": "https://www.youtube.com/watch?v=vEeQgL0MYWc"
        },
        {
            "text": "Trump is a mid-level Russian mobster. I wish <a href=\"http://nymag.com/intelligencer/2019/08/trump-putin-russia-g7-summit.html\">journalists</a> could get over trying to not say what’s been totally obvious for years. ",
            "created": "Tue, 27 Aug 2019 13:37:32 GMT",
            "type": "outline"
        },
        {
            "text": "A <a href=\"https://github.com/scripting/Scripting-News/issues/128\">braintrust query</a> for lawyers. I've been <a href=\"https://www.google.com/search?q=%22Occam%27s+News%22+site%3Ascripting.com&rlz=1C5CHFA_enUS743US747&oq=%22Occam%27s+News%22+site%3Ascripting.com&aqs=chrome..69i57.1303j0j3&sourceid=chrome&ie=UTF-8\">writing</a> about the concept of Occam's News, a service that only writes about what's obviously true. Doesn't bother with official statements or press releases. We don't interview people on the record. It disclaims up front that <i>does not</i> follow standard journalistic practices. For example, it's obvious that Trump is a Russian oligarch. He meets all the qualifications. So we say that's what he is, in addition to being president of the United States. All our reporting starts with that premise, and reports Russian and American policy as linked. It's news when they deviate. We also assume that climate change is real. It's never subject to question in our reporting. \"Moscow Mitch\" is a popular example of Occam's News philosophy. The guy is owned by Moscow. He doesn't hide it. Etc. So the question for lawyers is what are the legal risks? It's not satire, not meant to be humorous (though of course sometimes the truth is funny). ",
            "created": "Tue, 27 Aug 2019 13:38:30 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/08/27/moscowMitchSmall.png"
        }
    ]
}