{
    "text": "August 29",
    "created": "Thu, 29 Aug 2019 13:05:54 GMT",
    "name": "29",
    "subs": [
        {
            "text": "<a href=\"http://scripting.com/email/\">Dave-via-email</a> went out last night, the messages seem to have gotten through ok. I'm pleased with the new service. It's been almost 20 years since my blog posts were available via email. I immediately feel a stronger connection with readers, esp since more of my personal friends are reading than before. ",
            "created": "Thu, 29 Aug 2019 13:46:18 GMT",
            "type": "outline"
        },
        {
            "text": "We got a <a href=\"https://github.com/scripting/Scripting-News/issues/128#issuecomment-525762285\">response</a> to the <a href=\"http://scripting.com/2019/08/27.html#a133830\">braintrust query</a> for lawyers, from a lawyer. Recall I asked about the risks for a news org that disclaimed up front that they were not using journalistic practices, and only reported on what was obviously true. <a href=\"Occam's News site:scripting.com\">Occam's News</a>. As an example the lawyer uses the assumption that Trump is a <a href=\"https://duckduckgo.com/?q=site%3Ascripting.com+%22Russian+oligarch%22&t=h_&ia=web\">Russian oligarch</a>, and tries to come up with a reason for us saying that. First Occam's News wouldn't have to say why they know it's true that Trump is a Russian oligarch, but if they did, they might use the equivalent of the mathematical <a href=\"https://en.wikipedia.org/wiki/Proof_by_contradiction\">Proof By Contradiction</a>, and start with the assumption that Trump is not a Russian oligarch, and prove that's not possible. It's a perfectly valid way to prove something. Anyway the discussion <a href=\"https://github.com/scripting/Scripting-News/issues/128#issuecomment-526186621\">continues</a>. ",
            "created": "Thu, 29 Aug 2019 13:17:45 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2017/12/23/sarahLynn.png"
        },
        {
            "text": "An academic who hangs out in a <a href=\"https://www.edge.org/dinners\">Billionaire's Club</a> probably isn't much of an academic.",
            "created": "Thu, 29 Aug 2019 21:45:46 GMT",
            "type": "outline"
        },
        {
            "text": "An idea for the news industry to collaborate on. Sometimes a news org takes down the paywall on a story because it's important that everyone see it. Here's the idea. Make an RSS feed that combines all such stories across all pubs. Make spreading the news even more efficient.",
            "created": "Thu, 29 Aug 2019 16:40:06 GMT",
            "type": "tweet",
            "tweetId": "1167114925602480128",
            "tweetUserName": "davewiner"
        },
        {
            "text": "Twitter changed something important. Now if someone you follow replies to a troll, you get cc'd on what the troll said.  This is not a good feature. It means that when you respond to a troll, you will lose followers. You should be aware of this.",
            "created": "Thu, 29 Aug 2019 14:35:41 GMT",
            "type": "outline"
        },
        {
            "text": "Why I don't use <a href=\"http://brave.com/\">Brave</a>. I figure that once they become dominant, if they do, they'll throw their weight around in just as awful ways as Google does. So why go out of my way just to create another monster. ",
            "created": "Thu, 29 Aug 2019 15:02:50 GMT",
            "type": "outline"
        },
        {
            "text": "I am, of course, not British. So I try to imagine what would happen if Trump tried to do the <a href=\"https://www.theguardian.com/politics/2019/aug/28/protests-sparked-by-boris-johnsons-plan-to-suspend-parliament\">same</a> as Boris Johnson, in the US. At least Trump was <a href=\"https://www.huffpost.com/entry/hillary-clinton-popular-vote_n_58599647e4b0eb58648446c6\">elected</a>. Maybe <a href=\"https://en.wikipedia.org/wiki/Brexit\">Brexit</a> should wait until the people decide if they want him as their leader. And of course if Trump tried to disband Congress there would be a revolution here, I hope. :pray:",
            "created": "Thu, 29 Aug 2019 13:05:55 GMT",
            "type": "outline"
        }
    ]
}