{
    "text": "August 31",
    "created": "Sat, 31 Aug 2019 13:00:58 GMT",
    "name": "31",
    "subs": [
        {
            "text": "I've been reading a lot about the <a href=\"https://www.media.mit.edu/\">MIT Media Lab</a> lately. I read that founder of the lab, <a href=\"https://en.wikipedia.org/wiki/Nicholas_Negroponte\">Nicholas Negroponte</a>, made a deal with <a href=\"https://en.wikipedia.org/wiki/Louis_Rossetto\">Louis</a> and <a href=\"https://en.wikipedia.org/wiki/Jane_Metcalfe\">Jane</a>, the founders of Wired, he bought 10 percent of the magazine for $75K and got a column on the inside back cover, which was prime real estate. This got me thinking. The Media Lab and Wired were made for each other. I loved Wired, but I also was aware that they went for gee-whiz tech over substantial tech more than I wished they would. The Media Lab produced lots of buzzworthy demos that never turned into usable tech. What I really wanted? A Wired/Media Lab that only covered open source tech. It was the style of Wired that attracted me, at the time all tech pubs were made for geeks who were suspicious of anything that looked too slick. I want beautiful artistic simplicity, the kind of look that Wired was so good at, applied to practical almost mundane tech. The developers who love all that stuff are the people I want to work with. Stuff that works and that can change the world right now, looking good, not popcorn-like gee-whiz tech that has limited depth or substance. ",
            "created": "Sat, 31 Aug 2019 15:11:42 GMT",
            "type": "outline",
            "image": "http://scripting.com/images/2019/08/31/thisIsNextYear.png"
        },
        {
            "text": "BTW, for some reason I find <a href=\"https://www.wired.com/\">Wired's</a> paywall particularly <a href=\"https://en.wiktionary.org/wiki/egregious\">egregious</a> even though it's no more limiting than other pubs' paywalls. I think it's because I'd like to link to them as much as I link to any other site. I used up my monthly quota just writing the above bit. Wired is a record, like my blog, of where we came from. That its access is limited, while I understand why, is also limiting access to the record. ",
            "created": "Sat, 31 Aug 2019 15:30:42 GMT",
            "type": "outline"
        },
        {
            "text": "565 votes on <a href=\"https://twitter.com/davewiner/status/1167459202987700224\">yesterday's poll</a> about <a href=\"http://scripting.com/2019/08/30/213245.html\">date formatting</a>. Many geeks, imho, get this wrong. If a format can be both human and machine readable it's better than one that's only machine readable. If I ever employ programmers this will be one of the questions I ask them. ",
            "created": "Sat, 31 Aug 2019 15:35:30 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1167459202987700224"
        },
        {
            "text": "People from the blogging world of the 00s are now in positions of great prestige, wealth and authority. It pisses me off they don't use that credibility to help us dig out of the mess we're in. That's why we lifted them up in the first place.",
            "created": "Sat, 31 Aug 2019 16:38:33 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://twitter.com/jasonyng/status/1167754810851876866\">Hong Kong police</a> deployed water cannons infused with blue dye to identify protesters and facilitate arrests. ",
            "created": "Sat, 31 Aug 2019 15:24:01 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/jasonyng/status/1167754810851876866"
        },
        {
            "text": "<a href=\"https://www.azquotes.com/quote/1405381\">Lester B. Pearson</a>: \"If a man has an apartment stacked to the ceiling with newspapers, we call him crazy. If a woman has a trailer house full of cats, we call her nuts. But when people pathologically hoard so much cash that they impoverish the entire nation, we put them on the cover of Fortune magazine and pretend that they are role models.\"",
            "created": "Sat, 31 Aug 2019 16:18:46 GMT",
            "type": "outline"
        },
        {
            "text": "<a href=\"https://twitter.com/davewiner/status/1167784585624727554\">Today's poll</a>: Is Trump a Russian asset or a useful idiot?",
            "created": "Sat, 31 Aug 2019 13:00:59 GMT",
            "type": "outline",
            "urltweet": "https://twitter.com/davewiner/status/1167784585624727554"
        },
        {
            "text": "My uncle's stories",
            "created": "Sat, 31 Aug 2019 18:04:35 GMT",
            "type": "outline",
            "subs": [
                {
                    "text": "My dear departed <a href=\"http://crimson1.scripting.com/kenKiesler\">uncle</a> had a repertoire about 100  stories. Each one took about 15 minutes to tell, and required your full attention. It was really uncomfortable, but since he was my uncle and I loved him, I put up with it, begrudgingly.",
                    "created": "Sat, 31 Aug 2019 18:04:44 GMT"
                },
                {
                    "text": "By the time I was in my 40s, after decades of listening to the same stories over and over, I started numbering them. As he would start the story, I'd say oh that's #285. That did it. He'd smile sheepishly, realize what he was doing, and we'd go back to being friends.",
                    "created": "Sat, 31 Aug 2019 18:06:18 GMT"
                },
                {
                    "text": "The reason I mention it is that at a party in Woodstock last weekend I met a guy who was almost exactly my uncle's age, who looked like him, had the same wild look in his eyes, and he started doing the exact same thing. Not one of my uncle's stories of course, his own tale of conspiracy and heroism.",
                    "created": "Sat, 31 Aug 2019 18:06:41 GMT"
                },
                {
                    "text": "I interrupted him after about five minutes and said you know my uncle used to do the same damn thing. He didn't notice, kept right on going. At some point I got up and left. It was fascinating for a while, but while he reminded me of my uncle, he wasn't him.",
                    "created": "Sat, 31 Aug 2019 18:06:53 GMT"
                }
            ]
        }
    ]
}