{
    "text": "I still use Twitter",
    "created": "Wed, 22 Mar 2023 14:52:05 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "I still use Twitter because it's still basically the same system it always has been, at least from my point of view. I don't see any fascist messages, or antisemitism, or race hate, for some reason -- that everyone else seems to see. I still have longtime friends who I only see here. It still has that annoying character limit. ",
            "created": "Wed, 22 Mar 2023 14:52:11 GMT",
            "image": "http://scripting.com/images/2017/05/30/elephant.png",
            "flInCalendar": true
        },
        {
            "text": "I also use Mastodon, and it's more interesting all the time, esp when it comes to technical discussions. One thing I don't like about Mastodon culture is it seems to assume Twitter is over, and only terrible people use it. This feels a lot like the political divide in the US and elsewhere. I don't find this is a political thing for me. Maybe I'm too old to give a shit. That's probably it.",
            "created": "Wed, 22 Mar 2023 14:53:00 GMT",
            "flInCalendar": true
        },
        {
            "text": "People who say Musk is stupid don't understand how this works. No one who has reached his position in the world is even remotely stupid. Same thing with presidents, or people who reach the pinnacle of accomplishment in anything. There's more to it than you can see. ",
            "created": "Wed, 22 Mar 2023 14:52:36 GMT",
            "flInCalendar": true
        },
        {
            "text": "Musk may have <a href=\"http://scripting.com/publicfolder/chatgpt/2023/03/22/new-chat.html\">screwed with</a> Tesla's products, but he had the good sense not to screw with the driving experience, which still is like nothing else I've ever loved in a car, and I've had some good cars. ",
            "created": "Wed, 22 Mar 2023 14:08:58 GMT",
            "flInCalendar": true
        },
        {
            "text": "He has screwed with Twitter, I guess, but so far it's still Twitter after all is said and done. ",
            "created": "Thu, 23 Mar 2023 02:03:02 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}