{
    "text": "A tale of two podcasts",
    "created": "Fri, 19 Mar 2021 17:29:26 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Two podcasts, one good the other one awful. ",
            "created": "Fri, 19 Mar 2021 17:13:18 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "The good one was on <a href=\"https://www.npr.org/2021/03/18/978687605/could-trump-be-convicted-of-criminal-charges\">Fresh Air</a>, featuring a long interview with New Yorker reporter, Jane Mayer, about whether or not former president Trump could be tried and convicted of a criminal offense. ",
            "created": "Fri, 19 Mar 2021 17:29:36 GMT",
            "flInCalendar": true
        },
        {
            "text": "The awful one was an <a href=\"https://www.nytimes.com/2021/03/19/opinion/ezra-klein-podcast-rebecca-traister.html\">Ezra Klein interview</a> with Rebecca Traister, a reporter for New York magazine, about Andrew Cuomo. It was about how offensive and sexist governor Cuomo is, but the ironic thing, that I can't believe Klein couldn't hear, is how incredibly offensive <i>she</i> was being, in a sexist and racist way. ",
            "created": "Fri, 19 Mar 2021 17:29:46 GMT",
            "flInCalendar": true
        },
        {
            "text": "The first thing that hit me the wrong way is she described a conflict between Cuomo and NYC mayor Bill de Blasio as a \"dick swinging contest.\" That quote (about 9 minutes into the interview) is as bad as anything Cuomo is accused of saying, and she did it publicly, with a member of the press listening, and he didn't say a word, didn't question it. Try to imagine something like that being said about two women politicians, using the female equivalent of \"dicks.\" You'd never hear it, and a respectful discussion of politics can't be at that level. It's not just disrepectful of the people she's talking about, but it's disrespectful of the audience and the interviewer, and the NYT which hosted the interview. ",
            "created": "Fri, 19 Mar 2021 17:30:07 GMT",
            "image": "http://scripting.com/images/2021/03/19/vulture.png",
            "flInCalendar": true
        },
        {
            "text": "She admits she was furious that her \"liberal peers\" were liking Cuomo's leadership, leadership we desperately needed at the time, but that is not grounds for removal, and you have to wonder, could New York Magazine, and Klein, have found a more dispassionate person to tell this story, someone like Jane Mayer, for example. And maybe present another side of it, about what it was really like for us one year ago. Why were her liberal peers so willing to overlook their dislike for Cuomo? Perhaps because they, like the rest of us, were scared out of their minds. Just a theory. (I certainly was.)",
            "created": "Fri, 19 Mar 2021 17:30:46 GMT",
            "flInCalendar": true
        },
        {
            "text": "Later in the interview she admits her issue is with \"white, male politicians.\" I turned the interview off at that point. This isn't a scandal, as she almost admits, there was vulnerability, a coverup perhaps, a mistake for sure, in a perilous time, and now, the fear having subsided, a bit (and imho irrationally) the opportunists move in. That's a story I'd love to hear on a future Ezra Klein podcast. How and why did we give journalism so much power, was it a good idea, and how can we put it back where it belongs -- with the people. ",
            "created": "Fri, 19 Mar 2021 17:31:06 GMT",
            "flInCalendar": true
        },
        {
            "text": "Traister should run against Cuomo next year, and her writing should be clearly labeled as partisan, but come on, we have to do better. And Klein, you can't support this kind of partisanship without at least questioning it, or properly labeling it. ",
            "created": "Fri, 19 Mar 2021 17:31:29 GMT",
            "flInCalendar": true
        },
        {
            "text": "A fair journalistic treatment of this supposed scandal has yet to be offered, by anyone. The best indication of that is that the people aren't buying the product that journalism is offering, for some reason, a big majority of NY voters are not calling for his head. Maybe it would be worth finding out why. ",
            "created": "Fri, 19 Mar 2021 18:03:30 GMT",
            "flInCalendar": true
        },
        {
            "text": "PS: Another podcast I listened to recently was a Fresh Air interview with author <a href=\"https://www.npr.org/2021/03/17/978185402/novelist-kazuo-ishiguro\">Kazuo Ishiguro</a>. I'm reading his book <a href=\"https://www.npr.org/2021/03/03/972841445/klara-and-the-sun-is-a-masterpiece-about-life-love-and-mortality\">Klara and the Sun</a>, based on listening to the interview, and <i>loving</i> it. ",
            "created": "Fri, 19 Mar 2021 18:07:09 GMT",
            "flInCalendar": true
        },
        {
            "text": "PPS: On this day a year ago, I proudly scored a thermometer. ",
            "created": "Fri, 19 Mar 2021 18:09:46 GMT",
            "inlineImage": "http://scripting.com/images/2021/03/19/thermometer.png",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}