{
    "text": "Bezos blinked",
    "created": "Tue, 29 Oct 2024 13:09:48 GMT",
    "type": "outline",
    "description": "The only principled thing to do is not abandon American democracy in its hour of greatest need.",
    "metaImage": "https://imgs.scripting.com/2024/01/12/deweyDefeatsTruman.png",
    "subs": [
        {
            "text": "My op-ed for the Washington Post, if there was such a thing..",
            "created": "Tue, 29 Oct 2024 13:09:53 GMT",
            "flInCalendar": true
        },
        {
            "text": "I didn't imagine that Bezos cared what subscribers to the Washington Post thought about his decision to cancel their endorsement of VP Harris in the election one week from today. ",
            "created": "Tue, 29 Oct 2024 13:09:54 GMT",
            "flInCalendar": true
        },
        {
            "text": "But <a href=\"https://www.npr.org/2024/10/28/nx-s1-5168416/washington-post-bezos-endorsement-president-cancellations-resignations\">200K people unsubscribed</a>, and I guess that message got through to him, so he <a href=\"https://www.washingtonpost.com/opinions/2024/10/28/jeff-bezos-washington-post-trust/\">wrote an op-ed</a> that ran in the Post yesterday, explaining that this was a <a href=\"https://www.google.com/search?q=define+principled\">principled</a> thing. ",
            "created": "Tue, 29 Oct 2024 13:22:33 GMT",
            "flInCalendar": true
        },
        {
            "text": "If it was really a matter of principle, they wouldn't have chosen this election, and one where his own personal interest was so involved. It doesn't <i>look</i> principled, and when you're trying to do something principled, it pretty much has to look that way or you have to conclude that it's bullshit, which it obviously is. ",
            "created": "Tue, 29 Oct 2024 13:12:30 GMT",
            "flInCalendar": true
        },
        {
            "text": "It's surprising that he cares. The Post was worth $250M when he <a href=\"https://www.washingtonpost.com/national/washington-post-to-be-sold-to-jeff-bezos/2013/08/05/ca537c9e-fe0c-11e2-9711-3708310f6f4d_story.html\">bought</a> it in 2013, maybe it's worth more than that now, but it's a very small part of his current $205B net worth. If owning the Post would interfere with his other businesses in a negative way, and if the problem could be solved by dropping it, I don't doubt that he would do that. Then why this op-ed? It could be that someone in his family objected, sometimes people react to that in ways that could cost money. It's possible. It's also possible that he's not sure that Trump will win, and being a calculating person, he realizes now that he's created a similar problem for himself if the Democrats win. The Trumps won't care if he lies about the reason, so lying about the reason was the obvious path for him. ",
            "created": "Tue, 29 Oct 2024 13:13:50 GMT",
            "image": "https://imgs.scripting.com/2024/08/17/dewey.png",
            "flInCalendar": true
        },
        {
            "text": "I think what we're really seeing is that owning a high profile news org like the Post isn't something for Mr Bezos. He would probably be better off selling the Post, so he doesn't have to make these kinds of principled bullshit choices, when clearly the only principled thing to do is not abandon American democracy in its hour of greatest need.",
            "created": "Tue, 29 Oct 2024 13:16:22 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}