{
    "text": "A story about Woz",
    "created": "Tue, 30 May 2017 15:07:57 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "<i>I wrote this <a href=\"https://www.facebook.com/dave.winer.12/posts/117622468445167?notif_t=like&notif_id=1496147434459341\">piece</a> on Facebook on this day in 2013. As far as I can tell I didn't post it on my blog. It should totally be in the archive. So here goes..</i>",
            "created": "Tue, 30 May 2017 15:08:02 GMT",
            "image": "http://scripting.com/2016/08/11/hope.png",
            "permalink": "http://scripting.com/2017/05/30.html#a110502"
        },
        {
            "text": "I was once giving a talk at MacWorld Expo, probably in 1986 or 1987. This was the peak of popularity of <a href=\"http://scripting.com/dwiner/outlinersProgramming.html\">MORE</a>. There were probably 500 people in the room.",
            "created": "Tue, 30 May 2017 15:11:41 GMT",
            "permalink": "http://scripting.com/2017/05/30.html#a110541"
        },
        {
            "text": "Just before I got up to speak, my marcom person, Kandes Bregman, showed me that Woz was sitting in one of the first rows, like an ordinary person. I had never met him at the time.",
            "created": "Tue, 30 May 2017 15:17:56 GMT",
            "permalink": "http://scripting.com/2017/05/30.html#a110556"
        },
        {
            "text": "Early in the talk, I asked for a show of hands of people who used MORE.",
            "permalink": "http://scripting.com/2017/05/30.html#a040631"
        },
        {
            "text": "Woz's arm shot straight up. Everyone else just raised their arm. He made a point of it.",
            "permalink": "http://scripting.com/2017/05/30.html#a040631"
        },
        {
            "text": "I thought how cool. Here's a guy who doesn't have to care, he's richer than god, and look at how passionate he is about the product.",
            "permalink": "http://scripting.com/2017/05/30.html#a040631"
        },
        {
            "text": "I felt like I had really accomplished something.",
            "permalink": "http://scripting.com/2017/05/30.html#a040631"
        },
        {
            "text": "The thing is that Woz is still doing it. Travelling around the world, meeting with regular people, listening to their dreams, and helping them if he can.",
            "permalink": "http://scripting.com/2017/05/30.html#a040631"
        },
        {
            "text": "He's like a technology elf. He believes in the power of people, not just as users of technology but also as creators of technology.",
            "permalink": "http://scripting.com/2017/05/30.html#a040631"
        },
        {
            "text": "These are my values too.",
            "permalink": "http://scripting.com/2017/05/30.html#a040631"
        },
        {
            "text": "I remember how empowered I was by Woz's most fantastic creation -- the Apple II. Up until then computers were far away, things you couldn't touch, only for the experts. I could program them, but I couldn't feel them.",
            "permalink": "http://scripting.com/2017/05/30.html#a040631"
        },
        {
            "text": "The best thing about the Apple II was the memory-mapped video. To display a character you just stored it in a magic memory location. And that was it. It appeared on the screen.",
            "permalink": "http://scripting.com/2017/05/30.html#a040631"
        },
        {
            "text": "My least favorite feature of the Apple II, cards that got unseated from their slots and fried the mother board. I had a few of those. I was pretty poor in those days so losing a mother board could really set me back! :-)",
            "permalink": "http://scripting.com/2017/05/30.html#a040631"
        },
        {
            "text": "But I'd rather suffer for having too much power than being restricted from going places my imagination wants to go.",
            "permalink": "http://scripting.com/2017/05/30.html#a040631"
        },
        {
            "text": "That's what Woz gave us. That and that he puts his heart into his work. And the guy's got a big heart.",
            "permalink": "http://scripting.com/2017/05/30.html#a040631"
        }
    ],
    "permalink": "http://scripting.com/2017/05/30.html#a110557"
}