{
    "text": "Stop scapegoating Birx",
    "created": "Mon, 29 Mar 2021 14:14:04 GMT",
    "type": "outline",
    "description": "Good journalism on CNN's part, now, to sit all these people down, while they're all accessible and memories are fresh.",
    "metaImage": "http://scripting.com/images/2021/03/29/birx.png",
    "subs": [
        {
            "text": "I watched <a href=\"https://www.cnn.com/health/live-news/covid-pandemic-doctors-cnn-special/index.html\">CNN's two-hour special</a> last night, with interviews with some of the doctors from the last administration on what went wrong. All of these people sold us out to some extent, including Fauci, just by staying in their jobs. None of them admitted last night that they were as complicit as they were. But <a href=\"https://en.wikipedia.org/wiki/Deborah_Birx\">Deborah Birx</a> takes the fall for everyone, and that's wrong. ",
            "created": "Mon, 29 Mar 2021 14:03:18 GMT",
            "type": "outline",
            "flInCalendar": true
        },
        {
            "text": "People say what if Birx had quit, with a statement about how the Trump administration was botching it, that could have made a difference. But it couldn't have. Anyone who was paying attention knew what Trump et al were doing, including news people. Yet they made the story every night about how Trump and his minions were screwing up. If you report that every night, as they did, it stops being news pretty quickly, and becomes a copout, a coverup of the cowardice of journalism. Tell me something that isn't common knowledge. ",
            "created": "Mon, 29 Mar 2021 14:14:43 GMT",
            "flInCalendar": true
        },
        {
            "text": "If the press wanted to make a difference, they could have changed the story from \"Trump Sucks\" to \"This is what we need to do today.\" They could have found a way to tell us where the virus was storming and where it was quiet. They could have, instead of coasting along in neutral, tried to <a href=\"https://www.google.com/search?q=site%3Ascripting.com+%22save+my+life%22\">save lives.</a> For some reason they didn't see this as their job. ",
            "created": "Mon, 29 Mar 2021 14:15:17 GMT",
            "flInCalendar": true
        },
        {
            "text": "Another idea. They could have led the charge to impeaching Trump. Here's the story: Trump is killing us, now wtf are we going to do about it? Had Wolf Blitzer said that I would have plotzed on the spot. ",
            "created": "Mon, 29 Mar 2021 18:58:36 GMT",
            "flInCalendar": true
        },
        {
            "text": "They could have done what Trump was supposed to be doing, but (guessing) they were too scared to step out of their comfortable role, which is ironically what people unfairly accuse Birx of. ",
            "created": "Mon, 29 Mar 2021 14:16:14 GMT",
            "flInCalendar": true
        },
        {
            "text": "But last night it was good journalism on CNN's part, <i>now,</i> to sit all these people down, while they're all accessible and their memories are fresh and the pandemic is still ongoing, to get them on the record. It's not an autopsy yet, as they were saying it was, because the story is not over, the patient is still alive. ",
            "created": "Mon, 29 Mar 2021 14:16:35 GMT",
            "flInCalendar": true
        },
        {
            "text": "The key failures in this pandemic so far have been the government and journalism, imho about equally. I'm glad we are starting to be honest about what happened in government, we probably <a href=\"http://scripting.com/2021/03/28.html#a153234\">never</a> will be open about what's going wrong in journalism. ",
            "created": "Mon, 29 Mar 2021 14:17:14 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}