{
    "text": "Think big",
    "created": "Mon, 10 Oct 2022 13:08:36 GMT",
    "type": "outline",
    "subs": [
        {
            "text": "Yesterday <a href=\"https://www.manton.org/\">Manton</a> asked why I thought his book was sad. I did a lot of writing in response, but in the end I deleted it all and replaced it with a single sentence, really just a phrase. ",
            "created": "Mon, 10 Oct 2022 13:09:17 GMT",
            "subs": [
                {
                    "text": "\"it's just sad that people always think so small.\" ",
                    "created": "Mon, 10 Oct 2022 13:08:59 GMT",
                    "flInCalendar": true
                }
            ],
            "flInCalendar": true
        },
        {
            "text": "An example. Subscribing is a mess in the \"RSS\" world, but at the start there was a plan for it not to be a mess. It required cooperation among the various writing and reading tools. The small thinking approach was that since you're going to dominate, writing tools should just put an icon on their pages that subscribes in your reader. But when no one dominates, the blogs get overwhelmed with these icons, then four years later someone invents Twitter which makes subscription a breeze. A few years later you wonder where all the blogs went. ",
            "created": "Mon, 10 Oct 2022 13:09:06 GMT",
            "flInCalendar": true
        },
        {
            "text": "When people blame the big silos for the lack of movement in blogging they should step back and figure out why they left the door open for them to dominate? We had years to create a barrier of user expectation of choice, as was done in podcasting...",
            "created": "Mon, 10 Oct 2022 13:10:40 GMT",
            "flInCalendar": true
        },
        {
            "text": "To whit, every time someone says \"Listen to <i>FreshAir</i> where you get your podcasts,\" I feel a huge sense of pride. It worked there. Victory! Subscribing is still a mess, it doesn't have to be, but the open approach of podcasting got so entrenched that the users demand choice, expect it -- and that barrier was too high for Spotify and Amazon to climb over. We got a little help there from Apple btw -- of all the big vendors they probably could have owned podcasting, but they never made that move and that's something to be grateful for when you see all the great podcasts out there and more coming online all the time. ",
            "created": "Mon, 10 Oct 2022 13:04:46 GMT",
            "flInCalendar": true
        },
        {
            "text": "Another bad example, in the news industry, where I and others, consumers of news, are constantly railing about the ridiculous economic model. If I want to read an article in the Atlantic I have to subscribe. And the Detroit News, Denver Post and the Boston Globe. And the New Yorker and New York and on and on. At some point you have to stop subscribing, and then you'll miss the article that you need/want to read. Everyone but three pubs, the NYT, WSJ and WP would benefit from a pay-as-you-go plan, but they won't do it. Isn't it funny how close it is in pattern to the problem in blogging that created Twitter? ",
            "created": "Mon, 10 Oct 2022 13:02:29 GMT",
            "flInCalendar": true
        },
        {
            "text": "We all have choices. We can work together or we can go it alone. When we work together we have a chance. When you go it alone, the chance of success is miniscule. ",
            "created": "Mon, 10 Oct 2022 13:06:48 GMT",
            "flInCalendar": true
        },
        {
            "text": "PS: Google Reader is to blame for another huge mess in RSS land. They said posts must have titles, even though RSS specifically <a href=\"http://scripting.com/images/2022/10/10/optionalTitle.png?nodialog\">allows posts</a> without titles. That basically cut off Twitter from the world defined by RSS because Google Reader became synonymous with RSS, they controlled it, and <i>tweets don't have titles. </i>Did you ever see how Google Reader rendered a tweet back when Twitter had feeds? They were right to shut that down, but don't blame them, blame Google. ",
            "created": "Mon, 10 Oct 2022 13:17:14 GMT",
            "flInCalendar": true
        }
    ],
    "flInCalendar": true
}